{"description": "Detects when a new member is added or invited to a github organization.", "author": ["Muhammad Faisal"], "enabled": false, "false_positives": ["Organization approved new members"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "3908d64a-3c06-4091-b503-b3a94424533b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Github Organization Member Added", "query": "action:(\"org.add_member\" OR \"org.invite_member\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#dependabot_alerts-category-actions"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
