{"description": "Detects file access requests to browser credential stores by uncommon processes.\nCould indicate potential attempt of credential stealing.\nRequires heavy baselining before usage\n", "author": ["frack113"], "enabled": false, "false_positives": ["Antivirus, Anti-Spyware, Anti-Malware Software", "Backup software", "Legitimate software installed on partitions other than \"C:\\\"", "Searching software such as \"everything.exe\""], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "91cb43db-302a-47e3-b3c8-7ede481e27bf", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Access To Browser Credential Files By Uncommon Application", "query": "((((file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ee][Bb][Cc][Aa][Cc][Hh][Ee]\\\\[Ww][Ee][Bb][Cc][Aa][Cc][Hh][Ee][Vv]01\\.[Dd][Aa][Tt]/) OR (file.path:(/.*\\\\[Cc][Oo][Oo][Kk][Ii][Ee][Ss]\\.[Ss][Qq][Ll][Ii][Tt][Ee]/ OR /.*[Rr][Ee][Ll][Ee][Aa][Ss][Ee]\\\\[Kk][Ee][Yy]3\\.[Dd][Bb]/ OR /.*[Rr][Ee][Ll][Ee][Aa][Ss][Ee]\\\\[Kk][Ee][Yy]4\\.[Dd][Bb]/ OR /.*[Rr][Ee][Ll][Ee][Aa][Ss][Ee]\\\\[Ll][Oo][Gg][Ii][Nn][Ss]\\.[Jj][Ss][Oo][Nn]/)) OR (file.path:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Ll][Oo][Gg][Ii][Nn]\\ [Dd][Aa][Tt][Aa].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\\\[Cc][Oo][Oo][Kk][Ii][Ee][Ss].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Uu][Ss][Ee][Rr]\\ [Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\ [Ss][Tt][Aa][Tt][Ee].*/))) AND (NOT (((process.executable.text:System AND process.parent.executable.text:Idle)) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/))))) AND (NOT (((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ AND process.executable:(/.*\\\\[Mm][Pp][Cc][Oo][Pp][Yy][Aa][Cc][Cc][Ee][Ll][Ee][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/))) OR (process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR (process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.zscaler.com/blogs/security-research/ffdroider-stealer-targeting-social-media-platform-users", "https://github.com/lclevy/firepwd"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
