{"description": "Detects DNS queries for ip lookup services such as api.ipify.org not originating from a browser process.", "enabled": false, "false_positives": ["Legitimate usage of ip lookup services such as ipify API"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d95d2559-c7ab-4a0a-ad7b-7ae7dd0a1ab6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious DNS Query for IP Lookup Service APIs", "query": "(dns.question.name:(\"canireachthe.net\" OR \"ipv4.icanhazip.com\" OR \"ip.anysrc.net\" OR \"edns.ip\\-api.com\" OR \"wtfismyip.com\" OR \"checkip.dyndns.org\" OR \"api.2ip.ua\" OR \"icanhazip.com\" OR \"api.ipify.org\" OR \"ip\\-api.com\" OR \"checkip.amazonaws.com\" OR \"ipecho.net\" OR \"ipinfo.io\" OR \"ipv4bot.whatismyipaddress.com\" OR \"freegeoip.app\") AND (NOT (process.executable.text:(*\\\\chrome.exe OR *\\\\iexplore.exe OR *\\\\firefox.exe OR *\\\\brave.exe OR *\\\\opera.exe OR *\\\\msedge.exe OR *\\\\vivaldi.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1590"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0043", "reference": "https://attack.mitre.org/tactics/TA0043", "name": "Reconnaissance"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1590", "name": "Gather Victim Network Information", "reference": "https://attack.mitre.org/techniques/T1590"}]}], "version": 1, "references": ["https://www.binarydefense.com/analysis-of-hancitor-when-boring-begets-beacon", "https://twitter.com/neonprimetime/status/1436376497980428318"], "timestamp_override": "event.ingested", "author": ["Brandon George (blog post)", "Thomas Patzke (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
