{"description": "Detect suspicious ldap request from non Windows application", "enabled": false, "false_positives": ["Programs that also lookup the observed domain"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2fd8617d-8df8-5d34-9133-8b7a98429a7b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Ldap Domain Access", "query": "(dns.question.name:_ldap.* AND (NOT ((process.executable.text:C\\:\\\\Windows\\\\*) OR (process.executable.text:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND process.executable.text:*\\\\MsMpEng.exe) OR (process.executable.text:\"<unknown\\ process>\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1482"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1482", "name": "Domain Trust Discovery", "reference": "https://attack.mitre.org/techniques/T1482"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
