{"description": "Detects a program that invoked suspicious DNS queries known from Cobalt Strike beacons", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f356a9c4-effd-4608-bbf8-408afd5cd006", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Suspicious Cobalt Strike DNS Beaconing", "query": "(dns.question.name:(aaa.stage.* OR post.1*) OR dns.question.name:*.stage.123456.*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns", "https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
