{"description": "AppInstaller.exe is spawned by the default handler for the \"ms-appinstaller\" URI. It attempts to load/install a package from the referenced URL", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "135aa23a-963d-e738-3fd4-851e6beecf30", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AppX Package Installation Attempts Via AppInstaller", "query": "(process.executable.text:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\Microsoft.DesktopAppInstaller_* AND process.executable.text:*\\\\AppInstaller.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/notwhickey/status/1333900137232523264", "https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
