{"description":"Detects DNS queries for ip lookup services such as api.ipify.org not originating from a browser process. Author: Brandon George (blog post), Thomas Patzke (rule). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate usage of ip lookup services such as ipify API"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d95d2559-c7ab-4a0a-ad7b-7ae7dd0a1ab6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious DNS Query for IP Lookup Service APIs","query":"(dns.question.name:(\"canireachthe.net\" OR \"ipv4.icanhazip.com\" OR \"ip.anysrc.net\" OR \"edns.ip\\-api.com\" OR \"wtfismyip.com\" OR \"checkip.dyndns.org\" OR \"api.2ip.ua\" OR \"icanhazip.com\" OR \"api.ipify.org\" OR \"ip\\-api.com\" OR \"checkip.amazonaws.com\" OR \"ipecho.net\" OR \"ipinfo.io\" OR \"ipv4bot.whatismyipaddress.com\" OR \"freegeoip.app\") AND (NOT (process.executable:(*\\\\chrome.exe OR *\\\\iexplore.exe OR *\\\\firefox.exe OR *\\\\brave.exe OR *\\\\opera.exe OR *\\\\msedge.exe OR *\\\\vivaldi.exe))))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
