{"description": "Detects DNS queries for IP lookup services such as \"api.ipify.org\" originating from a non browser process.", "author": ["Brandon George (blog post)", "Thomas Patzke"], "enabled": false, "false_positives": ["Legitimate usage of IP lookup services such as ipify API"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ec82e2a5-81ea-4211-a1f8-37a0286df2c2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious DNS Query for IP Lookup Service APIs", "query": "(dns.question.name:(*api.2ip.ua* OR *api.ipify.org* OR *bot.whatismyipaddress.com* OR *canireachthe.net* OR *checkip.amazonaws.com* OR *checkip.dyndns.org* OR *curlmyip.com* OR *edns.ip\\-api.com* OR *eth0.me* OR *freegeoip.app* OR *geoipy.com* OR *getip.pro* OR *icanhazip.com* OR *ident.me* OR *ifconfig.io* OR *ifconfig.me* OR *ip\\-api.com* OR *ip.anysrc.net* OR *ip.tyk.nu* OR *ipaddressworld.com* OR *ipecho.net* OR *ipinfo.io* OR *ipof.in* OR *ipv4.icanhazip.com* OR *ipv4bot.whatismyipaddress.com* OR *ipwho.is* OR *l2.io* OR *myexternalip.com* OR *wgetip.com* OR *whatismyip.akamai.com* OR *wtfismyip.com*) AND (NOT ((process.executable.text:\"*\\\\brave.exe\") OR (process.executable.text:(\"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\")) OR (process.executable.text:(\"C:\\Program Files\\Mozilla Firefox\\firefox.exe\" OR \"C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe\")) OR (process.executable.text:(\"C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe\" OR \"C:\\Program Files\\Internet Explorer\\iexplore.exe\")) OR (process.executable.text:\"*\\\\maxthon.exe\") OR (((process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\") OR (process.executable.text:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\") OR (process.executable.text:(\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" OR \"C:\\Program Files\\Microsoft\\Edge\\Application\\msedge.exe\")))) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeCore\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\\\EdgeCore\\\\*\") AND process.executable.text:(\"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\"))) OR (process.executable.text:\"*\\\\opera.exe\") OR (process.executable.text:\"*\\\\safari.exe\") OR (process.executable.text:\"*\\\\seamonkey.exe\") OR (process.executable.text:\"*\\\\vivaldi.exe\") OR (process.executable.text:\"*\\\\whale.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1590"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0043", "reference": "https://attack.mitre.org/tactics/TA0043", "name": "Reconnaissance"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1590", "name": "Gather Victim Network Information", "reference": "https://attack.mitre.org/techniques/T1590"}]}], "version": 1, "references": ["https://www.binarydefense.com/analysis-of-hancitor-when-boring-begets-beacon", "https://twitter.com/neonprimetime/status/1436376497980428318", "https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
