{"description": "Detects DNS queries to a TeamViewer domain only resolved by a TeamViewer client by an image that isn't named TeamViewer (sometimes used by threat actors for obfuscation)", "enabled": false, "false_positives": ["Unknown binary names of TeamViewer", "Other programs that also lookup the observed domain"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0b5a0ea5-29d2-5096-e710-25b6ca75f1b8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious TeamViewer Domain Access", "query": "(dns.question.name:(\"taf.teamviewer.com\" OR \"udp.ping.teamviewer.com\") AND (NOT (process.executable:*TeamViewer*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.teamviewer.com/en-us/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
