{"description": "Detects DNS resolution of an .onion address related to Tor routing networks", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f782447d-4b74-6439-e380-d19eabb66217", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Query Tor Onion Address", "query": "dns.question.name:*.onion*", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
