{"description": "An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.\nThese services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.\nRemote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)\n", "author": ["frack113", "Connor Martin"], "enabled": false, "false_positives": ["Likely with other browser software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4d07b1f4-cb00-4470-b9f8-b0191d48ff52", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DNS Query To Remote Access Software Domain", "query": "(((dns.question.name:(/.*\\.[Gg][Ee][Tt][Gg][Oo]\\.[Cc][Oo][Mm]/ OR /.*\\.[Ll][Oo][Gg][Mm][Ee][Ii][Nn]\\.[Cc][Oo][Mm]/ OR /.*\\.[Aa][Mm][Mm][Yy][Yy]\\.[Cc][Oo][Mm]/ OR /.*\\.[Nn][Ee][Tt][Ss][Uu][Pp][Pp][Oo][Rr][Tt][Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Rr][Ee][Mm][Oo][Tt][Ee][Uu][Tt][Ii][Ll][Ii][Tt][Ii][Ee][Ss]\\.[Cc][Oo][Mm]/ OR /.*\\.[Nn][Ee][Tt]\\.[Aa][Nn][Yy][Dd][Ee][Ss][Kk]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Pp][Ii]\\.[Pp][Ll][Aa][Yy][Aa][Nn][Ee][Xx][Tt]\\.[Cc][Oo][Mm]/ OR /.*\\.[Rr][Ee][Ll][Aa][Yy]\\.[Ss][Pp][Ll][Aa][Ss][Hh][Tt][Oo][Pp]\\.[Cc][Oo][Mm]/ OR /.*\\.[Aa][Pp][Ii]\\.[Ss][Pp][Ll][Aa][Ss][Hh][Tt][Oo][Pp]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Pp][Pp]\\.[Aa][Tt][Ee][Rr][Aa]\\.[Cc][Oo][Mm]/ OR /.*\\.[Aa][Gg][Ee][Nn][Tt][Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]\\.[Aa][Tt][Ee][Rr][Aa]\\.[Cc][Oo][Mm]/ OR /.*\\.[Pp][Uu][Bb][Ss][Uu][Bb]\\.[Aa][Tt][Ee][Rr][Aa]\\.[Cc][Oo][Mm]/ OR /.*[Ll][Oo][Gg][Mm][Ee][Ii][Nn][Cc][Dd][Nn]\\.[Hh][Tt][Tt][Pp]\\.[Ii][Nn][Tt][Ee][Rr][Nn][Aa][Pp][Cc][Dd][Nn]\\.[Nn][Ee][Tt]/ OR /.*[Ll][Oo][Gg][Mm][Ee][Ii][Nn]\\-[Gg][Aa][Tt][Ee][Ww][Aa][Yy]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Ll][Ii][Ee][Nn][Tt]\\.[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ee][Dd][Cc][Hh][Aa][Tt]\\.[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Tt][Aa][Tt][Ii][Cc]\\.[Rr][Ee][Mm][Oo][Tt][Ee][Pp][Cc]\\.[Cc][Oo][Mm]/ OR /.*\\.[Nn]\\-[Aa][Bb][Ll][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Oo][Mm][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Cc][Oo][Rr][Pp][Oo][Rr][Aa][Tt][Ee]\\.[Bb][Ee][Aa][Nn][Yy][Ww][Hh][Ee][Rr][Ee]\\.[Cc][Oo][Mm]/ OR /.*\\.[Ss][Ww][Ii]\\-[Rr][Cc]\\.[Cc][Oo][Mm]/ OR /.*\\.[Ss][Ww][Ii]\\-[Tt][Cc]\\.[Cc][Oo][Mm]/ OR /.*[Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy]\\.[Ss][Ee][Rr][Vv][Ee][Rr][Ss]\\.[Qq][Ee][Tt][Qq][Oo]\\.[Cc][Oo][Mm]/ OR /.*[Rr][Ee][Ll][Aa][Yy]\\.[Ss][Cc][Rr][Ee][Ee][Nn][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\.[Cc][Oo][Nn][Nn][Ee][Cc][Tt][Ww][Ii][Ss][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Ee][Xx][Pp][Rr][Ee][Ss][Ss]\\.[Gg][Oo][Tt][Oo][Aa][Ss][Ss][Ii][Ss][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\.[Ll][Oo][Gg][Mm][Ee][Ii][Nn][Ii][Nn][Cc]\\.[Cc][Oo][Mm]/ OR /.*\\.[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Vv][Nn][Cc]\\.[Cc][Oo][Mm]/ OR /.*\\.[Tt][Mm][Aa][Tt][Ee]\\.[Ii][Oo]/ OR /.*[Aa][Pp][Ii]\\.[Pp][Aa][Rr][Ss][Ee][Cc]\\.[Aa][Pp][Pp]/ OR /.*[Pp][Aa][Rr][Ss][Ee][Cc][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Rr][Ee][Mm][Oo][Tt][Ee][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\-[Pp][Aa]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm]/ OR /.*\\.[Ll][Oo][Gg][Mm][Ee][Ii][Nn]\\-[Gg][Aa][Tt][Ee][Ww][Aa][Yy]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Ee][Cc][Uu][Rr][Ee]\\.[Ll][Oo][Gg][Mm][Ee][Ii][Nn][Rr][Ee][Ss][Cc][Uu][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Jj][Oo][Ii][Nn]\\.[Zz][Oo][Hh][Oo]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Ss][Ss][Ii][Ss][Tt]\\.[Zz][Oo][Hh][Oo]\\.[Cc][Oo][Mm]/ OR /.*\\.[Zz][Oo][Hh][Oo][Aa][Ss][Ss][Ii][Ss][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\.[Zz][Oo][Hh][Oo][Cc][Dd][Nn]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Gg][Ee][Nn][Tt]\\.[Jj][Uu][Mm][Pp][Cc][Ll][Oo][Uu][Dd]\\.[Cc][Oo][Mm]/ OR /.*[Kk][Ii][Cc][Kk][Ss][Tt][Aa][Rr][Tt]\\.[Jj][Uu][Mm][Pp][Cc][Ll][Oo][Uu][Dd]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Dd][Nn]\\.[Kk][Aa][Ss][Ee][Yy][Aa]\\.[Nn][Ee][Tt]/ OR /.*[Rr][Ee][Ll][Aa][Yy]\\.[Kk][Aa][Ss][Ee][Yy][Aa]\\.[Nn][Ee][Tt]/ OR /.*[Ll][Ii][Cc][Ee][Nn][Ss][Ee]\\.[Bb][Oo][Mm][Gg][Aa][Rr]\\.[Cc][Oo][Mm]/ OR /.*\\.[Bb][Ee][Yy][Oo][Nn][Dd][Tt][Rr][Uu][Ss][Tt][Cc][Ll][Oo][Uu][Dd]\\.[Cc][Oo][Mm]/)) OR ((dns.question.name:/.*\\.[Rr][Uu][Ss][Tt][Dd][Ee][Ss][Kk]\\.[Cc][Oo][Mm]/ AND dns.question.name:/[Rr][Ss]\\-.*/))) AND (NOT ((process.executable:/.*\\\\\\\\[Bb][Rr][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\\\\\[Mm][Aa][Xx][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/) OR (((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\.*/) OR (process.executable:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\\\\\.*/) AND process.executable:(/.*\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/))) OR (process.executable:/.*\\\\\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ss][Aa][Ff][Aa][Rr][Ii]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ss][Ee][Aa][Mm][Oo][Nn][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ww][Hh][Aa][Ll][Ee]\\.[Ee][Xx][Ee]/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-4---gotoassist-files-detected-test-on-windows", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-3---logmein-files-detected-test-on-windows", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-6---ammyy-admin-software-execution", "https://redcanary.com/blog/misbehaving-rats/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
