{"description":"AppInstaller.exe is spawned by the default handler for the URI, it attempts to load/install a package from the URL Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d3a25fed-e3e3-8e8f-1852-3d8ae90c84cf","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"AppInstaller Attempts From URL by DNS","query":"(process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\Microsoft.DesktopAppInstaller_* AND process.executable:*\\\\AppInstaller.exe)","meta":{"from":"1m"},"severity":"medium","tags":["T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
