{"description": "Detects the execution of Scheduled Tasks where the Program being run is located in a suspicious location or it's an unusale program to be run from a Scheduled Task", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives may occur with some of the selected binaries if you have tasks using them (which could be very common in your environment). Exclude all the specific trusted tasks before using this rule"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8c8fac0d-c4fe-9b0c-784f-e75d1a4af131", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Scheduled Task Executed Uncommon LOLBIN", "query": "(winlog.event_id:\"129\" AND winlog.event_data.Path:(*\\\\calc.exe OR *\\\\cscript.exe OR *\\\\mshta.exe OR *\\\\mspaint.exe OR *\\\\notepad.exe OR *\\\\regsvr32.exe OR *\\\\wscript.exe))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
