{"description": "Detects connections to the host used in a big repository compromise discovered in August 2022", "enabled": false, "false_positives": ["Users looking up that domain after reading the report (unlikely)", "Web proxy or other security device DNS lookups of the domain"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "6b0dd2e4-13ff-4eff-b79b-4444fad43644", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DNS Lookup Github Repo Compromise Domain MyJino RU", "query": "dns.question.name:\"ovz1.j19544519.pr46m.vps.myjino.ru\"", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/stephenlacy/status/1554697077430505473"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
