{"description": "Detects attempted file load events that did not meet the signing level requirements. It often means the file's signature is revoked or a signature with the Lifetime Signing EKU has expired.\nThis event is best correlated with EID 3089 to determine the error of the validation.\n", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Antivirus and other third party products. Apply additional filters accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f8931561-97f5-4c46-907f-0a4a592e47a7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CodeIntegrity - Unmet Signing Level Requirements By File Under Validation", "query": "((winlog.event_id:(\"3033\" OR \"3034\") AND (NOT (FileNameBuffer:*\\\\Windows\\\\assembly\\\\GAC\\\\* AND ProcessNameBuffer:*\\\\mscorsvw.exe AND ProcessNameBuffer:*\\\\Windows\\\\Microsoft.NET\\\\* AND RequestedPolicy:\"8\" AND ValidatedPolicy:(\"1\" OR \"2\")))) AND (NOT (((FileNameBuffer:*\\\\Program\\ Files\\\\DTrace\\\\dtrace.dll AND ProcessNameBuffer:*\\\\Windows\\\\System32\\\\svchost.exe AND RequestedPolicy:\"12\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\* AND FileNameBuffer:*\\\\igd10iumd64.dll AND RequestedPolicy:\"7\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Windows\\\\System32\\\\nvspcap64.dll AND ProcessNameBuffer:(*\\\\AppData\\\\Local\\\\Keybase\\\\Gui\\\\Keybase.exe OR *\\\\Microsoft\\\\Teams\\\\stage\\\\Teams.exe) AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Program\\ Files\\\\Bonjour\\\\mdnsNSP.dll AND ProcessNameBuffer:(*\\\\Windows\\\\System32\\\\svchost.exe OR *\\\\Windows\\\\System32\\\\SIHClient.exe) AND RequestedPolicy:(\"8\" OR \"12\") AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Microsoft\\ Office\\\\root\\\\vfs\\\\ProgramFilesCommonX64\\\\Microsoft\\ Shared\\\\OFFICE* AND FileNameBuffer:*\\\\MSOXMLMF.DLL AND RequestedPolicy:\"7\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Windows\\\\System32\\\\nvspcap64.dll AND ProcessNameBuffer:*\\\\AppData\\\\Local\\\\slack\\\\app\\-* AND ProcessNameBuffer:*\\\\slack.exe AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:(*\\\\Mozilla\\ Firefox\\\\mozavcodec.dll OR *\\\\Mozilla\\ Firefox\\\\mozavutil.dll) AND ProcessNameBuffer:*\\\\Mozilla\\ Firefox\\\\firefox.exe AND RequestedPolicy:\"8\")) OR ((FileNameBuffer:(*\\\\Program\\ Files\\\\Avast\\ Software\\\\Avast\\\\aswAMSI.dll OR *\\\\Program\\ Files\\ \\(x86\\)\\\\Avast\\ Software\\\\Avast\\\\aswAMSI.dll) AND RequestedPolicy:(\"8\" OR \"12\") AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Program\\ Files\\\\Google\\\\Drive\\ File\\ Stream\\\\* AND FileNameBuffer:*\\\\crashpad_handler.exe AND ProcessNameBuffer:*\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Trend\\ Micro\\\\Client\\ Server\\ Security\\ Agent\\\\perficrcperfmonmgr.dll AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1483810148602814466", "https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log", "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-tag-explanations", "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-id-explanations"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
