{"description": "Detects attempted file load events that did not meet the signing level requirements. It often means the file's signature is revoked or a signature with the Lifetime Signing EKU has expired.\nThis event is best correlated with EID 3089 to determine the error of the validation.\n", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Antivirus and other third party products. Apply additional filters accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f8931561-97f5-4c46-907f-0a4a592e47a7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CodeIntegrity - Unmet Signing Level Requirements By File Under Validation", "query": "((winlog.event_id:(3033 OR 3034) AND (NOT (FileNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\\\\\\\[Gg][Aa][Cc]\\\\\\\\.*/ AND ProcessNameBuffer:/.*\\\\\\\\[Mm][Ss][Cc][Oo][Rr][Ss][Vv][Ww]\\.[Ee][Xx][Ee]/ AND ProcessNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\\\\\.*/ AND RequestedPolicy:8 AND ValidatedPolicy:(1 OR 2)))) AND (NOT (((FileNameBuffer:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Dd][Tt][Rr][Aa][Cc][Ee]\\\\\\\\[Dd][Tt][Rr][Aa][Cc][Ee]\\.[Dd][Ll][Ll]/ AND ProcessNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND RequestedPolicy:12 AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss][Tt][Oo][Rr][Ee]\\\\\\\\[Ff][Ii][Ll][Ee][Rr][Ee][Pp][Oo][Ss][Ii][Tt][Oo][Rr][Yy]\\\\\\\\.*/ AND FileNameBuffer:/.*\\\\\\\\[Ii][Gg][Dd]10[Ii][Uu][Mm][Dd]64\\.[Dd][Ll][Ll]/ AND RequestedPolicy:7 AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Nn][Vv][Ss][Pp][Cc][Aa][Pp]64\\.[Dd][Ll][Ll]/ AND ProcessNameBuffer:(/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Kk][Ee][Yy][Bb][Aa][Ss][Ee]\\\\\\\\[Gg][Uu][Ii]\\\\\\\\[Kk][Ee][Yy][Bb][Aa][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Tt][Ee][Aa][Mm][Ss]\\\\\\\\[Ss][Tt][Aa][Gg][Ee]\\\\\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/) AND RequestedPolicy:8 AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Bb][Oo][Nn][Jj][Oo][Uu][Rr]\\\\\\\\[Mm][Dd][Nn][Ss][Nn][Ss][Pp]\\.[Dd][Ll][Ll]/ AND ProcessNameBuffer:(/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Ii][Hh][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/) AND RequestedPolicy:(8 OR 12) AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\[Rr][Oo][Oo][Tt]\\\\\\\\[Vv][Ff][Ss]\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ff][Ii][Ll][Ee][Ss][Cc][Oo][Mm][Mm][Oo][Nn][Xx]64\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ AND FileNameBuffer:/.*\\\\\\\\[Mm][Ss][Oo][Xx][Mm][Ll][Mm][Ff]\\.[Dd][Ll][Ll]/ AND RequestedPolicy:7 AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Nn][Vv][Ss][Pp][Cc][Aa][Pp]64\\.[Dd][Ll][Ll]/ AND ProcessNameBuffer:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Ss][Ll][Aa][Cc][Kk]\\\\\\\\[Aa][Pp][Pp]\\-.*/ AND ProcessNameBuffer:/.*\\\\\\\\[Ss][Ll][Aa][Cc][Kk]\\.[Ee][Xx][Ee]/ AND RequestedPolicy:8 AND ValidatedPolicy:1)) OR ((FileNameBuffer:(/.*\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Mm][Oo][Zz][Aa][Vv][Cc][Oo][Dd][Ee][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Mm][Oo][Zz][Aa][Vv][Uu][Tt][Ii][Ll]\\.[Dd][Ll][Ll]/) AND ProcessNameBuffer:/.*\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ AND RequestedPolicy:8)) OR ((FileNameBuffer:(/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Aa][Vv][Aa][Ss][Tt]\\\\\\\\[Aa][Ss][Ww][Aa][Mm][Ss][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Aa][Vv][Aa][Ss][Tt]\\ [Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Aa][Vv][Aa][Ss][Tt]\\\\\\\\[Aa][Ss][Ww][Aa][Mm][Ss][Ii]\\.[Dd][Ll][Ll]/) AND RequestedPolicy:(8 OR 12) AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Dd][Rr][Ii][Vv][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Tt][Rr][Ee][Aa][Mm]\\\\\\\\.*/ AND FileNameBuffer:/.*\\\\\\\\[Cc][Rr][Aa][Ss][Hh][Pp][Aa][Dd]_[Hh][Aa][Nn][Dd][Ll][Ee][Rr]\\.[Ee][Xx][Ee]/ AND ProcessNameBuffer:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ii][Mm][Mm][Ee][Rr][Ss][Ii][Vv][Ee][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Pp][Aa][Nn][Ee][Ll]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\.[Ee][Xx][Ee]/ AND RequestedPolicy:8 AND ValidatedPolicy:1)) OR ((FileNameBuffer:/.*\\\\\\\\[Tt][Rr][Ee][Nn][Dd]\\ [Mm][Ii][Cc][Rr][Oo]\\\\\\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Aa][Gg][Ee][Nn][Tt]\\\\\\\\[Pp][Ee][Rr][Ff][Ii][Cc][Rr][Cc][Pp][Ee][Rr][Ff][Mm][Oo][Nn][Mm][Gg][Rr]\\.[Dd][Ll][Ll]/ AND RequestedPolicy:8 AND ValidatedPolicy:1)))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1483810148602814466", "https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log", "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-tag-explanations", "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-id-explanations"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
