{"description": "Detects driver load events that got blocked by Windows code integrity checks", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8824a696-4119-72ae-92bf-e5e055cc4de3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Code Integrity Blocked Driver Load", "query": "\"that\\ did\\ not\\ meet\\ the\\ Microsoft\\ signing\\ level\\ requirements\"", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1483810148602814466"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
