{"description": "Detects attempted DLL load events that didn't meet anti-malware or Windows signing level requirements. It often means the file's signature is revoked or expired", "author": ["Florian Roth", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Antivirus products"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0c411a7f-7521-e5cd-c6b5-c6f04c92e887", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Code Integrity Attempted DLL Load", "query": "(winlog.event_id:\"3033\" AND (NOT (((FileNameBuffer:*\\\\Program\\ Files\\\\DTrace\\\\dtrace.dll AND ProcessNameBuffer:*\\\\Windows\\\\System32\\\\svchost.exe AND RequestedPolicy:\"12\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\* AND FileNameBuffer:*\\\\igd10iumd64.dll AND RequestedPolicy:\"7\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Windows\\\\System32\\\\nvspcap64.dll AND ProcessNameBuffer:(*\\\\AppData\\\\Local\\\\Keybase\\\\Gui\\\\Keybase.exe OR *\\\\Microsoft\\\\Teams\\\\stage\\\\Teams.exe) AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Program\\ Files\\\\Bonjour\\\\mdnsNSP.dll AND ProcessNameBuffer:(*\\\\Windows\\\\System32\\\\svchost.exe OR *\\\\Windows\\\\System32\\\\SIHClient.exe) AND RequestedPolicy:(\"8\" OR \"12\") AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Microsoft\\ Office\\\\root\\\\vfs\\\\ProgramFilesCommonX64\\\\Microsoft\\ Shared\\\\OFFICE* AND FileNameBuffer:*\\\\MSOXMLMF.DLL AND RequestedPolicy:\"7\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:*\\\\Windows\\\\System32\\\\nvspcap64.dll AND ProcessNameBuffer:*\\\\AppData\\\\Local\\\\slack\\\\app\\-* AND ProcessNameBuffer:*\\\\slack.exe AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:(*\\\\Mozilla\\ Firefox\\\\mozavcodec.dll OR *\\\\Mozilla\\ Firefox\\\\mozavutil.dll) AND ProcessNameBuffer:*\\\\Mozilla\\ Firefox\\\\firefox.exe AND RequestedPolicy:\"8\")) OR ((FileNameBuffer:(*\\\\Program\\ Files\\\\Avast\\ Software\\\\Avast\\\\aswAMSI.dll OR *\\\\Program\\ Files\\ \\(x86\\)\\\\Avast\\ Software\\\\Avast\\\\aswAMSI.dll) AND RequestedPolicy:(\"8\" OR \"12\") AND ValidatedPolicy:\"1\")) OR ((FileNameBuffer:(*\\\\stdole.dll OR *\\\\msdatasrc.dll OR *\\\\adodb.dll) AND ProcessNameBuffer:*\\\\mscorsvw.exe AND ProcessNameBuffer:*\\\\Windows\\\\Microsoft.NET\\\\* AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"2\")) OR ((FileNameBuffer:*\\\\Program\\ Files\\\\Google\\\\Drive\\ File\\ Stream\\\\* AND FileNameBuffer:*\\\\crashpad_handler.exe AND ProcessNameBuffer:*\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe AND RequestedPolicy:\"8\" AND ValidatedPolicy:\"1\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1483810148602814466", "https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
