{"description":"Detects possible Active Directory enumeration via LDAP Author: Adeem Mawani. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e0c765ad-9647-e121-7fc9-61326f682801","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"LDAP Reconnaissance / Active Directory Enumeration","query":"(((winlog.event_id:\"30\" AND SearchFilter:(*\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483648\\)* OR *\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483656\\)* OR *\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483652\\)* OR *\\(groupType\\:1.2.840.113556.1.4.803\\:\\=2147483650\\)* OR *\\(sAMAccountType\\=805306369\\)* OR *\\(sAMAccountType\\=805306368\\)* OR *\\(sAMAccountType\\=536870913\\)* OR *\\(sAMAccountType\\=536870912\\)* OR *\\(sAMAccountType\\=268435457\\)* OR *\\(sAMAccountType\\=268435456\\)* OR *\\(objectCategory\\=groupPolicyContainer\\)* OR *\\(objectCategory\\=organizationalUnit\\)* OR *\\(objectCategory\\=Computer\\)* OR *\\(objectCategory\\=nTDSDSA\\)* OR *\\(objectCategory\\=server\\)* OR *\\(objectCategory\\=domain\\)* OR *\\(objectCategory\\=person\\)* OR *\\(objectCategory\\=group\\)* OR *\\(objectCategory\\=user\\)* OR *\\(objectClass\\=trustedDomain\\)* OR *\\(objectClass\\=computer\\)* OR *\\(objectClass\\=server\\)* OR *\\(objectClass\\=group\\)* OR *\\(objectClass\\=user\\)* OR *\\(primaryGroupID\\=521\\)* OR *\\(primaryGroupID\\=516\\)* OR *\\(primaryGroupID\\=515\\)* OR *\\(primaryGroupID\\=512\\)* OR *Domain\\ Admins*)) AND (NOT (winlog.event_id:\"30\" AND SearchFilter:(*\\(domainSid\\=*\\)* OR *\\(objectSid\\=*\\)*)))) OR (winlog.event_id:\"30\" AND SearchFilter:(*\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=4194304\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=2097152\\)* OR *\\!\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=1048574\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=524288\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=65536\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=8192\\)* OR *\\(userAccountControl\\:1.2.840.113556.1.4.803\\:\\=544\\)* OR *\\!\\(UserAccountControl\\:1.2.840.113556.1.4.803\\:\\=2\\)* OR *msDS\\-AllowedToActOnBehalfOfOtherIdentity* OR *msDS\\-AllowedToDelegateTo* OR *\\(accountExpires\\=9223372036854775807\\)* OR *\\(accountExpires\\=0\\)* OR *\\(adminCount\\=1\\)* OR *ms\\-MCS\\-AdmPwd*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1069","T1087","T1482"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1482","name":"Domain Trust Discovery","reference":"https://attack.mitre.org/techniques/T1482"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
