{"description": "Detects potential Active Directory enumeration via LDAP", "author": ["Adeem Mawani"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "31d68132-4038-47c7-8f8e-635a39a7c174", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Active Directory Reconnaissance/Enumeration Via LDAP", "query": "((((winlog.event_id:30 AND SearchFilter:(/.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483648\\).*/ OR /.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483656\\).*/ OR /.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483652\\).*/ OR /.*\\([Gg][Rr][Oo][Uu][Pp][Tt][Yy][Pp][Ee]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2147483650\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=805306369\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=805306368\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=536870913\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=536870912\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=268435457\\).*/ OR /.*\\([Ss][Aa][Mm][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Tt][Yy][Pp][Ee]\\=268435456\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Gg][Rr][Oo][Uu][Pp][Pp][Oo][Ll][Ii][Cc][Yy][Cc][Oo][Nn][Tt][Aa][Ii][Nn][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Oo][Rr][Gg][Aa][Nn][Ii][Zz][Aa][Tt][Ii][Oo][Nn][Aa][Ll][Uu][Nn][Ii][Tt]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Nn][Tt][Dd][Ss][Dd][Ss][Aa]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Ss][Ee][Rr][Vv][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Dd][Oo][Mm][Aa][Ii][Nn]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Pp][Ee][Rr][Ss][Oo][Nn]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Gg][Rr][Oo][Uu][Pp]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Aa][Tt][Ee][Gg][Oo][Rr][Yy]\\=[Uu][Ss][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Tt][Rr][Uu][Ss][Tt][Ee][Dd][Dd][Oo][Mm][Aa][Ii][Nn]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Ss][Ee][Rr][Vv][Ee][Rr]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Gg][Rr][Oo][Uu][Pp]\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Cc][Ll][Aa][Ss][Ss]\\=[Uu][Ss][Ee][Rr]\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=521\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=516\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=515\\).*/ OR /.*\\([Pp][Rr][Ii][Mm][Aa][Rr][Yy][Gg][Rr][Oo][Uu][Pp][Ii][Dd]\\=512\\).*/ OR /.*[Dd][Oo][Mm][Aa][Ii][Nn]\\ [Aa][Dd][Mm][Ii][Nn][Ss].*/ OR /.*[Oo][Bb][Jj][Ee][Cc][Tt][Gg][Uu][Ii][Dd]\\=\\\\\\*.*/ OR /.*\\([Ss][Cc][Hh][Ee][Mm][Aa][Ii][Dd][Gg][Uu][Ii][Dd]\\=\\\\\\*\\).*/)) AND (NOT (winlog.event_id:30 AND SearchFilter:(/.*\\([Dd][Oo][Mm][Aa][Ii][Nn][Ss][Ii][Dd]\\=\\*\\).*/ OR /.*\\([Oo][Bb][Jj][Ee][Cc][Tt][Ss][Ii][Dd]\\=\\*\\).*/))))) OR ((winlog.event_id:30 AND SearchFilter:(/.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=4194304\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2097152\\).*/ OR /.*\\!\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=1048574\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=524288\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=65536\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=8192\\).*/ OR /.*\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=544\\).*/ OR /.*\\!\\([Uu][Ss][Ee][Rr][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\:1\\.2\\.840\\.113556\\.1\\.4\\.803\\:\\=2\\).*/ OR /.*[Mm][Ss][Dd][Ss]\\-[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Aa][Cc][Tt][Oo][Nn][Bb][Ee][Hh][Aa][Ll][Ff][Oo][Ff][Oo][Tt][Hh][Ee][Rr][Ii][Dd][Ee][Nn][Tt][Ii][Tt][Yy].*/ OR /.*[Mm][Ss][Dd][Ss]\\-[Aa][Ll][Ll][Oo][Ww][Ee][Dd][Tt][Oo][Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Tt][Oo].*/ OR /.*[Mm][Ss][Dd][Ss]\\-[Gg][Rr][Oo][Uu][Pp][Mm][Aa][Nn][Aa][Gg][Ee][Dd][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Aa][Cc][Cc][Oo][Uu][Nn][Tt].*/ OR /.*\\([Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ee][Xx][Pp][Ii][Rr][Ee][Ss]\\=9223372036854775807\\).*/ OR /.*\\([Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ee][Xx][Pp][Ii][Rr][Ee][Ss]\\=0\\).*/ OR /.*\\([Aa][Dd][Mm][Ii][Nn][Cc][Oo][Uu][Nn][Tt]\\=1\\).*/ OR /.*[Mm][Ss]\\-[Mm][Cc][Ss]\\-[Aa][Dd][Mm][Pp][Ww][Dd].*/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1069", "T1087", "T1482"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1482", "name": "Domain Trust Discovery", "reference": "https://attack.mitre.org/techniques/T1482"}]}], "version": 1, "references": ["https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/hunting-for-reconnaissance-activities-using-ldap-search-filters/ba-p/824726", "https://github.com/PowerShellMafia/PowerSploit/blob/d943001a7defb5e0d1657085a77a0e78609be58f/Recon/PowerView.ps1", "https://github.com/BloodHoundAD/SharpHound3/blob/7d96b991b1887ff50349ce59c80980bc0d95c86a/SharpHound3/LdapBuilder.cs", "https://medium.com/falconforce/falconfriday-detecting-active-directory-data-collection-0xff21-c22d1a57494c", "https://github.com/fox-it/BloodHound.py/blob/d65eb614831cd30f26028ccb072f5e77ca287e0b/bloodhound/ad/domain.py#L427"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
