{"description": "Detects loading of essential DLLs used by PowerShell, but not by the process powershell.exe. Detects behaviour similar to meterpreter's \"load powershell\" extension.", "author": ["Tom Kern", "oscd.community", "Natalia Shornikova", "Tim Shelton", "Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "enabled": false, "false_positives": ["Used by some .NET binaries, minimal on user workstation.", "Used by Microsoft SQL Server Management Studio"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "092bc4b9-3d1d-43b4-a6b4-8c8acd83522f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Core DLL Loaded By Non PowerShell Process", "query": "((((winlog.event_data.Description:/[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]/) OR (winlog.event_data.OriginalFileName:/[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/) OR (dll.path:(/.*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Nn][Ii]\\.[Dd][Ll][Ll]/))) AND (NOT ((process.executable:(/.*\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\\\\\7\\\\\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Dd][Ss][Aa][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Rr][Ee][Mm][Oo][Tt][Ee][Ff][Xx][Vv][Gg][Pp][Uu][Dd][Ii][Ss][Aa][Bb][Ll][Ee][Mm][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Rr][Uu][Nn][Ss][Cc][Rr][Ii][Pp][Tt][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Dd][Ii][Aa][Gg][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Yy][Nn][Cc][Aa][Pp][Pp][Vv][Pp][Uu][Bb][Ll][Ii][Ss][Hh][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\\\\\[Vv]1\\.0\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\\\\\[Vv]1\\.0\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ww][Ii][Nn][Rr][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\\\\\[Vv]1\\.0\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\\\\\[Vv]1\\.0\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\[Ww][Ii][Nn][Rr][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]64\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Mm][Ss][Cc][Oo][Rr][Ss][Vv][Ww]\\.[Ee][Xx][Ee]/))))) AND (NOT (((process.executable:(/.*\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/ OR /.*\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/) AND process.executable:/.*\\\\\\\\[Ii][Dd][Ee]\\\\\\\\[Ss][Ss][Mm][Ss]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/.*\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Tt][Oo][Oo][Ll][Ss]\\\\\\\\[Bb][Ii][Nn][Nn]\\\\\\\\[Ss][Qq][Ll][Pp][Ss]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc]\\\\\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\\\\\.*/)) OR ((process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\\\\\.*/ AND process.executable:(/.*\\\\\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/))) OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921", "https://github.com/p3nt4/PowerShdll"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
