{"description": "Detects the load of EvtMuteHook.dll, a key component of SharpEvtHook, a tool that tampers with the Windows event logs", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Other DLLs with the same Imphash"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "49329257-089d-46e6-af37-4afce4290685", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - SharpEvtMute DLL Load", "query": "((winlog.event_data.Hashes:*IMPHASH\\=330768A4F172E10ACB6287B87289D83B*) OR (winlog.event_data.Imphash:\"330768a4f172e10acb6287b87289d83b\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/bats3c/EvtMute"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
