{"description": "Detects PowerShell core DLL being loaded by an Office Product", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bb2ba6fb-95d4-4a25-89fc-30bb736c021a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Core DLL Loaded Via Office Application", "query": "(process.executable.text:(\"*\\\\excel.exe\" OR \"*\\\\mspub.exe\" OR \"*\\\\outlook.exe\" OR \"*\\\\onenote.exe\" OR \"*\\\\onenoteim.exe\" OR \"*\\\\powerpnt.exe\" OR \"*\\\\winword.exe\") AND dll.path:(*\\\\System.Management.Automation.Dll* OR *\\\\System.Management.Automation.ni.Dll*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
