{"description": "Detects loading of Amsi.dll by uncommon processes", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate third party apps installed in \"ProgramData\" and \"AppData\" might generate some false positives. Apply additional filters accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "facd1549-e416-48e0-b8c4-41d7215eedc8", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Amsi.DLL Load By Uncommon Process", "query": "(dll.path:/.*\\\\\\\\[Aa][Mm][Ss][Ii]\\.[Dd][Ll][Ll]/ AND (NOT ((process.executable:(/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\\\\\.*/)) OR ((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\\\\\[Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]64\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Nn][Gg][Ee][Nn][Tt][Aa][Ss][Kk]\\.[Ee][Xx][Ee]/)) OR (NOT _exists_:process.executable.text) OR (process.executable.text:))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://infosecwriteups.com/amsi-bypass-new-way-2023-d506345944e9", "https://github.com/TheD1rkMtr/AMSI_patch", "https://github.com/surya-dev-singh/AmsiBypass-OpenSession"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
