{"description": "Detects both of CVE-2022-30190 / Follina and DogWalk vulnerability exploiting msdt.exe binary to load sdiageng.dll binary", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a72c8d54-14b4-b6c8-7249-aebf160ce65a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSDT.exe Loading Diagnostic Library", "query": "(process.executable:*\\\\msdt.exe AND file.path:*\\\\sdiageng.dll)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/"], "timestamp_override": "event.ingested", "author": ["Greg (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
