{"description": "Detects potential DLL sideloading of \"EACore.dll\"", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "edd3ddc3-386f-4ba5-9ada-4376b2cfa7b5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential EACore.DLL Sideloading", "query": "(dll.path:/.*\\\\[Ee][Aa][Cc][Oo][Rr][Ee]\\.[Dd][Ll][Ll]/ AND (NOT (process.executable:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ee][Ll][Ee][Cc][Tt][Rr][Oo][Nn][Ii][Cc]\\ [Aa][Rr][Tt][Ss]\\\\[Ee][Aa]\\ [Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ AND process.executable:/.*\\\\[Ee][Aa][Cc][Oo][Rr][Ee][Ss][Ee][Rr][Vv][Ee][Rr]\\.[Ee][Xx][Ee].*/ AND dll.path:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ee][Ll][Ee][Cc][Tt][Rr][Oo][Nn][Ii][Cc]\\ [Aa][Rr][Tt][Ss]\\\\[Ee][Aa]\\ [Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
