{"description": "Detects WMI command line event consumers", "enabled": false, "false_positives": ["Unknown (data set is too small; further testing needed)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "05936ce2-ee05-4dae-9d03-9a391cf2d2c6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WMI Persistence - Command Line Event Consumer", "query": "(process.executable:\"C\\:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe\" AND file.path:*\\\\wbemcons.dll)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/"], "timestamp_override": "event.ingested", "author": ["Thomas Patzke"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
