{"description": "Detects potential DLL sideloading of \"ShellDispatch.dll\"", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Some installers may trigger some false positives"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "844f8eb2-610b-42c8-89a4-47596e089663", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential ShellDispatch.DLL Sideloading", "query": "(dll.path:/.*\\\\\\\\[Ss][Hh][Ee][Ll][Ll][Dd][Ii][Ss][Pp][Aa][Tt][Cc][Hh]\\.[Dd][Ll][Ll]/ AND (NOT ((dll.path:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND dll.path:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/) OR (dll.path:/.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.hexacorn.com/blog/2023/06/07/this-lolbin-doesnt-exist/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
