{"description": "A General detection for processes loading System.Drawing.ni.dll. This could be an indicator of potential Screen Capture.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "953ab693-f7f9-b1f7-216a-53e977e0df36", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious System.Drawing Load", "query": "(file.path:*\\\\System.Drawing.ni.dll AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\* OR C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\*)) OR (process.executable:(C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\NhNotifSys\\\\nahimic\\\\nahimicNotifSys.exe OR C\\:\\\\Users\\\\*\\\\GitHubDesktop\\\\Update.exe OR \"C\\:\\\\Windows\\\\System32\\\\NhNotifSys.exe\")))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1113"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1113", "name": "Screen Capture", "reference": "https://attack.mitre.org/techniques/T1113"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/16", "https://threathunterplaybook.com/evals/apt29/detections/7.A.1_3B4E5808-3C71-406A-B181-17B0CE3178C9.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
