{"description": "Detects potential DLL sideloading of \"waveedit.dll\", which is part of the Nero WaveEditor audio editing software.", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "71b31e99-9ad0-47d4-aeb5-c0ca3928eeeb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Waveedit.DLL Sideloading", "query": "(dll.path:/.*\\\\\\\\[Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt]\\.[Dd][Ll][Ll]/ AND (NOT (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Nn][Ee][Rr][Oo]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Aa][Pp][Pp][Ss]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt][Oo][Rr]\\\\\\\\[Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Nn][Ee][Rr][Oo]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Aa][Pp][Pp][Ss]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt][Oo][Rr]\\\\\\\\[Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/) AND dll.path:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Nn][Ee][Rr][Oo]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Aa][Pp][Pp][Ss]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt][Oo][Rr]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Nn][Ee][Rr][Oo]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Aa][Pp][Pp][Ss]\\\\\\\\[Nn][Ee][Rr][Oo]\\ [Ww][Aa][Vv][Ee][Ee][Dd][Ii][Tt][Oo][Rr]\\\\\\\\.*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/23/f/behind-the-scenes-unveiling-the-hidden-workings-of-earth-preta.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
