{"description": "Detects DLL sideloading of \"dbghelp.dll\"", "enabled": false, "false_positives": ["Legitimate applications loading their own versions of the DLL mentioned in this rule"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2930b371-4db5-0f1a-c8e3-a6ffc109e3f5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DLL Sideloading Of DBGHELP.DLL", "query": "(dll.path:*\\\\dbghelp.dll AND (NOT ((dll.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Windows\\\\SoftwareDistribution\\\\* OR C\\:\\\\Windows\\\\SystemTemp\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Program\\ Files\\\\*) OR dll.path:(*\\\\Epic\\ Games\\\\Launcher\\\\Engine\\\\Binaries\\\\ThirdParty\\\\DbgHelp\\\\dbghelp.dll OR *\\\\Epic\\ Games\\\\MagicLegends\\\\x86\\\\dbghelp.dll OR *\\\\Anaconda3\\\\Lib\\\\site\\-packages\\\\vtrace\\\\platforms\\\\windll\\\\amd64\\\\dbghelp.dll OR *\\\\Anaconda3\\\\Lib\\\\site\\-packages\\\\vtrace\\\\platforms\\\\windll\\\\i386\\\\dbghelp.dll)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://hijacklibs.net/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali", "Wietze Beukema (project and research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
