{"description": "Detects a WMI modules being loaded by an uncommon process", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "671bb7e3-a020-4824-a00e-2ee5b55f385e", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "WMI Module Loaded By Non Uncommon Process", "query": "(event.action:(/[Ii][Mm][Aa][Gg][Ee]\\ [Ll][Oo][Aa][Dd][Ee][Dd]\\ \\([Rr][Uu][Ll][Ee]\\:\\ [Ii][Mm][Aa][Gg][Ee][Ll][Oo][Aa][Dd]\\)/ OR load) AND ((dll.path:(/.*\\\\[Ff][Aa][Ss][Tt][Pp][Rr][Oo][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Cc][Oo][Mm][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Pp][Rr][Oo][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Aa][Pp][Rr][Pp][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Cc][Ll][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Nn][Ee][Tt]\\_[Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Pp][Rr][Oo][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/)) OR (file.path:(/.*\\\\[Ff][Aa][Ss][Tt][Pp][Rr][Oo][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Cc][Oo][Mm][Nn]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Pp][Rr][Oo][Xx]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Bb][Ee][Mm][Ss][Vv][Cc]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Aa][Pp][Rr][Pp][Ll]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Cc][Ll][Nn][Tt]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Nn][Ee][Tt]\\_[Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Pp][Rr][Oo][Vv]\\.[Dd][Ll][Ll]/ OR /.*\\\\[Ww][Mm][Ii][Uu][Tt][Ii][Ll][Ss]\\.[Dd][Ll][Ll]/))) AND (NOT ((process.executable:(/.*\\:\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Mm][Oo][Nn]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Mm][Oo][Nn]64\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Cc][Ee][Nn][Ss][Uu][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ff][Ss][Rr][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ii][Ss][Pp][Dd][Ii][Aa][Gg]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Xx][Dd][Ii][Aa][Gg]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Gg][Pp][Rr][Ee][Ss][Uu][Ll][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Oo][Gg][Mm][Aa][Nn]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Oo][Uu][Ss][Oo][Cc][Oo][Rr][Ee][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Dd][Ii][Aa][Gg][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Hh][Ee][Aa][Ll][Tt][Hh][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ii][Hh][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Dd][Ss]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Uu][Nn][Ss][Ee][Cc][Aa][Pp][Pp]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Aa][Dd][Aa][Pp]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Aa][Pp][Ss][Rr][Vv]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Cc]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ll][Oo][Gg][Mm][Aa][Nn]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ss][Dd][Ii][Aa][Gg][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee].*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee].*/)) OR (process.executable:(/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Zz][Uu][Rr][Ee][Gg][Uu][Ee][Ss][Tt][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Aa][Aa][Pp][Pp][Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR ((process.executable:(/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\.*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]64\\\\.*/) AND process.executable:/.*\\\\[Nn][Gg][Ee][Nn][Tt][Aa][Ss][Kk]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/)))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://threathunterplaybook.com/hunts/windows/190811-WMIModuleLoad/notebook.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
