{"description": "Detects abusing Azure Browser SSO by requesting OAuth 2.0 refresh tokens for an Azure-AD-authenticated Windows user (i.e. the machine is joined to Azure AD and a user logs in with their Azure AD account) wanting to perform SSO authentication in the browser. An attacker can use this to authenticate to Azure AD in a browser as that user.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ec985c74-1a1e-c71c-4d57-f4902f3206e8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Abusing Azure Browser SSO", "query": "(file.path:*MicrosoftAccountTokenProvider.dll AND (NOT (process.executable:(*\\\\BackgroundTaskHost.exe OR *\\\\devenv.exe OR *\\\\iexplore.exe OR *\\\\MicrosoftEdge.exe OR *\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe OR *\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe OR *\\\\msedgewebview2.exe OR *\\\\OneDrive.exe) OR process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://posts.specterops.io/requesting-azure-ad-request-tokens-on-azure-ad-joined-machines-for-browser-sso-2b0409caad30"], "timestamp_override": "event.ingested", "author": ["Den Iuzvyk"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
