{"description": "Detects DLL image load activity as used by FoggyWeb backdoor loader", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "640dc51c-7713-4faa-8a0e-e7c0d9d4654c", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "FoggyWeb Backdoor DLL Loading", "query": "process.executable:\"C\\:\\\\Windows\\\\ADFS\\\\version.dll\"", "meta": {"from": "1m"}, "severity": "critical", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/09/27/foggyweb-targeted-nobelium-malware-leads-to-persistent-backdoor/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
