{"description": "Detects the image load of VSS DLL by uncommon executables", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c52b8112-ad66-0677-97d2-90e0dc7b10f5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Image Load of VSS Dll by Uncommon Executable", "query": "(dll.path:(*\\\\vsstrace.dll OR *\\\\vssapi.dll) AND (NOT ((process.executable.text:(C\\:\\\\Windows\\\\* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/ORCx41/DeleteShadowCopies"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
