{"description": "Detects VB DLL's loaded by an office application. Which could indicate the presence of VBA Macros.", "author": ["Antonlovesdnb"], "enabled": false, "false_positives": ["Legitimate macro usage. Add the appropriate filter according to your environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e6ce8457-68b1-485b-9bdd-3c2b5d679aa9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "VBA DLL Loaded Via Office Application", "query": "(process.executable.text:(\"*\\\\excel.exe\" OR \"*\\\\mspub.exe\" OR \"*\\\\onenote.exe\" OR \"*\\\\onenoteim.exe\" OR \"*\\\\outlook.exe\" OR \"*\\\\powerpnt.exe\" OR \"*\\\\winword.exe\") AND dll.path:(*\\\\VBE7.DLL OR *\\\\VBEUI.DLL OR *\\\\VBE7INTL.DLL))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
