{"description": "Detects abusing Azure Browser SSO by requesting OAuth 2.0 refresh tokens for an Azure-AD-authenticated Windows user (i.e. the machine is joined to Azure AD and a user logs in with their Azure AD account) wanting to perform SSO authentication in the browser.\nAn attacker can use this to authenticate to Azure AD in a browser as that user.\n", "author": ["Den Iuzvyk"], "enabled": false, "false_positives": ["False positives are expected since this rules is only looking for the DLL load event. This rule is better used in correlation with related activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "50f852e6-af22-4c78-9ede-42ef36aa3453", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Potential Azure Browser SSO Abuse", "query": "((dll.path:\"C:\\Windows\\System32\\MicrosoftAccountTokenProvider.dll\" AND (NOT (process.executable.text:(\"C\\:\\\\Windows\\\\System32\\\\*\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\*\") AND process.executable.text:\"*\\\\BackgroundTaskHost.exe\"))) AND (NOT (((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\*\") AND process.executable.text:\"*\\\\IDE\\\\devenv.exe\")) OR (process.executable.text:(\"C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe\" OR \"C:\\Program Files\\Internet Explorer\\iexplore.exe\")) OR (((process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\") OR (process.executable.text:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\") OR (process.executable.text:(\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" OR \"C:\\Program Files\\Microsoft\\Edge\\Application\\msedge.exe\")))) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeCore\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\\\EdgeCore\\\\*\") AND process.executable.text:(\"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\"))) OR (process.executable.text:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe\") OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "Privilege Escalation", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://posts.specterops.io/requesting-azure-ad-request-tokens-on-azure-ad-joined-machines-for-browser-sso-2b0409caad30"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
