{"description": "Detects Kerberos DLL being loaded by an Office Product", "author": ["Antonlovesdnb"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7417e29e-c2e7-4cf6-a2e8-767228c64837", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Active Directory Kerberos DLL Loaded Via Office Application", "query": "(process.executable.text:(\"*\\\\excel.exe\" OR \"*\\\\mspub.exe\" OR \"*\\\\onenote.exe\" OR \"*\\\\onenoteim.exe\" OR \"*\\\\outlook.exe\" OR \"*\\\\powerpnt.exe\" OR \"*\\\\winword.exe\") AND dll.path:*\\\\kerberos.dll)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
