{"description": "Detects CLR DLL being loaded by an Office Product", "author": ["Antonlovesdnb"], "enabled": false, "false_positives": ["Legitimate macro usage. Add the appropriate filter according to your environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8c295836-f279-2d1c-d41c-91654930c4a6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CLR DLL Loaded Via Office Applications", "query": "(process.executable.text:(*\\\\excel.exe OR *\\\\mspub.exe OR *\\\\outlook.exe OR *\\\\powerpnt.exe OR *\\\\winword.exe) AND dll.path:*\\\\clr.dll*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
