{"description": "Detects both of CVE-2022-30190 (Follina) and DogWalk vulnerabilities exploiting msdt.exe binary to load the \"sdiageng.dll\" library", "author": ["Greg (rule)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ec8c4047-fad9-416a-8c81-0f479353d7f6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Diagnostic Library Sdiageng.DLL Loaded By Msdt.EXE", "query": "(process.executable.text:\"*\\\\msdt.exe\" AND dll.path:*\\\\sdiageng.dll)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
