{"description": "Detects signs of potential use of the WSMAN provider from uncommon processes locally and remote execution.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious WSMAN Provider Image Loads", "query": "((((dll.path:(*\\\\WsmSvc.dll OR *\\\\WsmAuto.dll OR *\\\\Microsoft.WSMan.Management.ni.dll) OR winlog.event_data.OriginalFileName:(\"WsmSvc.dll\" OR \"WSMANAUTOMATION.DLL\" OR \"Microsoft.WSMan.Management.dll\")) OR (process.executable.text:*\\\\svchost.exe AND winlog.event_data.OriginalFileName:\"WsmWmiPl.dll\")) AND (NOT ((process.executable.text:(*\\\\powershell.exe OR *C\\:\\\\Windows\\\\System32\\\\sdiagnhost.exe OR *C\\:\\\\Windows\\\\System32\\\\services.exe)) OR (process.command_line.text:(*svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ BITS* OR *svchost.exe\\ \\-k\\ GraphicsPerfSvcGroup\\ \\-s\\ GraphicsPerfSvc* OR *svchost.exe\\ \\-k\\ NetworkService\\ \\-p\\ \\-s\\ Wecsvc* OR *svchost.exe\\ \\-k\\ netsvcs*)) OR (process.executable.text:(C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\v*) AND process.executable.text:*\\\\mscorsvw.exe) OR (process.executable.text:(\"C\\:\\\\Windows\\\\System32\\\\Configure\\-SMRemoting.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\ServerManager.exe\")) OR (process.executable.text:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\*) OR (process.executable.text:C\\:\\\\Program\\ Files\\\\Citrix\\\\*) OR (process.executable.text:*\\\\powershell_ise.exe)))) AND (NOT ((process.executable.text:*\\\\svchost.exe AND NOT _exists_:process.command_line.text))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1021", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://twitter.com/chadtilbury/status/1275851297770610688", "https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/", "https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture", "https://github.com/bohops/WSMan-WinRM"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
