{"description": "Detects the load of a signed and vulnerable GIGABYTE driver often used by threat actors or malware for privilege escalation", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "744023df-43fe-a3fd-7080-83c286523582", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Vulnerable GIGABYTE Driver Load", "query": "(winlog.event_data.Hashes:(*MD5\\=9AB9F3B75A2EB87FAFB1B7361BE9DFB3* OR *SHA1\\=FE10018AF723986DB50701C8532DF5ED98B17C39* OR *SHA256\\=31F4CFB4C71DA44120752721103A16512444C13C2AC2D857A7E6F13CB679B427*) OR MD5:\"9ab9f3b75a2eb87fafb1b7361be9dfb3\" OR SHA1:\"fe10018af723986db50701c8532df5ed98b17c39\" OR SHA256:\"31f4cfb4c71da44120752721103a16512444c13c2ac2d857a7e6f13cb679b427\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://medium.com/@fsx30/weaponizing-vulnerable-driver-for-privilege-escalation-gigabyte-edition-e73ee523598b", "https://twitter.com/malmoeb/status/1551449425842786306", "https://github.com/fengjixuchui/gdrv-loader"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
