{"description": "Detects DLL sideloading of \"dbgcore.dll\"", "enabled": false, "false_positives": ["Legitimate applications loading their own versions of the DLL mentioned in this rule"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9ca2bf31-0570-44d8-a543-534c47c33ed7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DLL Sideloading Of DBGCORE.DLL", "query": "(dll.path:*\\\\dbgcore.dll AND (NOT ((dll.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Windows\\\\SoftwareDistribution\\\\* OR C\\:\\\\Windows\\\\SystemTemp\\\\*)) OR (dll.path:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\*)) OR (dll.path:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Windows\\ Kits\\\\10\\\\Debuggers\\\\*) OR (dll.path:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\Microsoft.WinDbg_*) OR (dll.path:*\\\\Steam\\\\bin\\\\cef\\\\cef.win7x64\\\\dbgcore.dll) OR (dll.path:\"C\\:\\\\Program\\ Files\\\\Dell\\\\DTP\\\\InstrumentationSubAgent\\\\dbgcore.dll\") OR (dll.path:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\Office* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\Root\\\\Office* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\Office* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\Root\\\\Office*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://hijacklibs.net/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali", "Wietze Beukema (project and research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
