{"description": "Detects SILENTTRINITY stager use", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7a05c282-7133-581c-7dcd-8969ece099e5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SILENTTRINITY Stager Execution", "query": "winlog.event_data.Description:*st2stager*", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/byt3bl33d3r/SILENTTRINITY"], "timestamp_override": "event.ingested", "author": ["Aleksey Potapov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
