{"description": "Detects loading of Amsi.dll by uncommon processes", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate third party apps installed in \"ProgramData\" and \"AppData\" might generate some false positives. Apply additional filters accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "facd1549-e416-48e0-b8c4-41d7215eedc8", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Amsi.DLL Load By Uncommon Process", "query": "(dll.path:*\\\\amsi.dll AND (NOT ((process.executable.text:(\"C:\\Windows\\explorer.exe\" OR \"C:\\Windows\\Sysmon64.exe\")) OR (process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\*\" OR \"C\\:\\\\Windows\\\\System32\\\\*\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\*\" OR \"C\\:\\\\Windows\\\\WinSxS\\\\*\")) OR ((process.executable.text:\"C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\*\" AND process.executable.text:\"*\\\\MsMpEng.exe\")) OR ((process.executable.text:(\"C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\*\" OR \"C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\*\") AND process.executable.text:\"*\\\\ngentask.exe\")) OR (NOT _exists_:process.executable.text) OR (process.executable.text:\"\"))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://infosecwriteups.com/amsi-bypass-new-way-2023-d506345944e9", "https://github.com/TheD1rkMtr/AMSI_patch", "https://github.com/surya-dev-singh/AmsiBypass-OpenSession"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
