{"description": "Detects DLL sideloading of DLLs that are part of antivirus software suchas McAfee, Symantec...etc", "enabled": false, "false_positives": ["Applications that load the same dlls mentioned in the detection section. Investigate them and filter them out if a lot FPs are caused.", "Dell SARemediation plugin folder (C:\\Program Files\\Dell\\SARemediation\\plugin\\log.dll) is known to contain the 'log.dll' file.", "The Canon MyPrinter folder 'C:\\Program Files\\Canon\\MyPrinter\\' is known to contain the 'log.dll' file"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "552b6b65-df37-4d3e-a258-f2fc4771ae54", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Antivirus Software DLL Sideloading", "query": "((((dll.path:*\\\\log.dll AND (NOT ((dll.path:(C\\:\\\\Program\\ Files\\\\Bitdefender\\ Antivirus\\ Free\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Bitdefender\\ Antivirus\\ Free\\\\*)) OR (process.executable.text:\"C\\:\\\\Program\\ Files\\\\Dell\\\\SARemediation\\\\audit\\\\TelemetryUtility.exe\" AND dll.path:(\"C\\:\\\\Program\\ Files\\\\Dell\\\\SARemediation\\\\plugin\\\\log.dll\" OR \"C\\:\\\\Program\\ Files\\\\Dell\\\\SARemediation\\\\audit\\\\log.dll\")) OR (dll.path:C\\:\\\\Program\\ Files\\\\Canon\\\\MyPrinter\\\\*)))) OR (dll.path:*\\\\qrt.dll AND (NOT (dll.path:(C\\:\\\\Program\\ Files\\\\F\\-Secure\\\\Anti\\-Virus\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\F\\-Secure\\\\Anti\\-Virus\\\\*))))) OR (dll.path:(*\\\\ashldres.dll OR *\\\\lockdown.dll OR *\\\\vsodscpl.dll) AND (NOT (dll.path:(C\\:\\\\Program\\ Files\\\\McAfee\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\McAfee\\\\*))))) OR (dll.path:*\\\\vftrace.dll AND (NOT (dll.path:(C\\:\\\\Program\\ Files\\\\CyberArk\\\\Endpoint\\ Privilege\\ Manager\\\\Agent\\\\x32\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\CyberArk\\\\Endpoint\\ Privilege\\ Manager\\\\Agent\\\\x32\\\\*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://hijacklibs.net/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali", "Wietze Beukema (project and research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
