{"description": "Detects loading of essential DLLs used by PowerShell, but not by the process powershell.exe. Detects behaviour similar to meterpreter's \"load powershell\" extension.", "author": ["Tom Kern", "oscd.community", "Natalia Shornikova", "Tim Shelton", "Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "enabled": false, "false_positives": ["Used by some .NET binaries, minimal on user workstation.", "Used by Microsoft SQL Server Management Studio"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "092bc4b9-3d1d-43b4-a6b4-8c8acd83522f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Core DLL Loaded By Non PowerShell Process", "query": "((((winlog.event_data.Description:\"System.Management.Automation\") OR (winlog.event_data.OriginalFileName:\"System.Management.Automation.dll\") OR (dll.path:(*\\\\System.Management.Automation.dll OR *\\\\System.Management.Automation.ni.dll))) AND (NOT ((process.executable.text:(\"*\\:\\\\Program\\ Files\\\\PowerShell\\\\7\\\\pwsh.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\dsac.exe\" OR \"*\\:\\\\WINDOWS\\\\System32\\\\RemoteFXvGPUDisablement.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\runscripthelper.exe\" OR \"*\\:\\\\WINDOWS\\\\System32\\\\sdiagnhost.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\ServerManager.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\SyncAppvPublishingServer.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\winrshost.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\wsmprovhost.exe\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\winrshost.exe\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\wsmprovhost.exe\")) OR ((process.executable.text:(\"*\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\*\" OR \"*\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\*\") AND process.executable.text:\"*\\\\mscorsvw.exe\"))))) AND (NOT (((process.executable.text:(\"*\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ SQL\\ Server\\ Management\\ Studio*\" OR \"*\\:\\\\Program\\ Files\\\\Microsoft\\ SQL\\ Server\\ Management\\ Studio*\") AND process.executable.text:\"*\\\\IDE\\\\Ssms.exe\")) OR ((process.executable.text:(\"*\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ SQL\\ Server\\\\*\" OR \"*\\:\\\\Program\\ Files\\\\Microsoft\\ SQL\\ Server\\\\*\") AND process.executable.text:\"*\\\\Tools\\\\Binn\\\\SQLPS.exe\")) OR (process.executable.text:\"*\\\\Citrix\\\\ConfigSync\\\\ConfigSyncRun.exe\") OR (process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\*\")) OR ((process.executable.text:\"C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\*\" AND process.executable.text:(\"*\\\\thor64.exe\" OR \"*\\\\thor.exe\"))) OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921", "https://github.com/p3nt4/PowerShdll"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
