{"description": "Detects potential DLL sideloading of \"CCleanerDU.dll\"", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["False positives could occur from other custom installation paths. Apply additional filters accordingly."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1fbc0671-5596-4e17-8682-f020a0b995dc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential CCleanerDU.DLL Sideloading", "query": "(dll.path:*\\\\CCleanerDU.dll AND (NOT (process.executable.text:(\"C\\:\\\\Program\\ Files\\\\CCleaner\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\CCleaner\\\\*\") AND process.executable.text:(\"*\\\\CCleaner.exe\" OR \"*\\\\CCleaner64.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://lab52.io/blog/2344-2/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
