{"description": "Detects loading of \"Amsi.dll\" by a living of the land process. This could be an indication of a \"PowerShell without PowerShell\" attack", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6ec86d9e-912e-4726-91a2-209359b999b9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Amsi.DLL Loaded Via LOLBIN Process", "query": "(dll.path:*\\\\amsi.dll AND process.executable.text:(\"*\\\\ExtExport.exe\" OR \"*\\\\odbcconf.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
