{"description": "Detects loading of essential DLL used by PowerShell, but not by the process powershell.exe. Detects meterpreter's \"load powershell\" extension.", "enabled": false, "false_positives": ["Used by some .NET binaries, minimal on user workstation.", "Used by Microsoft SQL Server Management Studio"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "092bc4b9-3d1d-43b4-a6b4-8c8acd83522f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "In-memory PowerShell", "query": "(file.path:(*\\\\System.Management.Automation.Dll OR *\\\\System.Management.Automation.ni.Dll) AND (NOT ((process.executable:(*\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\WINDOWS\\\\System32\\\\sdiagnhost.exe OR *\\\\mscorsvw.exe OR *\\\\WINDOWS\\\\System32\\\\RemoteFXvGPUDisablement.exe OR *\\\\sqlps.exe OR *\\\\wsmprovhost.exe OR *\\\\winrshost.exe OR *\\\\syncappvpublishingserver.exe OR *\\\\runscripthelper.exe OR *\\\\ServerManager.exe OR *\\\\Microsoft\\ SQL\\ Server\\ Management\\ Studio\\ *\\\\Common*\\\\IDE\\\\Ssms.exe OR *\\\\IDE\\\\devenv.exe OR *\\\\ServiceHub.VSDetouredHost.exe OR *\\\\ServiceHub.SettingsHost.exe OR *\\\\ServiceHub.Host.CLR.x86.exe OR *\\\\Citrix\\\\ConfigSync\\\\ConfigSyncRun.exe) OR process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\*)) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:(*\\\\thor64.exe OR *\\\\thor.exe)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921", "https://github.com/p3nt4/PowerShdll"], "timestamp_override": "event.ingested", "author": ["Tom Kern", "oscd.community", "Natalia Shornikova", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
