{"description": "Detects PowerShell core DLL being loaded by an Office Product", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bb2ba6fb-95d4-4a25-89fc-30bb736c021a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Core DLL Loaded Via Office Application", "query": "(process.executable:(/.*\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Pp][Uu][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Oo][Nn][Ee][Nn][Oo][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Oo][Nn][Ee][Nn][Oo][Tt][Ee][Ii][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/) AND dll.path:(/.*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Dd][Ll][Ll].*/ OR /.*\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\.[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\.[Aa][Uu][Tt][Oo][Mm][Aa][Tt][Ii][Oo][Nn]\\.[Nn][Ii]\\.[Dd][Ll][Ll].*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
