{"description": "Detects the image load of vss_ps.dll by uncommon executables using OriginalFileName datapoint", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc7500b0-2a78-8e86-918d-4e7fca08d6a1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Image Load of VSS_PS.dll by Uncommon Executable", "query": "(dll.path:*\\\\vss_ps.dll AND (NOT ((process.executable.text:(*\\\\svchost.exe OR *\\\\msiexec.exe OR *\\\\vssvc.exe OR *\\\\srtasks.exe OR *\\\\tiworker.exe OR *\\\\dllhost.exe OR *\\\\searchindexer.exe OR *\\\\dismhost.exe OR *\\\\taskhostw.exe OR *\\\\clussvc.exe OR *\\\\thor64.exe OR *\\\\thor.exe OR *\\\\rundll32.exe OR *\\\\inetsrv\\\\iissetup.exe OR *\\\\inetsrv\\\\appcmd.exe OR *\\\\WmiPrvSE.exe) AND process.executable.text:*c\\:\\\\windows\\\\*) OR (process.command_line.text:C\\:\\\\$WinREAgent\\\\Scratch\\\\* AND process.command_line.text:*\\\\dismhost.exe\\ \\{*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["1bd85e1caa1415ebdc8852c91e37bbb7", "https://twitter.com/am0nsec/status/1412232114980982787"], "timestamp_override": "event.ingested", "author": ["Markus Neis", "@markus_neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
