{"description": "Detect usage of DLL \"coregen.exe\" (Microsoft CoreCLR Native Image Generator) binary to sideload arbitrary DLLs.", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0fa66f66-e3f6-4a9c-93f8-4f2610b00171", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential DLL Sideloading Using Coregen.exe", "query": "(process.executable.text:*\\\\coregen.exe AND (NOT (dll.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Silverlight\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Silverlight\\\\*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1055", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Coregen/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
