{"description": "Detects threat actors proxy executing code and bypassing application controls by leveraging wmic and the `/FORMAT` argument switch to download and execute an XSL file (i.e js, vbs, etc).", "enabled": false, "false_positives": ["Apparently, wmic os get lastboottuptime loads vbscript.dll"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "52c4dfc5-b570-04d0-a572-662e478ce068", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WMIC Loading Scripting Libraries", "query": "(process.executable:*\\\\wmic.exe AND file.path:(*\\\\jscript.dll OR *\\\\vbscript.dll))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1220"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1220", "name": "XSL Script Processing", "reference": "https://attack.mitre.org/techniques/T1220"}]}], "version": 1, "references": ["https://securitydatasets.com/notebooks/small/windows/05_defense_evasion/SDWIN-201017061100.html", "https://twitter.com/dez_/status/986614411711442944", "https://lolbas-project.github.io/lolbas/Binaries/Wmic/"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
