{"description": "Detects loading of \"RjvPlatform.dll\" by the \"SystemResetPlatform.exe\" binary which can be abused as a method of DLL side loading since the \"$SysReset\" directory isn't created by default.", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "259dda31-b7a3-444f-b7d8-17f96e8a7d0d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential RjvPlatform.DLL Sideloading From Default Location", "query": "(process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Ee][Ss][Ee][Tt][Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Ee][Ss][Ee][Tt][Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\.[Ee][Xx][Ee]/ AND dll.path:/[Cc]\\:\\\\\\\\$[Ss][Yy][Ss][Rr][Ee][Ss][Ee][Tt]\\\\\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\\\\\[Ss][Tt][Aa][Cc][Kk]\\\\\\\\[Rr][Jj][Vv][Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\.[Dd][Ll][Ll]/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://twitter.com/0gtweet/status/1666716511988330499"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
