{"description": "Detects rundll32 loading a renamed comsvcs.dll to dump process memory", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8cde342c-ba48-4b74-b615-172c330f2e93", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Renamed Comsvcs DLL Loaded By Rundll32", "query": "((process.executable.text:\"*\\\\rundll32.exe\" AND winlog.event_data.Hashes:(*IMPHASH\\=eed93054cb555f3de70eaa9787f32ebb* OR *IMPHASH\\=5e0dbdec1fce52daae251a110b4f309d* OR *IMPHASH\\=eadbccbb324829acb5f2bbe87e5549a8* OR *IMPHASH\\=407ca0f7b523319d758a40d7c0193699* OR *IMPHASH\\=281d618f4e6271e527e6386ea6f748de*)) AND (NOT dll.path:*\\\\comsvcs.dll))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Defense Evasion", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/sbousseaden/status/1555200155351228419"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
