{"description": "Detects when a system process (i.e. located in system32, syswow64, etc.) loads a DLL from a suspicious location such as C:\\Users\\Public", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DLL Load By System Process From Suspicious Locations", "query": "(process.executable.text:\"C\\:\\\\Windows\\\\*\" AND dll.path:(C\\:\\\\Users\\\\Public\\\\* OR C\\:\\\\PerfLogs\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
