{"description": "Detects DLL sideloading of DLLs usually located in system locations (System32, SysWOW64, etc.)", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate applications loading their own versions of the DLLs mentioned in this rule"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4fc0deee-0057-4998-ab31-d24e46e0aba4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential System DLL Sideloading From Non System Locations", "query": "((dll.path:(*\\\\shfolder.dll OR *\\\\activeds.dll OR *\\\\adsldpc.dll OR *\\\\aepic.dll OR *\\\\apphelp.dll OR *\\\\applicationframe.dll OR *\\\\appxalluserstore.dll OR *\\\\appxdeploymentclient.dll OR *\\\\archiveint.dll OR *\\\\atl.dll OR *\\\\audioses.dll OR *\\\\auditpolcore.dll OR *\\\\authfwcfg.dll OR *\\\\authz.dll OR *\\\\avrt.dll OR *\\\\bcd.dll OR *\\\\bcp47langs.dll OR *\\\\bcp47mrm.dll OR *\\\\bcrypt.dll OR *\\\\cabinet.dll OR *\\\\cabview.dll OR *\\\\certenroll.dll OR *\\\\cldapi.dll OR *\\\\clipc.dll OR *\\\\clusapi.dll OR *\\\\cmpbk32.dll OR *\\\\coloradapterclient.dll OR *\\\\colorui.dll OR *\\\\comdlg32.dll OR *\\\\connect.dll OR *\\\\coremessaging.dll OR *\\\\credui.dll OR *\\\\cryptbase.dll OR *\\\\cryptdll.dll OR *\\\\cryptui.dll OR *\\\\cryptxml.dll OR *\\\\cscapi.dll OR *\\\\cscobj.dll OR *\\\\cscui.dll OR *\\\\d2d1.dll OR *\\\\d3d10.dll OR *\\\\d3d10_1.dll OR *\\\\d3d10_1core.dll OR *\\\\d3d10core.dll OR *\\\\d3d10warp.dll OR *\\\\d3d11.dll OR *\\\\d3d12.dll OR *\\\\d3d9.dll OR *\\\\dataexchange.dll OR *\\\\davclnt.dll OR *\\\\dcomp.dll OR *\\\\defragproxy.dll OR *\\\\desktopshellext.dll OR *\\\\deviceassociation.dll OR *\\\\devicecredential.dll OR *\\\\devicepairing.dll OR *\\\\devobj.dll OR *\\\\devrtl.dll OR *\\\\dhcpcmonitor.dll OR *\\\\dhcpcsvc.dll OR *\\\\dhcpcsvc6.dll OR *\\\\directmanipulation.dll OR *\\\\dismapi.dll OR *\\\\dismcore.dll OR *\\\\dmcfgutils.dll OR *\\\\dmcmnutils.dll OR *\\\\dmenrollengine.dll OR *\\\\dmenterprisediagnostics.dll OR *\\\\dmiso8601utils.dll OR *\\\\dmoleaututils.dll OR *\\\\dmprocessxmlfiltered.dll OR *\\\\dmpushproxy.dll OR *\\\\dmxmlhelputils.dll OR *\\\\dnsapi.dll OR *\\\\dot3api.dll OR *\\\\dot3cfg.dll OR *\\\\drprov.dll OR *\\\\dsclient.dll OR *\\\\dsparse.dll OR *\\\\dsreg.dll OR *\\\\dsrole.dll OR *\\\\dui70.dll OR *\\\\duser.dll OR *\\\\dusmapi.dll OR *\\\\dwmapi.dll OR *\\\\dwrite.dll OR *\\\\dxgi.dll OR *\\\\dxva2.dll OR *\\\\eappcfg.dll OR *\\\\eappprxy.dll OR *\\\\edputil.dll OR *\\\\efsadu.dll OR *\\\\efsutil.dll OR *\\\\esent.dll OR *\\\\execmodelproxy.dll OR *\\\\explorerframe.dll OR *\\\\fastprox.dll OR *\\\\faultrep.dll OR *\\\\fddevquery.dll OR *\\\\feclient.dll OR *\\\\fhcfg.dll OR *\\\\firewallapi.dll OR *\\\\flightsettings.dll OR *\\\\fltlib.dll OR *\\\\fveapi.dll OR *\\\\fwbase.dll OR *\\\\fwcfg.dll OR *\\\\fwpolicyiomgr.dll OR *\\\\fwpuclnt.dll OR *\\\\getuname.dll OR *\\\\hid.dll OR *\\\\hnetmon.dll OR *\\\\httpapi.dll OR *\\\\idstore.dll OR *\\\\ieadvpack.dll OR *\\\\iedkcs32.dll OR *\\\\iertutil.dll OR *\\\\ifmon.dll OR *\\\\iphlpapi.dll OR *\\\\iri.dll OR *\\\\iscsidsc.dll OR *\\\\iscsium.dll OR *\\\\isv.exe_rsaenh.dll OR *\\\\joinutil.dll OR *\\\\ksuser.dll OR *\\\\ktmw32.dll OR *\\\\licensemanagerapi.dll OR *\\\\licensingdiagspp.dll OR *\\\\linkinfo.dll OR *\\\\loadperf.dll OR *\\\\logoncli.dll OR *\\\\logoncontroller.dll OR *\\\\lpksetupproxyserv.dll OR *\\\\magnification.dll OR *\\\\mapistub.dll OR *\\\\mfcore.dll OR *\\\\mfplat.dll OR *\\\\mi.dll OR *\\\\midimap.dll OR *\\\\miutils.dll OR *\\\\mlang.dll OR *\\\\mmdevapi.dll OR *\\\\mobilenetworking.dll OR *\\\\mpr.dll OR *\\\\mprapi.dll OR *\\\\mrmcorer.dll OR *\\\\msacm32.dll OR *\\\\mscms.dll OR *\\\\mscoree.dll OR *\\\\msctf.dll OR *\\\\msctfmonitor.dll OR *\\\\msdrm.dll OR *\\\\msftedit.dll OR *\\\\msi.dll OR *\\\\msutb.dll OR *\\\\mswb7.dll OR *\\\\mswsock.dll OR *\\\\msxml3.dll OR *\\\\mtxclu.dll OR *\\\\napinsp.dll OR *\\\\ncrypt.dll OR *\\\\ndfapi.dll OR *\\\\netid.dll OR *\\\\netiohlp.dll OR *\\\\netplwiz.dll OR *\\\\netprofm.dll OR *\\\\netsetupapi.dll OR *\\\\netshell.dll OR *\\\\netutils.dll OR *\\\\networkexplorer.dll OR *\\\\newdev.dll OR *\\\\ninput.dll OR *\\\\nlaapi.dll OR *\\\\nlansp_c.dll OR *\\\\npmproxy.dll OR *\\\\nshhttp.dll OR *\\\\nshipsec.dll OR *\\\\nshwfp.dll OR *\\\\ntdsapi.dll OR *\\\\ntlanman.dll OR *\\\\ntlmshared.dll OR *\\\\ntmarta.dll OR *\\\\ntshrui.dll OR *\\\\oleacc.dll OR *\\\\omadmapi.dll OR *\\\\onex.dll OR *\\\\osbaseln.dll OR *\\\\osuninst.dll OR *\\\\p2p.dll OR *\\\\p2pnetsh.dll OR *\\\\p9np.dll OR *\\\\pcaui.dll OR *\\\\pdh.dll OR *\\\\peerdistsh.dll OR *\\\\pla.dll OR *\\\\pnrpnsp.dll OR *\\\\policymanager.dll OR *\\\\polstore.dll OR *\\\\printui.dll OR *\\\\propsys.dll OR *\\\\prvdmofcomp.dll OR *\\\\puiapi.dll OR *\\\\radcui.dll OR *\\\\rasapi32.dll OR *\\\\rasgcw.dll OR *\\\\rasman.dll OR *\\\\rasmontr.dll OR *\\\\reagent.dll OR *\\\\regapi.dll OR *\\\\resutils.dll OR *\\\\rmclient.dll OR *\\\\rpcnsh.dll OR *\\\\rsaenh.dll OR *\\\\rtutils.dll OR *\\\\rtworkq.dll OR *\\\\samcli.dll OR *\\\\samlib.dll OR *\\\\sapi_onecore.dll OR *\\\\sas.dll OR *\\\\scansetting.dll OR *\\\\scecli.dll OR *\\\\schedcli.dll OR *\\\\secur32.dll OR *\\\\shell32.dll OR *\\\\slc.dll OR *\\\\snmpapi.dll OR *\\\\spp.dll OR *\\\\sppc.dll OR *\\\\srclient.dll OR *\\\\srpapi.dll OR *\\\\srvcli.dll OR *\\\\ssp.exe_rsaenh.dll OR *\\\\ssp_isv.exe_rsaenh.dll OR *\\\\sspicli.dll OR *\\\\ssshim.dll OR *\\\\staterepository.core.dll OR *\\\\structuredquery.dll OR *\\\\sxshared.dll OR *\\\\tapi32.dll OR *\\\\tbs.dll OR *\\\\tdh.dll OR *\\\\tquery.dll OR *\\\\tsworkspace.dll OR *\\\\ttdrecord.dll OR *\\\\twext.dll OR *\\\\twinapi.dll OR *\\\\twinui.appcore.dll OR *\\\\uianimation.dll OR *\\\\uiautomationcore.dll OR *\\\\uireng.dll OR *\\\\uiribbon.dll OR *\\\\updatepolicy.dll OR *\\\\userenv.dll OR *\\\\utildll.dll OR *\\\\uxinit.dll OR *\\\\uxtheme.dll OR *\\\\vaultcli.dll OR *\\\\virtdisk.dll OR *\\\\vssapi.dll OR *\\\\vsstrace.dll OR *\\\\wbemprox.dll OR *\\\\wbemsvc.dll OR *\\\\wcmapi.dll OR *\\\\wcnnetsh.dll OR *\\\\wdi.dll OR *\\\\wdscore.dll OR *\\\\webservices.dll OR *\\\\wecapi.dll OR *\\\\wer.dll OR *\\\\wevtapi.dll OR *\\\\whhelper.dll OR *\\\\wimgapi.dll OR *\\\\winbrand.dll OR *\\\\windows.storage.dll OR *\\\\windows.storage.search.dll OR *\\\\windowscodecs.dll OR *\\\\windowscodecsext.dll OR *\\\\windowsudk.shellcommon.dll OR *\\\\winhttp.dll OR *\\\\wininet.dll OR *\\\\winipsec.dll OR *\\\\winmde.dll OR *\\\\winmm.dll OR *\\\\winnsi.dll OR *\\\\winrnr.dll OR *\\\\winsqlite3.dll OR *\\\\winsta.dll OR *\\\\wkscli.dll OR *\\\\wlanapi.dll OR *\\\\wlancfg.dll OR *\\\\wldp.dll OR *\\\\wlidprov.dll OR *\\\\wmiclnt.dll OR *\\\\wmidcom.dll OR *\\\\wmiutils.dll OR *\\\\wmsgapi.dll OR *\\\\wofutil.dll OR *\\\\wpdshext.dll OR *\\\\wshbth.dll OR *\\\\wshelper.dll OR *\\\\wtsapi32.dll OR *\\\\wwapi.dll OR *\\\\xmllite.dll OR *\\\\xolehlp.dll OR *\\\\xwizards.dll OR *\\\\xwtpw32.dll OR *\\\\aclui.dll OR *\\\\bderepair.dll OR *\\\\bootmenuux.dll OR *\\\\dcntel.dll OR *\\\\dwmcore.dll OR *\\\\dynamoapi.dll OR *\\\\fhsvcctl.dll OR *\\\\fxsst.dll OR *\\\\inproclogger.dll OR *\\\\iumbase.dll OR *\\\\kdstub.dll OR *\\\\maintenanceui.dll OR *\\\\mdmdiagnostics.dll OR *\\\\mintdh.dll OR *\\\\msdtctm.dll OR *\\\\nettrace.dll OR *\\\\osksupport.dll OR *\\\\reseteng.dll OR *\\\\resetengine.dll OR *\\\\spectrumsyncclient.dll OR *\\\\srcore.dll OR *\\\\systemsettingsthresholdadminflowui.dll OR *\\\\timesync.dll OR *\\\\upshared.dll OR *\\\\wmpdui.dll OR *\\\\wwancfg.dll OR *\\\\dpx.dll OR *\\\\fxsapi.dll OR *\\\\fxstiff.dll OR *\\\\xpsservices.dll OR *\\\\appvpolicy.dll OR *\\\\batmeter.dll OR *\\\\bootux.dll OR *\\\\cmutil.dll OR *\\\\configmanager2.dll OR *\\\\coredplus.dll OR *\\\\coreuicomponents.dll OR *\\\\cryptsp.dll OR *\\\\dmcommandlineutils.dll OR *\\\\drvstore.dll OR *\\\\dsprop.dll OR *\\\\dxcore.dll OR *\\\\edgeiso.dll OR *\\\\framedynos.dll OR *\\\\fveskybackup.dll OR *\\\\fvewiz.dll OR *\\\\gpapi.dll OR *\\\\icmp.dll OR *\\\\ifsutil.dll OR *\\\\iumsdk.dll OR *\\\\lockhostingframework.dll OR *\\\\lrwizdll.dll OR *\\\\mbaexmlparser.dll OR *\\\\mfc42u.dll OR *\\\\msiso.dll OR *\\\\msvcp110_win.dll OR *\\\\netapi32.dll OR *\\\\netjoin.dll OR *\\\\netprovfw.dll OR *\\\\opcservices.dll OR *\\\\pkeyhelper.dll OR *\\\\playsndsrv.dll OR *\\\\powrprof.dll OR *\\\\prntvpt.dll OR *\\\\profapi.dll OR *\\\\proximitycommon.dll OR *\\\\proximityservicepal.dll OR *\\\\rasdlg.dll OR *\\\\security.dll OR *\\\\sppcext.dll OR *\\\\srmtrace.dll OR *\\\\tpmcoreprovisioning.dll OR *\\\\umpdc.dll OR *\\\\unattend.dll OR *\\\\urlmon.dll OR *\\\\vdsutil.dll OR *\\\\version.dll OR *\\\\winbio.dll OR *\\\\windows.ui.immersive.dll OR *\\\\winscard.dll OR *\\\\winsync.dll OR *\\\\wscapi.dll OR *\\\\wsmsvc.dll OR *\\\\FxsCompose.dll OR *\\\\WfsR.dll OR *\\\\rpchttp.dll OR *\\\\storageusage.dll OR *\\\\amsi.dll OR *\\\\PrintIsolationProxy.dll OR *\\\\msdtcVSp1res.dll OR *\\\\rdpendp.dll OR *\\\\dxilconv.dll OR *\\\\utcutil.dll OR *\\\\appraiser.dll OR *\\\\dsound.dll OR *\\\\DispBroker.dll OR *\\\\FXSRESM.DLL OR *\\\\cryptnet.dll OR *\\\\COMRES.DLL OR *\\\\igdumdim64.dll OR *\\\\igd10iumd64.dll OR *\\\\igd12umd64.dll OR *\\\\igdusc64.dll OR *\\\\WLBSCTRL.dll OR *\\\\TSMSISrv.dll OR *\\\\TSVIPSrv.dll OR *\\\\wow64log.dll OR *\\\\WptsExtensions.dll OR *\\\\wbemcomn.dll) AND (NOT dll.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Windows\\\\SoftwareDistribution\\\\* OR C\\:\\\\Windows\\\\SystemTemp\\\\* OR C\\:\\\\$WINDOWS.\\~BT\\\\*))) AND (NOT (((process.executable.text:\"C:\\Program Files\\Common Files\\microsoft shared\\ClickToRun\\OfficeClickToRun.exe\" AND dll.path:\"C:\\Program Files\\Common Files\\microsoft shared\\ClickToRun\\AppVPolicy.dll\")) OR (dll.path:C\\:\\\\Packages\\\\Plugins\\\\Microsoft.GuestConfiguration.ConfigurationforWindows\\\\*) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\WindowsApps\\\\DellInc.DellSupportAssistforPCs*\" OR \"C\\:\\\\Windows\\\\System32\\\\backgroundTaskHost.exe*\") AND dll.path:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\DellInc.DellSupportAssistforPCs*)) OR ((process.executable.text:\"C\\:\\\\Program\\ Files\\\\WindowsApps\\\\DellInc.DellSupportAssistforPCs*\" AND process.executable.text:\"*\\\\wldp.dll\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\CheckPoint\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\CheckPoint\\\\*\") AND process.executable.text:\"*\\\\SmartConsole.exe\" AND dll.path:(C\\:\\\\Program\\ Files\\\\CheckPoint\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\CheckPoint\\\\*) AND dll.path:*\\\\PolicyManager.dll)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://hijacklibs.net/", "https://blog.cyble.com/2022/07/21/qakbot-resurfaces-with-new-playbook/", "https://blog.cyble.com/2022/07/27/targeted-attacks-being-carried-out-via-dll-sideloading/", "https://github.com/XForceIR/SideLoadHunter/blob/cc7ef2e5d8908279b0c4cee4e8b6f85f7b8eed52/SideLoads/README.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
