{"description": "Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fe6e002f-f244-4278-9263-20e4b593827f", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Alternate PowerShell Hosts", "query": "((winlog.event_data.Description:\"System.Management.Automation\" AND dll.path:*System.Management.Automation*) AND (NOT ((process.executable.text:(*\\\\powershell.exe OR *\\\\mscorsvw.exe) OR process.executable.text:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Program\\ Files\\\\Citrix\\\\ConfigSync\\\\*)) OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190610201010.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
