{"description": "Detects .NET CLR DLLs being loaded by scripting applications such as wscript or cscript", "author": ["omkar72", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ff521eac-347a-8ce8-431f-782aab240c2f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CLR DLL Loaded Via Scripting Applications", "query": "(process.executable.text:(*\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\mshta.exe OR *\\\\cmstp.exe OR *\\\\msxsl.exe) AND dll.path:(*\\\\clr.dll OR *\\\\mscoree.dll OR *\\\\mscorlib.dll))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://github.com/tyranid/DotNetToJScript", "https://thewover.github.io/Introducing-Donut/", "https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html", "https://web.archive.org/web/20221026202428/https://gist.github.com/code-scrap/d7f152ffcdb3e0b02f7f394f5187f008"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
