{"description": "Detects potential DLL sideloading of \"roboform.dll\", a DLL used by RoboForm Password Manager", "author": ["X__Junior (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["If installed on a per-user level, the path would be located in \"AppData\\Local\". Add additional filters to reflect this mode of installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f64c9b2d-b0ad-481d-9d03-7fc75020892a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential RoboForm.DLL Sideloading", "query": "(dll.path:(*\\\\roboform.dll OR *\\\\roboform\\-x64.dll) AND (NOT (process.executable.text:(\"\\ C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Siber\\ Systems\\\\AI\\ RoboForm\\\\*\" OR \"\\ C\\:\\\\Program\\ Files\\\\Siber\\ Systems\\\\AI\\ RoboForm\\\\*\") AND process.executable.text:(\"*\\\\robotaskbaricon.exe\" OR \"*\\\\robotaskbaricon\\-x64.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://twitter.com/StopMalvertisin/status/1648604148848549888", "https://twitter.com/t3ft3lb/status/1656194831830401024", "https://www.roboform.com/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
