{"description": "Detects potential DLL sideloading activity via the Aruba Networks Virtual Intranet Access \"arubanetsvc.exe\" process using DLL Search Order Hijacking", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "90ae0469-0cee-4509-b67f-e5efcef040f7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Aruba Network Service Potential DLL Sideloading", "query": "((process.executable.text:*\\\\arubanetsvc.exe AND dll.path:(*\\\\wtsapi32.dll OR *\\\\msvcr100.dll OR *\\\\msvcp100.dll OR *\\\\dbghelp.dll OR *\\\\dbgcore.dll OR *\\\\wininet.dll OR *\\\\iphlpapi.dll OR *\\\\version.dll OR *\\\\cryptsp.dll OR *\\\\cryptbase.dll OR *\\\\wldp.dll OR *\\\\profapi.dll OR *\\\\sspicli.dll OR *\\\\winsta.dll OR *\\\\dpapi.dll)) AND (NOT dll.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://twitter.com/wdormann/status/1616581559892545537?t=XLCBO9BziGzD7Bmbt8oMEQ&s=09"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
