{"description": "Detects potential DLL sideloading of DLLs that are known to be abused from suspicious locations", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "799a5f48-0ac1-4e0f-9152-71d137d48c2a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Abusable DLL Potential Sideloading From Suspicious Location", "query": "(dll.path:(/.*\\\\\\\\[Cc][Oo][Rr][Ee][Cc][Ll][Rr]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Ff][Aa][Cc][Ee][Ss][Dd][Kk]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Hh][Pp][Cc][Uu][Ss][Tt][Pp][Aa][Rr][Tt][Uu][Ii]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Ll][Ii][Bb][Cc][Ee][Ff]\\.[Dd][Ll][Ll]/ OR /.*\\\\\\\\[Zz][Ii][Pp][Dd][Ll][Ll]\\.[Dd][Ll][Ll]/) AND ((dll.path:(/.*\\:\\\\\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\\\\\.*/ OR /.*\\\\\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/ OR /.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/)) OR ((dll.path:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND dll.path:/.*\\\\\\\\[Ff][Aa][Vv][Oo][Rr][Ii][Tt][Ee][Ss]\\\\\\\\.*/)) OR ((dll.path:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND dll.path:/.*\\\\\\\\[Ff][Aa][Vv][Oo][Uu][Rr][Ii][Tt][Ee][Ss]\\\\\\\\.*/)) OR ((dll.path:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND dll.path:/.*\\\\\\\\[Cc][Oo][Nn][Tt][Aa][Cc][Tt][Ss]\\\\\\\\.*/)) OR ((dll.path:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND dll.path:/.*\\\\\\\\[Pp][Ii][Cc][Tt][Uu][Rr][Ee][Ss]\\\\\\\\.*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/23/f/behind-the-scenes-unveiling-the-hidden-workings-of-earth-preta.html", "https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
