{"description": "Detects when a system process (ie located in system32, syswow64...etc) loads a DLL from a suspicious location such as %temp%", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d1080f78-989b-aad3-9991-0cafecaa81b0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DLL Load By System Process From Suspicious Locations", "query": "((process.executable.text:C\\:\\\\Windows\\\\* AND dll.path:(*\\\\Users\\\\Public\\\\* OR *\\\\Downloads\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\PerfLogs\\\\*)) AND (NOT ((process.executable.text:*\\\\msiexec.exe OR dll.path:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\cleanmgr.exe\" AND dll.path:*\\\\ssshim.dll) OR (process.executable.text:C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\v* AND process.executable.text:*\\\\mscorsvw.exe AND dll.path:*\\\\AppData\\\\Local\\\\Temp\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
