{"description": "Detects outlvba (Microsoft VBA for Outlook Addin) DLL being loaded by the outlook process", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate macro usage. Add the appropriate filter according to your environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9a0b8719-cd3c-4f0a-90de-765a4cb3f5ed", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft VBA For Outlook Addin Loaded Via Outlook", "query": "(process.executable.text:*\\\\outlook.exe AND dll.path:\\\\outlvba.dll*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=58"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
