{"description": "Detects loading and execution of an unsigned thor scanner binary.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Other legitimate binaries named \"thor.exe\" that aren't published by Nextron Systems"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ea5c131b-380d-49f9-aeb3-920694da4d4b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Unsigned Thor Scanner Execution", "query": "(event.action:(/[Ii][Mm][Aa][Gg][Ee]\\ [Ll][Oo][Aa][Dd][Ee][Dd]\\ \\([Rr][Uu][Ll][Ee]\\:\\ [Ii][Mm][Aa][Gg][Ee][Ll][Oo][Aa][Dd]\\)/ OR /[Ll][Oo][Aa][Dd]/) AND (process.executable:(/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/) AND ((dll.path:(/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/)) OR (file.path:(/.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/)))) AND (NOT (winlog.event_data.Signed:true AND SignatureStatus:valid AND winlog.event_data.Signature:/[Nn][Ee][Xx][Tt][Rr][Oo][Nn]\\ [Ss][Yy][Ss][Tt][Ee][Mm][Ss]\\ [Gg][Mm][Bb][Hh]/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
