{"description": "Detects the image load of VSS DLL by uncommon executables", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "37774c23-25a1-4adb-bb6d-8bb9fd59c0f8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Volume Shadow Copy Vssapi.dll Load", "query": "(dll.path:*\\\\vssapi.dll AND (NOT ((((process.executable.text:(\"C:\\Windows\\explorer.exe\" OR \"C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exe\")) OR (process.executable.text:(\"C\\:\\\\Windows\\\\System32\\\\*\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\*\" OR \"C\\:\\\\Windows\\\\Temp\\\\\\{*\" OR \"C\\:\\\\Windows\\\\WinSxS\\\\*\")))) OR (process.executable.text:(\"C\\:\\\\Program\\ Files\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*\")) OR (process.executable.text:\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/ORCx41/DeleteShadowCopies"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
