{"description": "Detects potential DLL sideloading of \"SmadHook.dll\", a DLL used by SmadAV antivirus", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "24b6cf51-6122-469e-861a-22974e9c1e5b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential SmadHook.DLL Sideloading", "query": "(dll.path:(*\\\\SmadHook32c.dll OR *\\\\SmadHook64c.dll) AND (NOT (process.executable.text:(\"C:\\Program Files (x86)\\SMADAV\\SmadavProtect32.exe\" OR \"C:\\Program Files (x86)\\SMADAV\\SmadavProtect64.exe\" OR \"C:\\Program Files\\SMADAV\\SmadavProtect32.exe\" OR \"C:\\Program Files\\SMADAV\\SmadavProtect64.exe\") AND dll.path:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\SMADAV\\\\* OR C\\:\\\\Program\\ Files\\\\SMADAV\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1574", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://research.checkpoint.com/2023/malware-spotlight-camaro-dragons-tinynote-backdoor/", "https://www.qurium.org/alerts/targeted-malware-against-crph/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
