{"description": "Detects potential use of UIPromptForCredentials functions by looking for some of the DLLs needed for it.", "enabled": false, "false_positives": ["Other legitimate processes loading those DLLs in your environment."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "686a2cb6-2a91-6eaa-21d6-d112454f9822", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "UIPromptForCredentials DLLs", "query": "((dll.path:(*\\\\credui.dll OR *\\\\wincredui.dll) OR winlog.event_data.OriginalFileName:(\"credui.dll\" OR \"wincredui.dll\")) AND (NOT ((process.executable.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (process.executable.text:(*\\\\opera_autoupdate.exe OR *\\\\procexp64.exe OR *\\\\procexp.exe)) OR (process.executable.text:(\"C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe\" OR \"C\\:\\\\Windows\\\\explorer.exe\")) OR (process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:(*\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe OR *\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe)) OR (process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*) OR (process.executable.text:\"C\\:\\\\Windows\\\\regedit.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1056"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}], "version": 1, "references": ["https://securitydatasets.com/notebooks/small/windows/06_credential_access/SDWIN-201020013208.html", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password", "https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
