{"description": "Detects Microsoft Excel loading an Add-In (.xll) file from an uncommon location", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Some tuning might be required to allow or remove certain locations used by the rule if you consider them as safe locations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "af4c4609-5755-42fe-8075-4effb49f5d44", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Microsoft Excel Add-In Loaded From Uncommon Location", "query": "(process.executable.text:\"*\\\\excel.exe\" AND dll.path:(*\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Perflogs\\\\* OR *\\\\Temp\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Tasks\\\\*) AND dll.path:*.xll)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://www.mandiant.com/resources/blog/lnk-between-browsers", "https://wazuh.com/blog/detecting-xll-files-used-for-dropping-fin7-jssloader-with-wazuh/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
