{"description": "Detects potential use of UIPromptForCredentials functions by looking for some of the DLLs needed for it.", "enabled": false, "false_positives": ["other legitimate processes loading those DLLs in your environment."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9ae01559-cf7e-4f8e-8e14-4c290a1b4784", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "UIPromptForCredentials DLLs", "query": "((file.path:(*\\\\credui.dll OR *\\\\wincredui.dll) OR winlog.event_data.OriginalFileName:(\"credui.dll\" OR \"wincredui.dll\")) AND (NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\explorer.exe* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*\\\\Microsoft.SharePoint.exe* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\SystemSettings.exe* OR C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe* OR C\\:\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe*) OR process.executable:*\\\\opera_autoupdate.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1056"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}], "version": 1, "references": ["https://securitydatasets.com/notebooks/small/windows/06_credential_access/SDWIN-201020013208.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password", "https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
