{"description":"Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\\Windows\\System32\\wbem\\` directory over the network and loading it for a WMI DLL Hijack scenario. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"b21786cc-b989-5b21-edf6-1d764852e7de","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Wmiprvse Wbemcomn DLL Hijack","query":"(process.executable:*\\\\wmiprvse.exe AND file.path:*\\\\wbem\\\\wbemcomn.dll)","meta":{"from":"1m"},"severity":"critical","tags":["Lateral Movement","T1021","T1047"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"}]},{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
