{"description":"A General detection for processes loading System.Drawing.ni.dll. This could be an indicator of potential Screen Capture. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"953ab693-f7f9-b1f7-216a-53e977e0df36","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious System.Drawing Load","query":"(file.path:*\\\\System.Drawing.ni.dll AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\* OR C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\*)) OR (process.executable:(C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\NhNotifSys\\\\nahimic\\\\nahimicNotifSys.exe OR C\\:\\\\Users\\\\*\\\\GitHubDesktop\\\\Update.exe OR \"C\\:\\\\Windows\\\\System32\\\\NhNotifSys.exe\")))))","meta":{"from":"1m"},"severity":"low","tags":["T1113"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0009","reference":"https://attack.mitre.org/tactics/TA0009","name":"Collection"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1113","name":"Screen Capture","reference":"https://attack.mitre.org/techniques/T1113"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
