{"description":"Detects usage of Time Travel Debugging Utility. Adversaries can execute malicious processes and dump processes, such as lsass.exe, via tttracer.exe. Author: Ensar Şamil, @sblmsrsn, @oscd_initiative. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate usage by software developers/testers"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f82e0d6f-5d50-49c3-23d2-1d61579bddb0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Time Travel Debugging Utility Usage","query":"file.path:(*\\\\ttdrecord.dll OR *\\\\ttdwriter.dll OR *\\\\ttdloader.dll)","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","Defense Evasion","T1003","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]},{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
