{"description":"Detects threat actors proxy executing code and bypassing application controls by leveraging wmic and the `/FORMAT` argument switch to download and execute an XSL file (i.e js, vbs, etc). Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Apparently, wmic os get lastboottuptime loads vbscript.dll"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"52c4dfc5-b570-04d0-a572-662e478ce068","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"WMIC Loading Scripting Libraries","query":"(process.executable:*\\\\wmic.exe AND file.path:(*\\\\jscript.dll OR *\\\\vbscript.dll))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1220"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1220","name":"XSL Script Processing","reference":"https://attack.mitre.org/techniques/T1220"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
