{"description":"Loading unsigned image (DLL, EXE) into LSASS process Author: Teymur Kheirkhabarov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Valid user connecting using RDP"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4b1bfefd-f6b3-976c-4ff2-d5c28c6f8406","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Unsigned Image Loaded Into LSASS Process","query":"(process.executable:*\\\\lsass.exe AND Signed:\"false\")","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
