{"description":"Detects DLL image load activity as used by FoggyWeb backdoor loader Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a5abd162-9e23-ccd1-1e75-f92988824901","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"FoggyWeb Backdoor DLL Loading","query":"process.executable:\"C\\:\\\\Windows\\\\ADFS\\\\version.dll\"","meta":{"from":"1m"},"severity":"critical","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
