{"description":"Detect DLL Load from Spooler Service backup folder Author: FPT.EagleEye, Thomas Patzke (improvements). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Loading of legitimate driver"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d83919f4-18b7-4961-ec0a-56e61eb8095a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Windows Spooler Service Suspicious Binary Load","query":"(process.executable:*spoolsv.exe AND file.path:(*\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\* OR *\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\4\\\\*) AND file.path:*.dll)","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","Privilege Escalation","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
