{"description":"Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"fe6e002f-f244-4278-9263-20e4b593827f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Alternate PowerShell Hosts","query":"((winlog.event_data.Description:\"System.Management.Automation\" AND file.path:*System.Management.Automation*) AND (NOT (process.executable:(*\\\\powershell.exe OR *\\\\mscorsvw.exe) OR process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Program\\ Files\\\\Citrix\\\\ConfigSync\\\\*))))","meta":{"from":"1m"},"severity":"medium","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
