{"description": "Detects the addition of a new Federated Domain.", "author": ["Splunk Threat Research Team (original rule)", "Harjot Singh @cyb3rjy0t (sigma rule)"], "enabled": false, "false_positives": ["The creation of a new Federated domain is not necessarily malicious, however these events need to be followed closely, as it may indicate federated credential abuse or backdoor via federated identities at a similar or different cloud provider."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "58f88172-a73d-442b-94c9-95eaed3cbb36", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Federated Domain Added", "query": "(Operation:*domain* AND Operation:(*add* OR *new*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://research.splunk.com/cloud/e155876a-6048-11eb-ae93-0242ac130002/", "https://o365blog.com/post/aadbackdoor/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
