{"description":"Detects when a Microsoft Cloud App Security reported for users whose account were terminated in Azure AD, but still perform activities in other platforms such as AWS or Salesforce. This is especially relevant for users who use another account to manage resources, since these accounts are often not terminated when a user leaves the company. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"7a5ac7ab-4047-355f-b3b5-2640f70a66e7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Activity Performed by Terminated User","query":"(eventSource:\"SecurityComplianceCenter\" AND eventName:\"Activity\\ performed\\ by\\ terminated\\ user\" AND status:\"success\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
