{"description": "Detects when a Microsoft Cloud App Security reported when users were active from an IP address that has been identified as an anonymous proxy IP address.", "enabled": false, "false_positives": ["User using a VPN or Proxy"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "4b998acb-5023-4dc2-41bd-df512e2ad10c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Activity from Anonymous IP Addresses", "query": "(eventSource:\"SecurityComplianceCenter\" AND eventName:\"Activity\\ from\\ anonymous\\ IP\\ addresses\" AND status:\"success\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1573"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy", "https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
