{"description": "Detects when a Security Compliance Center reported a user who exceeded sending limits of the service policies and because of this has been restricted from sending email.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "65c0e353-e153-2316-5a06-9c6f7a94167c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Microsoft 365 - User Restricted from Sending Email", "query": "(eventSource:\"SecurityComplianceCenter\" AND eventName:\"User\\ restricted\\ from\\ sending\\ email\" AND status:\"success\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1199"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1199", "name": "Trusted Relationship", "reference": "https://attack.mitre.org/techniques/T1199"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy", "https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference"], "timestamp_override": "event.ingested", "author": ["austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
