{"description": "Detects disabling of Multi Factor Authencation.", "author": ["Splunk Threat Research Team (original rule)", "Harjot Singh @cyb3rjy0t (sigma rule)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "60de9b57-dc4d-48b9-a6a0-b39e0469f876", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disabling Multi Factor Authenication", "query": "Operation:/.*[Dd][Ii][Ss][Aa][Bb][Ll][Ee]\\ [Ss][Tt][Rr][Oo][Nn][Gg]\\ [Aa][Uu][Tt][Hh][Ee][Nn][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\..*/", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1556"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1556", "name": "Modify Authentication Process", "reference": "https://attack.mitre.org/techniques/T1556"}]}], "version": 1, "references": ["https://research.splunk.com/cloud/c783dd98-c703-4252-9e8a-f19d9f5c949e/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
