{"description":"Detects when a Microsoft Cloud App Security reported suspicious email forwarding rules, for example, if a user created an inbox rule that forwards a copy of all emails to an external address. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"af02962f-c363-3fb0-e82e-60ba5ac56ca6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious Inbox Forwarding","query":"(eventSource:\"SecurityComplianceCenter\" AND eventName:\"Suspicious\\ inbox\\ forwarding\" AND status:\"success\")","meta":{"from":"1m"},"severity":"low","tags":["T1020"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0010","reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1020","name":"Automated Exfiltration","reference":"https://attack.mitre.org/techniques/T1020"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
