{"description":"Detects when a Microsoft Cloud App Security reported users were active from an IP address identified as risky by Microsoft Threat Intelligence. These IP addresses are involved in malicious activities, such as Botnet C&C, and may indicate compromised account. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"78bd5776-c2cf-81e7-98ca-b106faec5881","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Activity from Suspicious IP Addresses","query":"(eventSource:\"SecurityComplianceCenter\" AND eventName:\"Activity\\ from\\ suspicious\\ IP\\ addresses\" AND status:\"success\")","meta":{"from":"1m"},"severity":"medium","tags":["T1573"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
