{"description": "Detects when a Microsoft Cloud App Security reported when an activity occurs from a location that wasn't recently or never visited by any user in the organization.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "2c0bbefe-f134-97d7-d832-94c11a87c71f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Activity from Infrequent Country", "query": "(eventSource:\"SecurityComplianceCenter\" AND eventName:\"Activity\\ from\\ infrequent\\ country\" AND status:\"success\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1573"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy", "https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
