{"description": "Detects deletion of local audit logs", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "acf61bd8-d814-4272-81f0-a7a269aa69aa", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Indicator Removal on Host - Clear Mac System Logs", "query": "(process.executable:*\\/rm AND (process.command_line:*\\/var\\/log* OR (process.command_line:*\\/Users\\/* AND process.command_line:*\\/Library\\/Logs\\/*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.002/T1070.002.md"], "timestamp_override": "event.ingested", "author": ["remotephone", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
