{"description": "Detects execution of AppleScript of the macOS scripting language AppleScript.", "enabled": false, "false_positives": ["Application installers might contain scripts as part of the installation process."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "0e34ed16-cbac-93e8-9242-1dbc30ebfd29", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "MacOS Scripting Interpreter AppleScript", "query": "(process.executable:*\\/osascript AND process.command_line:*\\-e*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.002/T1059.002.md"], "timestamp_override": "event.ingested", "author": ["Alejandro Ortuno", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
