{"description": "Detects the execution of suspicious child processes from macOS installer package parent process. This includes osascript, JXA, curl and wget amongst other interpreters", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Legitimate software uses the scripts (preinstall, postinstall)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e0cfaecd-602d-41af-988d-f6ccebb2af26", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Installer Package Child Process", "query": "(process.parent.executable.text:(\"*\\/package_script_service\" OR \"*\\/installer\") AND process.executable.text:(\"*\\/sh\" OR \"*\\/bash\" OR \"*\\/dash\" OR \"*\\/python\" OR \"*\\/ruby\" OR \"*\\/perl\" OR \"*\\/php\" OR \"*\\/javascript\" OR \"*\\/osascript\" OR \"*\\/tclsh\" OR \"*\\/curl\" OR \"*\\/wget\") AND process.command_line.text:(\"*preinstall*\" OR \"*postinstall*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059", "T1059", "T1071", "T1071"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://redcanary.com/blog/clipping-silver-sparrows-wings/", "https://github.com/elastic/detection-rules/blob/4312d8c9583be524578a14fe6295c3370b9a9307/rules/macos/execution_installer_package_spawned_network_event.toml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
