{"description": "Detects attempts to create and/or add an account to the admin group, thus granting admin privileges.", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "0c1ffcf9-efa9-436e-ab68-23a9496ebf5b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "User Added To Admin Group - MacOS", "query": "(((process.executable.text:\"*\\/sysadminctl\" AND process.command_line.text:\"*\\ \\-addUser\\ *\" AND process.command_line.text:\"*\\ \\-admin\\ *\")) OR ((process.executable.text:\"*\\/dscl\" AND process.command_line.text:\"*\\ \\-append\\ *\" AND process.command_line.text:\"*\\ \\/Groups\\/admin\\ *\" AND process.command_line.text:\"*\\ GroupMembership\\ *\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "Privilege Escalation", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1078.003/T1078.003.md#atomic-test-3---create-local-account-with-admin-privileges-using-sysadminctl-utility---macos", "https://ss64.com/osx/dscl.html", "https://ss64.com/osx/sysadminctl.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
