{"description": "Detects possible malicious execution of JXA in-memory via OSAScript", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "954f6047-70d4-d010-4fab-1343cce9a416", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "JXA In-memory Execution Via OSAScript", "query": "((process.command_line.text:*osascript* AND process.command_line.text:*\\ \\-e\\ * AND process.command_line.text:*eval* AND process.command_line.text:*NSData.dataWithContentsOfURL*) AND (((process.command_line.text:*\\ \\-l\\ * AND process.command_line.text:*JavaScript*)) OR (process.command_line.text:*.js*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://redcanary.com/blog/applescript/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
