{"description": "Detect file time attribute change to hide new or changes to existing files.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "f96776bb-5879-6386-4a46-dd50ec2d7f81", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File Time Attribute Change", "query": "(process.executable:*\\/touch AND process.command_line:(*\\-t* OR *\\-acmr* OR *\\-d* OR *\\-r*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.006/T1070.006.md"], "timestamp_override": "event.ingested", "author": ["Igor Fits", "Mikhail Larin", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
