{"description": "Detects usage of \"find\" binary in a suspicious manner to perform discovery", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "bf3144a3-8f5f-f7bb-bf27-f102a56cb51d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Discovery Activity Using Find - MacOS", "query": "(process.executable.text:*\\/find AND process.command_line.text:(*\\-perm\\ \\-4000* OR *\\-perm\\ \\-2000* OR *\\-perm\\ 0777* OR *\\-perm\\ \\-222* OR *\\-perm\\ \\-o\\ w* OR *\\-perm\\ \\-o\\ x* OR *\\-perm\\ \\-u\\=s* OR *\\-perm\\ \\-g\\=s*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1083"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1083", "name": "File and Directory Discovery", "reference": "https://attack.mitre.org/techniques/T1083"}]}], "version": 1, "references": ["https://github.com/SaiSathvik1/Linux-Privilege-Escalation-Notes"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
