{"description": "Detects macOS Gatekeeper bypass via xattr utility", "enabled": false, "false_positives": ["Legitimate activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "f5141b6d-9f42-41c6-a7bf-2a780678b29b", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Gatekeeper Bypass via Xattr", "query": "(process.executable:*\\/xattr AND process.command_line:*\\-r* AND process.command_line:*com.apple.quarantine*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1553"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1553", "name": "Subvert Trust Controls", "reference": "https://attack.mitre.org/techniques/T1553"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1553.001/T1553.001.md"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
