{"description": "Detects potential suspicious run-only executions compiled using OSACompile", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b9d9b652-d8ed-4697-89a2-a1186ee680ac", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "OSACompile Run-Only Execution", "query": "(process.command_line.text:*osacompile* AND process.command_line.text:*\\ \\-x\\ * AND process.command_line.text:*\\ \\-e\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://redcanary.com/blog/applescript/", "https://ss64.com/osx/osacompile.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
