{"description": "Detects attempts to use screencapture to collect macOS screenshots", "enabled": false, "false_positives": ["Legitimate user activity taking screenshots"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "45e45189-08e1-80c1-b182-77345af04125", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Screen Capture - macOS", "query": "process.executable:\"\\/usr\\/sbin\\/screencapture\"", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1113"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1113", "name": "Screen Capture", "reference": "https://attack.mitre.org/techniques/T1113"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1113/T1113.md", "https://github.com/BC-SECURITY/Empire/blob/master/lib/modules/python/collection/osx/screenshot.py"], "timestamp_override": "event.ingested", "author": ["remotephone", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
