{"description": "Detects potential in-memory downloading and compiling of applets using curl and osacompile as seen used by XCSSET malware", "author": ["Sohan G (D4rkCiph3r)", "Red Canary (idea)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "13db8d2e-7723-4c2c-93c1-a4d36994f7ef", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential In-Memory Download And Compile Of Payloads", "query": "(process.command_line.text:*osacompile* AND process.command_line.text:*curl*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059", "T1105"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://redcanary.com/blog/mac-application-bundles/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
