{"description": "Detects usage of system utilities (only grep for now) to discover security software discovery", "enabled": false, "false_positives": ["Legitimate activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5ac81c77-0f0e-1ec1-e713-a8808b0d3cee", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Security Software Discovery", "query": "(process.executable:\"\\/usr\\/bin\\/grep\" AND (process.command_line:(*nessusd* OR *santad* OR *CbDefense* OR *falcond* OR *td\\-agent* OR *packetbeat* OR *filebeat* OR *auditbeat* OR *osqueryd* OR *BlockBlock* OR *LuLu*) OR (process.command_line:*Little* AND process.command_line:*Snitch*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1518"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1518", "name": "Software Discovery", "reference": "https://attack.mitre.org/techniques/T1518"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1518.001/T1518.001.md"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
