{"description": "Detects attempts to create and/or add an account to the admin group, thus granting admin privileges.", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5d0fdb62-f225-42fb-8402-3dfe64da468a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "User Added To Admin Group Via DseditGroup", "query": "(process.executable:/.*\\/[Dd][Ss][Ee][Dd][Ii][Tt][Gg][Rr][Oo][Uu][Pp]/ AND process.command_line:/.*\\ \\-[Oo]\\ [Ee][Dd][Ii][Tt]\\ .*/ AND process.command_line:/.*\\ \\-[Aa]\\ .*/ AND process.command_line:/.*\\ \\-[Tt]\\ [Uu][Ss][Ee][Rr].*/ AND process.command_line.text:*admin*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "Privilege Escalation", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1078.003/T1078.003.md#atomic-test-5---add-a-newexisting-user-to-the-admin-group-using-dseditgroup-utility---macos", "https://ss64.com/osx/dseditgroup.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
