{"description": "Detects suspicious child processes spawning from microsoft office suite applications such as word or excel. This could indicates malicious macro execution", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "69483748-1525-4a6c-95ca-90dc8d431b68", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Microsoft Office Child Process - MacOS", "query": "(process.parent.executable.text:(\"*Microsoft\\ Word*\" OR \"*Microsoft\\ Excel*\" OR \"*Microsoft\\ PowerPoint*\" OR \"*Microsoft\\ OneNote*\") AND process.executable.text:(\"*\\/bash\" OR \"*\\/curl\" OR \"*\\/dash\" OR \"*\\/fish\" OR \"*\\/osacompile\" OR \"*\\/osascript\" OR \"*\\/sh\" OR \"*\\/zsh\" OR \"*\\/python\" OR \"*\\/python3\" OR \"*\\/wget\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1137", "T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://redcanary.com/blog/applescript/", "https://objective-see.org/blog/blog_0x4B.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
