{"description": "Detects passwords dumps from Keychain", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "9c4e40c4-afbc-7c56-b6b2-812da243b686", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Credentials from Password Stores - Keychain", "query": "((process.executable:\"\\/usr\\/bin\\/security\" AND process.command_line:(*find\\-certificate* OR *\\ export\\ *)) OR process.command_line:(*\\ dump\\-keychain\\ * OR *\\ login\\-keychain\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.001/T1555.001.md", "https://gist.github.com/Capybara/6228955"], "timestamp_override": "event.ingested", "author": ["Tim Ismilyaev", "oscd.community", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
