{"description": "Detects enumeration of local network configuration", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "58800443-f9fc-4d55-ae0c-98a3966dfb97", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "System Network Discovery - macOS", "query": "(process.executable:(\"\\/usr\\/sbin\\/netstat\" OR \"\\/sbin\\/ifconfig\" OR \"\\/usr\\/sbin\\/ipconfig\" OR \"\\/usr\\/libexec\\/ApplicationFirewall\\/socketfilterfw\" OR \"\\/usr\\/sbin\\/networksetup\" OR \"\\/usr\\/sbin\\/arp\") OR (process.executable:\"\\/usr\\/bin\\/defaults\" AND process.command_line:*read* AND process.command_line:*\\/Library\\/Preferences\\/com.apple.alf*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1016"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1016", "name": "System Network Configuration Discovery", "reference": "https://attack.mitre.org/techniques/T1016"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md"], "timestamp_override": "event.ingested", "author": ["remotephone", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
