{"description": "Detects execution of the \"jamf\" binary to create user accounts and run commands. For example, the binary can be abused by attackers on the system in order to bypass security controls or remove application control polices.\n", "author": ["Jay Pandit"], "enabled": false, "false_positives": ["Legitimate use of the JAMF CLI tool by IT support and administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "be2e3a5c-9cc7-4d02-842a-68e9cb26ec49", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "JAMF MDM Execution", "query": "(process.executable:/.*\\/[Jj][Aa][Mm][Ff]/ AND process.command_line.text:(*createAccount* OR *manage* OR *removeFramework* OR *removeMdmProfile* OR *resetPassword* OR *setComputerName*))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/MythicAgents/typhon/", "https://www.zoocoup.org/casper/jamf_cheatsheet.pdf", "https://docs.jamf.com/10.30.0/jamf-pro/administrator-guide/Components_Installed_on_Managed_Computers.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
