{"description": "Detects potential suspicious child processes of \"jamf\". Could be a sign of potential abuse of Jamf as a C2 server as seen by Typhon MythicAgent.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate execution of custom scripts or commands by Jamf administrators. Apply additional filters accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "2316929c-01aa-438c-970f-099145ab1ee6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "JAMF MDM Potential Suspicious Child Process", "query": "(process.parent.executable:/.*\\/[Jj][Aa][Mm][Ff]/ AND process.executable:(/.*\\/[Bb][Aa][Ss][Hh]/ OR /.*\\/[Ss][Hh]/))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/MythicAgents/typhon/", "https://www.zoocoup.org/casper/jamf_cheatsheet.pdf", "https://docs.jamf.com/10.30.0/jamf-pro/administrator-guide/Components_Installed_on_Managed_Computers.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
