{"description": "Detects suspicious child processes spawned from browsers. This could be a result of a potential web browser exploitation.", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Legitimate browser install, update and recovery scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "0250638a-2b28-4541-86fc-ea4c558fa0c6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Browser Child Process - MacOS", "query": "(((process.parent.executable.text:(\"*com.apple.WebKit.WebContent*\" OR \"*firefox*\" OR \"*Google\\ Chrome\\ Helper*\" OR \"*Google\\ Chrome*\" OR \"*Microsoft\\ Edge*\" OR \"*Opera*\" OR \"*Safari*\" OR \"*Tor\\ Browser*\") AND process.executable.text:(\"*\\/bash\" OR \"*\\/curl\" OR \"*\\/dash\" OR \"*\\/ksh\" OR \"*\\/osascript\" OR \"*\\/perl\" OR \"*\\/php\" OR \"*\\/pwsh\" OR \"*\\/python\" OR \"*\\/sh\" OR \"*\\/tcsh\" OR \"*\\/wget\" OR \"*\\/zsh\")) AND (NOT ((process.command_line.text:\"*\\-\\-defaults\\-torrc*\") OR (process.command_line.text:\"*\\/Library\\/Application\\ Support\\/Microsoft\\/MAU\\*\\/Microsoft\\ AutoUpdate.app\\/Contents\\/MacOS\\/msupdate*\") OR ((process.parent.executable.text:(\"*Google\\ Chrome\\ Helper*\" OR \"*Google\\ Chrome*\") AND process.command_line.text:(\"*\\/Volumes\\/Google\\ Chrome\\/Google\\ Chrome.app\\/Contents\\/Frameworks\\/\\*\\/Resources\\/install.sh*\" OR \"*\\/Applications\\/Google\\ Chrome.app\\/Contents\\/Frameworks\\/Google\\ Chrome\\ Framework.framework\\/\\*\\/Resources\\/keystone_promote_preflight.sh*\" OR \"*\\/Applications\\/Google\\ Chrome.app\\/Contents\\/Frameworks\\/Google\\ Chrome\\ Framework.framework\\/\\*\\/Resources\\/keystone_promote_postflight.sh*\"))) OR ((process.parent.executable.text:\"*Microsoft\\ Edge*\" AND process.command_line.text:(\"*IOPlatformExpertDevice*\" OR \"*hw.model*\"))) OR ((process.parent.executable.text:(\"*Google\\ Chrome\\ Helper*\" OR \"*Google\\ Chrome*\") AND process.command_line.text:\"*\\/Users\\/*\" AND process.command_line.text:\"*\\/Library\\/Application\\ Support\\/Google\\/Chrome\\/recovery\\/*\" AND process.command_line.text:\"*\\/ChromeRecovery*\"))))) AND (NOT ((NOT _exists_:process.command_line.text) OR (process.command_line.text:\"\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1059", "T1189", "T1203"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1189", "name": "Drive-by Compromise", "reference": "https://attack.mitre.org/techniques/T1189"}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}], "version": 1, "references": ["https://fr.slideshare.net/codeblue_jp/cb19-recent-apt-attack-on-crypto-exchange-employees-by-heungsoo-kang", "https://github.com/elastic/detection-rules/blob/4312d8c9583be524578a14fe6295c3370b9a9307/rules/macos/execution_initial_access_suspicious_browser_childproc.toml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
