{"description": "Detects potential persistence activity using LaunchAgents or LaunchDaemons via the PlistBuddy utility", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "65d506d3-fcfe-4071-b4b2-bcefe721bbbb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via PlistBuddy", "query": "(process.executable.text:\"*\\/PlistBuddy\" AND process.command_line.text:\"*RunAtLoad*\" AND process.command_line.text:\"*true*\" AND process.command_line.text:(\"*LaunchAgents*\" OR \"*LaunchDaemons*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1543", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}, {"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://redcanary.com/blog/clipping-silver-sparrows-wings/", "https://www.manpagez.com/man/8/PlistBuddy/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
