{"description": "Detects possible collection of data from the clipboard via execution of the osascript binary", "author": ["Sohan G (D4rkCiph3r)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "718c42e4-c5ba-dda7-c89d-823a8ea52af4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Clipboard Data Collection Via OSAScript", "query": "(process.command_line.text:*osascript* AND process.command_line.text:*\\ \\-e\\ * AND process.command_line.text:*clipboard*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1115"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1115", "name": "Clipboard Data", "reference": "https://attack.mitre.org/techniques/T1115"}]}], "version": 1, "references": ["https://www.sentinelone.com/blog/how-offensive-actors-use-applescript-for-attacking-macos/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
