{"description": "A General detection for the Get-Clipboard commands in PowerShell logs. This could be an adversary capturing clipboard contents.", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "91fe9a49-cebd-b515-1598-7b6b5d7fd09b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Get Clipboard", "query": "((powershell.command.invocation_details:*Get\\-Clipboard*) OR (winlog.event_data.Payload:*Get\\-Clipboard*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1115"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1115", "name": "Clipboard Data", "reference": "https://attack.mitre.org/techniques/T1115"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/16", "https://threathunterplaybook.com/evals/apt29/detections/7.A.2_F4609F7E-C4DB-4327-91D4-59A58C962A02.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
