{"description": "A General detection for specific decompress commands in PowerShell logs. This could be an adversary decompressing files.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1ddc1472-8e52-4f7d-9f11-eab14fc171f5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Decompress Commands", "query": "(powershell.command.invocation_details:*Expand\\-Archive* OR winlog.event_data.Payload:*Expand\\-Archive*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/8", "https://threathunterplaybook.com/evals/apt29/detections/4.A.3_09F29912-8E93-461E-9E89-3F06F6763383.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
