{"description": "Detects Obfuscated Powershell via use MSHTA in Scripts", "author": ["Nikita Nazarov", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7bc1e568-18a8-98fb-7d0e-e2b5074f8dd5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Invoke-Obfuscation Via Use MSHTA - PowerShell Module", "query": "(((powershell.command.invocation_details:*set*) OR (winlog.event_data.Payload:*set*)) AND ((powershell.command.invocation_details:*\\&&*) OR (winlog.event_data.Payload:*\\&&*)) AND ((powershell.command.invocation_details:*mshta*) OR (winlog.event_data.Payload:*mshta*)) AND ((powershell.command.invocation_details:*vbscript\\:createobject*) OR (winlog.event_data.Payload:*vbscript\\:createobject*)) AND ((powershell.command.invocation_details:*.run*) OR (winlog.event_data.Payload:*.run*)) AND ((powershell.command.invocation_details:*\\(window.close\\)*) OR (winlog.event_data.Payload:*\\(window.close\\)*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/SigmaHQ/sigma/issues/1009"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
