{"description": "Detects usage of the \"Import-Module\" cmdlet to load the \"Microsoft.ActiveDirectory.Management.dl\" DLL. Which is often used by attackers to perform AD enumeration.", "author": ["Nasreddine Bencherchali", "frack113"], "enabled": false, "false_positives": ["Legitimate use of the library for administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bb6205b2-a835-8a03-77a1-562acfcb0b0f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Active Directory Enumeration Using AD Module - PsModule", "query": "(((powershell.command.invocation_details:(*Import\\-Module\\ * OR *ipmo\\ *)) OR (winlog.event_data.Payload:(*Import\\-Module\\ * OR *ipmo\\ *))) AND ((powershell.command.invocation_details:*Microsoft.ActiveDirectory.Management.dll*) OR (winlog.event_data.Payload:*Microsoft.ActiveDirectory.Management.dll*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/samratashok/ADModule", "https://twitter.com/cyb3rops/status/1617108657166061568?s=20", "https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/active-directory-enumeration-with-ad-module-without-rsat-or-admin-privileges"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
