{"description": "Detects all variations of obfuscated powershell IEX invocation code generated by Invoke-Obfuscation framework from the code block cited in the reference section below", "author": ["Daniel Bohannon (@Mandiant/@FireEye)", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a04164e3-9fe0-2511-bd8b-9cb244e79036", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Invoke-Obfuscation Obfuscated IEX Invocation - PowerShell Module", "query": "(((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/P/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/H/ OR powershell.command.invocation_details:/o/ OR powershell.command.invocation_details:/m/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/{/ OR powershell.command.invocation_details:/1/ OR powershell.command.invocation_details:/,/ OR powershell.command.invocation_details:/3/ OR powershell.command.invocation_details:/}/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/]/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/+/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/P/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/H/ OR powershell.command.invocation_details:/o/ OR powershell.command.invocation_details:/m/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/P/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/H/ OR winlog.event_data.Payload:/o/ OR winlog.event_data.Payload:/m/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/{/ OR winlog.event_data.Payload:/1/ OR winlog.event_data.Payload:/,/ OR winlog.event_data.Payload:/3/ OR winlog.event_data.Payload:/}/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/]/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/+/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/P/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/H/ OR winlog.event_data.Payload:/o/ OR winlog.event_data.Payload:/m/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/)) OR ((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/h/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/l/ OR powershell.command.invocation_details:/l/ OR powershell.command.invocation_details:/I/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/{/ OR powershell.command.invocation_details:/1/ OR powershell.command.invocation_details:/,/ OR powershell.command.invocation_details:/3/ OR powershell.command.invocation_details:/}/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/]/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/+/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/h/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/l/ OR powershell.command.invocation_details:/l/ OR powershell.command.invocation_details:/I/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/h/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/l/ OR winlog.event_data.Payload:/l/ OR winlog.event_data.Payload:/I/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/{/ OR winlog.event_data.Payload:/1/ OR winlog.event_data.Payload:/,/ OR winlog.event_data.Payload:/3/ OR winlog.event_data.Payload:/}/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/]/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/+/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/h/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/l/ OR winlog.event_data.Payload:/l/ OR winlog.event_data.Payload:/I/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/)) OR ((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/v/ OR powershell.command.invocation_details:/:/ OR powershell.command.invocation_details:/P/ OR powershell.command.invocation_details:/u/ OR powershell.command.invocation_details:/b/ OR powershell.command.invocation_details:/l/ OR powershell.command.invocation_details:/i/ OR powershell.command.invocation_details:/c/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/{/ OR powershell.command.invocation_details:/1/ OR powershell.command.invocation_details:/,/ OR powershell.command.invocation_details:/3/ OR powershell.command.invocation_details:/}/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/]/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/+/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/v/ OR powershell.command.invocation_details:/:/ OR powershell.command.invocation_details:/P/ OR powershell.command.invocation_details:/u/ OR powershell.command.invocation_details:/b/ OR powershell.command.invocation_details:/l/ OR powershell.command.invocation_details:/i/ OR powershell.command.invocation_details:/c/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/v/ OR winlog.event_data.Payload:/:/ OR winlog.event_data.Payload:/P/ OR winlog.event_data.Payload:/u/ OR winlog.event_data.Payload:/b/ OR winlog.event_data.Payload:/l/ OR winlog.event_data.Payload:/i/ OR winlog.event_data.Payload:/c/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/{/ OR winlog.event_data.Payload:/1/ OR winlog.event_data.Payload:/,/ OR winlog.event_data.Payload:/3/ OR winlog.event_data.Payload:/}/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/]/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/+/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/v/ OR winlog.event_data.Payload:/:/ OR winlog.event_data.Payload:/P/ OR winlog.event_data.Payload:/u/ OR winlog.event_data.Payload:/b/ OR winlog.event_data.Payload:/l/ OR winlog.event_data.Payload:/i/ OR winlog.event_data.Payload:/c/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/)) OR ((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/v/ OR powershell.command.invocation_details:/:/ OR powershell.command.invocation_details:/C/ OR powershell.command.invocation_details:/o/ OR powershell.command.invocation_details:/m/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/p/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/c/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/ OR powershell.command.invocation_details:/(/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/{/ OR powershell.command.invocation_details:/1/ OR powershell.command.invocation_details:/,/ OR powershell.command.invocation_details:/3/ OR powershell.command.invocation_details:/}/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/,/ OR powershell.command.invocation_details:/)/ OR powershell.command.invocation_details:/{/ OR powershell.command.invocation_details:/2/ OR powershell.command.invocation_details:/}/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/v/ OR winlog.event_data.Payload:/:/ OR winlog.event_data.Payload:/C/ OR winlog.event_data.Payload:/o/ OR winlog.event_data.Payload:/m/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/p/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/c/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/ OR winlog.event_data.Payload:/(/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/{/ OR winlog.event_data.Payload:/1/ OR winlog.event_data.Payload:/,/ OR winlog.event_data.Payload:/3/ OR winlog.event_data.Payload:/}/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/,/ OR winlog.event_data.Payload:/)/ OR winlog.event_data.Payload:/{/ OR winlog.event_data.Payload:/2/ OR winlog.event_data.Payload:/}/)) OR ((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/m/ OR powershell.command.invocation_details:/d/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/W/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/)/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/./ OR powershell.command.invocation_details:/N/ OR powershell.command.invocation_details:/a/ OR powershell.command.invocation_details:/m/ OR powershell.command.invocation_details:/e/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/m/ OR winlog.event_data.Payload:/d/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/W/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/)/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/./ OR winlog.event_data.Payload:/N/ OR winlog.event_data.Payload:/a/ OR winlog.event_data.Payload:/m/ OR winlog.event_data.Payload:/e/)) OR ((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/V/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/b/ OR powershell.command.invocation_details:/o/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/P/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/f/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/c/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/./ OR powershell.command.invocation_details:/T/ OR powershell.command.invocation_details:/o/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/t/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/i/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/g/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/(/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/V/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/b/ OR winlog.event_data.Payload:/o/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/P/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/f/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/c/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/./ OR winlog.event_data.Payload:/T/ OR winlog.event_data.Payload:/o/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/t/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/i/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/g/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/(/)) OR ((powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/[/ OR powershell.command.invocation_details:/S/ OR powershell.command.invocation_details:/t/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/i/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/g/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/]/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/*/ OR powershell.command.invocation_details:/\\/ OR powershell.command.invocation_details:/$/ OR powershell.command.invocation_details:/V/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/b/ OR powershell.command.invocation_details:/o/ OR powershell.command.invocation_details:/s/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/P/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/f/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/r/ OR powershell.command.invocation_details:/e/ OR powershell.command.invocation_details:/n/ OR powershell.command.invocation_details:/c/ OR powershell.command.invocation_details:/e/)) OR ((winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/[/ OR winlog.event_data.Payload:/S/ OR winlog.event_data.Payload:/t/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/i/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/g/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/]/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/*/ OR winlog.event_data.Payload:/\\/ OR winlog.event_data.Payload:/$/ OR winlog.event_data.Payload:/V/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/b/ OR winlog.event_data.Payload:/o/ OR winlog.event_data.Payload:/s/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/P/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/f/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/r/ OR winlog.event_data.Payload:/e/ OR winlog.event_data.Payload:/n/ OR winlog.event_data.Payload:/c/ OR winlog.event_data.Payload:/e/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
