{"description":"Detects suspicious PowerShell invocation command parameters Author: Florian Roth (rule), Jonhnathan Ribeiro. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Penetration tests"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4952abd3-9818-24f7-c18f-3534c6d6ad46","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious PowerShell Invocations - Specific","query":"(((ContextInfo:*\\-nop* AND ContextInfo:*\\ \\-w\\ * AND ContextInfo:*hidden* AND ContextInfo:*\\ \\-c\\ * AND ContextInfo:*\\[Convert\\]\\:\\:FromBase64String*) OR (ContextInfo:*\\ \\-w\\ * AND ContextInfo:*hidden* AND ContextInfo:*\\-noni* AND ContextInfo:*\\-nop* AND ContextInfo:*\\ \\-c\\ * AND ContextInfo:*iex* AND ContextInfo:*New\\-Object*) OR (ContextInfo:*\\ \\-w\\ * AND ContextInfo:*hidden* AND ContextInfo:*\\-ep* AND ContextInfo:*bypass* AND ContextInfo:*\\-Enc*) OR (ContextInfo:*powershell* AND ContextInfo:*reg* AND ContextInfo:*add* AND ContextInfo:*HKCU\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run*) OR (ContextInfo:*bypass* AND ContextInfo:*\\-noprofile* AND ContextInfo:*\\-windowstyle* AND ContextInfo:*hidden* AND ContextInfo:*new\\-object* AND ContextInfo:*system.net.webclient* AND ContextInfo:*.download*) OR (ContextInfo:*iex* AND ContextInfo:*New\\-Object* AND ContextInfo:*Net.WebClient* AND ContextInfo:*.Download*)) AND (NOT ((ContextInfo:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1* OR *Write\\-ChocolateyWarning*)))))","meta":{"from":"1m"},"severity":"high","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
