{"description": "Detects remote PowerShell sessions", "author": ["Roberto Rodriguez @Cyb3rWard0g", "Tim Shelton"], "enabled": false, "false_positives": ["Legitimate use remote PowerShell sessions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "085302f4-1edf-09b3-5c53-696b780ed50d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote PowerShell Session (PS Module)", "query": "((ContextInfo:*\\ \\=\\ ServerRemoteHost\\ * AND ContextInfo:*wsmprovhost.exe*) AND (NOT ContextInfo:*\\\\Windows\\\\system32\\\\WindowsPowerShell\\\\v1.0\\\\Modules\\\\Microsoft.PowerShell.Archive\\\\Microsoft.PowerShell.Archive.psm1*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
