{"description":"Adversaries may attempt to find domain-level groups and permission settings.\nThe knowledge of domain-level permission groups can help adversaries determine which groups exist and which users belong to a particular group.\nAdversaries may use this information to determine which users have elevated permissions, such as domain administrators. \n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["administrator script"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"614b9bfc-229f-77b3-af91-21cec21d8ef9","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious Get Information for AD Groups or DoesNotRequirePreAuth User","query":"((winlog.event_data.Payload:*get\\-ADPrincipalGroupMembership* OR powershell.command.invocation_details:*get\\-ADPrincipalGroupMembership*) OR ContextInfo:*get\\-ADPrincipalGroupMembership* OR ((winlog.event_data.Payload:*get\\-aduser* OR powershell.command.invocation_details:*get\\-aduser*) AND (winlog.event_data.Payload:*\\-f\\ * OR powershell.command.invocation_details:*\\-f\\ *) AND (winlog.event_data.Payload:*\\-pr\\ * OR powershell.command.invocation_details:*\\-pr\\ *) AND (winlog.event_data.Payload:*DoesNotRequirePreAuth* OR powershell.command.invocation_details:*DoesNotRequirePreAuth*)) OR (ContextInfo:*get\\-aduser* AND ContextInfo:*\\-f\\ * AND ContextInfo:*\\-pr\\ * AND ContextInfo:*DoesNotRequirePreAuth*))","meta":{"from":"1m"},"severity":"low","tags":["T1069"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
