{"description": "Detects suspicious PowerShell download command", "author": ["Florian Roth"], "enabled": false, "false_positives": ["PowerShell scripts that download content from the Internet"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7eac21b5-bac2-5ec7-4ff7-ee5c2e6eea91", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious PowerShell Download - PoshModule", "query": "(ContextInfo:*System.Net.WebClient* AND ContextInfo:(*.DownloadFile\\(* OR *.DownloadString\\(*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
