{"description": "Detects LSASS process access by LaZagne for credential dumping.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4b9a8556-99c4-470b-a40c-9c8d02c77ed0", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Credential Dumping by LaZagne", "query": "(winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.CallTrace:*C\\:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll\\+* AND winlog.event_data.CallTrace:*|C\\:\\\\Windows\\\\System32\\\\KERNELBASE.dll\\+* AND winlog.event_data.CallTrace:*_ctypes.pyd\\+* AND winlog.event_data.CallTrace:*python27.dll\\+* AND winlog.event_data.GrantedAccess:\"0x1FFFFF\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/bh4b3sh/status/1303674603819081728"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj", "Jonhnathan Ribeiro"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
