{"description": "Detects PowerShell processes requesting access to \"lsass.exe\"", "author": ["oscd.community", "Natalia Shornikova"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0f920ebe-7aea-4c54-b202-9aa0c609cfe5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Credential Dumping Attempt Via PowerShell", "query": "(process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND winlog.event_data.TargetImage:*\\\\lsass.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
