{"description": "Detects process access to LSASS memory with suspicious access flags and from a suspicious folder", "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7afd24e2-2d8b-aa0f-0c29-72273ce19e0d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "LSASS Access from Program in Suspicious Folder", "query": "((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2 OR *FF) AND process.executable.text:(*\\\\Temp\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\AppData\\\\* OR *\\\\Temporary*)) AND (NOT ((process.executable.text:*C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\* AND process.executable.text:(*\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR *\\\\software_reporter_tool.exe OR *\\\\DropboxUpdate.exe OR *\\\\MBAMInstallerService.exe OR *\\\\WebexMTA.exe OR *\\\\WebEx\\\\WebexHost.exe OR *\\\\JetBrains\\\\Toolbox\\\\bin\\\\jetbrains\\-toolbox.exe) AND winlog.event_data.GrantedAccess:\"0x410\") OR (process.executable.text:C\\:\\\\Windows\\\\Temp\\\\* AND process.executable.text:*.tmp\\\\DropboxUpdate.exe AND winlog.event_data.GrantedAccess:\"0x410\") OR (process.executable.text:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable.text:(*\\\\thor64.exe OR *\\\\thor.exe) AND winlog.event_data.GrantedAccess:(\"0x1fffff\" OR \"0x1010\")) OR (process.executable.text:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable.text:*\\\\vs_bootstrapper_* AND winlog.event_data.GrantedAccess:\"0x1410\") OR (process.executable.text:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Google\\\\Temp\\\\* AND process.executable.text:*.tmp\\\\GoogleUpdate.exe AND winlog.event_data.GrantedAccess:\"0x410\") OR (process.executable.text:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Common\\ Files\\\\Adobe\\\\ARM\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Adobe\\\\ARM\\\\*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights", "https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow", "https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
