{"description": "Detects shellcode injection by Metasploit's migrate and Empire's psinject", "enabled": false, "false_positives": ["Empire's csharp_exe payload uses 0x1f3fff for process enumeration as well"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9f123141-d44a-ec9c-0c1a-d555a66f7b17", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Shellcode Injection", "query": "(winlog.event_data.GrantedAccess:(\"0x147a\" OR \"0x1f3fff\") AND winlog.event_data.CallTrace:*UNKNOWN*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
