{"description": "Detects the process injection of a LittleCorporal generated Maldoc.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7bdde3bf-2a42-4c39-aa31-a92b3e17afac", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "LittleCorporal Generated Maldoc Injection", "query": "(process.executable:*\\\\winword.exe AND winlog.event_data.CallTrace:*\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.* AND winlog.event_data.CallTrace:*UNKNOWN*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1055", "T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://github.com/connormcgarr/LittleCorporal"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
