{"description": "Detects potential NT API stub patching as seen used by the project PatchingAPI", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b916cba1-b38a-42da-9223-17114d846fd6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential NT API Stub Patching", "query": "((winlog.event_data.GrantedAccess:\"0x1FFFFF\" AND winlog.event_data.CallTrace:C\\:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll\\+* AND winlog.event_data.CallTrace:*|UNKNOWN\\(* AND winlog.event_data.CallTrace:*\\)) AND (NOT (((process.executable.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*) AND winlog.event_data.TargetImage:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))) OR ((process.executable.text:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable.text:*\\\\thor64.exe)) OR ((process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\app\\-* AND process.executable.text:(*\\\\GitHubDesktop.exe OR *\\\\resources\\\\app\\\\git\\\\usr\\\\bin\\\\sh.exe) AND winlog.event_data.TargetImage:C\\:\\\\Users\\\\* AND winlog.event_data.TargetImage:*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\app\\-*)) OR ((process.executable.text:(C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\v* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v*) AND process.executable.text:*\\\\NGenTask.exe AND winlog.event_data.TargetImage:(C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\v* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v*))) OR ((process.executable.text:(\"C:\\WINDOWS\\system32\\taskhostw.exe\" OR \"C:\\Windows\\system32\\taskhost.exe\") AND winlog.event_data.TargetImage:(C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\v* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v*) AND winlog.event_data.TargetImage:*\\\\NGenTask.exe)) OR ((process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\stage\\\\Teams.exe AND winlog.event_data.TargetImage:C\\:\\\\Users\\\\* AND winlog.event_data.TargetImage:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe)) OR ((process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe AND winlog.event_data.TargetImage:\"C:\\WINDOWS\\SysWOW64\\regsvr32.exe\")) OR ((process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe AND winlog.event_data.TargetImage:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\stage\\\\Teams.exe)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/D1rkMtr/UnhookingPatch", "https://twitter.com/D1rkMtr/status/1611471891193298944?s=20"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
