{"description": "Detects the usage of the direct syscall of NtOpenProcess which might be done from a CobaltStrike BOF.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f3f3506-1895-401b-9cc3-e86b16e630d0", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Direct Syscall of NtOpenProcess", "query": "(winlog.event_data.CallTrace:UNKNOWN* AND (NOT ((winlog.event_data.TargetImage:\"C\\:\\\\Program\\ Files\\\\Cylance\\\\Desktop\\\\CylanceUI.exe\" AND process.executable:\"C\\:\\\\Windows\\\\Explorer.EXE\"))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6"], "timestamp_override": "event.ingested", "author": ["Christian Burkard", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
