{"description": "Detects potential shellcode injection used by tools such as Metasploit's migrate and Empire's psinject", "author": ["Bhabesh Raj"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "250ae82f-736e-4844-a68b-0b5e8cc887da", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Shellcode Injection", "query": "((winlog.event_data.GrantedAccess:(0x147a OR 0x1f3fff) AND winlog.event_data.CallTrace:*UNKNOWN*) AND (NOT (((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Dd][Ee][Ll][Ll]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Dd][Ee][Ll][Ll]\\\\.*/) AND winlog.event_data.TargetImage:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Dd][Ee][Ll][Ll]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Dd][Ee][Ll][Ll]\\\\.*/) AND winlog.event_data.GrantedAccess:0x1F3FFF AND winlog.event_data.CallTrace:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/)) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Dd][Ee][Ll][Ll]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:0x1F3FFF AND winlog.event_data.CallTrace:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/)) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\2022\\\\[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]7\\\\[Ii][Dd][Ee]\\\\[Pp][Ee][Rr][Ff][Ww][Aa][Tt][Ss][Oo][Nn]2\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\2019\\\\[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]7\\\\[Ii][Dd][Ee]\\\\[Pp][Ee][Rr][Ff][Ww][Aa][Tt][Ss][Oo][Nn]2\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetImage:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\2022\\\\[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]7\\\\[Ii][Dd][Ee]\\\\[Dd][Ee][Vv][Ee][Nn][Vv]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\2019\\\\[Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]7\\\\[Ii][Dd][Ee]\\\\[Dd][Ee][Vv][Ee][Nn][Vv]\\.[Ee][Xx][Ee]/) AND winlog.event_data.CallTrace:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/)) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\[Bb][Ii][Nn]\\\\[Mm][Ss][Bb][Uu][Ii][Ll][Dd]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Dd][Ee][Ll][Ll]\\\\[Dd][Ee][Ll][Ll][Dd][Aa][Tt][Aa][Vv][Aa][Uu][Ll][Tt]\\\\[Dd][Dd][Vv][Dd][Aa][Tt][Aa][Cc][Oo][Ll][Ll][Ee][Cc][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Bb][Ee][Mm]\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.CallTrace:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ll][Ll]\\.[Dd][Ll][Ll].*/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
