{"description": "Detects the use of SysmonEnte, a tool to attack the integrity of Sysmon", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e2e127d9-ae0c-dbae-b82c-7398d46b606d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SysmonEnte Usage", "query": "(((winlog.event_data.TargetImage:\"C\\:\\\\Windows\\\\Sysmon64.exe\" AND winlog.event_data.GrantedAccess:\"0x1400\") AND (NOT ((process.executable.text:(C\\:\\\\Program\\ Files* OR C\\:\\\\Windows\\\\System32\\\\*)) OR (process.executable.text:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND process.executable.text:*\\\\MsMpEng.exe)))) OR winlog.event_data.CallTrace:\"Ente\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://codewhitesec.blogspot.com/2022/09/attacks-on-sysmon-revisited-sysmonente.html", "https://github.com/codewhitesec/SysmonEnte/", "https://github.com/codewhitesec/SysmonEnte/blob/main/screens/1.png"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
