{"description": "Detects process access to LSASS memory with suspicious access flags 0x410 and 0x01410 (spin-off of similar rule)", "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "678dfc63-fefb-47a5-a04c-26bcf8cc9f65", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rare GrantedAccess Flags on LSASS Access", "query": "((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:*10) AND (NOT ((process.executable.text:(\"C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe\" OR \"C\\:\\\\Program\\ Files\\\\Malwarebytes\\\\Anti\\-Malware\\\\MBAMService.exe\" OR \"C\\:\\\\PROGRAMDATA\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe\" OR \"C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\lsass.exe\" OR \"C\\:\\\\WINDOWS\\\\System32\\\\perfmon.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\wmiprvse.exe\" OR \"C\\:\\\\Windows\\\\sysWOW64\\\\wbem\\\\wmiprvse.exe\" OR \"C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\McAfee\\\\MMSSHost\\\\MMSSHOST.exe\")) OR (process.executable.text:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable.text:*\\\\MsMpEng.exe) OR (process.executable.text:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND process.executable.text:*\\\\GamingServices.exe) OR (process.executable.text:(*\\\\PROCEXP64.EXE OR *\\\\PROCEXP.EXE)) OR (process.executable.text:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable.text:*\\\\vmtoolsd.exe) OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND process.executable.text:*Antivirus*) OR (process.executable.text:(*\\\\thor64.exe OR *\\\\thor.exe)) OR (process.executable.text:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable.text:*\\\\vs_bootstrapper_* AND winlog.event_data.GrantedAccess:\"0x1410\") OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\WINDOWS\\\\system32\\\\*)) OR (SourceCommandLine:\"C\\:\\\\WINDOWS\\\\system32\\\\wermgr.exe\\ \\-upload\") OR (process.executable.text:*C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\* AND process.executable.text:(*\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR *\\\\software_reporter_tool.exe OR *\\\\DropboxUpdate.exe OR *\\\\MBAMInstallerService.exe OR *\\\\WebEx\\\\WebexHost.exe\\  OR *\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe)) OR (process.executable.text:*\\\\xampp\\-control.exe AND winlog.event_data.GrantedAccess:\"0x410\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights", "https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow", "https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
