{"description": "Detects process access LSASS memory which is typical for credentials dumping tools", "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason; please add more filters"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "32d0d3e2-e58d-4d41-926b-18b520b2b32d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Credentials Dumping Tools Accessing LSASS Memory", "query": "((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(0x40* OR 0x100000* OR 0x1410* OR 0x1438* OR 0x143a* OR 0x1418* OR 0x1f0fff* OR 0x1f1fff* OR 0x1f2fff* OR 0x1f3fff*)) AND (NOT ((process.executable:(\"C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\perfmon.exe\")) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND process.executable:*\\\\GamingServices.exe AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")) OR (process.executable:(*\\\\PROCEXP64.EXE OR *\\\\PROCEXP.EXE OR *C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe OR *\\\\MBAMInstallerService.exe) AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")) OR (process.executable:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable:*\\\\vmtoolsd.exe) OR (process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\" AND winlog.event_data.GrantedAccess:\"0x100000\") OR (process.executable:(\"C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\wmiprvse.exe\" OR \"C\\:\\\\Windows\\\\syswow64\\\\MsiExec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\msiexec.exe\") AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")) OR (process.executable:(*\\\\thor.exe OR *\\\\thor64.exe) AND winlog.event_data.GrantedAccess:(\"0x40\" OR \"0x1010\")) OR (process.executable:*\\\\explorer.exe AND winlog.event_data.GrantedAccess:\"0x401\") OR (process.executable:(\"C\\:\\\\Windows\\\\system32\\\\wininit.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\lsass.exe\") AND winlog.event_data.GrantedAccess:\"0x1000000\") OR (process.executable:\"C\\:\\\\Windows\\\\system32\\\\MRT.exe\" AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x1418\")) OR (winlog.event_data.GrantedAccess:\"0x40\" AND process.executable:(*\\\\handle.exe OR *\\\\handle64.exe)) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")) OR (process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\* AND process.executable:*\\\\Installer\\\\setup.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow", "https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Roberto Rodriguez", "Dimitrios Slamaris", "Mark Russinovich", "Thomas Patzke", "Teymur Kheirkhabarov", "Sherif Eldeeb", "James Dickenson", "Aleksey Potapov", "oscd.community (update)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
