{"description": "Detects potential access to svchost process memory such as that used by Invoke-Phantom to kill the winRM windows event logging service.", "author": ["Tim Burrell"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d451dcb9-2a6c-781d-db72-220c79a4fb5c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Svchost Memory Access", "query": "((winlog.event_data.TargetImage:*\\\\WINDOWS\\\\System32\\\\svchost.exe AND winlog.event_data.GrantedAccess:\"0x1F3FFF\" AND winlog.event_data.CallTrace:*UNKNOWN*) AND (NOT (process.executable.text:C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* AND process.executable.text:*\\\\MSBuild\\\\Current\\\\Bin\\\\MSBuild.exe AND winlog.event_data.CallTrace:(*Microsoft.Build.ni.dll* OR *System.ni.dll*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/hlldz/Invoke-Phant0m", "https://twitter.com/timbmsft/status/900724491076214784"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
