{"description": "Detects processes requesting access to LSASS memory via suspicious access masks. This is typical for credentials dumping tools", "author": ["Florian Roth", "Roberto Rodriguez", "Dimitrios Slamaris", "Mark Russinovich", "Thomas Patzke", "Teymur Kheirkhabarov", "Sherif Eldeeb", "James Dickenson", "Aleksey Potapov", "oscd.community (update)"], "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason; please add more filters"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "32d0d3e2-e58d-4d41-926b-18b520b2b32d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Credential Dumping Tools Accessing LSASS Memory", "query": "((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(0x40* OR 0x100000* OR 0x1410* OR 0x1438* OR 0x143a* OR 0x1418* OR 0x1f0fff* OR 0x1f1fff* OR 0x1f2fff* OR 0x1f3fff*)) AND (NOT ((process.executable.text:(\"C:\\WINDOWS\\system32\\taskmgr.exe\" OR \"C:\\Windows\\System32\\perfmon.exe\")) OR ((process.executable.text:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable.text:*\\\\MsMpEng.exe)) OR ((process.executable.text:\"C:\\Windows\\System32\\svchost.exe\" AND winlog.event_data.CallTrace:*|C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Definition\\ Updates\\\\\\{* AND winlog.event_data.CallTrace:*\\}\\\\mpengine.dll\\+* AND winlog.event_data.GrantedAccess:\"0x1418\")) OR ((process.executable.text:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND process.executable.text:*\\\\GamingServices.exe AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\"))) OR ((process.executable.text:(*\\\\PROCEXP64.EXE OR *\\\\PROCEXP.EXE OR *C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe OR *\\\\MBAMInstallerService.exe) AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\" OR \"0x40\"))) OR ((process.executable.text:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable.text:*\\\\vmtoolsd.exe)) OR ((process.executable.text:\"C:\\WINDOWS\\system32\\svchost.exe\" AND winlog.event_data.GrantedAccess:(\"0x100000\" OR \"0x1410\"))) OR ((process.executable.text:(\"C:\\WINDOWS\\system32\\wbem\\wmiprvse.exe\" OR \"C:\\Windows\\syswow64\\MsiExec.exe\" OR \"C:\\Windows\\System32\\msiexec.exe\") AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\" OR \"0x1f3fff\"))) OR ((process.executable.text:(*\\\\thor.exe OR *\\\\thor64.exe OR *\\\\aurora\\-agent.exe OR *\\\\aurora\\-agent\\-64.exe) AND winlog.event_data.GrantedAccess:(\"0x40\" OR \"0x1010\"))) OR ((process.executable.text:*\\\\explorer.exe AND winlog.event_data.GrantedAccess:\"0x401\")) OR ((process.executable.text:(\"C:\\Windows\\system32\\wininit.exe\" OR \"C:\\Windows\\System32\\lsass.exe\") AND winlog.event_data.GrantedAccess:\"0x1000000\")) OR ((process.executable.text:\"C:\\Windows\\system32\\MRT.exe\" AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x1418\"))) OR ((winlog.event_data.GrantedAccess:\"0x40\" AND process.executable.text:(*\\\\handle.exe OR *\\\\handle64.exe))) OR ((process.executable.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\"))) OR ((process.executable.text:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\* AND process.executable.text:*\\\\Installer\\\\setup.exe)) OR ((process.executable.text:*\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe AND winlog.event_data.GrantedAccess:\"0x401\")) OR ((process.executable.text:\"C:\\PROGRAMDATA\\MALWAREBYTES\\MBAMSERVICE\\ctlrupdate\\mbupdatr.exe\" AND winlog.event_data.GrantedAccess:\"0x1410\")) OR (winlog.event_data.CallTrace:(*|c\\:\\\\program\\ files\\\\windows\\ defender\\\\mprtp.dll* OR *|c\\:\\\\program\\ files\\\\windows\\ defender\\\\MpClient.dll*)) OR ((process.executable.text:C\\:\\\\Windows\\\\Temp\\\\* AND process.executable.text:*.tmp\\\\DropboxUpdate.exe AND winlog.event_data.GrantedAccess:(\"0x410\" OR \"0x1410\"))) OR ((process.executable.text:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable.text:*.tmp\\\\DropboxUpdate.exe AND winlog.event_data.GrantedAccess:\"0x1410\")) OR ((process.executable.text:C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* AND process.executable.text:*\\\\MSBuild\\\\Current\\\\Bin\\\\MSBuild.exe AND winlog.event_data.GrantedAccess:\"0x1F3FFF\")) OR (process.executable.text:*\\\\SteamLibrary\\\\steamapps\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow", "https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
