{"description": "Detects the usage of the direct syscall of NtOpenProcess which might be done from a CobaltStrike BOF.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f3f3506-1895-401b-9cc3-e86b16e630d0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Direct Syscall of NtOpenProcess", "query": "(winlog.event_data.CallTrace:UNKNOWN* AND (NOT ((winlog.event_data.TargetImage:\"C\\:\\\\Program\\ Files\\\\Cylance\\\\Desktop\\\\CylanceUI.exe\" AND process.executable:\"C\\:\\\\Windows\\\\Explorer.EXE\") OR (winlog.event_data.TargetImage:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\MicrosoftEdgeUpdate.exe\" AND process.executable:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Temp\\*\\\\MicrosoftEdgeUpdate.exe\") OR (winlog.event_data.TargetImage:*vcredist_x64.exe AND process.executable:*vcredist_x64.exe) OR (winlog.event_data.TargetImage:\"C\\:\\\\Windows\\\\system32\\\\systeminfo.exe\" AND process.executable:*setup64.exe) OR (winlog.event_data.TargetImage:*AmazonSSMAgentSetup.exe AND process.executable:*AmazonSSMAgentSetup.exe) OR (winlog.event_data.TargetImage:*C\\:\\\\Program\\ Files\\\\Mozilla\\ Firefox\\\\firefox.exe AND process.executable:*C\\:\\\\Program\\ Files\\\\Mozilla\\ Firefox\\\\firefox.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6"], "timestamp_override": "event.ingested", "author": ["Christian Burkard", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
