{"description": "Detects when a process, such as mimikatz, accesses the memory of svchost to dump credentials", "enabled": false, "false_positives": ["Non identified legit exectubale"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ad7769f7-5b3a-9786-cee8-5f897987c28f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "SVCHOST Credential Dump", "query": "((winlog.event_data.TargetImage:*\\\\svchost.exe AND winlog.event_data.GrantedAccess:\"0x143a\") AND (NOT (process.executable:(*\\\\services.exe OR *\\\\msiexec.exe))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1548"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florent Labouyrie"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
