{"description": "Detects potential NT API stub patching as seen used by the project PatchingAPI", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1e120792-44ff-123a-1343-b04899d0255d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential NT API Stub Patching", "query": "(winlog.event_data.GrantedAccess:\"0x1FFFFF\" AND winlog.event_data.CallTrace:C\\:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll\\+* AND winlog.event_data.CallTrace:*|UNKNOWN\\(* AND winlog.event_data.CallTrace:*\\))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/D1rkMtr/UnhookingPatch", "https://twitter.com/D1rkMtr/status/1611471891193298944?s=20"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
