{"description": "Detects potential shellcode injection used by tools such as Metasploit's migrate and Empire's psinject", "author": ["Bhabesh Raj"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "250ae82f-736e-4844-a68b-0b5e8cc887da", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Shellcode Injection", "query": "((winlog.event_data.GrantedAccess:(\"0x147a\" OR \"0x1f3fff\") AND winlog.event_data.CallTrace:*UNKNOWN*) AND (NOT (((process.executable.text:(C\\:\\\\Program\\ Files\\\\Dell\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Dell\\\\*) AND winlog.event_data.TargetImage:(C\\:\\\\Program\\ Files\\\\Dell\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Dell\\\\*) AND winlog.event_data.GrantedAccess:\"0x1F3FFF\" AND winlog.event_data.CallTrace:C\\:\\\\Windows\\\\System32\\\\ntdll.dll*)) OR ((process.executable.text:\"C:\\Program Files (x86)\\Dell\\UpdateService\\ServiceShell.exe\" AND winlog.event_data.TargetImage:\"C:\\Windows\\Explorer.EXE\" AND winlog.event_data.GrantedAccess:\"0x1F3FFF\" AND winlog.event_data.CallTrace:C\\:\\\\Windows\\\\System32\\\\ntdll.dll*)) OR ((process.executable.text:(\"C:\\Program Files\\Microsoft Visual Studio\\2022\\Community\\Common7\\IDE\\PerfWatson2.exe\" OR \"C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\\Community\\Common7\\IDE\\PerfWatson2.exe\") AND winlog.event_data.TargetImage:(\"C:\\Program Files\\Microsoft Visual Studio\\2022\\Community\\Common7\\IDE\\devenv.exe\" OR \"C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\\Community\\Common7\\IDE\\devenv.exe\") AND winlog.event_data.CallTrace:C\\:\\\\Windows\\\\System32\\\\ntdll.dll*)) OR ((process.executable.text:C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* AND process.executable.text:*\\\\MSBuild\\\\Current\\\\Bin\\\\MSBuild.exe AND winlog.event_data.TargetImage:\"C:\\Program Files\\Dell\\DellDataVault\\DDVDataCollector.exe\")) OR ((process.executable.text:\"C:\\Windows\\System32\\Wbem\\Wmiprvse.exe\" AND winlog.event_data.TargetImage:\"C:\\Windows\\system32\\lsass.exe\" AND winlog.event_data.CallTrace:C\\:\\\\Windows\\\\SYSTEM32\\\\ntdll.dll* AND winlog.event_data.CallTrace:*\\\\System.ni.dll\\+*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
