{"description": "Detects the usage of the direct syscall of NtOpenProcess which might be done from a CobaltStrike BOF.", "author": ["Christian Burkard (Nextron Systems)", "Tim Shelton"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f3f3506-1895-401b-9cc3-e86b16e630d0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Direct Syscall of NtOpenProcess", "query": "(winlog.event_data.CallTrace:UNKNOWN* AND (NOT (((winlog.event_data.TargetImage:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Yy][Ll][Aa][Nn][Cc][Ee]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Cc][Yy][Ll][Aa][Nn][Cc][Ee][Uu][Ii]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*[Vv][Cc][Rr][Ee][Dd][Ii][Ss][Tt]\\_[Xx]64\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Vv][Cc][Rr][Ee][Dd][Ii][Ss][Tt]\\_[Xx]64\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Ss][Ee][Tt][Uu][Pp]64\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*[Aa][Mm][Aa][Zz][Oo][Nn][Ss][Ss][Mm][Aa][Gg][Ee][Nn][Tt][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Aa][Mm][Aa][Zz][Oo][Nn][Ss][Ss][Mm][Aa][Gg][Ee][Nn][Tt][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Pp][Ll][Uu][Gg][Ii][Nn]\\-[Cc][Oo][Nn][Tt][Aa][Ii][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/))) OR ((winlog.event_data.TargetImage:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ss]\\ [Cc][Oo][Dd][Ee]\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Bb][Aa][Cc][Kk][Gg][Rr][Oo][Uu][Nn][Dd][Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Bb][Aa][Cc][Kk][Gg][Rr][Oo][Uu][Nn][Dd][Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Cc][Cc][Ll][Ee][Aa][Nn][Ee][Rr]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Cc][Ll][Ee][Aa][Nn][Ee][Rr][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Cc][Cc][Ll][Ee][Aa][Nn][Ee][Rr]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Cc][Ll][Ee][Aa][Nn][Ee][Rr][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetImage:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND winlog.event_data.TargetImage:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\\\.*/ AND winlog.event_data.TargetImage:/.*\\\\[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Aa][Uu][Dd][Ii][Oo][Dd][Gg]\\.[Ee][Xx][Ee]/) OR ((process.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Yy][Aa][Mm][Mm][Ee][Rr][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Aa][Pp][Pp]\\-.*/ AND process.executable:/.*\\\\[Yy][Aa][Mm][Mm][Ee][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND winlog.event_data.TargetImage:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Yy][Aa][Mm][Mm][Ee][Rr][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Aa][Pp][Pp]\\-.*/ AND winlog.event_data.TargetImage:/.*\\\\[Yy][Aa][Mm][Mm][Ee][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:0x1000)) OR (Provider_Name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Kk][Ee][Rr][Nn][Ee][Ll]\\-[Aa][Uu][Dd][Ii][Tt]\\-[Aa][Pp][Ii]\\-[Cc][Aa][Ll][Ll][Ss]/) OR (winlog.event_data.TargetImage:/.*\\\\[Ee][Vv][Ee][Rr][Nn][Oo][Tt][Ee]\\\\[Ee][Vv][Ee][Rr][Nn][Oo][Tt][Ee]\\.[Ee][Xx][Ee]/) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.GrantedAccess:0x1000)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
