{"description": "Detects various indicators of Microsoft Connection Manager Profile Installer execution", "enabled": false, "false_positives": ["Legitimate CMSTP use (unlikely in modern enterprise environments)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9ba1a22d-3913-9a0a-d9a2-82e1f6d16d7f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CMSTP Execution Process Access", "query": "winlog.event_data.CallTrace:*cmlua.dll*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218", "T1559"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1559", "name": "Inter-Process Communication", "reference": "https://attack.mitre.org/techniques/T1559"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/"], "timestamp_override": "event.ingested", "author": ["Nik Seetharaman"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
