{"description": "Detects process access to LSASS memory with suspicious access flags", "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7b2d0808-70a5-35a3-3baf-e28c5f678aa2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious GrantedAccess Flags on LSASS Access", "query": "((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2)) AND (NOT ((process.executable:(\"C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe\" OR \"C\\:\\\\Program\\ Files\\\\Malwarebytes\\\\Anti\\-Malware\\\\MBAMService.exe\" OR \"C\\:\\\\PROGRAMDATA\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe\" OR C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR \"C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\lsass.exe\" OR \"C\\:\\\\WINDOWS\\\\System32\\\\perfmon.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\MRT.exe\" OR \"C\\:\\\\Program\\ Files\\\\Cisco\\\\Cisco\\ AnyConnect\\ Secure\\ Mobility\\ Client\\\\vpnagent.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Cisco\\\\Cisco\\ AnyConnect\\ Secure\\ Mobility\\ Client\\\\vpnagent.exe\")) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable:*\\\\vmtoolsd.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) AND process.executable:*Antivirus*) OR (process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\MRT.exe\" AND winlog.event_data.GrantedAccess:\"0x1418\") OR (process.executable:\"C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\McAfee\\\\MMSSHost\\\\MMSSHOST.exe\") OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* AND process.executable:(*\\\\thor64.exe OR *\\\\thor.exe) AND winlog.event_data.GrantedAccess:\"0x1fffff\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights", "https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow", "https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
