{"description":"Detects a possible process memory dump based on a keyword in the file name of the accessing process Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Rare programs that contain the word dump in their name and access lsass"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"445e79cc-722d-1426-7eb0-b35440cab0c0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"LSASS Memory Access by Tool Named Dump","query":"(winlog.event_data.TargetImage:*\\\\lsass.exe AND process.executable:*dump* AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2 OR *FF))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
