{"description":"Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz, Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or dbgcore.dll for win10, server2016 and up. Author: Samir Bousseaden, Michael Haag. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["False positives are present when looking for 0x1410. Exclusions may be required."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"74a772dc-67da-9552-5aea-80960b7ed98d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"LSASS Memory Dump","query":"(winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*0x1fffff* OR *0x1038* OR *0x40* OR *0x1410* OR *0x1438* OR *0x143a*) AND winlog.event_data.CallTrace:(*dbghelp.dll* OR *dbgcore.dll* OR *ntdll.dll*))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
