{"description":"Detects various indicators of Microsoft Connection Manager Profile Installer execution Author: Nik Seetharaman. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate CMSTP use (unlikely in modern enterprise environments)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3b4b232a-af90-427c-a22f-30b0c0837b95","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CMSTP Execution Process Access","query":"winlog.event_data.CallTrace:*cmlua.dll*","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218","T1559"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1559","name":"Inter-Process Communication","reference":"https://attack.mitre.org/techniques/T1559"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
