{"description":"Detects a possible process memory dump that uses the white-listed filename like TrolleyExpress.exe as a way to dump the lsass process memory without Microsoft Defender interference Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely, since these tools shouldn't access lsass.exe at all"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4be8b654-0c01-4c9d-a10c-6b28467fc651","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"LSASS Access from White-Listed Processes","query":"(winlog.event_data.TargetImage:*\\\\lsass.exe AND process.executable:(*\\\\TrolleyExpress.exe OR *\\\\ProcessDump.exe OR *\\\\dump64.exe) AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2 OR *FF))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
