{"description":"Detects the access to processes by other suspicious processes which have reflectively loaded libraries in their memory space. An example is SilentTrinity C2 behaviour. Generally speaking, when Sysmon EventID 10 cannot reference a stack call to a dll loaded from disk (the standard way), it will display \"UNKNOWN\" as the module name. Usually this means the stack call points to a module that was reflectively loaded in memory. Adding to this, it is not common to see such few calls in the stack (ntdll.dll --> kernelbase.dll --> unknown) which essentially means that most of the functions required by the process to execute certain routines are already present in memory, not requiring any calls to external libraries. The latter should also be considered suspicious. Author: Perez Diego (@darkquassar), oscd.community, Jonhnathan Ribeiro. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["SysInternals Process Explorer"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2548e94b-4db1-5f25-f016-0503488c9c58","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious In-Memory Module Execution","query":"((((winlog.event_data.CallTrace:*C\\:\\\\WINDOWS\\\\SYSTEM32\\\\ntdll.dll\\+* AND winlog.event_data.CallTrace:*|C\\:\\\\WINDOWS\\\\System32\\\\KERNELBASE.dll\\+* AND winlog.event_data.CallTrace:*|UNKNOWN\\(* AND winlog.event_data.CallTrace:*\\)*) OR (winlog.event_data.CallTrace:*UNKNOWN\\(* AND winlog.event_data.CallTrace:*\\)|UNKNOWN\\(* AND winlog.event_data.CallTrace:*\\))) OR (winlog.event_data.CallTrace:*UNKNOWN* AND winlog.event_data.GrantedAccess:(\"0x1F0FFF\" OR \"0x1F1FFF\" OR \"0x143A\" OR \"0x1410\" OR \"0x1010\" OR \"0x1F2FFF\" OR \"0x1F3FFF\" OR \"0x1FFFFF\"))) AND (NOT ((process.executable:(*\\\\Windows\\\\System32\\\\sdiagnhost.exe OR *\\\\procexp64.exe OR *\\\\procexp.exe OR *\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR *\\\\aurora\\-agent\\-64.exe OR *\\\\aurora\\-agent.exe OR *\\\\git\\\\usr\\\\bin\\\\sh.exe OR *\\\\IDE\\\\devenv.exe OR *\\\\GitHubDesktop\\\\Update.exe OR *\\\\RuntimeBroker.exe OR *\\\\backgroundTaskHost.exe OR *\\\\GitHubDesktop.exe) OR process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\*\\\\NGenTask.exe* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework* OR C\\:\\\\WINDOWS\\\\System32\\\\DriverStore\\\\* OR C\\:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\*) OR process.executable:(C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR \"C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\ctfmon.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\NhNotifSys.exe\") OR winlog.event_data.TargetImage:\"C\\:\\\\Windows\\\\System32\\\\RuntimeBroker.exe\" OR winlog.event_data.TargetImage:*\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR winlog.event_data.CallTrace:*|C\\:\\\\WINDOWS\\\\System32\\\\RPCRT4.dll\\+*) OR (process.executable:\"C\\:\\\\WINDOWS\\\\Explorer.EXE\" AND winlog.event_data.TargetImage:(\"C\\:\\\\WINDOWS\\\\system32\\\\backgroundTaskHost.exe\" OR \"C\\:\\\\WINDOWS\\\\explorer.exe\")) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:*\\\\eclipse.exe AND winlog.event_data.CallTrace:(*\\\\jre\\\\bin\\\\java.dll* OR *|C\\:\\\\Windows\\\\SYSTEM32\\\\windows.storage.dll\\+* OR *\\\\configuration\\\\org.eclipse.osgi\\\\*)))))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","Privilege Escalation","T1055","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"},{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"},{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
