{"description":"Detects the usage of the direct syscall of NtOpenProcess which might be done from a CobaltStrike BOF. Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"00ad272d-c72e-1637-47b3-328ade39d648","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Direct Syscall of NtOpenProcess","query":"winlog.event_data.CallTrace:UNKNOWN*","meta":{"from":"1m"},"severity":"critical","tags":["T1106"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1106","name":"Native API","reference":"https://attack.mitre.org/techniques/T1106"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
