{"description":"Detects a typical pattern of a CobaltStrike BOF which inject into other processes Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"46a0b6b3-7989-c7ca-8fac-e4d12e4b0f52","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CobaltStrike BOF Injection Pattern","query":"(winlog.event_data.CallTrace:/^C:\\\\\\\\Windows\\\\\\\\SYSTEM32\\\\\\\\ntdll\\\\.dll\\+[a-z0-9]{4,6}\\|C:\\\\\\\\Windows\\\\\\\\System32\\\\\\\\KERNELBASE\\\\.dll\\+[a-z0-9]{4,6}\\|UNKNOWN\\([A-Z0-9]{16}\\)$/ AND winlog.event_data.GrantedAccess:(\"0x1028\" OR \"0x1fffff\"))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1106","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1106","name":"Native API","reference":"https://attack.mitre.org/techniques/T1106"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
