{"description":"Detects process access to LSASS memory with suspicious access flags Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software accessing LSASS process for legitimate reason"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7b2d0808-70a5-35a3-3baf-e28c5f678aa2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious GrantedAccess Flags on LSASS Access","query":"((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(*10 OR *30 OR *50 OR *70 OR *90 OR *B0 OR *D0 OR *F0 OR *18 OR *38 OR *58 OR *78 OR *98 OR *B8 OR *D8 OR *F8 OR *1A OR *3A OR *5A OR *7A OR *9A OR *BA OR *DA OR *FA OR *0x14C2)) AND (NOT ((process.executable:(\"C\\:\\\\WINDOWS\\\\system32\\\\taskmgr.exe\" OR \"C\\:\\\\Program\\ Files\\\\Malwarebytes\\\\Anti\\-Malware\\\\MBAMService.exe\" OR \"C\\:\\\\PROGRAMDATA\\\\MALWAREBYTES\\\\MBAMSERVICE\\\\ctlrupdate\\\\mbupdatr.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\taskhostw.exe\" OR C\\:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe OR \"C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\lsass.exe\" OR \"C\\:\\\\WINDOWS\\\\System32\\\\perfmon.exe\")) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND process.executable:*\\\\GamingServices.exe AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\" OR \"0x1040\")) OR (process.executable:(*\\\\PROCEXP64.EXE OR *\\\\PROCEXP.EXE) AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")) OR (process.executable:C\\:\\\\ProgramData\\\\VMware\\\\VMware\\ Tools\\\\* AND process.executable:*\\\\vmtoolsd.exe) OR (process.executable:(C\\:\\\\Progra\\ Files\\\\* OR C\\:\\\\Progra\\ Files\\ \\(x86\\)\\\\*) AND process.executable:*Antivirus*) OR (process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\wmiprvse.exe\" AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")) OR (process.executable:\"C\\:\\\\Windows\\\\sysWOW64\\\\wbem\\\\wmiprvse.exe\" AND winlog.event_data.GrantedAccess:\"0x1010\") OR (process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\MRT.exe\" AND winlog.event_data.GrantedAccess:\"0x1418\") OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\WINDOWS\\\\system32\\\\*) AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x410\")))))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
