{"description": "Detects a file ending in jse, vbe, js, vba, vbs written by cscript.exe or wscript.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "002bdb95-0cf1-46a6-9e08-d38c128a6127", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WScript or CScript Dropper", "query": "(process.executable:(*\\\\wscript.exe OR *\\\\cscript.exe) AND file.path:(C\\:\\\\Users\\\\* OR C\\:\\\\ProgramData*) AND file.path:(*.jse OR *.vbe OR *.js OR *.vba OR *.vbs))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["WScript or CScript Dropper (cea72823-df4d-4567-950c-0b579eaf0846)"], "timestamp_override": "event.ingested", "author": ["Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
