{"description": "Detects the pattern of a UAC bypass using Windows Event Viewer", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "63e4f530-65dc-49cc-8f80-ccfa95c69d43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "UAC Bypass Using EventVwr", "query": "(file.path:*\\\\AppData\\\\Local\\\\Microsoft\\\\Event\\ Viewer\\\\RecentViews* AND (NOT (Level:\"4\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/orange_8361/status/1518970259868626944?s=20&t=RFXqZjtA7tWM3HxqEH78Aw", "https://twitter.com/splinter_code/status/1519075134296006662?s=12&t=DLUXH86WtcmG_AZ5gY3C6g"], "timestamp_override": "event.ingested", "author": ["Antonio Cocomazzi (idea)", "Florian Roth (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
