{"description":"Detects the creation of files that contain Kerberos tickets based on an extension used by the popular tool Mimikatz Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"364bed01-3608-ebde-c841-6dafe214a45c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Mimikatz Kirbi File Creation","query":"file.path:*.kirbi","meta":{"from":"1m"},"severity":"critical","tags":["Credential Access","T1558"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1558","name":"Steal or Forge Kerberos Tickets","reference":"https://attack.mitre.org/techniques/T1558"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
