{"description": "Detects a suspicious Microsoft desktopimgdownldr file creation that stores a file to a suspicious location or contains a file with a suspicious extension", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc4f4817-0c53-4683-a4ee-b17a64bc1039", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Desktopimgdownldr Target File", "query": "(((process.executable:*svchost.exe AND file.path:*\\\\Personalization\\\\LockScreenImage\\\\*) AND (NOT (file.path:*C\\:\\\\Windows\\\\*))) AND (NOT (file.path:(*.jpg* OR *.jpeg* OR *.png*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/", "https://twitter.com/SBousseaden/status/1278977301745741825"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
