{"description": "A general detection for processes creating PFX files. This could be an indicator of an adversary exporting a local certificate to a PFX file.", "enabled": false, "false_positives": ["System administrators managing certififcates."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "286a8d22-d241-e293-e36b-e17af327cb24", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious PFX File Creation", "query": "file.path:*.pfx", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/14", "https://threathunterplaybook.com/evals/apt29/detections/6.B.1_6392C9F1-D975-4F75-8A70-433DEDD7F622.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
