{"description": "Attempts to detect PowerShell writing startup shortcuts. This procedure was highlighted in Red Canary Intel Insights Oct. 2021, \"We frequently observe adversaries using PowerShell to write malicious .lnk files into the startup directory to establish persistence. Accordingly, this detection opportunity is likely to identify persistence mechanisms in multiple threats. In the context of Yellow Cockatoo, this persistence mechanism eventually launches the command-line script that leads to the installation of a malicious DLL\"", "enabled": false, "false_positives": ["Unknown", "Depending on your environment accepted applications may leverage this at times. It is recomended to search for anomolies inidicative of malware."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "53f99753-b94e-167e-3c94-8eb6f4819561", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Writing Startup Shortcuts", "query": "(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND file.path:*\\\\start\\ menu\\\\programs\\\\startup\\\\* AND file.path:*.lnk)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1547"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/intelligence-insights-october-2021/", "https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1547.001/T1547.001.md#atomic-test-7---add-executable-shortcut-link-to-user-startup-folder"], "timestamp_override": "event.ingested", "author": ["Christopher Peacock '@securepeacock'", "SCYTHE"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
