{"description": "Detects suspicious processes that write (copy) a Active Directory database (ntds.dit) file", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "921cafd4-6074-cd26-9de7-a878f1f8a623", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Process Writes Ntds.dit", "query": "(file.path:*\\\\ntds.dit AND process.executable:(*\\\\powershell.exe OR *\\\\cmd.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://stealthbits.com/blog/extracting-password-hashes-from-the-ntds-dit-file/", "https://adsecurity.org/?p=2398"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
