{"description": "Detects suspicious file creation patterns found in logs when CrackMapExec is used", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d194734d-ce89-993e-8ca7-96f6d8beb01a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CrackMapExec File Creation Patterns", "query": "((file.path:C\\:\\\\Windows\\\\Temp\\\\* AND process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\rundll32.exe\" AND user.name:(*NT\\ AUTHORI* OR *NT\\ AUTORI*) AND file.path:(*.rtf OR *.otf OR *.odt OR *.txt OR *.doc OR *.pdf OR *.dll OR *.docx OR *.wpd OR *.icns OR *.db OR *.ini OR *.tex OR *.sys OR *.csv OR *.fon OR *.tar OR *.ttf OR *.xml OR *.cfg OR *.cpl OR *.jpg OR *.drv OR *.cur OR *.tmp)) OR (file.path:\"C\\:\\\\Windows\\\\Temp\\\\procdump.exe\" AND user.name:(*NT\\ AUTHO* OR *NT\\ AUTO*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
