{"description": "A General detection for files being created in the Windows startup directory. This could be an indicator of persistence.", "enabled": false, "false_positives": ["An FP could be caused by legitimate application writing shortcuts for example. This folder should always be inspected to make sure that all the files in there are legitimate"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8e5f0a87-db26-0565-c8dd-2bb21ae213c2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Startup Folder File Write", "query": "(file.path.text:*\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\StartUp* AND (NOT (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\wuauclt.exe\" OR file.path.text:C\\:\\\\$WINDOWS.\\~BT\\\\NewOS\\\\*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/12", "https://threathunterplaybook.com/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
