{"description": "A office file with macro is created from a commandline or a script", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5a25ccd9-2ac8-0818-2755-ddd2ffd3bda6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Dump Office Macro Files from Commandline", "query": "(file.path:(*.docm OR *.dotm OR *.xlsm OR *.xltm OR *.potm OR *.pptm OR *.pptx) AND (process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe) OR process.parent.executable:(*\\\\cmd.exe OR *\\\\powershell.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1566.001/T1566.001.md", "https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
