{"description": "Detects Octopus Scanner Malware.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "805c55d9-31e6-4846-9878-c34c75054fe9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Octopus Scanner Malware", "query": "file.path:(*\\\\AppData\\\\Local\\\\Microsoft\\\\Cache134.dat OR *\\\\AppData\\\\Local\\\\Microsoft\\\\ExplorerSync.db)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1195", "T1195"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://securitylab.github.com/research/octopus-scanner-malware-open-source-supply-chain"], "timestamp_override": "event.ingested", "author": ["NVISO"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
