{"description":"A sigma rule detecting an unidetefied attacker who used phishing emails to target high profile orgs on November 2018. The Actor shares some TTPs with YYTRIUM/APT29 campaign in 2016. Author: @41thexplorer, Microsoft Defender ATP. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d77e1d8a-ad72-c00b-c2e0-a9288e04e164","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Unidentified Attacker November 2018","query":"file.path:*ds7002.lnk*","meta":{"from":"1m"},"severity":"high","tags":["T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
