{"description": "Detect creation of suspicious executable file name. Some strings look for suspicious file extensions, others look for filenames that exploit unquoted service paths.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "035ca949-fc23-e212-f1cb-5427fc7b3b08", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Executable File Creation", "query": "(file.path.text:(*.bat.exe OR *.sys.exe) OR file.path.text:(\"C\\:\\\\$Recycle.Bin.exe\" OR \"C\\:\\\\Documents\\ and\\ Settings.exe\" OR \"C\\:\\\\MSOCache.exe\" OR \"C\\:\\\\Recovery.exe\" OR \"C\\:\\\\PerfLogs.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae", "https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
