{"description": "Detects when a file with a suspicious extension is created in the startup folder", "enabled": false, "false_positives": ["Rare legitimate usage of some of the extensions mentioned in the rule"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "28208707-fe31-437f-9a7f-4b1108b94d2e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Startup Folder Persistence", "query": "(file.path.text:*\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* AND file.path.text:(*.vbs OR *.vbe OR *.bat OR *.ps1 OR *.hta OR *.dll))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/last-byte/PersistenceSniper"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
