{"description": "Detects the creation of log files during a TeamViewer remote session", "enabled": false, "false_positives": ["Legitimate uses of TeamViewer in an organisation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "084253e9-d8ae-7559-d887-d14b11dc5629", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "TeamViewer Remote Session", "query": "(file.path:(*\\\\TeamViewer\\\\RemotePrinting\\\\tvprint.db OR *\\\\TeamViewer\\\\TVNetwork.log) OR (file.path:*\\\\TeamViewer* AND file.path:*_Logfile.log*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.teamviewer.com/en-us/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
