{"description": "Detects anydesk writing binaries files to disk other than \"gcapi.dll\". According to RedCanary research it's highly abnormal for AnyDesk to write executable files to disk besides gcapi.dll, which is a legitimate DLL that's part of the Google Chrome web browser used to interact with the Google Cloud API. (See reference section for more details)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d2841e9e-b03b-3405-b122-9431ab828215", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Binary Writes Via AnyDesk", "query": "((process.executable.text:*\\\\anydesk.exe AND file.path.text:(*.dll OR *.exe)) AND (NOT ((file.path.text:*\\\\gcapi.dll))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
