{"description": "Aversaries may use to interact with a remote network share using Server Message Block (SMB).\nThis technique is used by post-exploitation frameworks.\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4aafb0fa-bff5-4b9d-b99e-8093e659c65f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Writing Local Admin Share", "query": "(file.path:*\\\\127.0.0* AND file.path:*\\\\ADMIN$\\\\*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1546"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1021.002/T1021.002.md#atomic-test-4---execute-command-writing-output-to-local-admin-share"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
