{"description":"Detects the usage of ADSI (LDAP) operations by tools. This may also detect tools like LDAPFragger. Author: xknow @xknow_infosec. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Other legimate tools, which do ADSI (LDAP) operations, e.g. any remoting activity by MMC, Powershell, Windows etc."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"85b0556c-eca8-829d-b67f-77c070968e2b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious ADSI-Cache Usage By Unknown Tool","query":"((file.path:*\\\\Local\\\\Microsoft\\\\Windows\\\\SchCache\\\\* AND file.path:*.sch) AND (NOT ((process.executable:(\"C\\:\\\\windows\\\\system32\\\\svchost.exe\" OR \"C\\:\\\\windows\\\\system32\\\\dllhost.exe\" OR \"C\\:\\\\windows\\\\system32\\\\mmc.exe\" OR \"C\\:\\\\windows\\\\system32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" OR \"C\\:\\\\Windows\\\\CCM\\\\CcmExec.exe\" OR \"C\\:\\\\Program\\ Files\\\\Cylance\\\\Desktop\\\\CylanceSvc.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe\")) OR (process.executable:C\\:\\\\Windows\\\\ccmsetup\\\\autoupgrade\\\\ccmsetup*))))","meta":{"from":"1m"},"severity":"high","tags":["T1001"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
