{"description": "Detects Rclone config file being created", "enabled": false, "false_positives": ["Legitimate Rclone usage (rare)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "70a22e55-7c7b-22e4-1318-5bc07116623d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rclone Config File Creation", "query": "(file.path:*\\:\\\\Users\\\\* AND file.path:*\\\\.config\\\\rclone\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/"], "timestamp_override": "event.ingested", "author": ["Aaron Greetham (@beardofbinary) - NCC Group"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
