{"description":"Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups. Author: @ROxPinTeddy. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administrative use"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ff685de9-6fe2-b5c7-ef34-af739bd1c06a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Advanced IP Scanner","query":"file.path:*\\\\AppData\\\\Local\\\\Temp\\\\Advanced\\ IP\\ Scanner\\ 2*","meta":{"from":"1m"},"severity":"medium","tags":["T1046"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1046","name":"Network Service Scanning","reference":"https://attack.mitre.org/techniques/T1046"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
