{"description": "Detects the creation of files that indicator an interactive use of PowerShell in the SYSTEM user context", "enabled": false, "false_positives": ["Administrative activity", "PowerShell scripts running as SYSTEM user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5b40a734-99b6-4b98-a1d0-1cea51a08ab2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Interactive PowerShell as SYSTEM", "query": "file.path:(\"C\\:\\\\Windows\\\\System32\\\\config\\\\systemprofile\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\PowerShell\\\\PSReadLine\\\\ConsoleHost_history.txt\" OR \"C\\:\\\\Windows\\\\System32\\\\config\\\\systemprofile\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\PowerShell\\\\StartupProfileData\\-Interactive\")", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/PowerSploit_Invoke-Mimikatz.htm"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
