{"description": "Detects windows executables that writes files with suspicious extensions", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b8fd0e93-ff58-4cbd-8f48-1c114e342e62", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Binaries Write Suspicious Extensions", "query": "(process.executable.text:(*\\\\rundll32.exe OR *\\\\smss.exe OR *\\\\RuntimeBroker.exe OR *\\\\sihost.exe OR *\\\\lsass.exe OR *\\\\csrss.exe OR *\\\\winlogon.exe OR *\\\\wininit.exe) AND file.path.text:(*.bat OR *.vbe OR *.txt OR *.vbs OR *.exe OR *.ps1 OR *.hta OR *.iso))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
