{"description": "Detects the use of Moriya rootkit as described in the securelist's Operation TunnelSnake report", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a1507d71-0b60-44f6-b17c-bf53220fdd88", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Moriya Rootkit", "query": "file.path:\"C\\:\\\\Windows\\\\System32\\\\drivers\\\\MoriyaStreamWatchmen.sys\"", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
