{"description": "Detects the creation of an executable by another executable", "enabled": false, "false_positives": ["Software installers", "Update utilities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "297afac9-5d02-4138-8c58-b977bac60556", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Creation of an Executable by an Executable", "query": "((process.executable:*.exe AND file.path:*.exe) AND (NOT ((process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\" AND file.path:C\\:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\Install\\\\*) OR (process.executable:C\\:\\\\Windows\\\\WinSxS\\\\* AND process.executable:*\\\\TiWorker.exe) OR (process.executable:\"C\\:\\\\Windows\\\\System32\\\\msiexec.exe\") OR (process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\cleanmgr.exe\"))))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Malware Sandbox"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
