{"description": "Detects possible successful exploitation for vulnerability described in CVE-2021-26858 by looking for | creation of non-standard files on disk by Exchange Server\u2019s Unified Messaging service | which could indicate dropping web shells or other malicious content", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b06335b3-55ac-4b41-937e-16b7f5d57dfd", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CVE-2021-26858 Exchange Exploitation", "query": "(process.executable:*UMWorkerProcess.exe AND (NOT (file.path:(*CacheCleanup.bin OR *.txt OR *.LOG OR *.cfg OR *cleanup.bin))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1203"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
