{"description": "Detects the creation of an executable with a system process name in a suspicious folder", "enabled": false, "false_positives": ["System processes copied outside their default folders for testing purposes", "Third party software naming their software with the same names as the processes mentioned here"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2d4ae911-23db-733d-4567-7726591f7358", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Created with System Process Name", "query": "(file.path.text:(*\\\\svchost.exe OR *\\\\rundll32.exe OR *\\\\services.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\regsvr32.exe OR *\\\\spoolsv.exe OR *\\\\lsass.exe OR *\\\\smss.exe OR *\\\\csrss.exe OR *\\\\conhost.exe OR *\\\\wininit.exe OR *\\\\lsm.exe OR *\\\\winlogon.exe OR *\\\\explorer.exe OR *\\\\taskhost.exe OR *\\\\Taskmgr.exe OR *\\\\sihost.exe OR *\\\\RuntimeBroker.exe OR *\\\\smartscreen.exe OR *\\\\dllhost.exe OR *\\\\audiodg.exe OR *\\\\wlanext.exe) AND (NOT ((file.path.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR \\\\SystemRoot\\\\System32\\\\*) AND process.executable.text:(*\\\\Windows\\\\System32\\\\dism.exe OR *\\\\TiWorker.exe)) OR (file.path.text:C\\:\\\\$WINDOWS.\\~BT\\\\* AND process.executable.text:\"C\\:\\\\$WINDOWS.\\~BT\\\\Sources\\\\SetupHost.exe\") OR (file.path.text:*\\\\RuntimeBroker.exe AND process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\wbengine.exe\") OR (file.path.text:*\\\\spoolsv.exe AND file.path.text:C\\:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\* AND process.executable.text:*\\:\\\\Windows\\\\system32\\\\svchost.exe) OR (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\wuauclt.exe\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Sander Wiebing", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
