{"description": "This rule will monitor executable and script file creation by office applications. Please add more file extensions or magic bytes to the logic of your choice.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3ab423b9-cb12-c777-4934-2a137ce540a3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Created Files by Office Applications", "query": "((process.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe) AND file.path:(*.exe OR *.dll OR *.ocx OR *.com OR *.ps1 OR *.vbs OR *.sys OR *.bat OR *.scr OR *.proj)) AND (NOT ((file.path:*C\\:\\\\Users\\\\* AND file.path:*\\\\AppData\\\\Local\\\\Microsoft\\\\Office\\\\* AND file.path:*\\\\WebServiceCache\\\\AllUsers* AND file.path:*.com) OR (process.executable:*\\\\winword.exe AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\webexdelta\\\\* AND file.path:(*.dll OR *.exe)) OR (file.path:*\\\\AppData\\\\Local\\\\assembly\\\\tmp\\\\* AND file.path:*.dll))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/", "https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml"], "timestamp_override": "event.ingested", "author": ["Vadim Khrykov (ThreatIntel)", "Cyb3rEng (Rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
