{"description": "Detects the creation of files that contain Kerberos tickets based on an extension used by the popular tool Mimikatz", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "364bed01-3608-ebde-c841-6dafe214a45c", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Mimikatz Kirbi File Creation", "query": "file.path:*.kirbi", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://cobalt.io/blog/kerberoast-attack-techniques"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
