{"description": "Detects unusual processes accessing desktop.ini, which can be leveraged to alter how Explorer displays a folder's content (i.e. renaming files) without changing them on disk.", "enabled": false, "false_positives": ["Operations performed through Windows SCCM or equivalent", "read only access list authority"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "424088c1-9280-78fc-4e7f-cb89fdb80c99", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious desktop.ini Action", "query": "(file.path:*\\\\desktop.ini AND (NOT (process.executable:(C\\:\\\\Windows\\\\* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/"], "timestamp_override": "event.ingested", "author": ["Maxime Thiebaut (@0xThiebaut)", "Tim Shelton (HAWK.IO)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
