{"description":"Detects Octopus Scanner Malware. Author: NVISO. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1e9839d8-08e8-4567-7c07-b1a7c4f48bb3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Octopus Scanner Malware","query":"file.path:(*\\\\AppData\\\\Local\\\\Microsoft\\\\Cache134.dat OR *\\\\AppData\\\\Local\\\\Microsoft\\\\ExplorerSync.db)","meta":{"from":"1m"},"severity":"high","tags":["T1195","T1195"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
