{"description": "Detects files created during the local privilege exploitation of CVE-2022-24527 Microsoft Connected Cache", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7f488413-039b-04ad-6f7b-d780778bcabc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CVE-2022-24527 Microsoft Connected Cache LPE", "query": "(file.path:*WindowsPowerShell\\\\Modules\\\\webAdministration\\\\webAdministration.psm1 AND (NOT (user.name:(*AUTHORI* OR *AUTORI*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1059"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.rapid7.com/blog/post/2022/04/12/cve-2022-24527-microsoft-connected-cache-local-privilege-escalation-fixed/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
