{"description": "Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "52753ea4-b3a0-4365-910d-36cff487b789", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Hijack Legit RDP Session to Move Laterally", "query": "(process.executable:*\\\\mstsc.exe AND file.path:*\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
