{"description": "Detects the usage of ADSI (LDAP) operations by tools. This may also detect tools like LDAPFragger.", "enabled": false, "false_positives": ["Other legimate tools, which do ADSI (LDAP) operations, e.g. any remoting activity by MMC, Powershell, Windows etc."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "75bf09fa-1dd7-4d18-9af9-dd9e492562eb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious ADSI-Cache Usage By Unknown Tool", "query": "((file.path.text:*\\\\Local\\\\Microsoft\\\\Windows\\\\SchCache\\\\* AND file.path.text:*.sch) AND (NOT ((process.executable.text:(\"C\\:\\\\windows\\\\system32\\\\svchost.exe\" OR \"C\\:\\\\windows\\\\system32\\\\dllhost.exe\" OR \"C\\:\\\\windows\\\\system32\\\\mmc.exe\" OR \"C\\:\\\\windows\\\\system32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" OR \"C\\:\\\\Windows\\\\CCM\\\\CcmExec.exe\" OR \"C\\:\\\\Program\\ Files\\\\Cylance\\\\Desktop\\\\CylanceSvc.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe\")) OR (process.executable.text:C\\:\\\\Windows\\\\ccmsetup\\\\autoupgrade\\\\ccmsetup*) OR (process.executable.text:*\\\\LANDesk\\\\LDCLient\\\\ldapwhoami.exe) OR (process.executable.text:(\"C\\:\\\\Windows\\\\system32\\\\efsui.exe\" OR \"C\\:\\\\Windows\\\\system32\\\\dsac.exe\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1001"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://medium.com/@ivecodoe/detecting-ldapfragger-a-newly-released-cobalt-strike-beacon-using-ldap-for-c2-communication-c274a7f00961", "https://blog.fox-it.com/2020/03/19/ldapfragger-command-and-control-over-ldap-attributes/", "https://github.com/fox-it/LDAPFragger"], "timestamp_override": "event.ingested", "author": ["xknow @xknow_infosec", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
