{"description":"Detects the use of CreateMiniDump hack tool used to dump the LSASS process memory for credential extraction on the attacker's machine Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"08207c27-e98e-25ef-7544-5f98156994c2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CreateMiniDump Hacktool","query":"file.path:*\\\\lsass.dmp","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
