{"description": "Detects javaw.exe in AppData folder as used by Adwind / JRAT", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "be675127-66dc-0d60-ec3a-8e0fc9204b64", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Adwind RAT / JRAT", "query": "((file.path:*\\\\AppData\\\\Roaming\\\\Oracle\\\\bin\\\\java* AND file.path:*.exe*) OR (file.path:*\\\\Retrive* AND file.path:*.vbs*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100", "https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Tom Ueltschi", "Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
