{"description": "Detects the creation of copy of suspicious files (EXE/DLL) to the default GPO storage folder", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8bf5fe82-49d0-fe28-83c9-148fb343ffda", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Files in Default GPO Folder", "query": "(file.path:*\\\\Policies\\\\\\{31B2F340\\-016D\\-11D2\\-945F\\-00C04FB984F9\\}\\\\* AND file.path:(*.dll OR *.exe))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://redcanary.com/blog/intelligence-insights-november-2021/"], "timestamp_override": "event.ingested", "author": ["elhoim"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
