{"description":"Detects files created during the local privilege exploitation of CVE-2022-24527 Microsoft Connected Cache Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7f488413-039b-04ad-6f7b-d780778bcabc","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CVE-2022-24527 Microsoft Connected Cache LPE","query":"(file.path:*WindowsPowerShell\\\\Modules\\\\webAdministration\\\\webAdministration.psm1 AND (NOT (user.name:(*AUTHORI* OR *AUTORI*))))","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1059"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
