{"description": "Detects Mimikatz MemSSP default log file creation", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6435ef86-7dc0-d844-dde9-4ebf3dce864e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Mimikatz MemSSP Default Log File Creation", "query": "file.path:*mimilsa.log", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://pentestlab.blog/2019/10/21/persistence-security-support-provider/"], "timestamp_override": "event.ingested", "author": ["David ANDRE"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
