{"description": "Detects creation of new \".dll\" files inside the plugins directory of a notepad++ installation by a process other than \"gup.exe\". Which could indicates possible persistence", "enabled": false, "false_positives": ["Possible FPs during first installation of Notepad++", "Legitimate use of custom plugins to enhance notepad++ functionality by users"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "22559638-d223-aa96-54f0-10b083f95d23", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Persistence Via Notepad++ Plugins", "query": "((file.path:*\\\\Notepad\\+\\+\\\\plugins\\\\* AND file.path:*.dll) AND (NOT ((process.executable:*\\\\Notepad\\+\\+\\\\updater\\\\gup.exe) OR (process.executable:C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.executable:*\\\\target.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestlab.blog/2022/02/14/persistence-notepad-plugins/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
