{"description": "Detects file creation patterns noticeable during the exploitation of CVE-2021-40444", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "79c9850f-3586-7bc2-38c2-28b354a7c373", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Suspicious Word Cab File Write CVE-2021-40444", "query": "((process.executable:*\\\\winword.exe AND ((file.path:*.cab AND file.path:*\\\\Windows\\\\INetCache*) OR (file.path:*\\\\AppData\\\\Local\\\\Temp\\\\* AND file.path:*.inf*))) AND (NOT (file.path:C\\:\\\\Users\\\\* AND file.path:*AppData\\\\Local\\\\Temp* AND file.path:*\\\\Content.inf)))", "meta": {"from": "1m"}, "severity": "critical", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/RonnyTNL/status/1436334640617373699?s=20", "https://twitter.com/vanitasnk/status/1437329511142420483?s=21"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Sittikorn S"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
