{"description": "Detects the creation or modification of a powershell profile which could indicate suspicious activity as the profile can be used as a mean of persistence", "enabled": false, "false_positives": ["System administrator create Powershell profile manually"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e40b40f2-d325-903e-db71-b4a776171504", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Profile Modification", "query": "file.path.text:(*\\\\Microsoft.PowerShell_profile.ps1 OR *\\\\WindowsPowerShell\\\\profile.ps1 OR *\\\\PowerShell\\\\profile.ps1 OR *\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\profile.ps1 OR *\\\\Program\\ Files\\\\PowerShell\\\\7\\\\profile.ps1)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/", "https://persistence-info.github.io/Data/powershellprofile.html"], "timestamp_override": "event.ingested", "author": ["HieuTT35", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
