{"description": "Detects a Windows executable that writes files to suspicious folders", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fdee8104-564c-c9d2-b747-f14c7478d37d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Shell File Write to Suspicious Folder", "query": "((process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\msbuild.exe OR *\\\\certutil.exe) AND file.path:(*C\\:\\\\Users\\\\Public* OR *C\\:\\\\PerfLogs*)) OR (process.executable:(*\\\\schtasks.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\certutil.exe) AND file.path:(*C\\:\\\\Users\\\\Public* OR *C\\:\\\\PerfLogs* OR *\\\\AppData\\\\* OR *C\\:\\\\Windows\\\\Temp*)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["No references"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
