{"description": "Detects the default filename used in PoC code against print spooler vulnerability CVE-2021-1675", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2131cfb3-8c12-45e8-8fa0-31f5924e9f07", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CVE-2021-1675 Print Spooler Exploitation Filename Pattern", "query": "file.path:*C\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\old\\\\1\\\\123*", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/hhlxf/PrintNightmare", "https://github.com/afwu/PrintNightmare", "https://github.com/cube0x0/CVE-2021-1675"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
