{"description":"Detects the pattern of UAC Bypass using a msconfig GUI hack (UACMe 55) Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cc3a2fde-d01c-4570-a875-a6fd1177db9e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"UAC Bypass Using MSConfig Token Modification - File","query":"(file.path:C\\:\\\\Users\\\\* AND file.path:*\\\\AppData\\\\Local\\\\Temp\\\\pkgmgr.exe)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","Privilege Escalation","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
