{"description":"Detects suspicious .NET assembly executions. Could detect using Cobalt Strike's command execute-assembly. Author: omkar72, oscd.community, Wojciech Lesicki. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["https://twitter.com/SBousseaden/status/1388064061087260675 - rundll32.exe with zzzzInvokeManagedCustomActionOutOfProc in command line and msiexec.exe as parent process"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9fbbe395-f009-30c1-c36b-13f47dd1e1e0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspcious CLR Logs Creation","query":"(file.path:*\\\\AppData\\\\Local\\\\Microsoft\\\\CLR* AND file.path:*\\\\UsageLogs\\\\* AND file.path:(*mshta* OR *cscript* OR *wscript* OR *regsvr32* OR *wmic* OR *rundll32* OR *svchost*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1059","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
