{"description":"Detects actions caused by the RedMimicry Winnti playbook Author: Alexander Rausch. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6ee7f3ca-fe9d-e487-3279-6e5e4d7b9976","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"RedMimicry Winnti Playbook Dropped File","query":"file.path:(*gthread\\-3.6.dll* OR *sigcmm\\-2.4.dll* OR *\\\\Windows\\\\Temp\\\\tmp.bat*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1027"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
