{"description":"Detects the creation of an executable with a system process name in a suspicious folder Author: Sander Wiebing, Tim Shelton. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["System processes copied outside the default folder"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2d4ae911-23db-733d-4567-7726591f7358","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"File Created with System Process Name","query":"(file.path:(*\\\\svchost.exe OR *\\\\rundll32.exe OR *\\\\services.exe OR *\\\\powershell.exe OR *\\\\regsvr32.exe OR *\\\\spoolsv.exe OR *\\\\lsass.exe OR *\\\\smss.exe OR *\\\\csrss.exe OR *\\\\conhost.exe OR *\\\\wininit.exe OR *\\\\lsm.exe OR *\\\\winlogon.exe OR *\\\\explorer.exe OR *\\\\taskhost.exe OR *\\\\Taskmgr.exe OR *\\\\taskmgr.exe OR *\\\\sihost.exe OR *\\\\RuntimeBroker.exe OR *\\\\runtimebroker.exe OR *\\\\smartscreen.exe OR *\\\\dllhost.exe OR *\\\\audiodg.exe OR *\\\\wlanext.exe) AND (NOT ((file.path:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\system32\\\\* OR C\\:\\\\Windows\\\\SysWow64\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\winsxs\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR \\\\SystemRoot\\\\System32\\\\*) AND process.executable:(*\\\\Windows\\\\System32\\\\dism.exe OR *\\\\TiWorker.exe)) OR (file.path:C\\:\\\\$WINDOWS.\\~BT\\\\* AND process.executable:\"C\\:\\\\$WINDOWS.\\~BT\\\\Sources\\\\SetupHost.exe\") OR (file.path:*\\\\RuntimeBroker.exe AND process.executable:\"C\\:\\\\Windows\\\\system32\\\\wbengine.exe\"))))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
