{"description":"Detects add-ins that load when Microsoft Word or Excel starts (.wll/.xll are simply .dll fit for Word or Excel). Author: NVISO. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate add-ins"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6e02b148-b406-512e-727f-32a258c6dcef","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Microsoft Office Add-In Loading","query":"(((file.path:*\\\\Microsoft\\\\Word\\\\Startup\\\\* AND file.path:*.wll) OR (file.path:*\\\\Microsoft\\\\Excel\\\\Startup\\\\* AND file.path:*.xll)) OR (file.path:*\\\\Microsoft\\\\Addins\\\\* AND file.path:(*.xlam OR *.xla)))","meta":{"from":"1m"},"severity":"high","tags":["T1137"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1137","name":"Office Application Startup","reference":"https://attack.mitre.org/techniques/T1137"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
