{"description":"A General detection for files being created in the Windows startup directory. This could be an indicator of persistence. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8e5f0a87-db26-0565-c8dd-2bb21ae213c2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Startup Folder File Write","query":"file.path:*ProgramData\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\StartUp*","meta":{"from":"1m"},"severity":"low","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
