{"description":"Detects the creation of a macro file for Outlook. Goes with win_outlook_c2_registry_key. VbaProject.OTM is explicitly mentioned in T1137. Particularly interesting if both events Registry & File Creation happens at the same time. Author: @ScoubiMtl. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["User genuinly creates a VB Macro for their email"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"915775e1-33d6-7ce5-b5a4-a36a21ab72e5","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Outlook C2 Macro Creation","query":"file.path:*\\\\Microsoft\\\\Outlook\\\\VbaProject.OTM","meta":{"from":"1m"},"severity":"medium","tags":["T1008","T1137","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1137","name":"Office Application Startup","reference":"https://attack.mitre.org/techniques/T1137"},{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
