{"description":"Attempts to access unattend.xml, where credentials are commonly stored, within the Panther directory where installation logs are stored.\nIf these files exist, their contents will be displayed. They are used to store credentials/answers during the unattended windows install process\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"16a6eda9-a7ff-5af0-e80f-f0a0a6f10b36","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Unattend.xml File Access","query":"file.path:*\\\\unattend.xml","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1552"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
