{"description":"Detects file creation patterns noticeable during the exploitation of CVE-2021-40444 Author: Florian Roth, Sittikorn S. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"79c9850f-3586-7bc2-38c2-28b354a7c373","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Suspicious Word Cab File Write CVE-2021-40444","query":"(process.executable:\"\\\\winword.exe\" AND ((file.path:*.cab AND file.path:*\\\\Windows\\\\INetCache*) OR (file.path:*\\\\AppData\\\\Local\\\\Temp\\\\* AND file.path:*.inf*)))","meta":{"from":"1m"},"severity":"critical","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
