{"description":"Aversaries may use to interact with a remote network share using Server Message Block (SMB).\nThis technique is used by post-exploitation frameworks.\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f56dc50c-5963-abf0-e145-d62177824d59","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Writing Local Admin Share","query":"(file.path:*\\\\127.0.0* AND file.path:*\\\\ADMIN$\\\\*)","meta":{"from":"1m"},"severity":"medium","tags":["Lateral Movement","T1546"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
