{"description":"Detects the default filename used in PoC code against print spooler vulnerability CVE-2021-1675 Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"af2cf5e4-95f9-b6bc-334f-e7f2fc5eb621","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"CVE-2021-1675 Print Spooler Exploitation Filename Pattern","query":"file.path:*C\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\old\\\\1\\\\123*","meta":{"from":"1m"},"severity":"critical","tags":["Privilege Escalation"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
