{"description":"Ransomware create txt file in the user Desktop Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d1ff74c3-f698-7a9d-953a-8abb3176e249","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Creation TXT File in User Desktop","query":"(process.executable:*\\\\cmd.exe AND file.path:*\\\\Users\\\\* AND file.path:*\\\\Desktop\\\\* AND file.path:*.txt)","meta":{"from":"1m"},"severity":"high","tags":["T1486"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1486","name":"Data Encrypted for Impact","reference":"https://attack.mitre.org/techniques/T1486"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
