{"description":"Detects suspicious WMI event filter and command line event consumer based on WMI and Security Logs. Author: Florian Roth, Gleb Sukhodolskiy, Timur Zinniatullin oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown (data set is too small; further testing needed)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c99b9969-744a-7293-7083-8cb9430972d2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"WMI Persistence","query":"(((winlog.event_id:\"5861\" AND (*ActiveScriptEventConsumer* OR *CommandLineEventConsumer* OR *CommandLineTemplate*)) OR winlog.event_id:\"5859\") AND (NOT (Provider:\"SCM\\ Event\\ Provider\" AND Query:select\\ *\\ from\\ MSFT_SCMEventLogEvent AND user.name:\"S\\-1\\-5\\-32\\-544\" AND PossibleCause:\"Permanent\")))","meta":{"from":"1m"},"severity":"medium","tags":["Privilege Escalation","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
