{"description": "Detects scenarios where an attacker enables the OpenSSH server and server starts to listening on SSH socket.", "enabled": false, "false_positives": ["Legitimate administrator activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3ce8e9a4-bc61-4c9b-8e69-d7e2492a8781", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "OpenSSH Server Listening On Socket", "query": "(winlog.event_id:\"4\" AND process:\"sshd\" AND payload:Server\\ listening\\ on\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.004-Remote%20Service%20SSH", "https://winaero.com/enable-openssh-server-windows-10/", "https://docs.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse", "https://virtualizationreview.com/articles/2020/05/21/ssh-server-on-windows-10.aspx", "https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16"], "timestamp_override": "event.ingested", "author": ["mdecrevoisier"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
