{"description":"Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019. Author: Tim Burrell. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9c9922a6-9f4d-fbee-ef04-62096d71475a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"GALLIUM Artefacts","query":"(winlog.channel:\"DNS\\ Server\" AND winlog.event_id:\"257\" AND QNAME:(\"asyspy256.ddns.net\" OR \"hotkillmail9sddcc.ddns.net\" OR \"rosaf112.ddns.net\" OR \"cvdfhjh1231.myftp.biz\" OR \"sz2016rose.ddns.net\" OR \"dffwescwer4325.myftp.biz\" OR \"cvdfhjh1231.ddns.net\"))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
