{"description":"This rule detects a DNS server error in which a specified plugin DLL (in registry) could not be loaded Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9769d20b-102f-23b1-7239-1d6efb701909","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"DNS Server Error Failed Loading the ServerLevelPluginDLL","query":"(winlog.channel:\"DNS\\ Server\" AND winlog.event_id:(\"150\" OR \"770\"))","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
