{"description":"Detects execution of RClone utility for exfiltration as used by various ransomwares strains like REvil, Conti, FiveHands, etc Author: Bhabesh Raj, Sittikorn S. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate RClone use"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9a594996-f700-0738-d482-9b76bdac1312","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"RClone Execution","query":"(winlog.event_data.Description:\"Rsync\\ for\\ cloud\\ storage\" OR (process.command_line:*\\-\\-config\\ * AND process.command_line:*\\-\\-no\\-check\\-certificate\\ * AND process.command_line:*\\ copy\\ *) OR (process.executable:*\\\\rclone.exe AND process.command_line:(*mega* OR *pcloud* OR *ftp* OR *\\-\\-progress* OR *\\-\\-ignore\\-existing* OR *\\-\\-auto\\-confirm* OR *\\-\\-transfers* OR *\\-\\-multi\\-thread\\-streams*)))","meta":{"from":"1m"},"severity":"high","tags":["T1567"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0010","reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1567","name":"Exfiltration Over Web Service","reference":"https://attack.mitre.org/techniques/T1567"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
