{"description":"Detects process access to LSASS which is typical for Mimikatz (0x1000 PROCESS_QUERY_ LIMITED_INFORMATION, 0x0400 PROCESS_QUERY_ INFORMATION \"only old versions\", 0x0010 PROCESS_VM_READ) Author: Sherif Eldeeb. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Some security products access LSASS in this way."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5a0ee28d-fefc-398a-1417-d0b56baa4e19","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Mimikatz Detection LSASS Access","query":"((winlog.event_data.TargetImage:*\\\\lsass.exe AND winlog.event_data.GrantedAccess:(\"0x1410\" OR \"0x1010\" OR \"0x410\")) AND (NOT (process.executable:(C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* OR C\\:\\\\Windows\\\\System32\\\\*) AND process.executable:*\\\\GamingServices.exe)))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
