{"description":"Identifies potential full network packet capture in gcp. This feature can potentially be abused to read sensitive data from unencrypted internal traffic. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Full Network Packet Capture may be done by a system or network administrator.","If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"980a7598-1e7f-4962-9372-2d754c930d0e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Google Full Network Traffic Packet Capture","query":"gcp.audit.method_name:(v*.Compute.PacketMirrorings.Get OR v*.Compute.PacketMirrorings.Delete OR v*.Compute.PacketMirrorings.Insert OR v*.Compute.PacketMirrorings.Patch OR v*.Compute.PacketMirrorings.List OR v*.Compute.PacketMirrorings.aggregatedList)","meta":{"from":"1m"},"severity":"medium","tags":["T1074"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0009","reference":"https://attack.mitre.org/tactics/TA0009","name":"Collection"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1074","name":"Data Staged","reference":"https://attack.mitre.org/techniques/T1074"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
