{"description": "Detect when a Cloud SQL DB has been modified or deleted.", "enabled": false, "false_positives": ["SQL Database being modified or deleted may be performed by a system administrator.", "Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "SQL Database modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "10205b1e-a595-daf3-dcdc-0b2545677bfa", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud SQL Database Modified or Deleted", "query": "gcp.audit.method_name:(\"cloudsql.instances.create\" OR \"cloudsql.instances.delete\" OR \"cloudsql.users.update\" OR \"cloudsql.users.delete\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/sql/docs/mysql/admin-api/rest/v1beta4/users/update"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
