{"description": "Detects the creation or patching of potential malicious RoleBinding. This includes RoleBindings and ClusterRoleBinding.", "enabled": false, "false_positives": ["RoleBindings and ClusterRoleBinding being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "RoleBindings and ClusterRoleBinding modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "cdecb17f-f7c2-0477-aefa-263ae85ccf81", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud Kubernetes RoleBinding", "query": "gcp.audit.method_name:(io.k8s.authorization.rbac.v*.clusterrolebindings.create OR io.k8s.authorization.rbac.v*.rolebindings.create OR io.k8s.authorization.rbac.v*.clusterrolebindings.patch OR io.k8s.authorization.rbac.v*.rolebindings.patch OR io.k8s.authorization.rbac.v*.clusterrolebindings.update OR io.k8s.authorization.rbac.v*.rolebindings.update OR io.k8s.authorization.rbac.v*.clusterrolebindings.delete OR io.k8s.authorization.rbac.v*.rolebindings.delete)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/elastic/detection-rules/pull/1267", "https://kubernetes.io/docs/reference/kubernetes-api/authorization-resources/cluster-role-v1/#ClusterRole", "https://cloud.google.com/kubernetes-engine/docs/how-to/role-based-access-control", "https://kubernetes.io/docs/reference/access-authn-authz/rbac/", "https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
