{"description": "Detects  when a firewall rule is modified or deleted in Google Cloud Platform (GCP).", "enabled": false, "false_positives": ["Firewall rules being modified or deleted may be performed by a system administrator. Verify that the firewall configuration change was expected.", "Exceptions can be added to this rule to filter expected behavior."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "87cc4a2a-fcca-adc7-c870-3433f2962783", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud Firewall Modified or Deleted", "query": "gcp.audit.method_name:(v*.Compute.Firewalls.Delete OR v*.Compute.Firewalls.Patch OR v*.Compute.Firewalls.Update OR v*.Compute.Firewalls.Insert)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging", "https://developers.google.com/resources/api-libraries/documentation/compute/v1/java/latest/com/google/api/services/compute/Compute.Firewalls.html"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
