{"description": "Identifies potential full network packet capture in gcp. This feature can potentially be abused to read sensitive data from unencrypted internal traffic.", "enabled": false, "false_positives": ["Full Network Packet Capture may be done by a system or network administrator.", "If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b94316c8-4335-1f82-4196-433dd99df818", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Full Network Traffic Packet Capture", "query": "gcp.audit.method_name:(v*.Compute.PacketMirrorings.Get OR v*.Compute.PacketMirrorings.Delete OR v*.Compute.PacketMirrorings.Insert OR v*.Compute.PacketMirrorings.Patch OR v*.Compute.PacketMirrorings.List OR v*.Compute.PacketMirrorings.aggregatedList)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1074"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1074", "name": "Data Staged", "reference": "https://attack.mitre.org/techniques/T1074"}]}], "version": 1, "references": ["https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging", "https://developers.google.com/resources/api-libraries/documentation/compute/v1/java/latest/com/google/api/services/compute/Compute.PacketMirrorings.html"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
