{"description": "Identifies when sensitive information is re-identified in google Cloud.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "ed70201f-1e80-6dcf-54ab-5f291650c764", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud Re-identifies Sensitive Information", "query": "gcp.audit.method_name:\"projects.content.reidentify\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1565"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1565", "name": "Data Manipulation", "reference": "https://attack.mitre.org/techniques/T1565"}]}], "version": 1, "references": ["https://cloud.google.com/dlp/docs/reference/rest/v2/projects.content/reidentify"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
