{"description": "Identifies when a service account is modified in Google Cloud.", "enabled": false, "false_positives": ["Service Account being modified may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Service Account modified from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "6b67c12e-5e40-47c6-b3b0-1e6b571184cc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud Service Account Modified", "query": "gcp.audit.method_name:(*.serviceAccounts.patch OR *.serviceAccounts.create OR *.serviceAccounts.update OR *.serviceAccounts.enable OR *.serviceAccounts.undelete)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/iam/docs/reference/rest/v1/projects.serviceAccounts"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
