{"description":"Identifies when sensitive information is re-identified in google Cloud. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"234f9f48-904b-4736-a34c-55d23919e4b7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Google Cloud Re-identifies Sensitive Information.","query":"gcp.audit.method_name:\"projects.content.reidentify\"","meta":{"from":"1m"},"severity":"medium","tags":["T1565"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1565","name":"Data Manipulation","reference":"https://attack.mitre.org/techniques/T1565"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
