{"description":"Identifies when a DNS Zone is modified or deleted in Google Cloud. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"28268a8f-191f-4c17-85b2-f5aa4fa829c3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Google Cloud DNS Zone Modified or Deleted","query":"gcp.audit.method_name:(\"Dns.ManagedZones.Delete\" OR \"Dns.ManagedZones.Update\" OR \"Dns.ManagedZones.Patch\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
