{"description": "Detects when storage bucket is enumerated in Google Cloud.", "enabled": false, "false_positives": ["Storage Buckets being enumerated may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Storage Buckets enumerated from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "da1d7790-dcf2-e39d-fe60-9b2ea03eca5a", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Google Cloud Storage Buckets Enumeration", "query": "gcp.audit.method_name:(\"storage.buckets.list\" OR \"storage.buckets.listChannels\")", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/storage/docs/json_api/v1/buckets"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
