{"description": "Detects when storage bucket is modified or deleted in Google Cloud.", "enabled": false, "false_positives": ["Storage Buckets being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Storage Buckets modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "71ca9e30-7ef6-fcd4-e78e-2836ac772d73", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud Storage Buckets Modified or Deleted", "query": "gcp.audit.method_name:(\"storage.buckets.delete\" OR \"storage.buckets.insert\" OR \"storage.buckets.update\" OR \"storage.buckets.patch\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/storage/docs/json_api/v1/buckets"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
