{"description": "Identifies when a Google Cloud Kubernetes CronJob runs in Azure Cloud. Kubernetes Job is a controller that creates one or more pods and ensures that a specified number of them successfully terminate. Kubernetes Job can be used to run containers that perform finite tasks for batch jobs. Kubernetes CronJob is used to schedule Jobs. An Adversary may use Kubernetes CronJob for scheduling execution of malicious code that would run as a container in the cluster.", "enabled": false, "false_positives": ["Google Cloud Kubernetes CronJob/Job may be done by a system administrator.", "If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "27c414d5-a2e9-5f3c-fb9e-ced22d35d957", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud Kubernetes CronJob", "query": "gcp.audit.method_name:(io.k8s.api.batch.v*.Job OR io.k8s.api.batch.v*.CronJob)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/kubernetes-engine/docs", "https://kubernetes.io/docs/concepts/workloads/controllers/cron-jobs/", "https://kubernetes.io/docs/concepts/workloads/controllers/job/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
