{"description": "Identifies when a DNS Zone is modified or deleted in Google Cloud.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "28268a8f-191f-4c17-85b2-f5aa4fa829c3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Cloud DNS Zone Modified or Deleted", "query": "gcp.audit.method_name:(\"Dns.ManagedZones.Delete\" OR \"Dns.ManagedZones.Update\" OR \"Dns.ManagedZones.Patch\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/dns/docs/reference/v1/managedZones"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
