{"description":"Identifies when the Secrets are Modified or Deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Secrets being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Secrets modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"2f0bae2d-bf20-4465-be86-1311addebaa3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Google Cloud Kubernetes Secrets Modified or Deleted","query":"gcp.audit.method_name:(io.k8s.core.v*.secrets.create OR io.k8s.core.v*.secrets.update OR io.k8s.core.v*.secrets.patch OR io.k8s.core.v*.secrets.delete)","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
