{"description":"Detects modification of autostart extensibility point (ASEP) in registry. Author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cbf93e5d-ca6c-4722-8bea-e9119007c248","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"CurrentVersion NT Autorun Keys Modification","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\Winlogon\\\\VmApplet* OR *\\\\Winlogon\\\\Userinit* OR *\\\\Winlogon\\\\Taskman* OR *\\\\Winlogon\\\\Shell* OR *\\\\Winlogon\\\\GpExtensions* OR *\\\\Winlogon\\\\AppSetup* OR *\\\\Winlogon\\\\AlternateShells\\\\AvailableShells* OR *\\\\Windows\\\\IconServiceLib* OR *\\\\Windows\\\\Appinit_Dlls* OR *\\\\Image\\ File\\ Execution\\ Options* OR *\\\\Font\\ Drivers* OR *\\\\Drivers32* OR *\\\\Windows\\\\Run* OR *\\\\Windows\\\\Load*)) AND (NOT ((winlog.event_data.Details:\"\\(Empty\\)\") OR (process.executable:C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Temp\\\\* AND process.executable:*\\\\MicrosoftEdgeUpdate.exe) OR (winlog.event_data.TargetObject:(*\\\\ClickToRunStore\\\\HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\* OR *\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\*) OR process.executable:(\"C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\") OR winlog.event_data.TargetObject:(*\\\\Image\\ File\\ Execution\\ Options\\\\OSPPREARM.EXE\\\\DisableExceptionChainValidation OR *\\\\Image\\ File\\ Execution\\ Options\\\\LICLUA.EXE\\\\DisableExceptionChainValidation)) OR (process.executable:*\\\\DropboxUpdate.exe AND winlog.event_data.TargetObject:*\\\\Image\\ File\\ Execution\\ Options\\\\DropboxUpdate.exe\\\\DisableExceptionChainValidation) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe))))","meta":{"from":"1m"},"severity":"medium","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
