{"description":"Detects the manipulation of persistent URLs which could execute malicious code Author: Tobias Michalski. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"487bb375-12ef-41f6-baae-c6a1572b4dd1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Persistent Outlook Landing Pages","query":"((winlog.event_data.TargetObject:(*Software\\\\Microsoft\\\\Office\\\\* OR *\\\\Outlook\\\\Today\\\\*) AND ((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*Stamp AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\") OR winlog.event_data.TargetObject:*UserDefinedUrl)) AND (NOT ((process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe))))","meta":{"from":"1m"},"severity":"high","tags":["T1112"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
