{"description":"Detects new registry key created by Ursnif malware. Author: megan201296. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"40b5ace1-f787-73d7-4cc8-c86614d097fa","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Ursnif","query":"(winlog.event_data.TargetObject:*\\\\Software\\\\AppDataLow\\\\Software\\\\Microsoft\\\\* AND (NOT (winlog.event_data.TargetObject:(*\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\Internet\\ Explorer\\\\* OR *\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\RepService\\\\* OR *\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\IME\\\\* OR *\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\Edge\\\\*))))","meta":{"from":"1m"},"severity":"critical","tags":["T1112"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
