{"description":"Detects modification of autostart extensibility point (ASEP) in registry. Author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"96c15a0a-07f3-e2cd-a409-445ec200d4ab","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Wow6432Node CurrentVersion Autorun Keys Modification","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run\\\\* OR *\\\\RunOnce\\\\* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects*)) AND (NOT ((winlog.event_data.Details:\"\\(Empty\\)\") OR (process.executable:*C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\\\{* AND process.executable:*\\\\setup.exe*) OR (process.executable:\"C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\OfficeClickToRun.exe\" AND winlog.event_data.TargetObject:*\\\\Office\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Wow6432Node\\\\*) OR (process.executable:(\"C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\") AND winlog.event_data.TargetObject:*\\\\Explorer\\\\Browser\\ Helper\\ Objects\\\\\\{31D09BA0\\-12F5\\-4CCE\\-BE8A\\-2923E76605DA\\}\\\\*) OR (winlog.event_data.Details:*\\-A251\\-47B7\\-93E1\\-CDD82E34AF8B\\} OR winlog.event_data.Details:\"grpconv\\ \\-o\" OR winlog.event_data.Details:*C\\:\\\\Program\\ Files* AND winlog.event_data.Details:*\\\\Dropbox\\\\Client\\\\Dropbox.exe* AND winlog.event_data.Details:*\\ \\/systemstartup*) OR (winlog.event_data.TargetObject:*\\\\Explorer\\\\Browser\\ Helper\\ Objects\\\\\\{92EF2EAD\\-A7CE\\-4424\\-B0DB\\-499CF856608E\\}\\\\NoExplorer) OR (process.executable:*\\\\windowsdesktop\\-runtime\\-* AND winlog.event_data.TargetObject:(*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{e2d1ae32\\-dd1d\\-4ad7\\-a298\\-10e42e7840fc\\} OR *\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{7037b699\\-7382\\-448c\\-89a7\\-4765961d2537\\}) AND winlog.event_data.Details:(\\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\\\{7037b699\\-7382\\-448c\\-89a7\\-4765961d2537\\}\\\\windowsdesktop\\-runtime\\-* OR \\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\\\{e2d1ae32\\-dd1d\\-4ad7\\-a298\\-10e42e7840fc\\}\\\\windowsdesktop\\-runtime\\-*) AND winlog.event_data.Details:*.exe\\\"\\ \\/burn.runonce) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe))))","meta":{"from":"1m"},"severity":"medium","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
