{"description":"Enable Dynamic Data Exchange protocol (DDE) in all supported editions of Microsoft Word or Excel. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"63647769-326d-4dde-a419-b925cc0caf42","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Enable Microsoft Dynamic Data Exchange","query":"(winlog.event_data.EventType:\"SetValue\" AND ((winlog.event_data.TargetObject:*\\\\Word\\\\Security\\\\AllowDDE AND winlog.event_data.Details:(\"DWORD\\ \\(0x00000001\\)\" OR \"DWORD\\ \\(0x00000002\\)\")) OR (winlog.event_data.TargetObject:(*\\\\Excel\\\\Security\\\\DisableDDEServerLaunch OR *\\\\Excel\\\\Security\\\\DisableDDEServerLookup) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")))","meta":{"from":"1m"},"severity":"medium","tags":["T1559"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1559","name":"Inter-Process Communication","reference":"https://attack.mitre.org/techniques/T1559"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
