{"description":"Detects disabling the CrashDump per registry (as used by HermeticWiper) Author: Tobias Michalski. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate disabling of crashdumps"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2ff692c2-4594-41ec-8fcb-46587de769e0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"CrashControl CrashDump Disabled","query":"(winlog.event_data.TargetObject:*SYSTEM\\\\CurrentControlSet\\\\Control\\\\CrashControl* AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")","meta":{"from":"1m"},"severity":"medium","tags":["T1112","T1564"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
