{"description":"Detects the modification of the registry settings used for Internet Explorer and other Windows components that use these settings Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"fdc69740-bd97-393a-64a5-e6627723cfa1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Modification of IE Registry Settings","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet\\ Settings*) AND (NOT ((winlog.event_data.Details:DWORD*) OR (winlog.event_data.Details:(\"Cookie\\:\" OR \"Visited\\:\" OR \"\\(Empty\\)\")) OR (winlog.event_data.TargetObject:(*\\\\Cache* OR *\\\\ZoneMap*)) OR (winlog.event_data.Details:\"Binary\\ Data\"))))","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
