{"description":"Remove the AMSI Provider registry key in HKLM\\Software\\Microsoft\\AMSI to disable AMSI inspection Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6ffb8e9d-aa1b-6618-0deb-5200df3e22df","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Removal Amsi Provider Reg Key","query":"(winlog.event_data.EventType:\"DeleteKey\" AND winlog.event_data.TargetObject:(*\\{2781761E\\-28E0\\-4109\\-99FE\\-B9D127C57AFE\\} OR *\\{A7C452EF\\-8E9F\\-42EB\\-9F2B\\-245613CA0DC9\\}))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
