{"description":"Detects modification of autostart extensibility point (ASEP) in registry. Author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4f527ad4-b70a-5053-9a09-6523c5d622f4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Autorun Keys Modification","query":"(((((((((((((winlog.event_data.TargetObject:(*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\ CE\\ Services\\\\AutoStart* OR *\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Command\\ Processor\\\\Autorun* OR *\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ CE\\ Services\\\\AutoStartOnDisconnect* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ CE\\ Services\\\\AutoStartOnConnect* OR *\\\\SYSTEM\\\\Setup\\\\CmdLine* OR *\\\\Software\\\\Microsoft\\\\Ctf\\\\LangBarAddin* OR *\\\\Software\\\\Microsoft\\\\Command\\ Processor\\\\Autorun* OR *\\\\SOFTWARE\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components* OR *\\\\SOFTWARE\\\\Classes\\\\Protocols\\\\Handler* OR *\\\\SOFTWARE\\\\Classes\\\\Protocols\\\\Filter* OR *\\\\SOFTWARE\\\\Classes\\\\Htmlfile\\\\Shell\\\\Open\\\\Command\\\\\\(Default\\)* OR *\\\\Environment\\\\UserInitMprLogonScript* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\Control\\ Panel\\\\Desktop\\\\Scrnsave.exe* OR *\\\\Software\\\\Microsoft\\\\Internet\\ Explorer\\\\UrlSearchHooks* OR *\\\\SOFTWARE\\\\Microsoft\\\\Internet\\ Explorer\\\\Desktop\\\\Components* OR *\\\\Software\\\\Classes\\\\Clsid\\\\\\{AB8902B4\\-09CA\\-4bb6\\-B78D\\-A8F59079A8D5\\}\\\\Inprocserver32* OR *\\\\Control\\ Panel\\\\Desktop\\\\Scrnsave.exe*) OR (winlog.event_data.TargetObject:*\\\\System\\\\CurrentControlSet\\\\Control\\\\Session\\ Manager* AND winlog.event_data.TargetObject:(*\\\\SetupExecute* OR *\\\\S0InitialCommand* OR *\\\\KnownDlls* OR *\\\\Execute* OR *\\\\BootExecute* OR *\\\\AppCertDlls*))) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run* OR *\\\\Policies\\\\System\\\\Shell* OR *\\\\Policies\\\\Explorer\\\\Run* OR *\\\\Group\\ Policy\\\\Scripts\\\\Startup* OR *\\\\Group\\ Policy\\\\Scripts\\\\Shutdown* OR *\\\\Group\\ Policy\\\\Scripts\\\\Logon* OR *\\\\Group\\ Policy\\\\Scripts\\\\Logoff* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects* OR *\\\\Authentication\\\\PLAP\\ Providers* OR *\\\\Authentication\\\\Credential\\ Providers* OR *\\\\Authentication\\\\Credential\\ Provider\\ Filters*))) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\Winlogon\\\\VmApplet* OR *\\\\Winlogon\\\\Userinit* OR *\\\\Winlogon\\\\Taskman* OR *\\\\Winlogon\\\\Shell* OR *\\\\Winlogon\\\\GpExtensions* OR *\\\\Winlogon\\\\AppSetup* OR *\\\\Winlogon\\\\AlternateShells\\\\AvailableShells* OR *\\\\Windows\\\\IconServiceLib* OR *\\\\Windows\\\\Appinit_Dlls* OR *\\\\Image\\ File\\ Execution\\ Options* OR *\\\\Font\\ Drivers* OR *\\\\Drivers32* OR *\\\\Windows\\\\Run* OR *\\\\Windows\\\\Load*))) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects*))) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\Windows\\\\Appinit_Dlls* OR *\\\\Image\\ File\\ Execution\\ Options* OR *\\\\Drivers32*))) OR ((winlog.event_data.TargetObject:*\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Office* OR winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Office*) AND winlog.event_data.TargetObject:(*\\\\Word\\\\Addins* OR *\\\\PowerPoint\\\\Addins* OR *\\\\Outlook\\\\Addins* OR *\\\\Onenote\\\\Addins* OR *\\\\Excel\\\\Addins* OR *\\\\Access\\\\Addins* OR *test\\\\Special\\\\Perf*))) OR ((winlog.event_data.TargetObject:*\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Internet\\ Explorer* OR winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Internet\\ Explorer*) AND winlog.event_data.TargetObject:(*\\\\Toolbar* OR *\\\\Extensions* OR *\\\\Explorer\\ Bars*))) OR (winlog.event_data.TargetObject:*\\\\Software\\\\Wow6432Node\\\\Classes* AND winlog.event_data.TargetObject:(*\\\\Folder\\\\ShellEx\\\\ExtShellFolderViews* OR *\\\\Folder\\\\ShellEx\\\\DragDropHandlers* OR *\\\\Folder\\\\ShellEx\\\\ColumnHandlers* OR *\\\\Directory\\\\Shellex\\\\DragDropHandlers* OR *\\\\Directory\\\\Shellex\\\\CopyHookHandlers* OR *\\\\CLSID\\\\\\{AC757296\\-3522\\-4E11\\-9862\\-C17BE5A1767E\\}\\\\Instance* OR *\\\\CLSID\\\\\\{ABE3B9A4\\-257D\\-4B97\\-BD1A\\-294AF496222E\\}\\\\Instance* OR *\\\\CLSID\\\\\\{7ED96837\\-96F0\\-4812\\-B211\\-F13C24117ED3\\}\\\\Instance* OR *\\\\CLSID\\\\\\{083863F1\\-70DE\\-11d0\\-BD40\\-00A0C911CE86\\}\\\\Instance* OR *\\\\AllFileSystemObjects\\\\ShellEx\\\\DragDropHandlers* OR *\\\\ShellEx\\\\PropertySheetHandlers* OR *\\\\ShellEx\\\\ContextMenuHandlers*))) OR (winlog.event_data.TargetObject:*\\\\Software\\\\Classes* AND winlog.event_data.TargetObject:(*\\\\Folder\\\\ShellEx\\\\ExtShellFolderViews* OR *\\\\Folder\\\\ShellEx\\\\DragDropHandlers* OR *\\\\Folder\\\\Shellex\\\\ColumnHandlers* OR *\\\\Filter* OR *\\\\Exefile\\\\Shell\\\\Open\\\\Command\\\\\\(Default\\)* OR *\\\\Directory\\\\Shellex\\\\DragDropHandlers* OR *\\\\Directory\\\\Shellex\\\\CopyHookHandlers* OR *\\\\CLSID\\\\\\{AC757296\\-3522\\-4E11\\-9862\\-C17BE5A1767E\\}\\\\Instance* OR *\\\\CLSID\\\\\\{ABE3B9A4\\-257D\\-4B97\\-BD1A\\-294AF496222E\\}\\\\Instance* OR *\\\\CLSID\\\\\\{7ED96837\\-96F0\\-4812\\-B211\\-F13C24117ED3\\}\\\\Instance* OR *\\\\CLSID\\\\\\{083863F1\\-70DE\\-11d0\\-BD40\\-00A0C911CE86\\}\\\\Instance* OR *\\\\Classes\\\\AllFileSystemObjects\\\\ShellEx\\\\DragDropHandlers* OR *\\\\.exe* OR *\\\\.cmd* OR *\\\\ShellEx\\\\PropertySheetHandlers* OR *\\\\ShellEx\\\\ContextMenuHandlers*))) OR (winlog.event_data.TargetObject:*\\\\Software\\\\Policies\\\\Microsoft\\\\Windows\\\\System\\\\Scripts* AND winlog.event_data.TargetObject:(*\\\\Startup* OR *\\\\Shutdown* OR *\\\\Logon* OR *\\\\Logoff*))) OR (winlog.event_data.TargetObject:*\\\\System\\\\CurrentControlSet\\\\Services\\\\WinSock2\\\\Parameters* AND winlog.event_data.TargetObject:(*\\\\Protocol_Catalog9\\\\Catalog_Entries* OR *\\\\NameSpace_Catalog5\\\\Catalog_Entries*))) OR (winlog.event_data.TargetObject:*\\\\SYSTEM\\\\CurrentControlSet\\\\Control* AND winlog.event_data.TargetObject:(*\\\\Terminal\\ Server\\\\WinStations\\\\RDP\\-Tcp\\\\InitialProgram* OR *\\\\Terminal\\ Server\\\\Wds\\\\rdpwd\\\\StartupPrograms* OR *\\\\SecurityProviders\\\\SecurityProviders* OR *\\\\SafeBoot\\\\AlternateShell* OR *\\\\Print\\\\Providers* OR *\\\\Print\\\\Monitors* OR *\\\\NetworkProvider\\\\Order* OR *\\\\Lsa\\\\Notification\\ Packages* OR *\\\\Lsa\\\\Authentication\\ Packages* OR *\\\\BootVerificationProgram\\\\ImagePath*))) AND (NOT (winlog.event_data.Details:\"\\(Empty\\)\" OR winlog.event_data.TargetObject:*\\\\NgcFirst\\\\ConsecutiveSwitchCount OR process.executable:\"C\\:\\\\WINDOWS\\\\System32\\\\svchost.exe\")))","meta":{"from":"1m"},"severity":"medium","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
