{"description":"Detects disabling Windows Defender PUA protection Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a69b6f5a-e936-cb7f-9f4f-187cbe818226","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Disable PUA Protection on Windows Defender","query":"(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\PUAProtection* AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
