{"description":"Sysmon registry detection of a local hidden user account. Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a9ec1fac-9667-e57a-1cd0-046ab3578565","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Creation of a Local Hidden User Account by Registry","query":"(winlog.event_data.TargetObject:HKLM\\\\SAM\\\\SAM\\\\Domains\\\\Account\\\\Users\\\\Names\\\\* AND winlog.event_data.TargetObject:*$ AND process.executable:*lsass.exe)","meta":{"from":"1m"},"severity":"high","tags":["T1136"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
