{"description":"Detects when a user enables DNS-over-HTTPS. This can be used to hide internet activity or be used to hide the process of exfiltrating data. With this enabled organization will lose visibility into data such as query type, response and originating IP that are used to determine bad actors. Author: Austin Songer. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"b017e15c-b8a7-9d39-c605-b8b74b2c9dc9","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"DNS-over-HTTPS Enabled by Registry","query":"(winlog.event_data.EventType:\"SetValue\" AND ((winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Edge\\\\BuiltInDnsClientEnabled AND winlog.event_data.Details:\"DWORD\\ \\(1\\)\") OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Google\\\\Chrome\\\\DnsOverHttpsMode AND winlog.event_data.Details:\"DWORD\\ \\(secure\\)\") OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Policies\\\\Mozilla\\\\Firefox\\\\DNSOverHTTPS\\\\Enabled AND winlog.event_data.Details:\"DWORD\\ \\(1\\)\")))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1112","T1140"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"},{"id":"T1140","name":"Deobfuscate/Decode Files or Information","reference":"https://attack.mitre.org/techniques/T1140"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
