{"description":"Detects modification of autostart extensibility point (ASEP) in registry. Author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e7c4106e-df8e-9350-4114-3eb7d23981ad","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Office Autorun Keys Modification","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Office* OR *\\\\Software\\\\Microsoft\\\\Office*) AND winlog.event_data.TargetObject:(*\\\\Word\\\\Addins* OR *\\\\PowerPoint\\\\Addins* OR *\\\\Outlook\\\\Addins* OR *\\\\Onenote\\\\Addins* OR *\\\\Excel\\\\Addins* OR *\\\\Access\\\\Addins* OR *test\\\\Special\\\\Perf*)) AND (NOT (winlog.event_data.Details:\"\\(Empty\\)\")))","meta":{"from":"1m"},"severity":"medium","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
