{"description":"Detects changes to the Registry in which a monitor program gets registered to dump process memory of the lsass.exe process memory Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"94458f2f-79ad-c8d5-a1a9-69fc7518752e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"SilentProcessExit Monitor Registrytion for LSASS","query":"winlog.event_data.TargetObject:*Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SilentProcessExit\\\\lsass.exe*","meta":{"from":"1m"},"severity":"critical","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
