{"description":"Detects the installation of the Azure Hybrid Connection Manager service to allow remote code execution from Azure function. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"63aea690-d9bf-e4ce-14a6-1a593d841992","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"HybridConnectionManager Service Installation","query":"(winlog.event_data.TargetObject:*\\\\Services\\\\HybridConnectionManager* OR (winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.Details:*Microsoft.HybridConnectionManager.Listener.exe*))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
