{"description":"A General detection for a new application in AppCompat. This indicates an application executing for the first time on an endpoint. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["This rule is to explore new applications on an endpoint. False positives depends on the organization.","Newly setup system.","Legitimate installation of new application."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e878ebf6-87da-32ea-35a3-7cdd97f7b498","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"New Application in AppCompat","query":"winlog.event_data.TargetObject:*\\\\AppCompatFlags\\\\Compatibility\\ Assistant\\\\Store\\\\*","meta":{"from":"1m"},"severity":"low","tags":["T1204"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
