{"description":"Detects a suspicious printer driver installation with an empty Manufacturer value Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Alerts on legitimate printer drivers that do not set any more details in the Manufacturer value"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c09d2d66-a96b-fdf1-8c18-cb584b6e31b0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Printer Driver Empty Manufacturer","query":"(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Control\\\\Print\\\\Environments\\\\Windows\\ x64\\\\Drivers* AND winlog.event_data.TargetObject:*\\\\Manufacturer* AND winlog.event_data.Details:\"\\(Empty\\)\")","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
