{"description":"Detects potential malicious modification of the property value of UseLogonCredential from HKLM:\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest to enable clear-text credentials Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5ac8d324-9ddc-eff6-8901-02d84bee2f6d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Wdigest Enable UseLogonCredential","query":"winlog.event_data.TargetObject:*WDigest\\\\UseLogonCredential","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
