{"description":"Detects the keyboard preload installation with a suspicious keyboard layout, e.g. Chinese, Iranian or Vietnamese layout load in user session on systems maintained by US staff only Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrators or users that actually use the selected keyboard layouts (heavily depends on the organisation's user base)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"62121b10-397a-90d3-11f2-469c8c6e5d29","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Keyboard Layout Load","query":"(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Keyboard\\ Layout\\\\Preload\\\\* OR *\\\\Keyboard\\ Layout\\\\Substitutes\\\\*) AND winlog.event_data.Details:(*00000429* OR *00050429* OR *0000042a*))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
