{"description":"Detects changes to the Registry in which a monitor program gets registered to monitor the exit of another process Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ed0761e2-3aa1-8695-94ca-94966eee357a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"SilentProcessExit Monitor Registrytion","query":"(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SilentProcessExit* AND winlog.event_data.Details:*MonitorProcess*)","meta":{"from":"1m"},"severity":"high","tags":["T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
