{"description":"Adversaries may abuse features of Winlogon to execute DLLs and/or executables when a user logs in.\nWinlogon.exe is a Windows component responsible for actions at logon/logoff as well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete.\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"bbf180f9-cc58-d034-0800-0b68b4eff046","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Winlogon Notify Key Logon Persistence","query":"(winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon\\\\Notify\\\\logon AND winlog.event_data.Details:*.dll AND winlog.event_data.EventType:\"SetValue\")","meta":{"from":"1m"},"severity":"high","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
