{"description":"BlackByte set three different registry values to escalate privileges and begin setting the stage for lateral movement and encryption Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"461df8e3-268f-f290-4c28-d44365c828a8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Blackbyte Ransomware Registry","query":"(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(\"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\\\\LocalAccountTokenFilterPolicy\" OR \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\\\\EnableLinkedConnections\" OR \"HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\FileSystem\\\\LongPathsEnabled\") AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\")","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
