{"description":"Detects the abuse of the exefile handler in new file association. Used for bypass of security products. Author: Andreas Hunkeler (@Karneades). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"66e0f872-9e0f-365b-c794-c51543cada0f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"New File Association Using Exefile","query":"(winlog.event_data.TargetObject:*Classes\\\\.* AND winlog.event_data.Details:\"exefile\" AND winlog.event_data.EventType:\"SetValue\")","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
