{"description":"Use IE registry to hide a scripts Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7223aae1-8cc9-056c-ddfa-7e1acfed7dc0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Use IE Registry for Persistence","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet\\ Settings*) AND (NOT ((winlog.event_data.Details:DWORD*) OR (winlog.event_data.Details:(\"Cookie\\:\" OR \"Visited\\:\" OR \"\\(Empty\\)\")))))","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
