{"description":"Detects the creation of a new user account. Such accounts may be used for persistence that do not require persistent remote access tools to be deployed on the system. Author: Alejandro Ortuno, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"51719bf5-e4fd-4e44-8ba8-b830e7ac0731","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Creation Of A Local User Account","query":"(process.executable:*\\/dscl AND process.command_line:*create*)","meta":{"from":"1m"},"severity":"low","tags":["T1136"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
