{"description":"Detects attempts to masquerade as legitimate files by adding a space to the end of the filename. Author: remotephone. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Mistyped commands or legitimate binaries named to match the pattern"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"b6e2a2e3-2d30-43b1-a4ea-071e36595690","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Space After Filename - macOS","query":"(process.command_line:*\\  OR ImageName:*\\ )","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
