{"description":"Adversaries may shutdown/reboot systems to interrupt access to, or aid in the destruction of, those systems. Author: Igor Fits, Mikhail Larin, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"40b1fbe2-18ea-4ee7-be47-0294285811de","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"System Shutdown/Reboot","query":"process.executable:(*\\/shutdown OR *\\/reboot OR *\\/halt)","meta":{"from":"1m"},"severity":"low","tags":["T1529"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1529","name":"System Shutdown/Reboot","reference":"https://attack.mitre.org/techniques/T1529"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
