{"description":"Detects usage of system utilities to discover system network connections Author: Daniil Yugoslavskiy, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"9a7a0393-2144-4626-9bf1-7c2f5a7321db","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"System Network Connections Discovery","query":"process.executable:(\"\\/usr\\/bin\\/who\" OR \"\\/usr\\/bin\\/w\" OR \"\\/usr\\/bin\\/last\" OR \"\\/usr\\/sbin\\/lsof\" OR \"\\/usr\\/sbin\\/netstat\")","meta":{"from":"1m"},"severity":"low","tags":["T1049"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1049","name":"System Network Connections Discovery","reference":"https://attack.mitre.org/techniques/T1049"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
