{"description":"Detects enumeration of local system groups Author: Ömer Günal, Alejandro Ortuno, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"89bb1f97-c7b9-40e8-b52b-7d6afbd67276","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Local Groups Discovery","query":"((process.executable:*\\/dscacheutil AND process.command_line:*\\-q* AND process.command_line:*group*) OR (process.executable:*\\/cat AND process.command_line:*\\/etc\\/group*) OR (process.executable:*\\/dscl AND process.command_line:*\\-list* AND process.command_line:*\\/groups*))","meta":{"from":"1m"},"severity":"low","tags":["T1069"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
