{"description":"Detects enumeration of local or remote network services. Author: Alejandro Ortuno, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"84bae5d4-b518-4ae0-b331-6d4afd34d00f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"MacOS Network Service Scanning","query":"((process.executable:(*\\/nc OR *\\/netcat) AND (NOT (process.command_line:*l*))) OR process.executable:(*\\/nmap OR *\\/telnet))","meta":{"from":"1m"},"severity":"low","tags":["T1046"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1046","name":"Network Service Scanning","reference":"https://attack.mitre.org/techniques/T1046"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
