{"description":"Detects execution of AppleScript of the macOS scripting language AppleScript. Author: Alejandro Ortuno, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Application installers might contain scripts as part of the installation process."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"1bc2e6c5-0885-472b-bed6-be5ea8eace55","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"MacOS Scripting Interpreter AppleScript","query":"(process.executable:*\\/osascript AND process.command_line:*\\-e*)","meta":{"from":"1m"},"severity":"medium","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
