{"description": "Detects registry key used by Leviathan APT in Malaysian focused campaign", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "13f3f239-0bf5-bc85-f0fa-3e9c87d5eefc", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Leviathan Registry Key Activity", "query": "winlog.event_data.TargetObject:\"HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\ntkd\"", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://www.elastic.co/blog/advanced-techniques-used-in-malaysian-focused-apt-campaign"], "timestamp_override": "event.ingested", "author": ["Aidan Bracher"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
