{"description": "Detects FlowCloud malware from threat group TA410.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "57392210-9604-1ba2-d9d2-99f4d23ca350", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "FlowCloud Malware", "query": "(winlog.event_data.TargetObject:(\"HKLM\\\\HARDWARE\\\\\\{804423C2\\-F490\\-4ac3\\-BFA5\\-13DEDE63A71A\\}\" OR \"HKLM\\\\HARDWARE\\\\\\{A5124AF5\\-DF23\\-49bf\\-B0ED\\-A18ED3DEA027\\}\" OR \"HKLM\\\\HARDWARE\\\\\\{2DB80286\\-1784\\-48b5\\-A751\\-B6ED1F490303\\}\") OR winlog.event_data.TargetObject:HKLM\\\\SYSTEM\\\\Setup\\\\PrintResponsor\\\\*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1112"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.proofpoint.com/us/blog/threat-insight/ta410-group-behind-lookback-attacks-against-us-utilities-sector-returns-new"], "timestamp_override": "event.ingested", "author": ["NVISO"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
