{"description": "Detects static QMS 810 and mimikatz driver name used by Mimikatz as exploited in CVE-2021-1675 and CVE-2021-34527", "author": ["Markus Neis", "@markus_neis", "Florian Roth"], "enabled": false, "false_positives": ["Legitimate installation of printer driver QMS 810, Texas Instruments microLaser printer (unlikely)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ba6b9e43-1d45-4d3c-a504-1043a64c8469", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "PrinterNightmare Mimikatz Driver Name", "query": "((((winlog.event_data.TargetObject:(/.*\\\\\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\\\\\[Pp][Rr][Ii][Nn][Tt]\\\\\\\\[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt][Ss]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Xx]64\\\\\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\\\\\[Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\-3\\\\\\\\[Qq][Mm][Ss]\\ 810\\\\\\\\.*/ OR /.*\\\\\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\\\\\[Pp][Rr][Ii][Nn][Tt]\\\\\\\\[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt][Ss]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Xx]64\\\\\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\\\\\[Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\-3\\\\\\\\[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz].*/)) OR ((winlog.event_data.TargetObject:*legitprinter* AND winlog.event_data.TargetObject:/.*\\\\\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\\\\\[Pp][Rr][Ii][Nn][Tt]\\\\\\\\[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt][Ss]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss].*/)))) OR ((winlog.event_data.TargetObject:(/.*\\\\\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\\\\\[Pp][Rr][Ii][Nn][Tt]\\\\\\\\[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt][Ss].*/ OR /.*\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\\\\\[Pp][Rr][Ii][Nn][Tt]\\\\\\\\[Pp][Rr][Ii][Nn][Tt][Ee][Rr][Ss].*/) AND winlog.event_data.TargetObject:(/.*[Gg][Ee][Nn][Tt][Ii][Ll]\\ [Kk][Ii][Ww][Ii].*/ OR /.*[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz]\\ [Pp][Rr][Ii][Nn][Tt][Ee][Rr].*/ OR /.*[Kk][Ii][Ww][Ii]\\ [Ll][Ee][Gg][Ii][Tt]\\ [Pp][Rr][Ii][Nn][Tt][Ee][Rr].*/))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://github.com/gentilkiwi/mimikatz/commit/c21276072b3f2a47a21e215a46962a17d54b3760", "https://www.lexjansen.com/sesug/1993/SESUG93035.pdf", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rprn/4464eaf0-f34f-40d5-b970-736437a21913", "https://nvd.nist.gov/vuln/detail/cve-2021-1675", "https://nvd.nist.gov/vuln/detail/cve-2021-34527"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
