{"description": "Detects disabling the CrashDump per registry (as used by HermeticWiper)", "enabled": false, "false_positives": ["Legitimate disabling of crashdumps"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a416d91c-a435-d8ad-b4c0-1d4de5487fad", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CrashControl CrashDump Disabled", "query": "(winlog.event_data.TargetObject:*SYSTEM\\\\CurrentControlSet\\\\Control\\\\CrashControl* AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1112", "T1564"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/"], "timestamp_override": "event.ingested", "author": ["Tobias Michalski"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
