{"description": "Detects the shell open key manipulation (exefile and ms-settings) used for persistence and the pattern of UAC Bypass using fodhelper.exe, computerdefaults.exe, slui.exe via registry keys (e.g. UACMe 33 or 62)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "152f3630-77c1-4284-bcc0-4cc68ab2f6e7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Shell Open Registry Keys Manipulation", "query": "(((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*Classes\\\\ms\\-settings\\\\shell\\\\open\\\\command\\\\SymbolicLinkValue AND winlog.event_data.Details:*\\\\Software\\\\Classes\\\\\\{*) OR winlog.event_data.TargetObject:*Classes\\\\ms\\-settings\\\\shell\\\\open\\\\command\\\\DelegateExecute) OR ((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*Classes\\\\ms\\-settings\\\\shell\\\\open\\\\command\\\\\\(Default\\) OR *Classes\\\\exefile\\\\shell\\\\open\\\\command\\\\\\(Default\\))) AND (NOT (winlog.event_data.Details:\"\\(Empty\\)\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1546", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}, {"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://github.com/hfiref0x/UACME", "https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/", "https://github.com/RhinoSecurityLabs/Aggressor-Scripts/tree/master/UACBypass", "https://tria.ge/211119-gs7rtshcfr/behavioral2 [Lokibot sample from Nov 2021]"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
