{"description": "Detects abusing Windows 10 Narrator's Feedback-Hub", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f663a6d9-9d1b-49b8-b2b1-0637914d199a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Narrator's Feedback-Hub Persistence", "query": "((winlog.event_data.EventType:\"DeleteValue\" AND winlog.event_data.TargetObject:*\\\\AppXypsaf9f1qserqevf0sws76dx4k9a5206\\\\Shell\\\\open\\\\command\\\\DelegateExecute) OR winlog.event_data.TargetObject:*\\\\AppXypsaf9f1qserqevf0sws76dx4k9a5206\\\\Shell\\\\open\\\\command\\\\\\(Default\\))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://giuliocomi.blogspot.com/2019/10/abusing-windows-10-narrators-feedback.html"], "timestamp_override": "event.ingested", "author": ["Dmitriy Lifanov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
