{"description": "Detects the modification of PortProxy registry key which is used for port forwarding. For command execution see rule win_netsh_port_fwd.yml.", "enabled": false, "false_positives": ["WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)", "Synergy Software KVM (https://symless.com/synergy)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "990c8c54-16a9-ed8f-afcf-0020eb071e31", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PortProxy Registry Key", "query": "winlog.event_data.TargetObject:\"HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\PortProxy\\\\v4tov4\\\\tcp\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Lateral Movement", "T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html", "https://adepts.of0x.cc/netsh-portproxy-code/", "https://www.dfirnotes.net/portproxy_detection/"], "timestamp_override": "event.ingested", "author": ["Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
