{"description": "Alerts on trust record modification within the registry, indicating usage of macros", "author": ["Antonlovesdnb", "Trent Liffick (@tliffick)"], "enabled": false, "false_positives": ["This will alert on legitimate macro usage as well, additional tuning is required"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "295a59c1-7b79-4b47-a930-df12c15fc9c2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Registry Trust Record Modification", "query": "winlog.event_data.TargetObject:/.*\\\\\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\\\\\[Tt][Rr][Uu][Ss][Tt][Ee][Dd]\\ [Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Ss]\\\\\\\\[Tt][Rr][Uu][Ss][Tt][Rr][Ee][Cc][Oo][Rr][Dd][Ss].*/", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://outflank.nl/blog/2018/01/16/hunting-for-evil-detect-macros-being-executed/", "http://az4n6.blogspot.com/2016/02/more-on-trust-records-macros-and.html", "https://twitter.com/inversecos/status/1494174785621819397"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
