{"description": "Rule to detect the configuration of Run Once registry key. Configured payload can be run by runonce.exe /AlternateShellStartup", "enabled": false, "false_positives": ["Legitimate modification of the registry key by legitimate program"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c74d7efc-8826-45d9-b8bb-f04fac9e4eff", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Run Once Task Configuration in Registry", "query": "((winlog.event_data.TargetObject:HKLM\\\\SOFTWARE\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components* AND winlog.event_data.TargetObject:*\\\\StubPath) AND (NOT ((winlog.event_data.Details:\\\"C\\:\\\\Program\\ Files\\\\Google\\\\Chrome\\\\Application\\\\* AND winlog.event_data.Details:*\\\\Installer\\\\chrmstp.exe\\\"\\ \\-\\-configure\\-user\\-settings\\ \\-\\-verbose\\-logging\\ \\-\\-system\\-level) OR (winlog.event_data.Details:(\\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\* OR \\\"C\\:\\\\Program\\ Files\\\\Microsoft\\\\Edge\\\\Application\\\\*) AND winlog.event_data.Details:*\\\\Installer\\\\setup.exe\\\"\\ \\-\\-configure\\-user\\-settings\\ \\-\\-verbose\\-logging\\ \\-\\-system\\-level\\ \\-\\-msedge\\ \\-\\-channel\\=stable))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/pabraeken/status/990717080805789697", "https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runonce.yml"], "timestamp_override": "event.ingested", "author": ["Avneet Singh @v3t0_", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
