{"description": "Detects static QMS 810 and mimikatz driver name used by Mimikatz as exploited in CVE-2021-1675 and CVE-2021-34527", "enabled": false, "false_positives": ["Legitimate installation of printer driver QMS 810, Texas Instruments microLaser printer (unlikely)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ba6b9e43-1d45-4d3c-a504-1043a64c8469", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "PrinterNightmare Mimimkatz Driver Name", "query": "((winlog.event_data.TargetObject:(*\\\\Control\\\\Print\\\\Environments\\\\Windows\\ x64\\\\Drivers\\\\Version\\-3\\\\QMS\\ 810\\\\* OR *\\\\Control\\\\Print\\\\Environments\\\\Windows\\ x64\\\\Drivers\\\\Version\\-3\\\\mimikatz*) OR (winlog.event_data.TargetObject:*legitprinter* AND winlog.event_data.TargetObject:*\\\\Control\\\\Print\\\\Environments\\\\Windows*)) OR (winlog.event_data.TargetObject:(*\\\\Control\\\\Print\\\\Environments* OR *\\\\CurrentVersion\\\\Print\\\\Printers*) AND winlog.event_data.TargetObject:(*Gentil\\ Kiwi* OR *mimikatz\\ printer* OR *Kiwi\\ Legit\\ Printer*)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://github.com/gentilkiwi/mimikatz/commit/c21276072b3f2a47a21e215a46962a17d54b3760", "https://www.lexjansen.com/sesug/1993/SESUG93035.pdf", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rprn/4464eaf0-f34f-40d5-b970-736437a21913"], "timestamp_override": "event.ingested", "author": ["Markus Neis", "@markus_neis", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
