{"description": "Detects the addition of office test registry that allows a user to specify an arbitrary DLL that will be executed every time an Office application is started", "author": ["omkar72"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3d27f6dd-1c74-4687-b4fa-ca849d128d1c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Office Application Startup - Office Test", "query": "(event.category:registry AND winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\ [Tt][Ee][Ss][Tt]\\\\[Ss][Pp][Ee][Cc][Ii][Aa][Ll]\\\\[Pp][Ee][Rr][Ff].*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://unit42.paloaltonetworks.com/unit42-technical-walkthrough-office-test-persistence-method-used-in-recent-sofacy-attacks/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
