{"description": "Alerts on trust record modification within the registry, indicating usage of macros", "enabled": false, "false_positives": ["Alerts on legitimate macro usage as well, will need to filter as appropriate"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "69cf6f26-5c32-48fc-73bc-abcfecad3e6e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Registry Trust Record Modification", "query": "winlog.event_data.TargetObject:*TrustRecords*", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://outflank.nl/blog/2018/01/16/hunting-for-evil-detect-macros-being-executed/", "http://az4n6.blogspot.com/2016/02/more-on-trust-records-macros-and.html"], "timestamp_override": "event.ingested", "author": ["Antonlovesdnb"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
