{"description": "Detects Processes accessing the camera and microphone from suspicious folder", "enabled": false, "false_positives": ["Unlikely, there could be conferencing software running from a Temp folder accessing the devices"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "973f1ca9-3544-f967-7fad-01029a745989", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Camera and Microphone Access", "query": "(winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\* AND winlog.event_data.TargetObject:*\\\\NonPackaged* AND winlog.event_data.TargetObject:(*microphone* OR *webcam*) AND winlog.event_data.TargetObject:(*\\:#Windows#Temp#* OR *\\:#$Recycle.bin#* OR *\\:#Temp#* OR *\\:#Users#Public#* OR *\\:#Users#Default#* OR *\\:#Users#Desktop#*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1123", "T1125"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1123", "name": "Audio Capture", "reference": "https://attack.mitre.org/techniques/T1123"}, {"id": "T1125", "name": "Video Capture", "reference": "https://attack.mitre.org/techniques/T1125"}]}], "version": 1, "references": ["https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072"], "timestamp_override": "event.ingested", "author": ["Den Iuzvyk"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
