{"description": "Detects the installation of the Azure Hybrid Connection Manager service to allow remote code execution from Azure function.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ac8866c7-ce44-46fd-8c17-b24acff96ca8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HybridConnectionManager Service Installation", "query": "(winlog.event_data.TargetObject:*\\\\Services\\\\HybridConnectionManager* OR (winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.Details:*Microsoft.HybridConnectionManager.Listener.exe*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
