{"description": "Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0", "author": ["Florian Roth (Nextron Systems)", "Lee Holmes (idea)", "Harish Segar (improvements)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6331d09b-4785-4c13-980f-f96661356249", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Downgrade Attack - PowerShell", "query": "(Data:/.*[Ee][Nn][Gg][Ii][Nn][Ee][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=2\\..*/ AND (NOT Data:/.*[Hh][Oo][Ss][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=2\\..*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
