{"description": "Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "enabled": false, "false_positives": ["Programs using PowerShell directly without invocation of a dedicated interpreter", "MSP Detection Searcher", "Citrix ConfigSync.ps1"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d7326048-328b-4d5e-98af-86e84b17c765", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Uncommon PowerShell Hosts", "query": "((Data:/.*[Hh][Oo][Ss][Tt][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\=.*/ AND (NOT Data:(/.*[Hh][Oo][Ss][Tt][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\=[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Hh][Oo][Ss][Tt][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\=[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Vv]1\\.0\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Hh][Oo][Ss][Tt][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\=[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\[Vv]1\\.0\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Hh][Oo][Ss][Tt][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\=[Cc]\\:\\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\/[Ss][Yy][Ss][Tt][Ee][Mm]32\\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\/[Vv]1\\.0\\/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/ OR /.*[Hh][Oo][Ss][Tt][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\=[Cc]\\:\\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\/[Ss][Yy][Ss][Ww][Oo][Ww]64\\/[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\/[Vv]1\\.0\\/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll].*/))) AND (NOT Data:/.*[Cc][Ii][Tt][Rr][Ii][Xx]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc]\\\\[Cc][Oo][Nn][Ff][Ii][Gg][Ss][Yy][Nn][Cc]\\.[Pp][Ss]1\\*.*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://threathunterplaybook.com/hunts/windows/190815-RemoteServiceInstallation/notebook.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
