{"description": "Detects suspicious powershell process which includes bxor command, alternative obfuscation method to b64 encoded commands.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "36b982cc-8963-a677-08c3-becf9f835691", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious XOR Encoded PowerShell Command Line", "query": "(HostName:\"ConsoleHost\" AND process.command_line:(*bxor* OR *join* OR *char*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov", "Harish Segar (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
