{"description": "Detects suspicious powershell process which includes bxor command, alternative obfuscation method to b64 encoded commands.", "author": ["Teymur Kheirkhabarov", "Harish Segar (rule)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "812837bb-b17f-45e9-8bd0-0ec35d2e3bd6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious XOR Encoded PowerShell Command Line - PowerShell", "query": "(Data:/.*[Hh][Oo][Ss][Tt][Nn][Aa][Mm][Ee]\\=[Cc][Oo][Nn][Ss][Oo][Ll][Ee][Hh][Oo][Ss][Tt].*/ AND Data:(*bxor* OR *char* OR *join*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=46"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
