{"description": "Detects remote PowerShell sessions", "enabled": false, "false_positives": ["Legitimate use remote PowerShell sessions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "61fe4d18-cfff-d121-8fdb-bd7acf43a69f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote PowerShell Session (PS Classic)", "query": "(HostName:\"ServerRemoteHost\" AND process.command_line:*wsmprovhost.exe*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
