{"description": "Detects suspicious powershell download cradle using nslookup. This cradle uses nslookup to extract payloads from DNS records", "author": ["Sai Prashanth Pulisetti @pulisettis"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "66a6ec46-6234-cc46-e83d-7a0dadd450db", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Nslookup PowerShell Download Cradle", "query": "(process.command_line.text:*powershell* AND process.command_line.text:*nslookup* AND process.command_line.text:(*\\-q\\=txt* OR *\\-querytype\\=txt*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://twitter.com/Alh4zr3d/status/1566489367232651264"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
