{"description": "Attempting to disable scheduled scanning and other parts of windows defender atp.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ec19ebab-72dc-40e1-9728-4c0b805d722c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tamper Windows Defender", "query": "(process.command_line:*Set\\-MpPreference* AND process.command_line:(*\\-DisableRealtimeMonitoring\\ 1* OR *\\-DisableBehaviorMonitoring\\ 1* OR *\\-DisableScriptScanning\\ 1* OR *\\-DisableBlockAtFirstSeen\\ 1*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
