{"description": "Detects PowerShell called from an executable by the version mismatch method", "author": ["Sean Metcalf (source)", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c70e019b-1479-4b65-b0cc-cd0c6093a599", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Called from an Executable Version Mismatch", "query": "(Data:(/.*[Ee][Nn][Gg][Ii][Nn][Ee][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=2\\..*/ OR /.*[Ee][Nn][Gg][Ii][Nn][Ee][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=4\\..*/ OR /.*[Ee][Nn][Gg][Ii][Nn][Ee][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=5\\..*/) AND Data:/.*[Hh][Oo][Ss][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\=3\\..*/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
