{"description": "Shadow Copies deletion using operating systems utilities via PowerShell", "enabled": false, "false_positives": ["Legitimate Administrator deletes Shadow Copies using operating systems utilities for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1b7a160e-3d48-0ec4-0d91-b5b529598b8c", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Delete Volume Shadow Copies Via WMI With PowerShell", "query": "(process.command_line:*Get\\-WmiObject* AND process.command_line:*\\ Win32_Shadowcopy* AND process.command_line:(*Delete\\(\\)* OR *Remove\\-WmiObject*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md", "https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/win_shadow_copies_deletion.yml", "https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
