{"description":"Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe Author: Roberto Rodriguez @Cyb3rWard0g. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Programs using PowerShell directly without invocation of a dedicated interpreter","MSP Detection Searcher","Citrix ConfigSync.ps1"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"26a18131-63fc-26d8-f0b1-139c072c47ce","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Alternate PowerShell Hosts","query":"(process.command_line:* AND (NOT (process.command_line:C\\:\\\\WINDOWS\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe* OR ContextInfo:*Citrix\\\\ConfigSync\\\\ConfigSync.ps1*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
