{"description": "Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c5b20776-639a-49bf-94c7-84f912b91c15", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Netcat The Powershell Version", "query": "Data:(/.*[Pp][Oo][Ww][Ee][Rr][Cc][Aa][Tt]\\ .*/ OR /.*[Pp][Oo][Ww][Ee][Rr][Cc][Aa][Tt]\\.[Pp][Ss]1.*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1095"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://nmap.org/ncat/", "https://github.com/besimorhino/powercat", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
