{"description": "Detects remote PowerShell sessions", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "enabled": false, "false_positives": ["Legitimate use remote PowerShell sessions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "60167e5c-84b2-4c95-a7ac-86281f27c445", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote PowerShell Session (PS Classic)", "query": "(Data:/.*[Hh][Oo][Ss][Tt][Nn][Aa][Mm][Ee]\\=[Ss][Ee][Rr][Vv][Ee][Rr][Rr][Ee][Mm][Oo][Tt][Ee][Hh][Oo][Ss][Tt].*/ AND Data:/.*[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee].*/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
