{"description": "Attempting to disable scheduled scanning and other parts of Windows Defender ATP or set default actions to allow.", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate PowerShell scripts that disable Windows Defender for troubleshooting purposes. Must be investigated."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ec19ebab-72dc-40e1-9728-4c0b805d722c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tamper Windows Defender - PSClassic", "query": "(((process.command_line.text:\"*Set\\-MpPreference*\" AND process.command_line.text:(\"*\\-dbaf\\ $true*\" OR \"*\\-dbaf\\ 1*\" OR \"*\\-dbm\\ $true*\" OR \"*\\-dbm\\ 1*\" OR \"*\\-dips\\ $true*\" OR \"*\\-dips\\ 1*\" OR \"*\\-DisableArchiveScanning\\ $true*\" OR \"*\\-DisableArchiveScanning\\ 1*\" OR \"*\\-DisableBehaviorMonitoring\\ $true*\" OR \"*\\-DisableBehaviorMonitoring\\ 1*\" OR \"*\\-DisableBlockAtFirstSeen\\ $true*\" OR \"*\\-DisableBlockAtFirstSeen\\ 1*\" OR \"*\\-DisableIntrusionPreventionSystem\\ $true*\" OR \"*\\-DisableIntrusionPreventionSystem\\ 1*\" OR \"*\\-DisableIOAVProtection\\ $true*\" OR \"*\\-DisableIOAVProtection\\ 1*\" OR \"*\\-DisableRealtimeMonitoring\\ $true*\" OR \"*\\-DisableRealtimeMonitoring\\ 1*\" OR \"*\\-DisableRemovableDriveScanning\\ $true*\" OR \"*\\-DisableRemovableDriveScanning\\ 1*\" OR \"*\\-DisableScanningMappedNetworkDrivesForFullScan\\ $true*\" OR \"*\\-DisableScanningMappedNetworkDrivesForFullScan\\ 1*\" OR \"*\\-DisableScanningNetworkFiles\\ $true*\" OR \"*\\-DisableScanningNetworkFiles\\ 1*\" OR \"*\\-DisableScriptScanning\\ $true*\" OR \"*\\-DisableScriptScanning\\ 1*\" OR \"*\\-drdsc\\ $true*\" OR \"*\\-drdsc\\ 1*\" OR \"*\\-drtm\\ $true*\" OR \"*\\-drtm\\ 1*\" OR \"*\\-dscrptsc\\ $true*\" OR \"*\\-dscrptsc\\ 1*\" OR \"*\\-dsmndf\\ $true*\" OR \"*\\-dsmndf\\ 1*\" OR \"*\\-dsnf\\ $true*\" OR \"*\\-dsnf\\ 1*\" OR \"*\\-dss\\ $true*\" OR \"*\\-dss\\ 1*\"))) OR (((process.command_line.text:\"*Set\\-MpPreference*\") OR (process.command_line.text:(\"*HighThreatDefaultAction\\ Allow*\" OR \"*htdefac\\ Allow*\" OR \"*LowThreatDefaultAction\\ Allow*\" OR \"*ltdefac\\ Allow*\" OR \"*ModerateThreatDefaultAction\\ Allow*\" OR \"*mtdefac\\ Allow*\" OR \"*SevereThreatDefaultAction\\ Allow*\" OR \"*stdefac\\ Allow*\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
