{"description": "Detects renamed powershell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4f62ee9b-a452-cbbd-66f4-d7a3a8d96221", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Renamed Powershell Under Powershell Channel", "query": "(HostName:\"ConsoleHost\" AND (NOT (process.command_line:(powershell.exe* OR C\\:\\\\WINDOWS\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe*))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "timestamp_override": "event.ingested", "author": ["Harish Segar", "frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
