{"description": "Shadow Copies deletion using operating systems utilities via PowerShell", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate Administrator deletes Shadow Copies using operating systems utilities for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "87df9ee1-5416-453a-8a08-e8d4a51e9ce1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Delete Volume Shadow Copies Via WMI With PowerShell", "query": "(Data:/.*[Gg][Ee][Tt]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/ AND Data:/.*[Ww][Ii][Nn]32\\_[Ss][Hh][Aa][Dd][Oo][Ww][Cc][Oo][Pp][Yy].*/ AND Data:(/.*[Dd][Ee][Ll][Ee][Tt][Ee]\\(\\).*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ww][Mm][Ii][Oo][Bb][Jj][Ee][Cc][Tt].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md", "https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
