{"description": "Detects suspicious PowerShell download command", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["PowerShell scripts that download content from the Internet"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3236fcd0-b7e3-4433-b4f8-86ad61a9af2d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious PowerShell Download", "query": "(Data:/.*[Nn][Ee][Tt]\\.[Ww][Ee][Bb][Cc][Ll][Ii][Ee][Nn][Tt].*/ AND Data:(/.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
