{"description": "Detects important or interesting Windows services that got terminated for whatever reason", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Rare false positives could occur since service termination could happen due to multiple reasons"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d6b5520d-3934-48b4-928c-2aa3f92d6963", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Important Windows Service Terminated With Error", "query": "(winlog.channel:\"System\" AND (Provider_Name:\"Service Control Manager\" AND winlog.event_id:\"7023\") AND ((param1:(*\\ Antivirus* OR *\\ Firewall* OR *Application\\ Guard* OR *BitLocker\\ Drive\\ Encryption\\ Service* OR *Encrypting\\ File\\ System* OR *Microsoft\\ Defender* OR *Threat\\ Protection* OR *Windows\\ Event\\ Log*)) OR (Binary:(*770069006e0064006500660065006e006400* OR *4500760065006e0074004c006f006700* OR *6d0070007300730076006300* OR *530065006e0073006500* OR *450046005300* OR *420044004500530056004300*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
