{"description": "Detects Windows services that got terminated for whatever reason", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives could occur since service termination could happen due to multiple reasons"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "acfa2210-0d71-4eeb-b477-afab494d596c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Windows Service Terminated With Error", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Service Control Manager\" AND winlog.event_id:\"7023\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
