{"description": "Detects important or interesting Windows services that got terminated unexpectedly.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Rare false positives could occur since service termination could happen due to multiple reasons"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56abae0c-6212-4b97-adc0-0b559bb950c3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Important Windows Service Terminated Unexpectedly", "query": "(winlog.channel:\"System\" AND (Provider_Name:\"Service Control Manager\" AND winlog.event_id:\"7034\") AND ((param1:*Message\\ Queuing*) OR (Binary:(*4d0053004d005100* OR *6d0073006d007100*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.randori.com/blog/vulnerability-analysis-queuejumper-cve-2023-21554/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
