{"description": "Detects when an application exports a certificate (and potentially the private key as well) from the local Windows certificate store.", "author": ["Zach Mathis"], "enabled": false, "false_positives": ["Legitimate application requesting certificate exports will trigger this. Apply additional filters as needed"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "58c0bff0-40a0-46e8-b5e8-b734b84d2017", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Certificate Exported From Local Certificate Store", "query": "winlog.event_id:\"1007\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
