{"description":"Detects process connections to a Monero crypto mining pool Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of crypto miners"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"a46c93b7-55ed-4d27-a41b-c259456c4746","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Linux Crypto Mining Pool Connections","query":"destination.domain:(\"pool.minexmr.com\" OR \"fr.minexmr.com\" OR \"de.minexmr.com\" OR \"sg.minexmr.com\" OR \"ca.minexmr.com\" OR \"us\\-west.minexmr.com\" OR \"pool.supportxmr.com\" OR \"mine.c3pool.com\" OR \"xmr\\-eu1.nanopool.org\" OR \"xmr\\-eu2.nanopool.org\" OR \"xmr\\-us\\-east1.nanopool.org\" OR \"xmr\\-us\\-west1.nanopool.org\" OR \"xmr\\-asia1.nanopool.org\" OR \"xmr\\-jp1.nanopool.org\" OR \"xmr\\-au1.nanopool.org\" OR \"xmr.2miners.com\" OR \"xmr.hashcity.org\" OR \"xmr.f2pool.com\" OR \"xmrpool.eu\" OR \"pool.hashvault.pro\" OR \"moneroocean.stream\" OR \"monerocean.stream\")","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
