{"description": "Detects connections to the host used in a big repository compromise discovered in August 2022", "enabled": false, "false_positives": ["Users looking up that domain after reading the report (unlikely)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "242e0911-294a-44ea-a54e-7eea97aa2622", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Github Repo Compromise Domain MyJino RU", "query": "destination.domain:\"ovz1.j19544519.pr46m.vps.myjino.ru\"", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/stephenlacy/status/1554697077430505473"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
