{"description": "Detects the reporting of NTLMv1 being used between a client and server. NTLMv1 is unsecure as the underlying encryption algorithms can be brute-forced by modern hardware.", "author": ["Tim Shelton", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Environments that use NTLMv1"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e9d4ab66-a532-4ef7-a502-66a9e4a34f5d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "NTLMv1 Logon Between Client and Server", "query": "(winlog.channel:System AND Provider_Name:LsaSrv AND winlog.event_id:(6038 OR 6039))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Lateral Movement", "T1550"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
