{"description": "Detects block of attempt to disable real time protection of Microsoft Defender by tamper protection", "enabled": false, "false_positives": ["Administrator actions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab1b7105-9b39-5197-6ca5-9899f3180fe6", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Microsoft Defender Tamper Protection Trigger", "query": "(winlog.channel:\"Microsoft\\-Windows\\-Windows\\ Defender\\/Operational\" AND winlog.event_id:\"5013\" AND Value:(*\\\\Windows\\ Defender\\\\DisableAntiSpyware\\ \\=\\ 0x1\\(\\) OR *\\\\Real\\-Time\\ Protection\\\\DisableRealtimeMonitoring\\ \\=\\ \\(Current\\)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://bhabeshraj.com/post/tampering-with-microsoft-defenders-tamper-protection"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
