{"description": "Detects disabling Windows Defender threat protection", "enabled": false, "false_positives": ["Administrator actions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "33a3d0ea-448a-51b3-5839-b208ddf4d798", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Defender Threat Detection Disabled", "query": "(winlog.channel:\"Microsoft\\-Windows\\-Windows\\ Defender\\/Operational\" AND winlog.event_id:(\"5001\" OR \"5010\" OR \"5012\" OR \"5101\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md"], "timestamp_override": "event.ingested", "author": ["J\u00e1n Tren\u010dansk\u00fd", "frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
