{"description": "Detects issues with Windows Defender Real-Time Protection features", "author": ["Nasreddine Bencherchali (Nextron Systems)", "Christopher Peacock '@securepeacock' (Update)"], "enabled": false, "false_positives": ["Some crashes can occur sometimes and the event doesn't provide enough information to tune out these cases. Manual exception is required"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dd80db93-6ec2-4f4c-a017-ad40da6ffe81", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Defender Real-Time Protection Failure/Restart", "query": "(winlog.channel:\"Microsoft-Windows-Windows Defender/Operational\" AND winlog.event_id:(\"3002\" OR \"3007\") AND (NOT (Feature_Name:\"%%886\" AND Reason:(\"%%892\" OR \"%%858\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["Internal Research", "https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/", "https://gist.github.com/nasbench/33732d6705cbdc712fae356f07666346"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
