{"description": "Detects blocking of process creations originating from PSExec and WMI commands", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "97b9ce1e-c5ab-11ea-87d0-0242ac130003", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PSExec and WMI Process Creations Block", "query": "(winlog.channel:\"Microsoft\\-Windows\\-Windows\\ Defender\\/Operational\" AND winlog.event_id:\"1121\" AND process.executable:(*\\\\wmiprvse.exe OR *\\\\psexesvc.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1047", "T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/attack-surface-reduction?WT.mc_id=twitter#block-process-creations-originating-from-psexec-and-wmi-commands", "https://twitter.com/duff22b/status/1280166329660497920"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
