{"description": "Detect Attempt PrintNightmare (CVE-2021-1675) Remote code execution in Windows Spooler Service", "enabled": false, "false_positives": ["Account fallback reasons (after failed login with specific account)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e66128dc-74c2-88cb-5494-ac9c1b42d878", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Rejected SMB Guest Logon From IP", "query": "(winlog.event_id:\"31017\" AND winlog.event_data.Description:*Rejected\\ an\\ insecure\\ guest\\ logon* AND UserName:\"\" AND ServerName:\\\\1*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://twitter.com/KevTheHermit/status/1410203844064301056", "https://github.com/hhlxf/PrintNightmare", "https://github.com/afwu/PrintNightmare"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "KevTheHermit", "fuzzyf10w"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
