{"description":"Detects strings used in command execution in DNS TXT Answer Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"8ae51330-899c-4641-8125-e39f2e07da72","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"DNS TXT Answer with Possible Execution Strings","query":"(dns.question.type:\"TXT\" AND dns.answers.name:(*IEX* OR *Invoke\\-Expression* OR *cmd.exe*))","meta":{"from":"1m"},"severity":"high","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
