{"description":"Detects suspicious DNS queries known from Cobalt Strike beacons Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"8e7fea02-63ea-47d9-aa23-2d71cd29a358","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Cobalt Strike DNS Beaconing","query":"(dns.question.name:(aaa.stage.* OR post.1*) OR dns.question.name:*.stage.123456.*)","meta":{"from":"1m"},"severity":"critical","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
