{"description":"Detects suspicious DNS queries to api.telegram.org used by Telegram Bots of any kind Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of Telegram bots in the company"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"8d86ef63-8381-e626-26a4-8df9e344f5e9","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Telegram Bot API Request","query":"dns.question.name:\"api.telegram.org\"","meta":{"from":"1m"},"severity":"medium","tags":["T1102"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
