{"description":"Detects wannacry killswitch domain dns queries Author: Mike Wade. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Analyst testing"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"b29c9d8a-a5bc-ee5a-4dbf-f744f07a54e6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Wannacry Killswitch Domain","query":"dns.question.name:(\"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.testing\" OR \"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.test\" OR \"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.com\" OR \"ayylmaotjhsstasdfasdfasdfasdfasdfasdfasdf.com\" OR \"iuqssfsodp9ifjaposdfjhgosurijfaewrwergwea.com\")","meta":{"from":"1m"},"severity":"high","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
