{"description": "Detects wannacry killswitch domain dns queries", "enabled": false, "false_positives": ["Analyst testing"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "3eaf6218-3bed-4d8a-8707-274096f12a18", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Wannacry Killswitch Domain", "query": "dns.question.name:(\"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.testing\" OR \"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.test\" OR \"ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.com\" OR \"ayylmaotjhsstasdfasdfasdfasdfasdfasdfasdf.com\" OR \"iuqssfsodp9ifjaposdfjhgosurijfaewrwergwea.com\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.fireeye.com/blog/products-and-services/2017/05/wannacry-ransomware-campaign.html"], "timestamp_override": "event.ingested", "author": ["Mike Wade"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
