{"description": "Detects suspicious DNS queries to Monero mining pools", "enabled": false, "false_positives": ["Legitimate crypto coin mining"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "b593fd50-7335-4682-a36c-4edcb68e4641", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Monero Crypto Coin Mining Pool Lookup", "query": "dns.question.name:(*pool.minexmr.com* OR *fr.minexmr.com* OR *de.minexmr.com* OR *sg.minexmr.com* OR *ca.minexmr.com* OR *us\\-west.minexmr.com* OR *pool.supportxmr.com* OR *mine.c3pool.com* OR *xmr\\-eu1.nanopool.org* OR *xmr\\-eu2.nanopool.org* OR *xmr\\-us\\-east1.nanopool.org* OR *xmr\\-us\\-west1.nanopool.org* OR *xmr\\-asia1.nanopool.org* OR *xmr\\-jp1.nanopool.org* OR *xmr\\-au1.nanopool.org* OR *xmr.2miners.com* OR *xmr.hashcity.org* OR *xmr.f2pool.com* OR *xmrpool.eu* OR *pool.hashvault.pro*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1496", "T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1496", "name": "Resource Hijacking", "reference": "https://attack.mitre.org/techniques/T1496"}]}], "version": 1, "references": ["https://www.nextron-systems.com/2021/10/24/monero-mining-pool-fqdns/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
