{"description": "Detects strings used in command execution in DNS TXT Answer", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "8ae51330-899c-4641-8125-e39f2e07da72", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DNS TXT Answer with Possible Execution Strings", "query": "(dns.question.type:\"TXT\" AND dns.answers.name:(*IEX* OR *Invoke\\-Expression* OR *cmd.exe*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/stvemillertime/status/1024707932447854592", "https://github.com/samratashok/nishang/blob/master/Backdoors/DNS_TXT_Pwnage.ps1"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
