{"description": "Detects communication to C2 servers mentioned in the operational notes of the ShadowBroker leak of EquationGroup C2 tools", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a6c2905b-f327-5f76-b1da-178edf554df2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Equation Group C2 Communication", "query": "(destination.ip:(\"69.42.98.86\" OR \"89.185.234.145\") OR source.ip:(\"69.42.98.86\" OR \"89.185.234.145\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1041"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://steemit.com/shadowbrokers/@theshadowbrokers/lost-in-translation", "https://medium.com/@msuiche/the-nsa-compromised-swift-network-50ec3000b195"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
