{"description":"Bypasses User Account Control using Event Viewer and a relevant Windows Registry modification Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c1968a53-fe14-0915-7649-924922d9d528","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Bypass UAC Using Event Viewer","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*_Classes\\\\mscfile\\\\shell\\\\open\\\\command\\\\\\(Default\\)) AND (NOT (winlog.event_data.Details:%SystemRoot%\\\\system32\\\\mmc.exe\\ \\\"%1\\\"\\ %*)))","meta":{"from":"1m"},"severity":"high","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
