{"description":"There is an auto-elevated task called SilentCleanup located in %windir%\\system32\\cleanmgr.exe This can be abused to elevate any file with Administrator privileges without prompting UAC Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"87acf7fd-e37d-cd45-83b6-71f8b50c3b6c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Bypass UAC Using SilentCleanup Task","query":"(winlog.event_data.TargetObject:*\\\\Environment\\\\windir AND winlog.event_data.Details:*&REM* AND winlog.event_data.EventType:\"SetValue\")","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","Privilege Escalation","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
