{"description":"Detects modification of autostart extensibility point (ASEP) in registry. Author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason","Legitimate administrator sets up autorun keys for legitimate reason"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8d273e6c-77d7-b708-2466-761946375293","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Wow6432Node Classes Autorun Keys Modification","query":"((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Software\\\\Wow6432Node\\\\Classes* AND winlog.event_data.TargetObject:(*\\\\Folder\\\\ShellEx\\\\ExtShellFolderViews* OR *\\\\Folder\\\\ShellEx\\\\DragDropHandlers* OR *\\\\Folder\\\\ShellEx\\\\ColumnHandlers* OR *\\\\Directory\\\\Shellex\\\\DragDropHandlers* OR *\\\\Directory\\\\Shellex\\\\CopyHookHandlers* OR *\\\\CLSID\\\\\\{AC757296\\-3522\\-4E11\\-9862\\-C17BE5A1767E\\}\\\\Instance* OR *\\\\CLSID\\\\\\{ABE3B9A4\\-257D\\-4B97\\-BD1A\\-294AF496222E\\}\\\\Instance* OR *\\\\CLSID\\\\\\{7ED96837\\-96F0\\-4812\\-B211\\-F13C24117ED3\\}\\\\Instance* OR *\\\\CLSID\\\\\\{083863F1\\-70DE\\-11d0\\-BD40\\-00A0C911CE86\\}\\\\Instance* OR *\\\\AllFileSystemObjects\\\\ShellEx\\\\DragDropHandlers* OR *\\\\ShellEx\\\\PropertySheetHandlers* OR *\\\\ShellEx\\\\ContextMenuHandlers*)) AND (NOT (winlog.event_data.Details:\"\\(Empty\\)\")))","meta":{"from":"1m"},"severity":"medium","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
