{"description": "A login from a public IP can indicate a misconfigured firewall or network boundary.", "author": ["NVISO"], "enabled": false, "false_positives": ["Legitimate logon attempts over the internet", "IPv4-to-IPv6 mapped IPs"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f88e112a-21aa-44bd-9b01-6ee2a2bbbed1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Failed Logon From Public IP", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4625\" AND (NOT ((source.ip:*\\-*) OR (source.ip:(10.* OR 192.168.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.* OR 127.* OR 169.254.*)) OR (((source.ip:\"::1\") OR (source.ip:(fe80\\:\\:* OR fc00\\:\\:*)))))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1078", "T1133", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}, {"id": "T1133", "name": "External Remote Services", "reference": "https://attack.mitre.org/techniques/T1133"}, {"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}, {"id": "T1133", "name": "External Remote Services", "reference": "https://attack.mitre.org/techniques/T1133"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
