{"description": "Detects scenarios where system auditing for important events such as \"Process Creation\" or \"Logon\" events is disabled.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab4561b1-6c7e-48a7-ad08-087cfb9ce8f1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Important Windows Event Auditing Disabled", "query": "(winlog.channel:Security AND winlog.event_id:4719 AND (((SubcategoryGuid:(/\\{0[Cc][Cc][Ee]9215\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]922[Bb]\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9240\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9210\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9211\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9212\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]921[Bb]\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]922[Ff]\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9230\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9235\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9236\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9237\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]923[Ff]\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ OR /\\{0[Cc][Cc][Ee]9242\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/) AND winlog.event_data.AuditPolicyChanges:(/.*%%8448.*/ OR /.*%%8450.*/))) OR ((SubcategoryGuid:/\\{0[Cc][Cc][Ee]9217\\-69[Aa][Ee]\\-11[Dd]9\\-[Bb][Ee][Dd]3\\-505054503030\\}/ AND winlog.event_data.AuditPolicyChanges:/.*%%8448.*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://docs.google.com/presentation/d/1dkrldTTlN3La-OjWtkWJBb4hVk6vfsSMBFBERs6R8zA/edit", "https://github.com/SigmaHQ/sigma/blob/master/documentation/logsource-guides/windows/service/security.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
