{"description": "This event was observed on the target host during lateral movement. The process name within the event contains the process spawned post compromise. Account Name within the event contains the compromised user account name. This event should to be correlated with 4624 and 4688 for further intrusion context.", "enabled": false, "false_positives": ["legal admin action"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "29d31aee-30f4-4006-85a9-a4a02d65306c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Lateral Movement Indicator ConDrv", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4674\" AND winlog.event_data.ObjectServer:\"Security\" AND winlog.event_data.ObjectType:\"File\" AND winlog.event_data.ObjectName:\"\\\\Device\\\\ConDrv\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["Lateral Movement", "T1021", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://jpcertcc.github.io/ToolAnalysisResultSheet/details/wmiexec-vbs.htm", "https://www.fireeye.com/blog/threat-research/2017/08/monitoring-windows-console-activity-part-one.html"], "timestamp_override": "event.ingested", "author": ["Janantha Marasinghe"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
