{"description": "Detects usage of Metasploit SMB PsExec (exploit/windows/smb/psexec) and Impacket psexec.py by triggering on specific service installation", "enabled": false, "false_positives": ["Possible, different agents with a 8 character binary and a 4, 8 or 16 character service name"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6fb63b40-e02a-403e-9ffd-3bcc1d749442", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Metasploit Or Impacket Service Installation Via SMB PsExec", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4697\" AND winlog.event_data.ServiceFileName:/^%systemroot%\\\\[a-zA-Z]{8}\\.exe$/ AND winlog.event_data.ServiceName:/(^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)/ AND ServiceStartType:\"3\" AND winlog.event_data.ServiceType:\"0x10\") AND (NOT (winlog.event_data.ServiceName:\"PSEXESVC\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1569", "T1570"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}, {"id": "T1570", "name": "Lateral Tool Transfer", "reference": "https://attack.mitre.org/techniques/T1570"}]}], "version": 1, "references": ["https://bczyz1.github.io/2021/01/30/psexec.html"], "timestamp_override": "event.ingested", "author": ["Bartlomiej Czyz", "Relativity"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
