{"description": "Detects the use of a scanner by zerosum0x0 that discovers targets vulnerable to  CVE-2019-0708 RDP RCE aka BlueKeep", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "df4cb398-26bf-0cd4-c940-ea3034399037", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Scanner PoC for CVE-2019-0708 RDP RCE Vuln", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4625\" AND winlog.event_data.TargetUserName:\"AAAAAAA\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Lateral Movement", "T1210"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1210", "name": "Exploitation of Remote Services", "reference": "https://attack.mitre.org/techniques/T1210"}]}], "version": 1, "references": ["https://twitter.com/AdamTheAnalyst/status/1134394070045003776", "https://github.com/zerosum0x0/CVE-2019-0708"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)", "Adam Bradbury (idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
