{"description": "Potential threat actor tampering with Sysmon manifest and eventually disabling it", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Sysmon Channel Reference Deletion", "query": "(winlog.channel:\"Security\" AND winlog.event_data.ObjectName:(*WINEVT\\\\Publishers\\\\\\{5770385f\\-c22a\\-43e0\\-bf4c\\-06f5698ffbd9\\}* OR *WINEVT\\\\Channels\\\\Microsoft\\-Windows\\-Sysmon\\/Operational*) AND ((winlog.event_id:\"4657\" AND winlog.event_data.ObjectValueName:\"Enabled\" AND NewValue:\"0\") OR (winlog.event_id:\"4663\" AND winlog.event_data.AccessMask:\"65536\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/Flangvik/status/1283054508084473861", "https://twitter.com/SecurityJosh/status/1283027365770276866", "https://securityjosh.github.io/2020/04/23/Mute-Sysmon.html", "https://gist.github.com/Cyb3rWard0g/cf08c38c61f7e46e8404b38201ca01c8"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
