{"description": "Detects known malicious service installs that only appear in cases of lateral movement, credential dumping, and other suspicious activities.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cb062102-587e-4414-8efa-dbe3c7bf19c6", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Malicious Service Installations", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4697\" AND winlog.event_data.ServiceName:\"javamtsup\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1003", "T1543", "T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://awakesecurity.com/blog/threat-hunting-for-paexec/", "https://www.fireeye.com/blog/threat-research/2017/05/wannacry-malware-profile.html", "https://blog.f-secure.com/wp-content/uploads/2019/10/CosmicDuke.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Daniil Yugoslavskiy", "oscd.community (update)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
