{"description": "Detects potential use of Rubeus via registered new trusted logon process", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3a2ef138-87e0-4f20-81c4-9f0a4e6a6b62", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Register new Logon Process by Rubeus", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4611\" AND winlog.event_data.LogonProcessName:\"User32LogonProcesss\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Lateral Movement", "Privilege Escalation", "T1558"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (source)", "Ilyas Ochkov (rule)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
