{"description":"Detects Obfuscated Powershell via use Rundll32 in Scripts Author: Nikita Nazarov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cd0f7229-d16f-42de-8fe3-fba365fbcb3a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Invoke-Obfuscation Via Use Rundll32","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4697\" AND winlog.event_data.ServiceFileName:*\\&&* AND winlog.event_data.ServiceFileName:*rundll32* AND winlog.event_data.ServiceFileName:*shell32.dll* AND winlog.event_data.ServiceFileName:*shellexec_rundll* AND winlog.event_data.ServiceFileName:(*value* OR *invoke* OR *comspec* OR *iex*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1027","T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
