{"description": "Detects WRITE_DAC access to a domain object", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6c622080-1edb-aa84-c86f-a00b4ddf1386", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "AD Object WriteDAC Access", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4662\" AND winlog.event_data.ObjectServer:\"DS\" AND winlog.event_data.AccessMask:\"0x40000\" AND winlog.event_data.ObjectType:(\"19195a5b\\-6da0\\-11d0\\-afd3\\-00c04fd930c9\" OR \"domainDNS\"))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1222"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1222", "name": "File and Directory Permissions Modification", "reference": "https://attack.mitre.org/techniques/T1222"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190101151110.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
