{"description":"Detects successful logon with logon type 9 (NewCredentials) which matches the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module. Author: Roberto Rodriguez (source), Dominik Schaudel (rule). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Runas command-line tool using /netonly parameter"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a501df14-7a14-33b2-0adb-d9e8129e56dd","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Successful Overpass the Hash Attempt","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"9\" AND winlog.event_data.LogonProcessName:\"seclogo\" AND winlog.event_data.AuthenticationPackageName:\"Negotiate\")","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","T1550"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1550","name":"Use Alternate Authentication Material","reference":"https://attack.mitre.org/techniques/T1550"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
