{"description": "Detect AD credential dumping using impacket secretdump HKTL", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "252902e3-5830-4cf6-bf21-c22083dfd5cf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Possible Impacket SecretDump Remote Activity", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"5145\" AND winlog.event_data.ShareName:\\\\\\*\\\\ADMIN$ AND winlog.event_data.RelativeTargetName:*SYSTEM32\\\\* AND winlog.event_data.RelativeTargetName:*.tmp*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden", "wagga"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
