{"description":"Detects tools extracting LSA secret DPAPI domain backup key from Domain Controllers Author: Roberto Rodriguez @Cyb3rWard0g. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4ac1f50b-3bd0-4968-902d-868b4647937e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"DPAPI Domain Backup Key Extraction","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4662\" AND winlog.event_data.ObjectType:\"SecretObject\" AND winlog.event_data.AccessMask:\"0x2\" AND winlog.event_data.ObjectName:*BCKUPKEY*)","meta":{"from":"1m"},"severity":"critical","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
