{"description": "Detects NetNTLM downgrade attack", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d3abac66-f11c-4ed0-8acb-50cc29c97eed", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "NetNTLM Downgrade Attack", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4657\" AND winlog.event_data.ObjectName:*\\\\REGISTRY\\\\MACHINE\\\\SYSTEM* AND winlog.event_data.ObjectName:*ControlSet* AND winlog.event_data.ObjectName:*\\\\Control\\\\Lsa* AND winlog.event_data.ObjectValueName:(\"LmCompatibilityLevel\" OR \"NtlmMinClientSec\" OR \"RestrictSendingNTLMTraffic\"))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1112", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "wagga"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
