{"description": "Detects svchost hosting RDP termsvcs communicating with the loopback address", "enabled": false, "false_positives": ["Programs that connect locally to the RDP port"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5bed80b6-b3e8-428e-a3ae-d3c757589e41", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RDP over Reverse SSH Tunnel WFP", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"5156\" AND ((source.port:\"3389\" AND DestAddress:(127.* OR \"\\:\\:1\")) OR (DestPort:\"3389\" AND SourceAddress:(127.* OR \"\\:\\:1\")))) AND (NOT ((Application:(*\\\\thor.exe OR *\\\\thor64.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Lateral Movement", "T1021", "T1090", "T1090"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1096148422984384514", "https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Command%20and%20Control/DE_RDP_Tunnel_5156.evtx"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
