{"description":"Detects interactive console logons to Server Systems Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative activity via KVM or ILO board"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"228777c4-c10a-7090-8198-ba2a77b6a63e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Interactive Logon to Server Systems","query":"(winlog.channel:\"Security\" AND (winlog.event_id:(\"528\" OR \"529\" OR \"4624\" OR \"4625\") AND winlog.event_data.LogonType:\"2\" AND winlog.ComputerName:(\"%ServerSystems%\" OR \"%DomainControllers%\")) AND (NOT (winlog.event_data.LogonProcessName:\"Advapi\" AND winlog.ComputerName:\"%Workstations%\")))","meta":{"from":"1m"},"severity":"medium","tags":["Lateral Movement","T1078"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
