{"description": "Detect priv users or groups recon based on 4661 eventid and known privileged users or groups SIDs", "enabled": false, "false_positives": ["if source account name is not an admin then its super suspicious"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b8d65bc0-c56d-b15d-2c95-2739b1139398", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AD Privileged Users or Groups Reconnaissance", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4661\" AND winlog.event_data.ObjectType:(\"SAM_USER\" OR \"SAM_GROUP\")) AND (winlog.event_data.ObjectName:(*\\-512 OR *\\-502 OR *\\-500 OR *\\-505 OR *\\-519 OR *\\-520 OR *\\-544 OR *\\-551 OR *\\-555) OR winlog.event_data.ObjectName:*admin*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1087"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-hunting-5-detecting-enumeration.html"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
