{"description": "Detects non-system users failing to get a handle of the SCM database.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5a688d19-4150-083e-a709-d6cdc2748e29", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "SCM Database Handle Failure", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4656\" AND winlog.event_data.ObjectType:\"SC_MANAGER\\ OBJECT\" AND winlog.event_data.ObjectName:\"ServicesActive\" AND winlog.event_data.AccessMask:\"0xf003f\") AND (NOT (SubjectLogonId:\"0x3e4\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1010"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1010", "name": "Application Window Discovery", "reference": "https://attack.mitre.org/techniques/T1010"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190826010110.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
