{"description": "Detects the usage of the 'SeLoadDriverPrivilege' privilege. This privilege is required to load or unload a device driver.\nWith this privilege, the user can dynamically load and unload device drivers or other code in to kernel mode.\nThis user right does not apply to Plug and Play device drivers.\nIf you exclude privileged users/admins and processes, which are allowed to do so, you are maybe left with bad programs trying to load malicious kernel drivers.\nThis will detect Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs) and the usage of Sysinternals and various other tools. So you have to work with a whitelist to find the bad stuff.\n", "author": ["xknow (@xknow_infosec)", "xorxes (@xor_xes)"], "enabled": false, "false_positives": ["Other legimate tools loading drivers. Including but not limited to, Sysinternals, CPU-Z, AVs etc. A baseline needs to be created according to the used products and allowed tools. A good thing to do is to try and exclude users who are allowed to load drivers."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bce64825-3bc1-fa20-92cf-cdef48704e43", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Privileged System Service Operation - SeLoadDriverPrivilege", "query": "(winlog.channel:\"Security\" AND (Provider_Name:\"Microsoft-Windows-Security-Auditing\" AND winlog.event_id:\"4673\" AND winlog.event_data.PrivilegeList:\"SeLoadDriverPrivilege\" AND Service:\"-\") AND (NOT ((winlog.event_data.ProcessName:(\"C:\\Windows\\System32\\Dism.exe\" OR \"C:\\Windows\\System32\\rundll32.exe\" OR \"C:\\Windows\\System32\\fltMC.exe\" OR \"C:\\Windows\\HelpPane.exe\" OR \"C:\\Windows\\System32\\mmc.exe\" OR \"C:\\Windows\\System32\\svchost.exe\" OR \"C:\\Windows\\System32\\wimserv.exe\" OR \"C:\\Windows\\System32\\RuntimeBroker.exe\" OR \"C:\\Windows\\System32\\SystemSettingsBroker.exe\" OR \"C:\\Windows\\explorer.exe\")) OR (winlog.event_data.ProcessName:(*\\\\procexp64.exe OR *\\\\procexp.exe OR *\\\\procmon64.exe OR *\\\\procmon.exe OR *\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe OR *\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe)) OR (winlog.event_data.ProcessName:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\Microsoft*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/", "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4673"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
