{"description": "Detects successful logon with logon type 9 (NewCredentials) which matches the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.", "enabled": false, "false_positives": ["Runas command-line tool using /netonly parameter"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "192a0330-c20b-4356-90b6-7b7049ae0b87", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Successful Overpass the Hash Attempt", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"9\" AND winlog.event_data.LogonProcessName:\"seclogo\" AND winlog.event_data.AuthenticationPackageName:\"Negotiate\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1550"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://cyberwardog.blogspot.de/2017/04/chronicles-of-threat-hunter-hunting-for.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (source)", "Dominik Schaudel (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
