{"description": "Checks for event id 1102 which indicates the security event log was cleared.", "enabled": false, "false_positives": ["Legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c4137225-80fe-844f-ad2a-1e0f7adc0e81", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Security Event Log Cleared", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"1102\" AND Provider_Name:\"Microsoft\\-Windows\\-Eventlog\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1070"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/SecurityEventLogCleared.yaml"], "timestamp_override": "event.ingested", "author": ["Saw Winn Naung"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
