{"description": "Detects process handle on LSASS process with certain access mask", "author": ["Roberto Rodriguez", "Teymur Kheirkhabarov", "Dimitrios Slamaris", "Mark Russinovich", "Aleksey Potapov", "oscd.community (update)"], "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason; update the whitelist with it"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4a1b6da0-d94f-4fc3-98fc-2d9cb9e5ee76", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Generic Password Dumper Activity on LSASS", "query": "(winlog.channel:\"Security\" AND (((winlog.event_id:\"4656\" AND winlog.event_data.ObjectName:*\\\\lsass.exe AND winlog.event_data.AccessMask:(*0x40* OR *0x1400* OR *0x100000* OR *0x1410* OR *0x1010* OR *0x1438* OR *0x143a* OR *0x1418* OR *0x1f0fff* OR *0x1f1fff* OR *0x1f2fff* OR *0x1f3fff*))) OR ((winlog.event_id:\"4663\" AND winlog.event_data.ObjectName:*\\\\lsass.exe AND winlog.event_data.AccessList:(*4484* OR *4416*)))) AND (NOT (((winlog.event_data.ProcessName:(*\\\\wmiprvse.exe OR *\\\\taskmgr.exe OR *\\\\procexp64.exe OR *\\\\procexp.exe OR *\\\\lsm.exe OR *\\\\csrss.exe OR *\\\\wininit.exe OR *\\\\vmtoolsd.exe OR *\\\\minionhost.exe OR *\\\\VsTskMgr.exe OR *\\\\thor.exe OR *\\\\thor64.exe OR *\\\\MicrosoftEdgeUpdate.exe OR *\\\\GamingServices.exe OR *\\\\svchost.exe OR *\\\\MsMpEng.exe OR *\\\\MRT.exe OR *RtkAudUService64) AND winlog.event_data.ProcessName:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWow64\\\\* OR C\\:\\\\Windows\\\\SysNative\\\\* OR C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\* OR C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\*))) OR (winlog.event_data.ProcessName:C\\:\\\\Program\\ Files*) OR (winlog.event_data.ProcessName:(\"C:\\Windows\\System32\\taskhostw.exe\" OR \"C:\\Windows\\System32\\msiexec.exe\" OR \"C:\\Windows\\CCM\\CcmExec.exe\")) OR ((winlog.event_data.ProcessName:\"C:\\Windows\\Sysmon64.exe\" AND winlog.event_data.AccessList:*%%4484*)) OR ((winlog.event_data.ProcessName:C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\-sc\\\\aurora\\\\* AND winlog.event_data.ProcessName:*\\\\aurora\\-agent\\-64.exe AND winlog.event_data.AccessList:*%%4484*)) OR ((winlog.event_data.ProcessName:*\\\\x64\\\\SCENARIOENGINE.EXE AND winlog.event_data.AccessList:*%%4484*)) OR ((winlog.event_data.ProcessName:C\\:\\\\Users\\\\* AND winlog.event_data.ProcessName:*\\\\AppData\\\\Local\\\\Temp\\\\is\\-* AND winlog.event_data.ProcessName:*\\\\avira_system_speedup.tmp AND winlog.event_data.AccessList:*%%4484*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://web.archive.org/web/20230208123920/https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
