{"description":"This method uses uncommon error codes on failed logons to determine suspicious activity and tampering with accounts that have been disabled or somehow restricted. Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["User using a disabled account"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6f0d4629-1bb4-2d2e-3046-a58b2266c705","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Account Tampering - Suspicious Failed Logon Reasons","query":"(winlog.channel:\"Security\" AND (winlog.event_id:(\"4625\" OR \"4776\") AND winlog.event_data.Status:(\"0xC0000072\" OR \"0xC000006F\" OR \"0xC0000070\" OR \"0xC0000413\" OR \"0xC000018C\" OR \"0xC000015B\")) AND (NOT (winlog.event_data.SubjectUserSid:\"S\\-1\\-0\\-0\")))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","Initial Access","Privilege Escalation","T1078"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"framework":"MITRE ATT&CK速","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]},{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK速","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK速","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK速","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
