{"description":"Detects renaming of file while deletion with SDelete tool. Author: Thomas Patzke. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate usage of SDelete"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"01a82efb-c5a9-d62e-3d88-f3b5f07c6af5","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Secure Deletion with SDelete","query":"(winlog.channel:\"Security\" AND winlog.event_id:(\"4656\" OR \"4663\" OR \"4658\") AND winlog.event_data.ObjectName:(*.AAA OR *.ZZZ))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1027","T1070","T1485","T1553"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027"},{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"},{"id":"T1553","name":"Subvert Trust Controls","reference":"https://attack.mitre.org/techniques/T1553"}]},{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1485","name":"Data Destruction","reference":"https://attack.mitre.org/techniques/T1485"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
