{"description":"Detects process handle on LSASS process with certain access mask and object type SAM_DOMAIN Author: sigma. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e8ef3cc9-faa2-5977-32b7-f69d11cfb2cf","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Password Dumper Activity on LSASS","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4656\" AND winlog.event_data.ProcessName:*\\\\lsass.exe AND winlog.event_data.AccessMask:\"0x705\" AND winlog.event_data.ObjectType:\"SAM_DOMAIN\")","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
