{"description": "Detects execution of Impacket's psexec.py.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "32d56ea1-417f-44ff-822b-882873f5f43b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Impacket PsExec Execution", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"5145\" AND winlog.event_data.ShareName:\\\\\\\\\\*\\\\IPC$ AND winlog.event_data.RelativeTargetName:(*RemCom_stdint* OR *RemCom_stdoutt* OR *RemCom_stderrt*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
