{"description": "Detects known sensitive file extensions accessed on a network share", "enabled": false, "false_positives": ["Help Desk operator doing backup or re-imaging end user machine or pentest or backup software", "Users working with these data types or exchanging message files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "60d420bf-6e53-4771-a4fb-1baf972df2c8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Access to Sensitive File Extensions", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"5145\" AND winlog.event_data.RelativeTargetName:(*.pst OR *.ost OR *.msg OR *.nst OR *.oab OR *.edb OR *.nsf OR *.bak OR *.dmp OR *.kirbi OR *\\\\groups.xml OR *.rdp))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1039"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1039", "name": "Data from Network Shared Drive", "reference": "https://attack.mitre.org/techniques/T1039"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
