{"description": "Detects an access to authentication tokens and accounts of Microsoft Teams desktop application.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "25cde13e-8e20-4c29-b949-4e795b76f16f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Teams Application Related ObjectAcess Event", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4663\" AND winlog.event_data.ObjectName:(*\\\\Microsoft\\\\Teams\\\\Cookies* OR *\\\\Microsoft\\\\Teams\\\\Local\\ Storage\\\\leveldb*)) AND (NOT (winlog.event_data.ProcessName:*\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1528"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1528", "name": "Steal Application Access Token", "reference": "https://attack.mitre.org/techniques/T1528"}]}], "version": 1, "references": ["https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/", "https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens"], "timestamp_override": "event.ingested", "author": ["@SerkinValery"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
