{"description": "Detects logon events that have characteristics of events generated during an attack with KrbRelayUp and the like", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "749c9f5e-b353-4b90-a9c1-05243357ca4b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "KrbRelayUp Attack Pattern", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"3\" AND winlog.event_data.AuthenticationPackageName:\"Kerberos\" AND source.ip:\"127.0.0.1\" AND winlog.event_data.TargetUserSid:S\\-1\\-5\\-21\\-* AND winlog.event_data.TargetUserSid:*\\-500)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/sbousseaden/status/1518976397364056071?s=12&t=qKO5eKHvWhAP19a50FTZ7g", "https://github.com/elastic/detection-rules/blob/fb6ee2c69864ffdfe347bf3b050cb931f53067a6/rules/windows/privilege_escalation_krbrelayup_suspicious_logon.toml"], "timestamp_override": "event.ingested", "author": ["@SBousseaden", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
