{"description": "Detect remote login by Administrator user (depending on internal pattern).", "enabled": false, "false_positives": ["Legitimate administrative activity."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "80dc53a5-ab33-1810-5774-a059b622166b", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Admin User Remote Logon", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"10\" AND winlog.event_data.AuthenticationPackageName:\"Negotiate\" AND winlog.event_data.TargetUserName:Admin*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Lateral Movement", "T1078", "T1078", "T1078"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://car.mitre.org/wiki/CAR-2016-04-005"], "timestamp_override": "event.ingested", "author": ["juju4"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
