{"description": "Detect PetitPotam coerced authentication activity.", "enabled": false, "false_positives": ["Unknown. Feedback welcomed."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1ce8c8a3-2723-48ed-8246-906ac91061a6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Possible PetitPotam Coerce Authentication Attempt", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"5145\" AND winlog.event_data.ShareName:\\\\\\* AND winlog.event_data.ShareName:*\\\\IPC$ AND winlog.event_data.RelativeTargetName:\"lsarpc\" AND winlog.event_data.SubjectUserName:\"ANONYMOUS\\ LOGON\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1187"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1187", "name": "Forced Authentication", "reference": "https://attack.mitre.org/techniques/T1187"}]}], "version": 1, "references": ["https://github.com/topotam/PetitPotam", "https://github.com/splunk/security_content/blob/0dd6de32de2118b2818550df9e65255f4109a56d/detections/endpoint/petitpotam_network_share_access_request.yml"], "timestamp_override": "event.ingested", "author": ["Mauricio Velazco", "Michael Haag"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
