{"description": "The Directory Service Restore Mode (DSRM) account is a local administrator account on Domain Controllers. Attackers may change the password to gain persistence.", "enabled": false, "false_positives": ["Initial installation of a domain controller"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b13b10e3-4445-1ba5-fd30-4c687967e72f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Password Change on Directory Service Restore Mode (DSRM) Account", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4794\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://adsecurity.org/?p=1714"], "timestamp_override": "event.ingested", "author": ["Thomas Patzke"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
