{"description":"Detect AD credential dumping using impacket secretdump HKTL Author: Samir Bousseaden, wagga. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["pentesting"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e2b2dadc-5ad8-3196-2837-c0a8894e68b8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Possible Impacket SecretDump Remote Activity","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"5145\" AND winlog.event_data.ShareName:\\\\\\*\\\\ADMIN$ AND winlog.event_data.RelativeTargetName:*SYSTEM32\\\\* AND winlog.event_data.RelativeTargetName:*.tmp*)","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1003","T1003","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
