{"description":"Potential adversaries accessing the microphone and webcam in an endpoint. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d9e70b38-a5be-b6b6-7d6e-10887707bce3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Processes Accessing the Microphone and Webcam","query":"(winlog.channel:\"Security\" AND winlog.event_id:(\"4657\" OR \"4656\" OR \"4663\") AND winlog.event_data.ObjectName:(*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\microphone\\\\NonPackaged* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\CapabilityAccessManager\\\\ConsentStore\\\\webcam\\\\NonPackaged*))","meta":{"from":"1m"},"severity":"medium","tags":["T1123"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0009","reference":"https://attack.mitre.org/tactics/TA0009","name":"Collection"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1123","name":"Audio Capture","reference":"https://attack.mitre.org/techniques/T1123"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
