{"description": "Detects the creation of suspicious accounts similar to ANONYMOUS LOGON, such as using additional spaces. Created as an covering detection for exclusion of Logon Type 3 from ANONYMOUS LOGON accounts.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1bbf25b9-8038-4154-a50b-118f2a32be27", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Windows ANONYMOUS LOGON Local Account Created", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4720\" AND winlog.event_data.SamAccountName:*ANONYMOUS* AND winlog.event_data.SamAccountName:*LOGON*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1136", "T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}, {"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1189469425482829824"], "timestamp_override": "event.ingested", "author": ["James Pemberton / @4A616D6573"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
