{"description": "Detects potential mimikatz-like tools accessing LSASS from non system account", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "df215ff1-b725-183b-6a3b-a9164e50b077", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "LSASS Access from Non System Account", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:(\"4663\" OR \"4656\") AND winlog.event_data.AccessMask:(\"0x40\" OR \"0x1400\" OR \"0x100000\" OR \"0x1410\" OR \"0x1010\" OR \"0x1438\" OR \"0x143a\" OR \"0x1418\" OR \"0x1f0fff\" OR \"0x1f1fff\" OR \"0x1f2fff\" OR \"0x1f3fff\" OR \"40\" OR \"1400\" OR \"1000\" OR \"100000\" OR \"1410\" OR \"1010\" OR \"1438\" OR \"143a\" OR \"1418\" OR \"1f0fff\" OR \"1f1fff\" OR \"1f2fff\" OR \"1f3fff\") AND winlog.event_data.ObjectType:\"Process\" AND winlog.event_data.ObjectName:*\\\\lsass.exe) AND (NOT ((winlog.event_data.SubjectUserName:*$) OR (winlog.event_data.ProcessName:C\\:\\\\Program\\ Files*))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-170105221010.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
