{"description": "Detect scenarios where a potentially unauthorized application or user is modifying the system time.", "enabled": false, "false_positives": ["HyperV or other virtualization technologies with binary not listed in filter portion of detection"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "575eba07-bf0d-472a-d042-d55a703297d1", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Unauthorized System Time Modification", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4616\" AND (NOT ((winlog.event_data.ProcessName:(\"C\\:\\\\Program\\ Files\\\\VMware\\\\VMware\\ Tools\\\\vmtoolsd.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\VBoxService.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\oobe\\\\msoobe.exe\")) OR (winlog.event_data.ProcessName:\"C\\:\\\\Windows\\\\System32\\\\svchost.exe\" AND winlog.event_data.SubjectUserSid:\"S\\-1\\-5\\-19\"))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["Private Cuckoo Sandbox (from many years ago, no longer have hash, NDA as well)", "Live environment caused by malware", "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4616"], "timestamp_override": "event.ingested", "author": ["@neu5ron"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
