{"description": "Detects wceaux.dll access while WCE pass-the-hash remote command execution on source host", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c9a2180c-0b8b-2bcf-bc34-84f16bf2aca3", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "WCE wceaux.dll Access", "query": "(winlog.channel:\"Security\" AND winlog.event_id:(\"4656\" OR \"4658\" OR \"4660\" OR \"4663\") AND winlog.event_data.ObjectName:*\\\\wceaux.dll)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.jpcert.or.jp/english/pub/sr/ir_research.html", "https://jpcertcc.github.io/ToolAnalysisResultSheet"], "timestamp_override": "event.ingested", "author": ["Thomas Patzke"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
