{"description": "Detects a threat actor creating a file named `iertutil.dll` in the `C:\\Program Files\\Internet Explorer\\` directory over the network for a DCOM InternetExplorer DLL Hijack scenario.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "549f4170-e670-097a-1882-297c569be603", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "T1021 DCOM InternetExplorer.Application Iertutil DLL Hijack", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"5145\" AND winlog.event_data.RelativeTargetName:*\\\\Internet\\ Explorer\\\\iertutil.dll) AND (NOT (winlog.event_data.SubjectUserName:*$)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Lateral Movement", "T1021", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}, {"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009183000.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g", "Open Threat Research (OTR)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
