{"description": "The 'LsaRegisterLogonProcess' function verifies that the application making the function call is a logon process by checking that it has the SeTcbPrivilege privilege set. Possible Rubeus tries to get a handle to LSA.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c82ebb83-b43f-1989-1307-e7541a295ccb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "User Couldn't Call a Privileged Service 'LsaRegisterLogonProcess'", "query": "(winlog.channel:\"Security\" AND Provider_Name:\"Microsoft\\-Windows\\-Security\\-Auditing\" AND winlog.event_id:\"4673\" AND Service:\"LsaRegisterLogonProcess\\(\\)\" AND Keywords:\"0x8010000000000000\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "Privilege Escalation", "T1558"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (source)", "Ilyas Ochkov (rule)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
