{"description": "Detects scenario where weak encryption is enabled for a user profile which could be used for hash/password cracking.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c3cb24a5-303e-0316-f52f-072dcdcdb558", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Weak Encryption Enabled and Kerberoast", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4738\" AND (((winlog.event_data.NewUacValue:(*8??? OR *9??? OR *A??? OR *B??? OR *C??? OR *D??? OR *E??? OR *F???) AND (NOT (winlog.event_data.OldUacValue:(*8??? OR *9??? OR *A??? OR *B??? OR *C??? OR *D??? OR *E??? OR *F???)))) OR (winlog.event_data.NewUacValue:(*1???? OR *3???? OR *5???? OR *7???? OR *9???? OR *B???? OR *D???? OR *F????) AND (NOT (winlog.event_data.OldUacValue:(*1???? OR *3???? OR *5???? OR *7???? OR *9???? OR *B???? OR *D???? OR *F????))))) OR (winlog.event_data.NewUacValue:(*8?? OR *9?? OR *A?? OR *B?? OR *C?? OR *D?? OR *E?? OR *F??) AND (NOT (winlog.event_data.OldUacValue:(*8?? OR *9?? OR *A?? OR *B?? OR *C?? OR *D?? OR *E?? OR *F??))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2053", "https://www.harmj0y.net/blog/activedirectory/roasting-as-reps/"], "timestamp_override": "event.ingested", "author": ["@neu5ron"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
