{"description":"Detects DCShadow via create new SPN Author: Ilyas Ochkov, oscd.community, Chakib Gzenayi (@Chak092), Hosni Mribah. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Exclude known DCs"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"afb941ee-90e8-95e8-526f-8fb1325b8c91","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Possible DC Shadow","query":"(winlog.channel:\"Security\" AND ((winlog.event_id:\"4742\" AND winlog.event_data.ServicePrincipalNames:*GC\\/*) OR (winlog.event_id:\"5136\" AND winlog.event_data.AttributeLDAPDisplayName:\"servicePrincipalName\" AND AttributeValue:GC\\/*)))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1207"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
