{"description":"Detects Obfuscated use of Clip.exe to execute PowerShell Author: Jonathan Cheong, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4edf51e1-cb83-4e1a-bc39-800e396068e3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Invoke-Obfuscation CLIP+ Launcher","query":"(winlog.channel:\"Security\" AND Provider_Name:\"Microsoft\\-Windows\\-Security\\-Auditing\" AND winlog.event_id:\"4697\" AND winlog.event_data.ServiceFileName:*cmd* AND winlog.event_data.ServiceFileName:*\\&&* AND winlog.event_data.ServiceFileName:*clipboard\\]\\:\\:*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1027","T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
