{"description": "Detects suspicious processes logging on with explicit credentials", "enabled": false, "false_positives": ["Administrators that use the RunAS command or scheduled tasks"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "941e5c45-cda7-4864-8cea-bbb7458d194a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Remote Logon with Explicit Credentials", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4648\" AND winlog.event_data.ProcessName:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\winrs.exe OR *\\\\wmic.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\reg.exe)) AND (NOT ((TargetServerName:\"localhost\") OR (winlog.event_data.SubjectUserName:*$ AND winlog.event_data.TargetUserName:*$))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1078"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"], "timestamp_override": "event.ingested", "author": ["oscd.community", "Teymur Kheirkhabarov @HeirhabarovT", "Zach Stanford @svch0st", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
