{"description": "Detects non-system users performing privileged operation os the SCM database", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dae8171c-5ec6-4396-b210-8466585b53e9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "SCM Database Privileged Operation", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4674\" AND winlog.event_data.ObjectType:\"SC_MANAGER\\ OBJECT\" AND winlog.event_data.ObjectName:\"servicesactive\" AND winlog.event_data.PrivilegeList:\"SeTakeOwnershipPrivilege\") AND (NOT (SubjectLogonId:\"0x3e4\" AND winlog.event_data.ProcessName:*\\:\\\\Windows\\\\System32\\\\services.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190826010110.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
