{"description": "Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.", "enabled": false, "false_positives": ["Other browsers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "20b33681-fc16-1e34-b417-271053a88e7d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Outbound Kerberos Connection", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"5156\" AND DestPort:\"88\") AND (NOT (Application:(*\\\\lsass.exe OR *\\\\opera.exe OR *\\\\chrome.exe OR *\\\\firefox.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1558"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/GhostPack/Rubeus"], "timestamp_override": "event.ingested", "author": ["Ilyas Ochkov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
