{"description":"Detects the usage of particular AttributeLDAPDisplayNames, which are known for data exchange via LDAP by the tool LDAPFragger and are additionally not commonly used in companies. Author: xknow @xknow_infosec. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Companies, who may use these default LDAP-Attributes for personal information"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a191ec04-6d7e-52cf-760e-5ad376032a2e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious LDAP-Attributes Used","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"5136\" AND AttributeValue:* AND winlog.event_data.AttributeLDAPDisplayName:(\"primaryInternationalISDNNumber\" OR \"otherFacsimileTelephoneNumber\" OR \"primaryTelexNumber\"))","meta":{"from":"1m"},"severity":"high","tags":["T1001"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
