{"description": "Detects Mimikatz DC sync security events", "enabled": false, "false_positives": ["Valid DC Sync that is not covered by the filters; please report", "Local Domain Admin account used for Azure AD Connect"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c689ab66-a820-a170-3fd4-91d6e8d047e2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Mimikatz DC Sync", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4662\" AND winlog.event_data.Properties:(*Replicating\\ Directory\\ Changes\\ All* OR *1131f6ad\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *1131f6aa\\-9c07\\-11d1\\-f79f\\-00c04fc2dcd2* OR *9923a32a\\-3607\\-11d2\\-b9be\\-0000f87a36b2* OR *89e95b76\\-444d\\-4c62\\-991a\\-0facbeda640c*) AND winlog.event_data.AccessMask:\"0x100\") AND (NOT ((winlog.event_data.SubjectDomainName:\"Window\\ Manager\") OR (winlog.event_data.SubjectUserName:(NT\\ AUT* OR MSOL_*)) OR (winlog.event_data.SubjectUserName:*$))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/gentilkiwi/status/1003236624925413376", "https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2", "https://blog.blacklanternsecurity.com/p/detecting-dcsync?s=r", "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4662"], "timestamp_override": "event.ingested", "author": ["Benjamin Delpy", "Florian Roth", "Scott Dermott", "Sorina Ionescu"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
