{"description":"Detects the renaming of an existing computer account to a account name that doesn't contain a $ symbol as seen in attacks against CVE-2021-42287 Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9707c250-eb4e-3db8-788c-f5534b2bb336","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Suspicious Computer Account Name Change CVE-2021-42287","query":"(winlog.channel:\"Security\" AND (winlog.event_id:\"4781\" AND OldTargetUserName:*$*) AND (NOT (NewTargetUserName:*$*)))","meta":{"from":"1m"},"severity":"critical","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
