{"description": "Detects basic PowerShell Remoting (WinRM) by monitoring for network inbound connections to ports 5985 OR 5986", "enabled": false, "false_positives": ["Legitimate use of remote PowerShell execution"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "13acf386-b8c6-4fe0-9a6e-c4756b974698", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote PowerShell Sessions Network Connections (WinRM)", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"5156\" AND DestPort:(\"5985\" OR \"5986\") AND LayerRTID:\"44\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
