{"description":"Detects the deactivation and disabling of the Scheduled defragmentation task as seen by Slingshot APT group Author: Florian Roth, Bartlomiej Czyz (@bczyz1). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a97ffee7-faa2-b1ac-1099-be829f48434d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Defrag Deactivation","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4701\" AND winlog.event_data.TaskName:\"\\\\Microsoft\\\\Windows\\\\Defrag\\\\ScheduledDefrag\")","meta":{"from":"1m"},"severity":"medium","tags":["T1053"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
