{"description":"Detects non-system users failing to get a handle of the SCM database. Author: Roberto Rodriguez @Cyb3rWard0g. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5a688d19-4150-083e-a709-d6cdc2748e29","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"SCM Database Handle Failure","query":"(winlog.channel:\"Security\" AND (winlog.event_id:\"4656\" AND winlog.event_data.ObjectType:\"SC_MANAGER\\ OBJECT\" AND winlog.event_data.ObjectName:\"ServicesActive\") AND (NOT (SubjectLogonId:\"0x3e4\")))","meta":{"from":"1m"},"severity":"critical","tags":["T1010"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1010","name":"Application Window Discovery","reference":"https://attack.mitre.org/techniques/T1010"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
