{"description": "Detects service installation of different remote access tools software. These software are often abused by threat actors to perform", "author": ["Connor Martin", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["The rule doesn't look for anything suspicious so false positives are expected. If you use one of the tools mentioned, comment it out"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c8b00925-926c-47e3-beea-298fd563728e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remote Access Tool Services Have Been Installed - Security", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4697\" AND winlog.event_data.ServiceFileName:(*AmmyyAdmin* OR *Atera* OR *BASupportExpressSrvcUpdater* OR *BASupportExpressStandaloneService* OR *chromoting* OR *GoToAssist* OR *GoToMyPC* OR *jumpcloud* OR *LMIGuardianSvc* OR *LogMeIn* OR *monblanking* OR *Parsec* OR *RManService* OR *RPCPerformanceService* OR *RPCService* OR *SplashtopRemoteService* OR *SSUService* OR *TeamViewer* OR *TightVNC* OR *vncserver* OR *Zoho*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1543", "T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
