{"description": "Detects unusual processes accessing desktop.ini remotely over network share, which can be leveraged to alter how Explorer displays a folder's content (i.e. renaming files) without changing them on disk.", "enabled": false, "false_positives": ["Read only access list authority"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "35bc7e28-ee6b-492f-ab04-da58fcf6402e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Network Access Suspicious desktop.ini Action", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"5145\" AND winlog.event_data.ObjectType:\"File\" AND winlog.event_data.RelativeTargetName:*\\\\desktop.ini AND AccessList:(*WriteData* OR *DELETE* OR *WriteDAC* OR *AppendData* OR *AddSubdirectory*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/"], "timestamp_override": "event.ingested", "author": ["Tim Shelton (HAWK.IO)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
