{"description": "Detects possible bypass EDR and SIEM via abnormal user account name.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cfeed607-6aa4-4bbd-9627-b637deb723c8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New or Renamed User Account with '$' in Attribute 'SamAccountName'", "query": "(winlog.channel:\"Security\" AND winlog.event_id:(\"4720\" OR \"4781\") AND winlog.event_data.SamAccountName:*$*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Ilyas Ochkov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
