{"description":"Detects the creation of suspicious accounts similar to ANONYMOUS LOGON, such as using additional spaces. Created as an covering detection for exclusion of Logon Type 3 from ANONYMOUS LOGON accounts. Author: James Pemberton / @4A616D6573. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6597d9a3-88c4-f56c-a44c-bc40e2eb39d2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Windows ANONYMOUS LOGON Local Account Created","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4720\" AND winlog.event_data.SamAccountName:*ANONYMOUS* AND winlog.event_data.SamAccountName:*LOGON*)","meta":{"from":"1m"},"severity":"high","tags":["T1136","T1136"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"},{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
