{"description": "Detects Netlogon Elevation of Privilege Vulnerability aka Zerologon (CVE-2020-1472)", "enabled": false, "false_positives": ["automatic DC computer account password change", "Legitimate DC computer account password change"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dd7876d8-0f09-11eb-adc1-0242ac120002", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Possible Zerologon (CVE-2020-1472) Exploitation", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"4742\" AND winlog.event_data.SubjectUserName:\"ANONYMOUS\\ LOGON\" AND winlog.event_data.TargetUserName:\"%DC\\-MACHINE\\-NAME%\") AND (NOT (winlog.event_data.PasswordLastSet:\"\\-\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1472", "https://www.logpoint.com/en/blog/detecting-zerologon-vulnerability-in-logpoint/"], "timestamp_override": "event.ingested", "author": ["Aleksandr Akhremchik", "@aleqs4ndr", "ocsd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
