{"description": "Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.", "author": ["Ilyas Ochkov", "oscd.community"], "enabled": false, "false_positives": ["Web Browsers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "eca91c7c-9214-47b9-b4c5-cb1d7e4f2350", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Outbound Kerberos Connection - Security", "query": "(winlog.channel:\"Security\" AND (winlog.event_id:\"5156\" AND DestPort:\"88\") AND (NOT Application:(\"C:\\Windows\\System32\\lsass.exe\" OR \"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files\\Mozilla Firefox\\firefox.exe\" OR \"C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1558"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/GhostPack/Rubeus"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
