{"description": "Detects anyone attempting a backup for the DPAPI Master Key. This events gets generated at the source and not the Domain Controller.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cf89cd93-d4f9-3fba-7bdb-135451287fb2", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "DPAPI Domain Master Key Backup Attempt", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4692\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
