{"description": "Rule to detect the Hybrid Connection Manager service installation.", "enabled": false, "false_positives": ["Legitimate use of Hybrid Connection Manager via Azure function apps."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "63aea690-d9bf-e4ce-14a6-1a593d841992", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HybridConnectionManager Service Installation", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4697\" AND winlog.event_data.ServiceName:\"HybridConnectionManager\" AND winlog.event_data.ServiceFileName:*HybridConnectionManager*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1554"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1554", "name": "Compromise Client Software Binary", "reference": "https://attack.mitre.org/techniques/T1554"}]}], "version": 1, "references": ["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
