{"description": "One of the Windows Eventlogs has been cleared. e.g. caused by \"wevtutil cl\" command execution", "enabled": false, "false_positives": ["Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)", "System provisioning (system reset before the golden image creation)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d99b79d2-0a6f-4f46-ad8b-260b6e17f982", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Security Eventlog Cleared", "query": "(winlog.channel:\"Security\" AND ((winlog.event_id:\"517\" AND Provider_Name:\"Security\") OR (winlog.event_id:\"1102\" AND Provider_Name:\"Microsoft\\-Windows\\-Eventlog\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://twitter.com/deviouspolack/status/832535435960209408", "https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
