{"description":"Detects scenarios where one can control another users or computers account without having to use their credentials. Author: @neu5ron. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f77f821e-2ad3-7422-062b-c2df56e31c13","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Active Directory User Backdoors","query":"(winlog.channel:\"Security\" AND ((winlog.event_id:\"4738\" AND (NOT (winlog.event_data.AllowedToDelegateTo:\"\\-\" OR NOT _exists_:winlog.event_data.AllowedToDelegateTo))) OR (winlog.event_id:\"5136\" AND (winlog.event_data.AttributeLDAPDisplayName:\"msDS\\-AllowedToDelegateTo\" OR (winlog.event_data.ObjectClass:\"user\" AND winlog.event_data.AttributeLDAPDisplayName:\"servicePrincipalName\") OR winlog.event_data.AttributeLDAPDisplayName:\"msDS\\-AllowedToActOnBehalfOfOtherIdentity\"))))","meta":{"from":"1m"},"severity":"high","tags":["T1098"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
