{"description":"One of the Windows Eventlogs has been cleared. e.g. caused by \"wevtutil cl\" command execution Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)","System provisioning (system reset before the golden image creation)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"64c008cc-9cee-8e86-1b1e-a8f10d1d70c4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Security Eventlog Cleared","query":"(winlog.channel:\"Security\" AND ((winlog.event_id:\"517\" AND Provider_Name:\"Security\") OR (winlog.event_id:\"1102\" AND Provider_Name:\"Microsoft\\-Windows\\-Eventlog\")))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1070"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
