{"description": "Detects external diskdrives or plugged in USB devices , EventID 6416 on windows 10 or later", "enabled": false, "false_positives": ["Legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2884a59d-a2b2-15d4-d248-978a168e0ede", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "External Disk Drive Or USB Storage Device", "query": "(winlog.channel:\"Security\" AND ((winlog.event_id:\"6416\" AND ClassName:\"DiskDrive\") OR DeviceDescription:\"USB\\ Mass\\ Storage\\ Device\"))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Initial Access", "Lateral Movement", "T1091", "T1200"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1091", "name": "Replication Through Removable Media", "reference": "https://attack.mitre.org/techniques/T1091"}, {"id": "T1200", "name": "Hardware Additions", "reference": "https://attack.mitre.org/techniques/T1200"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1091", "name": "Replication Through Removable Media", "reference": "https://attack.mitre.org/techniques/T1091"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Keith Wright"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
