{"description":"Detect potential adversaries leveraging WMI ActiveScriptEventConsumers remotely to move laterally in a network Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["SCCM"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"81a77adf-83ee-95c5-7354-b89561bf7386","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Remote WMI ActiveScriptEventConsumers","query":"(winlog.channel:\"Security\" AND (winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"3\" AND winlog.event_data.ProcessName:*scrcons.exe) AND (NOT (TargetLogonId:\"0x3e7\")))","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","Privilege Escalation","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
