{"description": "Detects the creation of a local hidden user account which should not happen for event ID 4720.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c435518d-7303-be5f-84cc-4b5760084c8c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Hidden Local User Creation", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4720\" AND winlog.event_data.TargetUserName:*$)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1387743867663958021"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
