{"description": "Detects multiple file rename or delete events occurrence within a specified period of time by a same user (these events may signalize about ransomware activity).", "enabled": false, "false_positives": ["Software uninstallation", "Files restore activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "97919310-06a7-482c-9639-92b67ed63cf8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Multiple File Rename Or Delete Occurred", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4663\" AND winlog.event_data.ObjectType:\"File\" AND AccessList:\"%%1537\" AND Keywords:\"0x8020000000000000\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1486"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1486", "name": "Data Encrypted for Impact", "reference": "https://attack.mitre.org/techniques/T1486"}]}], "version": 1, "threshold": {"field": "SubjectLogonId", "value": 11}, "references": ["https://www.manageengine.com/data-security/how-to/how-to-detect-ransomware-attacks.html"], "timestamp_override": "event.ingested", "author": ["Vasiliy Burov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
