{"description":"Detects the registration of the security event source VSSAudit. It would usually trigger when volume shadow copy operations happen. Author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of VSSVC. Maybe backup operations. It would usually be done by C:\\Windows\\System32\\VSSVC.exe."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"34e6ef2b-e6e1-b110-1e9a-ac2f3278a331","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"VSSAudit Security Event Source Registration","query":"(winlog.channel:\"Security\" AND Provider_Name:\"Microsoft\\-Windows\\-Security\\-Auditing\" AND AuditSourceName:\"VSSAudit\" AND winlog.event_id:(\"4904\" OR \"4905\"))","meta":{"from":"1m"},"severity":"low","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
