{"description": "This rule triggers on user accounts that are added to the local Administrators group, which could be legitimate activity or a sign of privilege escalation activity", "enabled": false, "false_positives": ["Legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7ef8a58a-0490-e67c-64a1-be6c4d7fe1c6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "User Added to Local Administrators", "query": "(winlog.channel:\"Security\" AND ((Provider_Name:\"Microsoft\\-Windows\\-Security\\-Auditing\" AND winlog.event_id:\"4732\") AND (winlog.event_data.TargetUserName:Administr* OR winlog.event_data.TargetSid:\"S\\-1\\-5\\-32\\-544\")) AND (NOT (winlog.event_data.SubjectUserName:*$)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1078", "T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}, {"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
