{"description": "Detects process handle on LSASS process with certain access mask", "author": ["Roberto Rodriguez", "Teymur Kheirkhabarov", "Dimitrios Slamaris", "Mark Russinovich", "Aleksey Potapov", "oscd.community (update)"], "enabled": false, "false_positives": ["Legitimate software accessing LSASS process for legitimate reason; update the whitelist with it"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4a1b6da0-d94f-4fc3-98fc-2d9cb9e5ee76", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Generic Password Dumper Activity on LSASS", "query": "(winlog.channel:Security AND (((winlog.event_id:4656 AND winlog.event_data.ObjectName:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessMask:(*0x40* OR *0x1400* OR *0x100000* OR *0x1410* OR *0x1010* OR *0x1438* OR *0x143a* OR *0x1418* OR *0x1f0fff* OR *0x1f1fff* OR *0x1f2fff* OR *0x1f3fff*))) OR ((winlog.event_id:4663 AND winlog.event_data.ObjectName:/.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessList:(*4484* OR *4416*)))) AND (NOT (((winlog.event_data.ProcessName:(/.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Aa][Mm][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ii][Nn][Ii][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Rr][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ee][Rr][Ff][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Vv][Ss][Tt][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Mm][Ii][Pp][Rr][Vv][Ss][Ee]\\.[Ee][Xx][Ee]/ OR *RtkAudUService64) AND winlog.event_data.ProcessName:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Nn][Aa][Tt][Ii][Vv][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/))) OR (winlog.event_data.ProcessName:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/) OR (winlog.event_data.ProcessName:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Cc][Mm]\\\\[Cc][Cc][Mm][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.ProcessName:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessList:/.*\\%\\%4484.*/)) OR ((winlog.event_data.ProcessName:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\-[Ss][Cc]\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\\\.*/ AND winlog.event_data.ProcessName:/.*\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Aa][Gg][Ee][Nn][Tt]\\-64\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessList:/.*\\%\\%4484.*/)) OR ((winlog.event_data.ProcessName:/.*\\\\[Xx]64\\\\[Ss][Cc][Ee][Nn][Aa][Rr][Ii][Oo][Ee][Nn][Gg][Ii][Nn][Ee]\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessList:/.*\\%\\%4484.*/)) OR ((winlog.event_data.ProcessName:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND winlog.event_data.ProcessName:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Ii][Ss]\\-.*/ AND winlog.event_data.ProcessName:/.*\\\\[Aa][Vv][Ii][Rr][Aa]\\_[Ss][Yy][Ss][Tt][Ee][Mm]\\_[Ss][Pp][Ee][Ee][Dd][Uu][Pp]\\.[Tt][Mm][Pp]/ AND winlog.event_data.AccessList:/.*\\%\\%4484.*/)) OR ((winlog.event_data.ProcessName:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Nn][Mm][Pp]\\.[Ee][Xx][Ee]/ AND winlog.event_data.AccessList:/.*\\%\\%4484.*/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://web.archive.org/web/20230208123920/https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html", "https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
