{"description": "Detects scenarios where system auditing for important events such as \"Process Creation\" or \"Logon\" events is disabled.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab4561b1-6c7e-48a7-ad08-087cfb9ce8f1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Important Windows Event Auditing Disabled", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4719\" AND (((SubcategoryGuid:(\"{0CCE9215-69AE-11D9-BED3-505054503030}\" OR \"{0CCE922B-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9240-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9210-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9211-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9212-69AE-11D9-BED3-505054503030}\" OR \"{0CCE921B-69AE-11D9-BED3-505054503030}\" OR \"{0CCE922F-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9230-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9235-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9236-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9237-69AE-11D9-BED3-505054503030}\" OR \"{0CCE923F-69AE-11D9-BED3-505054503030}\" OR \"{0CCE9242-69AE-11D9-BED3-505054503030}\") AND winlog.event_data.AuditPolicyChanges:(*%%8448* OR *%%8450*))) OR ((SubcategoryGuid:\"{0CCE9217-69AE-11D9-BED3-505054503030}\" AND winlog.event_data.AuditPolicyChanges:*%%8448*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://docs.google.com/presentation/d/1dkrldTTlN3La-OjWtkWJBb4hVk6vfsSMBFBERs6R8zA/edit", "https://github.com/SigmaHQ/sigma/blob/master/documentation/logsource-guides/windows/service/security.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
