{"description": "This detection method points out highly relevant Antivirus events", "author": ["Florian Roth (Nextron Systems)", "Arnim Rupp"], "enabled": false, "false_positives": ["Some software piracy tools (key generators, cracks) are classified as hack tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "78bc5783-81d9-4d73-ac97-59f6db4f72a8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Relevant Anti-Virus Event", "query": "(winlog.channel:Application AND ((/\\*[Aa][Dd][Ff][Ii][Nn][Dd]\\*/) OR (/\\*[Aa][Ss][Pp]\\/[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\*/) OR (/\\*[Aa][Tt][Kk]\\/\\*/) OR (/\\*[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\.[Aa][Ss][Pp]\\*/) OR (/\\*[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\.[Cc][Oo][Bb][Aa][Ll][Tt]\\*/) OR (/\\*[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\.[Jj][Ss][Pp]\\*/) OR (/\\*[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\.[Pp][Hh][Pp]\\*/) OR (/\\*[Bb][Ll][Aa][Cc][Kk][Ww][Oo][Rr][Mm]\\*/) OR (/\\*[Bb][Rr][Uu][Tt][Ee][Ll]\\*/) OR (/\\*[Bb][Rr][Uu][Tt][Ee][Rr]\\*/) OR (/\\*[Cc][Hh][Oo][Pp][Pp][Ee][Rr]\\*/) OR (/\\*[Cc][Oo][Bb][Aa][Ll][Tt]\\*/) OR (/\\*[Cc][Oo][Bb][Ee][Aa][Cc][Oo][Nn]\\*/) OR (/\\*[Cc][Oo][Mm][Ee][Tt][Ee][Rr]\\*/) OR (/\\*[Cc][Rr][Yy][Pp][Tt][Ee][Ss]\\*/) OR (/\\*[Cc][Rr][Yy][Pp][Tt][Oo][Rr]\\*/) OR (/\\*[Dd][Ee][Ss][Tt][Rr][Uu][Cc][Tt][Oo][Rr]\\*/) OR (/\\*[Dd][Uu][Mm][Pp][Cc][Rr][Ee][Dd][Ss]\\*/) OR (/\\*[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ss][Cc][Rr][Ii][Pp][Tt]\\.[Cc][Vv][Ee]\\*/) OR (/\\*[Ff][Ii][Ll][Ee][Cc][Oo][Dd][Ee][Rr]\\*/) OR (/\\*[Ff][Aa][Ss][Tt][Rr][Ee][Vv][Ee][Rr][Ss][Ee][Pp][Rr][Oo][Xx][Yy]\\*/) OR (/\\*[Gg][Rr][Aa][Nn][Dd][Cc][Rr][Aa][Bb]\\*/) OR (/\\*[Hh][Aa][Cc][Kk][Tt][Oo][Oo][Ll]\\*/) OR (/\\*[Hh][Kk][Tt][Ll]\\.\\*/) OR (/\\*[Hh][Kk][Tt][Ll]\\/\\*/) OR (/\\*[Hh][Kk][Tt][Ll]\\:\\*/) OR (/\\*[Hh][Tt][Oo][Oo][Ll]\\*/) OR (/\\*[Ii][Mm][Pp][Aa][Cc][Kk][Ee][Tt]\\*/) OR (/\\*[Ii][Ii][Ss][Ee][Xx][Cc][Hh][Gg][Ss][Pp][Aa][Ww][Nn][Cc][Mm][Dd]\\*/) OR (/\\*[Jj][Ss][Pp]\\/[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\*/) OR (/\\*[Kk][Ee][Yy][Ll][Oo][Gg][Gg][Ee][Rr]\\*/) OR (/\\*[Kk][Oo][Aa][Dd][Ii][Cc]\\*/) OR (/\\*[Kk][Rr][Yy][Pp][Tt]\\*/) OR (/\\*[Ll][Aa][Zz][Aa][Gg][Nn][Ee]\\*/) OR (/\\*[Ll][Oo][Cc][Kk][Ee][Rr]\\*/) OR (/\\*[Mm][Ee][Tt][Aa][Ss][Pp][Ll][Oo][Ii][Tt]\\*/) OR (/\\*[Mm][Ee][Tt][Ee][Rr][Pp][Rr][Ee][Tt][Ee][Rr]\\*/) OR (/\\*[Mm][Ee][Tt][Ee][Tt][Oo][Oo][Ll]\\*/) OR (/\\*[Mm][Ii][Mm][Ii][Kk][Aa][Tt][Zz]\\*/) OR (/\\*[Mm][Pp][Rr][Ee][Tt][Ee][Rr]\\*/) OR (/\\*[Nn][Ii][Gg][Hh][Tt][Hh][Aa][Ww][Kk]\\*/) OR (/\\*[Pp][Aa][Cc][Kk][Ee][Dd]\\.[Gg][Ee][Nn][Ee][Rr][Ii][Cc]\\.347\\*/) OR (/\\*[Pp][Ee][Nn][Tt][Ee][Ss][Tt][Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\*/) OR (/\\*[Pp][Hh][Oo][Bb][Oo][Ss]\\*/) OR (/\\*[Pp][Hh][Pp]\\/[Bb][Aa][Cc][Kk][Dd][Oo][Oo][Rr]\\*/) OR (/\\*[Pp][Oo][Tt][Aa][Tt][Oo]\\*/) OR (/\\*[Pp][Oo][Ww][Ee][Rr][Ss][Pp][Ll][Oo][Ii][Tt]\\*/) OR (/\\*[Pp][Oo][Ww][Ee][Rr][Ss][Ss][Hh]\\*/) OR (/\\*[Pp][Ss][Hh][Ll][Ss][Pp][Yy]\\*/) OR (/\\*[Pp][Ss][Ww][Tt][Oo][Oo][Ll]\\*/) OR (/\\*[Pp][Ww][Cc][Rr][Aa][Cc][Kk]\\*/) OR (/\\*[Pp][Ww][Dd][Uu][Mm][Pp]\\*/) OR (/\\*[Rr][Aa][Nn][Ss][Oo][Mm]\\*/) OR (/\\*[Rr][Oo][Zz][Ee][Nn][Aa]\\*/) OR (/\\*[Rr][Yy][Zz][Ee][Rr][Ll][Oo]\\*/) OR (/\\*[Ss][Bb][Ee][Ll][Tt]\\*/) OR (/\\*[Ss][Ee][Aa][Tt][Bb][Ee][Ll][Tt]\\*/) OR (/\\*[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Tt][Oo][Oo][Ll]\\*/) OR (/\\*[Ss][Hh][Aa][Rr][Pp][Dd][Uu][Mm][Pp]\\*/) OR (/\\*[Ss][Ll][Ii][Vv][Ee][Rr]\\*/) OR (/\\*[Ss][Pp][Ll][Ii][Nn][Tt][Ee][Rr]\\*/) OR (/\\*[Ss][Ww][Rr][Oo][Rr][Tt]\\*/) OR (/\\*[Tt][Ee][Ss][Cc][Rr][Yy][Pp][Tt]\\*/) OR (/\\*[Tt][Ee][Ss][Ll][Aa][Cc][Rr][Yy][Pp][Tt]\\*/) OR (/\\*[Vv][Aa][Ll][Yy][Rr][Ii][Aa]\\*/) OR (/\\*[Ww][Ee][Bb][Ss][Hh][Ee][Ll][Ll]\\*/)) AND (NOT ((((/\\*[Kk][Ee][Yy][Gg][Ee][Nn]\\*/) OR (/\\*[Cc][Rr][Aa][Cc][Kk]\\*/) OR (/\\*[Aa][Nn][Tt][Ii]_[Rr][Aa][Nn][Ss][Oo][Mm][Ww][Aa][Rr][Ee]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]\\*/) OR (/\\*[Cc][Yy][Bb][Ee][Rr]\\-[Pp][Rr][Oo][Tt][Ee][Cc][Tt]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]\\*/))) OR (Level:4) OR (Provider_Name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Rr][Ee][Ss][Tt][Aa][Rr][Tt][Mm][Aa][Nn][Aa][Gg][Ee][Rr]/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Resource Development", "T1588"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1588", "name": "Obtain Capabilities", "reference": "https://attack.mitre.org/techniques/T1588"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/13828b390d5f58b002e808c2c4f02fdd920e236cc8015480fa33b6c1a9300e31", "https://www.virustotal.com/gui/file/15b57c1b68cd6ce3c161042e0f3be9f32d78151fe95461eedc59a79fc222c7ed", "https://www.virustotal.com/gui/file/5092b2672b4cb87a8dd1c2e6047b487b95995ad8ed5e9fc217f46b8bfb1b8c01"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
