{"description": "Detects cases in which ngrok, a reverse proxy tool, forwards events to the local RDP port, which could be a sign of malicious behaviour", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e22aea86-6539-6c64-4b98-7196ab2f60d8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Ngrok Usage with Remote Desktop Service", "query": "(winlog.event_id:\"21\" AND Address:*16777216*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg", "https://ngrok.com/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
