{"description": "Detects corrupted packets sent to the MSMQ service. Could potentially be a sign of CVE-2023-21554 exploitation", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ae94b10d-fee9-4767-82bb-439b309d5a27", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSMQ Corrupted Packet Encountered", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MSMQ\" AND winlog.event_id:\"2027\" AND Level:\"2\")", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.randori.com/blog/vulnerability-analysis-queuejumper-cve-2023-21554/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
