{"description": "Detects potential SpEL Injection exploitation, which may lead to RCE.", "author": ["Moti Harmats"], "enabled": false, "false_positives": ["Application bugs"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e9edd087-89d8-48c9-b0b4-5b9bb10896b8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential SpEL Injection In Spring Framework", "query": "\"org.springframework.expression.ExpressionException\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://owasp.org/www-community/vulnerabilities/Expression_Language_Injection", "https://www.wix.engineering/post/threat-and-vulnerability-hunting-with-application-server-error-logs"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
