{"description": "Detects suspicious SQL query keywrods that are often used during recon, exfiltration or destructive activities. Such as dropping tables and selecting wildcard fields", "author": ["@juju4"], "enabled": false, "false_positives": ["Inventory and monitoring activity", "Vulnerability scanners", "Legitimate applications"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a8f7ef09-111e-c02a-34a6-d6d5f03e3f45", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious SQL Query", "query": "((*drop*) OR (*truncate*) OR (*dump*) OR (*select \\*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "Privilege Escalation", "T1190", "T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://github.com/sqlmapproject/sqlmap"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
