{"description":"Adversaries can interact with the DACLs using built-in Windows commands takeown which can grant adversaries higher permissions on specific files and folders Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Scripts created by developers and admins","Administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"554601fb-9b71-4bcc-abf4-21a611be4fde","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Recursif Takeown","query":"(process.executable:*\\\\takeown.exe AND process.command_line:*\\/f\\ * AND process.command_line:*\\/r*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1222"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1222","name":"File and Directory Permissions Modification","reference":"https://attack.mitre.org/techniques/T1222"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
