{"description": "Attackers may change the file creation time of a backdoor to make it look like it was installed with the operating system.\nNote that many processes legitimately change the creation time of a file; it does not necessarily indicate malicious activity.\n", "enabled": false, "false_positives": ["Changes made to or by the local NTP service"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c6f7d028-8d94-30ba-c6b4-6215bdecf3db", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Creation Date Changed to Another Year", "query": "((PreviousCreationUtcTime:\"2022\" AND (NOT (CreationUtcTime:\"2022\"))) OR (PreviousCreationUtcTime:\"202\" AND (NOT (CreationUtcTime:\"202\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://www.inversecos.com/2022/04/defence-evasion-technique-timestomping.html"], "timestamp_override": "event.ingested", "author": ["frack113", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
