{"description":"Detects when an application Sign-on Policy is modified or deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"8f668cc4-c18e-45fe-ad00-624a981cf88a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Okta Application Sign-On Policy Modified or Deleted","query":"eventtype:(\"application.policy.sign_on.update\" OR \"application.policy.sign_on.rule.delete\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
