{"description": "Detects when an security threat is detected in Okta.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a60890b1-2061-fea1-fcab-2cf89cd9a8ea", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Okta Security Threat Detected", "query": "eventtype:\"security.threat.detected\"", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://okta.github.io/okta-help/en/prod/Content/Topics/Security/threat-insight/configure-threatinsight-system-log.htm", "https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
