{"description": "Detects when Okta FastPass prevents a known phishing site.", "author": ["Austin Songer @austinsonger"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "ee39a9f7-5a79-4b0a-9815-d36b3cf28d3e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Okta FastPass Phishing Detection", "query": "(outcome.reason:\"FastPass declined phishing attempt\" AND outcome.result:\"FAILURE\" AND eventtype:\"user.authentication.auth_via_mfa\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://sec.okta.com/fastpassphishingdetection", "https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
