{"description":"Detects when an user account is locked out. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"14701da0-4b0f-4ee6-9c95-2ffb4e73bb9a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Okta User Account Locked Out","query":"displaymessage:\"Max\\ sign\\ in\\ attempts\\ exceeded\"","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
