{"description": "Detects when unauthorized access to app occurs.", "enabled": false, "false_positives": ["User might of believe that they had access."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e640a41c-56ed-6b53-ff3a-e1c18586bee8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Okta Unauthorized Access to App", "query": "displaymessage:\"User\\ attempted\\ unauthorized\\ access\\ to\\ app\"", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
