{"description": "Detects when an Okta policy is modified or deleted.", "enabled": false, "false_positives": ["Okta Policies being modified or deleted may be performed by a system administrator.", "Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Okta Policies modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "cc372e39-ad70-c354-8729-9dc045a891bb", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Okta Policy Modified or Deleted", "query": "eventtype:(\"policy.lifecycle.update\" OR \"policy.lifecycle.delete\")", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
