{"description":"Detects when an attempt at deactivating  or resetting MFA. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["If a MFA reset or deactivated was performed by a system administrator."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"50e068d7-1e6b-4054-87e5-0a592c40c7e0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Okta MFA Reset or Deactivated","query":"eventtype:(\"user.mfa.factor.deactivate\" OR \"user.mfa.factor.reset_all\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
