{"description":"Detects when unauthorized access to app occurs. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["User might of believe that they had access."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"6cc2b61b-d97e-42ef-a9dd-8aa8dc951657","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Okta Unauthorized Access to App","query":"displaymessage:\"User\\ attempted\\ unauthorized\\ access\\ to\\ app\"","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
