{"description": "Detects when an the Administrator role is assigned to an user or group.", "enabled": false, "false_positives": ["Administrator roles could be assigned to users or group by other admin users."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "413d4a81-6c98-4479-9863-014785fd579c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Okta Admin Role Assigned to an User or Group", "query": "eventtype:(\"group.privilege.grant\" OR \"user.account.privilege.grant\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
