{"description":"Detects when an Policy Rule is Modified or Deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"0c97c1d3-4057-45c9-b148-1de94b631931","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Okta Policy Rule Modified or Deleted","query":"eventtype:(\"policy.rule.update\" OR \"policy.rule.delete\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
