{"description": "Detects when an attempt at deactivating  or resetting MFA.", "enabled": false, "false_positives": ["If a MFA reset or deactivated was performed by a system administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "67c9d10e-cd69-140a-efa0-83181a195e62", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Okta MFA Reset or Deactivated", "query": "eventtype:(\"user.mfa.factor.deactivate\" OR \"user.mfa.factor.reset_all\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
