{"description": "Detects when an application is modified or deleted.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "7899144b-e416-4c28-b0b5-ab8f9e0a541d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Okta Application Modified or Deleted", "query": "eventtype:(\"application.lifecycle.update\" OR \"application.lifecycle.delete\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developer.okta.com/docs/reference/api/system-log/", "https://developer.okta.com/docs/reference/api/event-types/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
