{"description":"Detects remote RPC calls to read information about scheduled tasks Author: Sagie Dulce, Dekel Paz. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"1f8bbd58-b778-0db4-c594-69ab56d0bf29","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Remote Schedule Task Recon via ITaskSchedulerService","query":"((EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"86d35949\\-83c9\\-4044\\-b424\\-db363231fd0c\") AND (NOT (OpNum:(\"1\" OR \"3\" OR \"4\" OR \"10\" OR \"11\" OR \"12\" OR \"13\" OR \"14\" OR \"15\"))))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
