{"description": "Detects remote RPC calls to possibly abuse remote printing service via MS-RPRN / MS-PAR", "author": ["Sagie Dulce", "Dekel Paz"], "enabled": false, "false_positives": ["Actual printing"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "3a7e2b31-df5c-8b96-0f2d-f3b274df65a1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Printing Abuse for Lateral Movement", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:(\"12345678-1234-abcd-ef00-0123456789ab\" OR \"76f03f96-cdfd-44fc-a22c-64950a001209\" OR \"0b6edbfa-4a24-4fc6-8a23-942b1eca65d1\" OR \"ae33069b-a2a8-46ee-a235-ddfd339be281\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rprn/d42db7d5-f141-4466-8f47-0a4be14e2fc1", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-pan/e44d984c-07d3-414c-8ffc-f8c8ad8512a8", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-RPRN-PAR.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
