{"description":"Detects remote RPC calls useb by SharpHound to map remote connections and local group membership. Author: Sagie Dulce, Dekel Paz. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"28b21226-89bd-3f3c-b805-d7956f2b5931","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"SharpHound Recon Account Discovery","query":"(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"6bffd098\\-a112\\-3610\\-9833\\-46c3f87e345a\" AND OpNum:\"2\")","meta":{"from":"1m"},"severity":"high","tags":["T1087"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
