{"description": "Detects remote RPC calls to read information about scheduled tasks", "author": ["Sagie Dulce", "Dekel Paz"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "1f8bbd58-b778-0db4-c594-69ab56d0bf29", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Schedule Task Recon via ITaskSchedulerService", "query": "((EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"86d35949-83c9-4044-b424-db363231fd0c\") AND (NOT OpNum:(\"1\" OR \"3\" OR \"4\" OR \"10\" OR \"11\" OR \"12\" OR \"13\" OR \"14\" OR \"15\")))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
