{"description": "Detects remote RPC calls to create or execute a scheduled task", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "0a058c29-ab92-5888-b2b9-00060f660bf0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Schedule Task Lateral Movement via ITaskSchedulerService", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"86d35949\\-83c9\\-4044\\-b424\\-db363231fd0c\" AND OpNum:(\"1\" OR \"3\" OR \"4\" OR \"10\" OR \"11\" OR \"12\" OR \"13\" OR \"14\" OR \"15\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1053", "T1053"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1053/", "https://attack.mitre.org/tactics/TA0008/", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/main/documents/MS-TSCH.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "timestamp_override": "event.ingested", "author": ["Sagie Dulce", "Dekel Paz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
