{"description":"Detects remote RPC calls to create or execute a scheduled task via ATSvc Author: Sagie Dulce, Dekel Paz. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"e02959ce-57e4-90f1-7729-e69fe3e57427","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Remote Schedule Task Lateral Movement via ATSvc","query":"(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"1ff70682\\-0a51\\-30e8\\-076d\\-740be8cee98b\" AND OpNum:(\"0\" OR \"1\"))","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","T1053","T1053"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
