{"description":"Detects remote RPC calls to create or execute a scheduled task Author: Sagie Dulce, Dekel Paz. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"0a058c29-ab92-5888-b2b9-00060f660bf0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Remote Schedule Task Lateral Movement via ITaskSchedulerService","query":"(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"86d35949\\-83c9\\-4044\\-b424\\-db363231fd0c\" AND OpNum:(\"1\" OR \"3\" OR \"4\" OR \"10\" OR \"11\" OR \"12\" OR \"13\" OR \"14\" OR \"15\"))","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","T1053","T1053"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
