{"description": "Detects remote RPC calls to modify the registry and possible execute code", "enabled": false, "false_positives": ["Remote administration of registry values"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b68ad196-6cbb-1c2b-1c29-4ac41570d56d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Registry Lateral Movement", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"338cd001\\-2244\\-31f1\\-aaaa\\-900038001003\" AND OpNum:(\"6\" OR \"7\" OR \"8\" OR \"13\" OR \"18\" OR \"19\" OR \"21\" OR \"22\" OR \"23\" OR \"35\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1112/", "https://attack.mitre.org/tactics/TA0008/", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rrp/0fa3191d-bb79-490a-81bd-54c2601b7a78", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/main/documents/MS-RRP.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "timestamp_override": "event.ingested", "author": ["Sagie Dulce", "Dekel Paz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
