{"description": "Detects remote RPC calls that performs remote DCOM operations. These could be abused for lateral movement via DCOM or WMI.", "author": ["Sagie Dulce", "Dekel Paz"], "enabled": false, "false_positives": ["Some administrative tasks on remote host"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b803507c-c413-3417-34d4-ccadb4360ef9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote DCOM/WMI Lateral Movement", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:(\"4d9f4ab8-7d1c-11cf-861e-0020af6e7c57\" OR \"99fcfec4-5260-101b-bbcb-00aa0021347a\" OR \"000001a0-0000-0000-c000-000000000046\" OR \"00000131-0000-0000-c000-000000000046\" OR \"00000143-0000-0000-c000-000000000046\" OR \"00000000-0000-0000-c000-000000000046\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/accf23b0-0f57-441c-9185-43041f1b0ee9", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
