{"description": "Detects remote RPC calls to possibly abuse remote encryption service via MS-EFSR", "enabled": false, "false_positives": ["Legitimate usage of remote file encryption"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5f92fff9-82e2-48eb-8fc1-8b133556a551", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Encrypting File System Abuse", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:(\"df1941c5\\-fe89\\-4e79\\-bf10\\-463657acf44d\" OR \"c681d488\\-d850\\-11d0\\-8c52\\-00c04fd90f7e\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/tactics/TA0008/", "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36942", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/main/documents/MS-EFSR.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "timestamp_override": "event.ingested", "author": ["Sagie Dulce", "Dekel Paz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
