{"description": "Detects remote RPC calls to MS-DRSR from non DC hosts, which could indicate DCSync / DCShadow attacks.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "fcd6a3a1-fd05-cf9c-9ad2-d1dadb134377", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Possible DCSync Attack", "query": "((EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"e3514235\\-4b06\\-11d1\\-ab04\\-00c04fc2dcd2\") AND (NOT (OpNum:(\"0\" OR \"1\" OR \"12\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1033"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1033/", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-drsr/f977faaa-673e-4f66-b9bf-48c640241d47?redirectedfrom=MSDN", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/main/documents/MS-DRSR.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "timestamp_override": "event.ingested", "author": ["Sagie Dulce", "Dekel Paz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
