{"description": "Detects remote RPC calls to get event log information via EVEN or EVEN6", "enabled": false, "false_positives": ["Remote administrative tasks on Windows Events"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "13fb23bb-e385-bab0-f458-c764e2992dd7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Event Log Recon", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:(\"82273fdc\\-e32a\\-18c3\\-3f78\\-827929dc23ea\" OR \"f6beaff7\\-1e19\\-4fbb\\-9f8f\\-b89e2018337c\"))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/tactics/TA0007/", "https://github.com/zeronetworks/rpcfirewall", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "timestamp_override": "event.ingested", "author": ["Sagie Dulce", "Dekel Paz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
