{"description": "Detects remote RPC calls to create or execute a scheduled task via SASec", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "4a7f06cf-f895-930a-5842-28d91c3d6d93", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Schedule Task Lateral Movement via SASec", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"378e52b0\\-c0a9\\-11cf\\-822d\\-00aa0051e40f\" AND OpNum:(\"0\" OR \"1\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1053", "T1053"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1053/", "https://attack.mitre.org/tactics/TA0008/", "https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/main/documents/MS-TSCH.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "timestamp_override": "event.ingested", "author": ["Sagie Dulce", "Dekel Paz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
