{"description": "Detects remote RPC calls to possibly abuse remote encryption service via MS-EFSR", "author": ["Sagie Dulce", "Dekel Paz"], "enabled": false, "false_positives": ["Administrative tasks on remote services"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "916163d8-abcd-c3cb-1e11-739b625bee21", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Server Service Abuse for Lateral Movement", "query": "(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"367abb81-9844-35f1-ad32-98f038001003\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1569"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/accf23b0-0f57-441c-9185-43041f1b0ee9", "https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-SCMR.md", "https://github.com/zeronetworks/rpcfirewall", "https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
