{"description":"Detects remote RPC calls to collect information Author: Sagie Dulce, Dekel Paz. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Remote administration of registry values"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"544faa6a-eda1-e852-1130-fa94904a0c2f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Remote Registry Recon","query":"((EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:\"338cd001\\-2244\\-31f1\\-aaaa\\-900038001003\") AND (NOT (OpNum:(\"6\" OR \"7\" OR \"8\" OR \"13\" OR \"18\" OR \"19\" OR \"21\" OR \"22\" OR \"23\" OR \"35\"))))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
