{"description":"Detects remote RPC calls to possibly abuse remote printing service via MS-RPRN / MS-PAR Author: Sagie Dulce, Dekel Paz. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["actual printing"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"3a7e2b31-df5c-8b96-0f2d-f3b274df65a1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Remote Printing Abuse for Lateral Movement","query":"(EventLog:\"RPCFW\" AND winlog.event_id:\"3\" AND InterfaceUuid:(\"12345678\\-1234\\-abcd\\-ef00\\-0123456789ab\" OR \"76f03f96\\-cdfd\\-44fc\\-a22c\\-64950a001209\" OR \"0b6edbfa\\-4a24\\-4fc6\\-8a23\\-942b1eca65d1\" OR \"ae33069b\\-a2a8\\-46ee\\-a235\\-ddfd339be281\"))","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
