{"description":"Detects the doas tool execution in linux host platform. Author: Sittikorn S, Teoderick Contreras. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"067d8238-7127-451c-a9ec-fa78045b618b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Linux Doas Tool Execution","query":"process.executable:*\\/doas","meta":{"from":"1m"},"severity":"low","tags":["Privilege Escalation","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
