{"description":"Detects installed new certificate Author: Ömer Günal, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"78a80655-a51e-4669-bc6b-e9d206a462ee","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Install Root Certificate","query":"process.executable:(*\\/update\\-ca\\-certificates OR *\\/update\\-ca\\-trust)","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","T1553"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1553","name":"Subvert Trust Controls","reference":"https://attack.mitre.org/techniques/T1553"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
