{"description": "Detects execution of the perl binary with the \"-e\" flag and common strings related to potential reverse shell activity", "author": ["@d4ns4n_", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "259df6bc-003f-4306-9f54-4ff1a08fa38e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Perl Reverse Shell Execution", "query": "((process.executable.text:\"*\\/perl\" AND process.command_line.text:\"*\\ \\-e\\ *\") AND (((process.command_line.text:\"*fdopen\\(*\" AND process.command_line.text:\"*\\:\\:Socket\\:\\:INET*\")) OR ((process.command_line.text:\"*Socket*\" AND process.command_line.text:\"*connect*\" AND process.command_line.text:\"*open*\" AND process.command_line.text:\"*exec*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet", "https://www.revshells.com/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
