{"description":"Detects suspicious sub processes of web server processes Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Web applications that invoke Linux command line tools"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"2c374f9e-2408-650e-038d-4e166cce5040","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Linux Webshell Indicators","query":"(process.executable:(*\\/whoami OR *\\/ifconfig OR *\\/usr\\/bin\\/ip OR *\\/bin\\/uname) AND (process.parent.executable:(*\\/httpd OR *\\/lighttpd OR *\\/nginx OR *\\/apache2 OR *\\/node OR *\\/caddy) OR (process.parent.command_line:*\\/bin\\/java* AND process.parent.command_line:*tomcat*)))","meta":{"from":"1m"},"severity":"critical","tags":["T1505"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1505","name":"Server Software Component","reference":"https://attack.mitre.org/techniques/T1505"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
