{"description": "Detects chmod targeting files in abnormal directory paths.", "enabled": false, "false_positives": ["Admin changing file permissions."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "6b4222fc-72b0-35d3-ea77-84e5d0d85854", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Chmod Suspicious Directory", "query": "(process.executable:*\\/chmod AND process.command_line:(*\\/tmp\\/* OR *\\/.Library\\/* OR *\\/etc\\/* OR *\\/opt\\/*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1222"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1222", "name": "File and Directory Permissions Modification", "reference": "https://attack.mitre.org/techniques/T1222"}]}], "version": 1, "references": ["https://www.intezer.com/blog/malware-analysis/new-backdoor-sysjoker/", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.002/T1222.002.md"], "timestamp_override": "event.ingested", "author": ["Christopher Peacock @SecurePeacock", "SCYTHE @scythe_io"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
