{"description": "Detects changes of sensitive and critical files. Monitors files that you don't expect to change without planning on Linux system.", "author": ["@d4ns4n_ (Wuerth-Phoenix)"], "enabled": false, "false_positives": ["Some false positives are to be expected on user or administrator machines. Apply additional filters as needed."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "86157017-c2b1-4d4a-8c33-93b8e67e4af4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Suspicious Change To Sensitive/Critical Files", "query": "((((process.executable:(/.*\\/[Cc][Aa][Tt]/ OR /.*\\/[Ee][Cc][Hh][Oo]/ OR /.*\\/[Gg][Rr][Ee][Pp]/ OR /.*\\/[Hh][Ee][Aa][Dd]/ OR /.*\\/[Mm][Oo][Rr][Ee]/ OR /.*\\/[Tt][Aa][Ii][Ll]/) AND process.command_line:/.*>.*/)) OR (process.executable:(/.*\\/[Ee][Mm][Aa][Cc][Ss]/ OR /.*\\/[Nn][Aa][Nn][Oo]/ OR /.*\\/[Ss][Ee][Dd]/ OR /.*\\/[Vv][Ii]/ OR /.*\\/[Vv][Ii][Mm]/))) AND process.command_line:(/.*\\/[Bb][Ii][Nn]\\/[Ll][Oo][Gg][Ii][Nn].*/ OR /.*\\/[Bb][Ii][Nn]\\/[Pp][Aa][Ss][Ss][Ww][Dd].*/ OR /.*\\/[Bb][Oo][Oo][Tt]\\/.*/ OR /.*\\/[Ee][Tt][Cc]\\/\\*\\.[Cc][Oo][Nn][Ff].*/ OR /.*\\/[Ee][Tt][Cc]\\/[Cc][Rr][Oo][Nn]\\..*/ OR /.*\\/[Ee][Tt][Cc]\\/[Cc][Rr][Oo][Nn][Tt][Aa][Bb].*/ OR /.*\\/[Ee][Tt][Cc]\\/[Hh][Oo][Ss][Tt][Ss].*/ OR /.*\\/[Ee][Tt][Cc]\\/[Ii][Nn][Ii][Tt]\\.[Dd].*/ OR /.*\\/[Ee][Tt][Cc]\\/[Ss][Uu][Dd][Oo][Ee][Rr][Ss].*/ OR /.*\\/[Oo][Pp][Tt]\\/[Bb][Ii][Nn]\\/.*/ OR /.*\\/[Ss][Bb][Ii][Nn].*/ OR /.*\\/[Uu][Ss][Rr]\\/[Bb][Ii][Nn]\\/.*/ OR /.*\\/[Uu][Ss][Rr]\\/[Ll][Oo][Cc][Aa][Ll]\\/[Bb][Ii][Nn]\\/.*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1565"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1565", "name": "Data Manipulation", "reference": "https://attack.mitre.org/techniques/T1565"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/defender-for-cloud/file-integrity-monitoring-overview#which-files-should-i-monitor"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
