{"description": "Detects specific commands commonly used to remove or empty the syslog. Which is often used by attacker as a method to hide their tracks", "enabled": false, "false_positives": ["Log rotation."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "3fcc9b35-39e4-44c0-a2ad-9e82b6902b31", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Commands to Clear or Remove the Syslog", "query": "process.command_line:(*rm\\ \\/var\\/log\\/syslog* OR *rm\\ \\-r\\ \\/var\\/log\\/syslog* OR *rm\\ \\-f\\ \\/var\\/log\\/syslog* OR *rm\\ \\-rf\\ \\/var\\/log\\/syslog* OR *mv\\ \\/var\\/log\\/syslog* OR *\\ >\\/var\\/log\\/syslog* OR *\\ >\\ \\/var\\/log\\/syslog*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md"], "timestamp_override": "event.ingested", "author": ["Max Altgelt", "Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)", "MSTIC"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
