{"description": "Detects suspicious process command line that uses base64 encoded input for execution with a shell", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "95418446-1d5f-e35a-e5c8-e91f306dcde9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Linux Base64 Encoded Pipe to Shell", "query": "(process.command_line.text:*base64\\ \\-w0\\ * AND (process.command_line.text:(*|\\ bash\\ * OR *|\\ sh\\ * OR *|bash\\ * OR *|sh\\ *) OR process.command_line.text:(*|\\ bash OR *|\\ sh OR *|bash OR *\\ |sh)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://github.com/arget13/DDexec"], "timestamp_override": "event.ingested", "author": ["pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
