{"description": "Detects attempts to collect data stored in the clipboard from users with the usage of xclip tool. Xclip has to be installed. Highly recommended using rule on servers, due to high usage of clipboard utilities on user workstations.", "enabled": false, "false_positives": ["Legitimate usage of xclip tools."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "7804ecee-8e2c-8cc2-c8e4-2822ad7349d2", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Clipboard Collection with Xclip Tool", "query": "(process.executable.text:*xclip* AND process.command_line.text:*\\-sel* AND process.command_line.text:*clip* AND process.command_line.text:*\\-o*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1115"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1115", "name": "Clipboard Data", "reference": "https://attack.mitre.org/techniques/T1115"}]}], "version": 1, "references": ["https://www.packetlabs.net/posts/clipboard-data-security/"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur", "Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)", "MSTIC"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
