{"description": "Detects default install commands of the Triple Cross eBPF rootkit based on the \"deployer.sh\" script", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "22236d75-d5a0-4287-bf06-c93b1770860f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Triple Cross eBPF Rootkit Install Commands", "query": "(process.executable:*\\/sudo AND process.command_line:*\\ tc\\ * AND process.command_line:*\\ enp0s3\\ * AND process.command_line:(*\\ qdisc\\ * OR *\\ filter\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1014"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1014", "name": "Rootkit", "reference": "https://attack.mitre.org/techniques/T1014"}]}], "version": 1, "references": ["https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/apps/deployer.sh"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
