{"description": "Detects known hacktool execution based on image name", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a015e032-146d-4717-8944-7a1884122111", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool Execution", "query": "process.executable.text:(*\\/sqlmap OR *\\/teamserver OR *\\/aircrack\\-ng OR *\\/john OR *\\/setoolkit OR *\\/wpscan OR *\\/hydra OR *\\/nikto)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
