{"description": "Detects executing python with keywords related to network activity that could indicate a potential reverse shell", "author": ["@d4ns4n_", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "32e62bc7-3de0-4bb1-90af-532978fe42c0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Python Reverse Shell", "query": "(process.executable.text:\"*python*\" AND process.command_line.text:\"*\\ \\-c\\ *\" AND process.command_line.text:\"*import*\" AND process.command_line.text:\"*pty*\" AND process.command_line.text:\"*spawn\\(*\" AND process.command_line.text:\"*.connect*\")", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet", "https://www.revshells.com/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
