{"description": "Detects execution of netcat with the \"-e\" flag followed by common shells. This could be a sign of a potential reverse shell setup.", "author": ["@d4ns4n_", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "7f734ed0-4f47-46c0-837f-6ee62505abd9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Netcat Reverse Shell Execution", "query": "(process.executable.text:(\"*\\/nc\" OR \"*\\/ncat\") AND process.command_line.text:(\"*\\ \\-c\\ *\" OR \"*\\ \\-e\\ *\") AND process.command_line.text:(\"*\\ ash*\" OR \"*\\ bash*\" OR \"*\\ bsh*\" OR \"*\\ csh*\" OR \"*\\ ksh*\" OR \"*\\ pdksh*\" OR \"*\\ sh*\" OR \"*\\ tcsh*\" OR \"*\\/bin\\/ash*\" OR \"*\\/bin\\/bash*\" OR \"*\\/bin\\/bsh*\" OR \"*\\/bin\\/csh*\" OR \"*\\/bin\\/ksh*\" OR \"*\\/bin\\/pdksh*\" OR \"*\\/bin\\/sh*\" OR \"*\\/bin\\/tcsh*\" OR \"*\\/bin\\/zsh*\" OR \"*$IFSash*\" OR \"*$IFSbash*\" OR \"*$IFSbsh*\" OR \"*$IFScsh*\" OR \"*$IFSksh*\" OR \"*$IFSpdksh*\" OR \"*$IFSsh*\" OR \"*$IFStcsh*\" OR \"*$IFSzsh*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet", "https://www.revshells.com/", "https://www.hackingtutorials.org/networking/hacking-netcat-part-2-bind-reverse-shells/", "https://www.infosecademy.com/netcat-reverse-shells/", "https://man7.org/linux/man-pages/man1/ncat.1.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
