{"description": "Detects installation of suspicious packages using system installation utilities", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "700fb7e8-2981-401c-8430-be58e189e741", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Package Installed - Linux", "query": "((((process.executable.text:(*\\/apt OR *\\/apt\\-get) AND process.command_line.text:*install*)) OR ((process.executable.text:*\\/yum AND process.command_line.text:(*localinstall* OR *install*))) OR ((process.executable.text:*\\/rpm AND process.command_line.text:*\\-i*)) OR ((process.executable.text:*\\/dpkg AND process.command_line.text:(*\\-\\-install* OR *\\-i*)))) AND process.command_line.text:(*nmap* OR *\\ nc* OR *netcat* OR *wireshark* OR *tshark* OR *openconnect* OR *proxychains*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1553"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1553", "name": "Subvert Trust Controls", "reference": "https://attack.mitre.org/techniques/T1553"}]}], "version": 1, "references": ["https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
