{"description": "Detects the use of wget to download content to a suspicious directory", "author": ["Joseliyo Sanchez", "@Joseliyo_Jstnk"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "cf610c15-ed71-46e1-bdf8-2bd1a99de6c4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Download File To Potentially Suspicious Directory Via Wget", "query": "(process.executable:/.*\\/[Ww][Gg][Ee][Tt]/ AND (((process.command_line:/\\s-O\\s/)) OR (process.command_line:/.*\\-\\-[Oo][Uu][Tt][Pp][Uu][Tt]\\-[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt].*/)) AND process.command_line:/.*\\/[Tt][Mm][Pp]\\/.*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blogs.jpcert.or.jp/en/2023/05/gobrat.html", "https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/", "https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection", "https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
