{"description": "Detects potential overwriting and deletion of a file using DD.", "enabled": false, "false_positives": ["Any user deleting files that way."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "2953194b-e33c-4859-b9e8-05948c167447", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "DD File Overwrite", "query": "(process.executable:(\"\\/bin\\/dd\" OR \"\\/usr\\/bin\\/dd\") AND process.command_line:*of\\=* AND process.command_line:(*if\\=\\/dev\\/zero* OR *if\\=\\/dev\\/null*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1485"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1485", "name": "Data Destruction", "reference": "https://attack.mitre.org/techniques/T1485"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md#atomic-test-2---macoslinux---overwrite-file-with-dd"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)", "MSTIC"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
