{"description": "Detects common command used to enable bpf kprobes tracing", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "7692f583-bd30-4008-8615-75dab3f08a99", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Enable BPF Kprobes Tracing", "query": "(process.command_line.text:*echo\\ 1\\ >* AND process.command_line.text:*\\/sys\\/kernel\\/debug\\/tracing\\/events\\/kprobes\\/* AND process.command_line.text:(*\\/myprobe\\/enable* OR *\\/myretprobe\\/enable*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://embracethered.com/blog/posts/2021/offensive-bpf-bpftrace/", "https://bpftrace.org/", "https://www.kernel.org/doc/html/v5.0/trace/kprobetrace.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
