{"description": "Detects the presence of a base64 version of the shebang in the commandline, which could indicate a malicious payload about to be decoded", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "fe2f9663-41cb-47e2-b954-8a228f3b9dff", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Linux Base64 Encoded Shebang In CLI", "query": "process.command_line.text:(*IyEvYmluL2Jhc2* OR *IyEvYmluL2Rhc2* OR *IyEvYmluL3pza* OR *IyEvYmluL2Zpc2* OR *IyEvYmluL3No*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://www.trendmicro.com/pl_pl/research/20/i/the-evolution-of-malicious-shell-scripts.html", "https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
