{"description": "Detects usage of system utilities (only grep for now) to discover security software discovery", "enabled": false, "false_positives": ["Legitimate activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c9d8b7fd-78e4-44fe-88f6-599135d46d60", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Security Software Discovery", "query": "(process.executable:*\\/grep AND process.command_line:(*nessusd* OR *td\\-agent* OR *packetbeat* OR *filebeat* OR *auditbeat* OR *osqueryd* OR *cbagentd* OR *falcond*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1518"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1518", "name": "Software Discovery", "reference": "https://attack.mitre.org/techniques/T1518"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
