{"description": "Detects process discovery commands. Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c4958f2a-c44f-c31f-c541-babf1c40fbeb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Process Discovery", "query": "process.executable:(*\\/ps OR *\\/top)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1057"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1057", "name": "Process Discovery", "reference": "https://attack.mitre.org/techniques/T1057"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1057/T1057.md"], "timestamp_override": "event.ingested", "author": ["\u00d6mer G\u00fcnal", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
