{"description": "Detects execution of the bash shell with the interactive flag \"-i\".", "author": ["@d4ns4n_"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "6104e693-a7d6-4891-86cb-49a258523559", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Bash Interactive Shell", "query": "(process.executable.text:\"*\\/bash\" AND process.command_line.text:\"*\\ \\-i\\ *\")", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet", "https://www.revshells.com/", "https://linux.die.net/man/1/bash"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
