{"description": "Detects suspicious process command line that starts with a shell that executes something and finally gets piped into another shell", "enabled": false, "false_positives": ["Legitimate software that uses these patterns"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "880973f3-9708-491c-a77b-2a35a1921158", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Linux Shell Pipe to Shell", "query": "(process.command_line:(sh\\ \\-c\\ * OR bash\\ \\-c\\ *) AND process.command_line:(*|\\ bash OR *|bash OR *|\\ sh OR *|sh))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["Internal Research"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
