{"description": "Detects usage of nohup which could be leveraged by an attacker to keep a process running or break out from restricted environments", "enabled": false, "false_positives": ["Administrators or installed processes that leverage nohup"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e4ffe466-6ff8-48d4-94bd-e32d1a6061e2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Nohup Execution", "query": "process.executable:*\\/nohup", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://gtfobins.github.io/gtfobins/nohup/", "https://en.wikipedia.org/wiki/Nohup", "https://www.computerhope.com/unix/unohup.htm"], "timestamp_override": "event.ingested", "author": ["Christopher Peacock @SecurePeacock", "SCYTHE @scythe_io"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
