{"description": "Detects the usage of utilities such as 'systemctl', 'service'...etc to stop or disable tools and services", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "de25eeb8-3655-4643-ac3a-b662d3f26b6b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Disable Or Stop Services", "query": "(process.executable.text:(*\\/service OR *\\/systemctl OR *\\/chkconfig) AND process.command_line.text:(*stop* OR *disable*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.trendmicro.com/pl_pl/research/20/i/the-evolution-of-malicious-shell-scripts.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
