{"description": "Detects usage of system utilities to discover system network connections", "author": ["Daniil Yugoslavskiy", "oscd.community"], "enabled": false, "false_positives": ["Legitimate activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "eb000114-2e3e-2a89-e4d7-99423e72b900", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "System Network Connections Discovery - Linux", "query": "(process.executable.text:(*\\/who OR *\\/w OR *\\/last OR *\\/lsof OR *\\/netstat) AND (NOT process.parent.command_line.text:*\\/usr\\/bin\\/python* AND process.parent.command_line.text:*\\/usr\\/bin\\/landscape\\-sysinfo*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1049"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1049", "name": "System Network Connections Discovery", "reference": "https://attack.mitre.org/techniques/T1049"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
