{"description": "Detects python spawning a pretty tty which could be indicative of potential reverse shell activity", "author": ["Nextron Systems"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c4042d54-110d-45dd-a0e1-05c47822c937", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Python Spawning Pretty TTY", "query": "(((process.executable:(/.*\\/[Pp][Yy][Tt][Hh][Oo][Nn]/ OR /.*\\/[Pp][Yy][Tt][Hh][Oo][Nn]2/ OR /.*\\/[Pp][Yy][Tt][Hh][Oo][Nn]3/)) OR (process.executable:(/.*\\/[Pp][Yy][Tt][Hh][Oo][Nn]2\\..*/ OR /.*\\/[Pp][Yy][Tt][Hh][Oo][Nn]3\\..*/))) AND (((process.command_line:/.*[Ii][Mm][Pp][Oo][Rr][Tt]\\ [Pp][Tt][Yy].*/ AND process.command_line:/.*\\.[Ss][Pp][Aa][Ww][Nn]\\(.*/)) OR (process.command_line:/.*[Ff][Rr][Oo][Mm]\\ [Pp][Tt][Yy]\\ [Ii][Mm][Pp][Oo][Rr][Tt]\\ [Ss][Pp][Aa][Ww][Nn].*/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
