{"description": "Detects a suspicious curl process start on linux with set useragent options", "enabled": false, "false_positives": ["Scripts created by developers and admins", "Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d4066970-1cc4-8bc5-c9e3-ac951708f8d8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Curl Change User Agents - Linux", "query": "(process.executable.text:*\\/curl AND process.command_line.text:(*\\ \\-A\\ * OR *\\ \\-\\-user\\-agent\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://curl.se/docs/manpage.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
