{"description":"Detects suspicious interactive bash as a parent to rather uncommon child processes Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate software that uses these patterns"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"1e862d31-5698-c85b-5797-5a8df3050332","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Interactive Bash Suspicious Children","query":"(process.parent.command_line:\"bash\\ \\-i\" AND (process.command_line:(*\\-c\\ import\\ * OR *base64* OR *pty.spawn*) OR process.executable:(*whoami OR *iptables OR *\\/ncat OR *\\/nc OR *\\/netcat)))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
