{"description": "Detects enumeration of local systeam accounts. This information can help adversaries determine which local accounts exist on a system to aid in follow-on behavior.", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b45e3d6f-42c6-47d8-a478-df6bd6cf534c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Local System Accounts Discovery", "query": "(process.executable:*\\/lastlog OR process.command_line:*'x\\:0\\:'* OR (process.executable:*\\/cat AND process.command_line:(*\\/etc\\/passwd* OR *\\/etc\\/sudoers*)) OR process.executable:*\\/id OR (process.executable:*\\/lsof AND process.command_line:*\\-u*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1087"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.001/T1087.001.md"], "timestamp_override": "event.ingested", "author": ["Alejandro Ortuno", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
