{"description": "Detects disabling security tools", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e3a8a052-111f-4606-9aee-f28ebeb76776", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Disabling Security Tools", "query": "((process.executable.text:*\\/service AND process.command_line.text:*iptables* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/service AND process.command_line.text:*ip6tables* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/chkconfig AND process.command_line.text:*iptables* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/chkconfig AND process.command_line.text:*ip6tables* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/systemctl AND process.command_line.text:*firewalld* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/systemctl AND process.command_line.text:*firewalld* AND process.command_line.text:*disable*) OR (process.executable.text:*\\/service AND process.command_line.text:*cbdaemon* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/chkconfig AND process.command_line.text:*cbdaemon* AND process.command_line.text:*off*) OR (process.executable.text:*\\/systemctl AND process.command_line.text:*cbdaemon* AND process.command_line.text:*stop*) OR (process.executable.text:*\\/systemctl AND process.command_line.text:*cbdaemon* AND process.command_line.text:*disable*) OR (process.executable.text:*\\/setenforce AND process.command_line.text:*0*) OR (process.executable.text:*\\/systemctl AND process.command_line.text:*stop* AND process.command_line.text:*falcon\\-sensor*) OR (process.executable.text:*\\/systemctl AND process.command_line.text:*disable* AND process.command_line.text:*falcon\\-sensor*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md"], "timestamp_override": "event.ingested", "author": ["\u00d6mer G\u00fcnal", "Alejandro Ortuno", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
