{"description": "Detects execution of ruby with the \"-e\" flag and calls to \"socket\" related functions. This could be an indication of a potential attempt to setup a reverse shell", "author": ["@d4ns4n_"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b8bdac18-c06e-4016-ac30-221553e74f59", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Ruby Reverse Shell", "query": "(process.executable.text:\"*ruby*\" AND process.command_line.text:\"*\\ \\-e*\" AND process.command_line.text:\"*rsocket*\" AND process.command_line.text:\"*TCPSocket*\" AND process.command_line.text:(\"*\\ ash*\" OR \"*\\ bash*\" OR \"*\\ bsh*\" OR \"*\\ csh*\" OR \"*\\ ksh*\" OR \"*\\ pdksh*\" OR \"*\\ sh*\" OR \"*\\ tcsh*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet", "https://www.revshells.com/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
