{"description": "Detects when the file \"passwd\" or \"shadow\" is copied from tmp path", "author": ["Joseliyo Sanchez", "@Joseliyo_Jstnk"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "fa4aaed5-4fe0-498d-bbc0-08e3346387ba", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Copy Passwd Or Shadow From TMP Path", "query": "(process.executable.text:\"*\\/cp\" AND process.command_line.text:\"*\\/tmp\\/*\" AND process.command_line.text:(\"*passwd*\" OR \"*shadow*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://blogs.blackberry.com/", "https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
