{"description": "Detects events in which someone prints the contents of history files to the commandline or redirects it to a file for reconnaissance", "enabled": false, "false_positives": ["Legitimate administration activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d04f6190-c1ea-8ee6-4781-a71b607e7662", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Print History File Contents", "query": "(process.executable.text:(*\\/cat OR *\\/head OR *\\/tail OR *\\/more) AND (process.command_line.text:(*\\/.bash_history* OR *\\/.zsh_history*) OR process.command_line.text:(*_history OR *.history OR *zhistory)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1592"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0043", "reference": "https://attack.mitre.org/tactics/TA0043", "name": "Reconnaissance"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1592", "name": "Gather Victim Host Information", "reference": "https://attack.mitre.org/techniques/T1592"}]}], "version": 1, "references": ["https://github.com/sleventyeleven/linuxprivchecker/", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
