{"description": "Detects execution of the \"groupdel\" binary. Which is used to delete a group. This is sometimes abused by threat actors in order to cover their tracks", "author": ["Tuan Le (NCSGroup)"], "enabled": false, "false_positives": ["Legitimate administrator activities"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b3f5ecf6-6ebe-36ad-427a-e072c6e33fff", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Group Has Been Deleted Via Groupdel", "query": "process.executable.text:*\\/groupdel", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1531"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1531", "name": "Account Access Removal", "reference": "https://attack.mitre.org/techniques/T1531"}]}], "version": 1, "references": ["https://linuxize.com/post/how-to-delete-group-in-linux/", "https://www.cyberciti.biz/faq/linux-remove-user-command/", "https://www.cybrary.it/blog/0p3n/linux-commands-used-attackers/", "https://linux.die.net/man/8/groupdel"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
