{"description": "Detects known hacktool execution based on image name", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "6ad0ff57-b001-49f5-af49-64de9e8fd2c3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Linux HackTool Execution", "query": "((process.executable.text:(*\\/sqlmap OR *\\/teamserver OR *\\/aircrack\\-ng OR *\\/john OR *\\/setoolkit OR *\\/wpscan OR *\\/hydra OR *\\/nikto OR *\\/ebpfkit OR *\\/bpfdos OR *\\/exechijack OR *\\/pidhide OR *\\/writeblocker)) OR (process.executable.text:*\\/linpeas*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://github.com/Gui774ume/ebpfkit", "https://github.com/pathtofile/bad-bpf", "https://github.com/carlospolop/PEASS-ng"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
