{"description": "Detects linux package removal using builtin tools such as \"yum\", \"apt\", \"apt-get\" or \"dpkg\".", "author": ["Tuan Le (NCSGroup)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Administrator or administrator scripts might delete packages for several reasons (debugging, troubleshooting)."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "95d61234-7f56-465c-6f2d-b562c6fedbc4", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Linux Package Uninstall", "query": "(((process.executable.text:\"*\\/yum\" AND process.command_line.text:(\"*erase*\" OR \"*remove*\"))) OR ((process.executable.text:(\"*\\/apt\" OR \"*\\/apt\\-get\") AND process.command_line.text:(\"*remove*\" OR \"*purge*\"))) OR ((process.executable.text:\"*\\/dpkg\" AND process.command_line.text:(\"*\\-\\-remove\\ *\" OR \"*\\ \\-r\\ *\"))) OR ((process.executable.text:\"*\\/rpm\" AND process.command_line.text:\"*\\ \\-e\\ *\")))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://sysdig.com/blog/mitre-defense-evasion-falco", "https://www.tutorialspoint.com/how-to-install-a-software-on-linux-using-yum-command", "https://linuxhint.com/uninstall_yum_package/", "https://linuxhint.com/uninstall-debian-packages/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
