{"description": "Detects the creation of a new named pipe using the \"mkfifo\" utility in a potentially suspicious location", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "999c3b12-0a8c-40b6-8e13-dd7d62b75c7a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Named Pipe Created Via Mkfifo", "query": "(process.executable.text:\"*\\/mkfifo\" AND process.command_line.text:\"*\\ \\/tmp\\/*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://dev.to/0xbf/use-mkfifo-to-create-named-pipe-linux-tips-5bbk", "https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
