{"description": "Detects the creation of shell scripts under the \"profile.d\" path.", "author": ["Joseliyo Sanchez", "@Joseliyo_Jstnk"], "enabled": false, "false_positives": ["Legitimate shell scripts in the \"profile.d\" directory could be common in your environment. Apply additional filter accordingly via \"image\", by adding specific filenames you \"trust\" or by correlating it with other events.", "Regular file creation during system update or software installation by the package manager"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "13f08f54-e705-4498-91fd-cce9d9cee9f1", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Potentially Suspicious Shell Script Creation in Profile Folder", "query": "(file.path:/.*\\/[Ee][Tt][Cc]\\/[Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\.[Dd]\\/.*/ AND file.path:(/.*\\.[Cc][Ss][Hh]/ OR /.*\\.[Ss][Hh]/))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blogs.jpcert.or.jp/en/2023/05/gobrat.html", "https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/", "https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection", "https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
