{"description": "Detects creation of cron file or files in Cron directories which could indicates potential persistence.", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)", "MSTIC"], "enabled": false, "false_positives": ["Any legitimate cron file."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "3172fbf0-e2a0-dbfb-7ea3-c6dbf6e23e53", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Persistence Via Cron Files", "query": "((file.path.text:(\\/etc\\/cron.d\\/* OR \\/etc\\/cron.daily\\/* OR \\/etc\\/cron.hourly\\/* OR \\/etc\\/cron.monthly\\/* OR \\/etc\\/cron.weekly\\/* OR \\/var\\/spool\\/cron\\/crontabs\\/*)) OR (file.path.text:(*\\/etc\\/cron.allow* OR *\\/etc\\/cron.deny* OR *\\/etc\\/crontab*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://github.com/microsoft/MSTIC-Sysmon/blob/f1477c0512b0747c1455283069c21faec758e29d/linux/configs/attack-based/persistence/T1053.003_Cron_Activity.xml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
