{"description": "Detects Malleable OneDrive Profile", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "d74b7894-b0d9-e6c5-5727-9260edc5e144", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CobaltStrike Malleable OneDrive Browsing Traffic Profile", "query": "((http.request.method:\"GET\" AND url.original:*?manifest\\=wac AND (destination.domain:\"onedrive.live.com\" OR url.domain:\"onedrive.live.com\")) AND (NOT (url.original:http* AND url.original:*\\:\\/\\/onedrive.live.com\\/*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/onedrive_getonly.profile"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
