{"description": "Detects Baby Shark C2 Framework communication patterns", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "304810ed-8853-437f-9e36-c4975c3dfd7e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "BabyShark Agent Pattern", "query": "url.original:*momyshark\\?key\\=*", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://nasbench.medium.com/understanding-detecting-c2-frameworks-babyshark-641be4595845"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
