{"description":"Detects direct access to raw pastes in different paste services often used by malware in their second stages to download malicious code in encrypted or encoded form Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["User activity (e.g. developer that shared and copied code snippets and used the raw link instead of just copy & paste)"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"79729454-3f1c-ea8a-1080-18f41bec0224","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Raw Paste Service Access","query":"url.original:(*.paste.ee\\/r\\/* OR *.pastebin.com\\/raw\\/* OR *.hastebin.com\\/raw\\/* OR *.ghostbin.co\\/paste\\/*\\/raw\\/*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1071","T1102","T1102"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
