{"description":"Detects WebDav DownloadCradle Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative scripts that download files from the Internet","Administrative scripts that retrieve certain website contents","Legitimate WebDAV administration"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"bf1bf8b9-e694-9616-cb98-0225ad7917ac","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Windows WebDAV User Agent","query":"(user_agent.original:Microsoft\\-WebDAV\\-MiniRedir\\/* AND http.request.method:\"GET\")","meta":{"from":"1m"},"severity":"high","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
