{"description":"Detects suspicious requests to Telegram API without the usual Telegram User-Agent Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of Telegram bots in the company"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"b494b165-6634-483d-8c47-2026a6c52372","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Telegram API Access","query":"((destination.domain:\"api.telegram.org\" OR url.domain:\"api.telegram.org\") AND (NOT (user_agent.original:(*Telegram* OR *Bot*))))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1071","T1102"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
