{"description":"Detects Malleable Amazon Profile Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"953b895e-5cc9-454b-b183-7f3db555452e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CobaltStrike Malleable Amazon Browsing Traffic Profile","query":"(user_agent.original:\"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 6.1;\\ WOW64;\\ Trident\\/7.0;\\ rv\\:11.0\\)\\ like\\ Gecko\" AND ((http.request.method:\"GET\" AND url.original:\"\\/s\\/ref\\=nb_sb_noss_1\\/167\\-3294888\\-0262949\\/field\\-keywords\\=books\" AND (destination.domain:\"www.amazon.com\" OR url.domain:\"www.amazon.com\") AND http.cookie:*\\=csm\\-hit\\=s\\-24KU11BB82RZSYGJ3BDK|1419899012996) OR (http.request.method:\"POST\" AND url.original:\"\\/N4215\\/adj\\/amzn.us.sr.aps\" AND (destination.domain:\"www.amazon.com\" OR url.domain:\"www.amazon.com\"))))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
