{"description": "Detects specific malware patterns used by FurBall malware linked to Iranian Domestic Kitten APT group", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "6c939dfa-c710-4e12-a4dd-47e1f10e68e1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Domestic Kitten FurBall Malware Pattern", "query": "url.original:(*Get\\~\\~\\~AllBrowser* OR *Get\\~\\~\\~HardwareInfo* OR *Take\\~\\~RecordCall* OR *Reset\\~\\~\\~AllCommand*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://research.checkpoint.com/2021/domestic-kitten-an-inside-look-at-the-iranian-surveillance-operations/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
