{"description": "Detects WebDav DownloadCradle", "enabled": false, "false_positives": ["Administrative scripts that download files from the Internet", "Administrative scripts that retrieve certain website contents", "Legitimate WebDAV administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "e09aed7a-09e0-4c9a-90dd-f0d52507347e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows WebDAV User Agent", "query": "(user_agent.original:Microsoft\\-WebDAV\\-MiniRedir\\/* AND http.request.method:\"GET\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
