{"description": "Detects Java class download in proxy logs, e.g. used in Log4shell exploitation attacks against Log4j.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "53c15703-b04c-42bb-9055-1937ddfb3392", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Java Class Proxy Download", "query": "url.original:*.class", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.lunasec.io/docs/blog/log4j-zero-day/"], "timestamp_override": "event.ingested", "author": ["Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
