{"description": "Detects suspicious malformed user agent strings in proxy logs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "7195a772-4b3f-43a4-a210-6a003d65caa1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious User Agent", "query": "((user_agent.original:(user\\-agent* OR Mozilla\\/3.0\\ * OR Mozilla\\/2.0\\ * OR Mozilla\\/1.0\\ * OR Mozilla\\ * OR \\ Mozilla\\/* OR Mozila\\/* OR Mozilla\\/4.0\\ \\(compatible;\\ MSIE\\ 6.0;\\ MS\\ Web\\ Services\\ Client\\ Protocol*) OR user_agent.original:(*\\ \\(compatible;MSIE\\ * OR *.0;Windows\\ NT\\ * OR *loader*) OR user_agent.original:(\"_\" OR \"CertUtil\\ URL\\ Agent\" OR \"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 10.0;\\ Win64;\\ x64;\\ rv\\:60.0\\)\" OR \"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 6.3;\\ WOW64;\\ rv\\:28.0\\)\\ Gecko\\/20100101\\ Firefox\\/28.0\" OR \"HTTPS\" OR \"Erbium\\-UA\\-4ce7c27cb4be9d32e333bf032c88235a\" OR \"rqwrwqrqwrqw\" OR \"qwrqrwrqwrqwr\" OR \"rc2.0\\/client\" OR \"TakeMyPainBack\")) AND (NOT (user_agent.original:Mozilla\\/3.0\\ *\\ Acrobat\\ * OR (url.domain:(*.acrobat.com OR *.adobe.com OR *.adobe.io) OR destination.domain:(*.acrobat.com OR *.adobe.com OR *.adobe.io)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/fastly/waf_testbed/blob/8bfc406551f3045e418cbaad7596cff8da331dfc/templates/default/scanners-user-agents.data.erb"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
