{"description": "Detects user agent and URI paths used by empire agents", "enabled": false, "false_positives": ["Valid requests with this exact user agent to server scripts of the defined names"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "0d98bf3c-f3ca-ca62-0ffe-fa5b3e592709", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Empire UserAgent URI Combo", "query": "(user_agent.original:\"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 6.1;\\ WOW64;\\ Trident\\/7.0;\\ rv\\:11.0\\)\\ like\\ Gecko\" AND cs-uri-query:(\"\\/admin\\/get.php\" OR \"\\/news.php\" OR \"\\/login\\/process.php\") AND http.request.method:\"POST\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/BC-SECURITY/Empire"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
