{"description": "Detects Malleable Amazon Profile", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "0e9f837f-b746-6229-efe9-332482c832b8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CobaltStrike Malleable Amazon Browsing Traffic Profile", "query": "(user_agent.original:\"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 6.1;\\ WOW64;\\ Trident\\/7.0;\\ rv\\:11.0\\)\\ like\\ Gecko\" AND ((http.request.method:\"GET\" AND url.original:\"\\/s\\/ref\\=nb_sb_noss_1\\/167\\-3294888\\-0262949\\/field\\-keywords\\=books\" AND (destination.domain:\"www.amazon.com\" OR url.domain:\"www.amazon.com\") AND http.cookie:*\\=csm\\-hit\\=s\\-24KU11BB82RZSYGJ3BDK|1419899012996) OR (http.request.method:\"POST\" AND url.original:\"\\/N4215\\/adj\\/amzn.us.sr.aps\" AND (destination.domain:\"www.amazon.com\" OR url.domain:\"www.amazon.com\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/rsmudge/Malleable-C2-Profiles/blob/26323784672913923d20c5a638c6ca79459e8529/normal/amazon.profile", "https://www.hybrid-analysis.com/sample/ee5eca8648e45e2fea9dac0d920ef1a1792d8690c41ee7f20343de1927cc88b9?environmentId=100"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
