{"description":"Detects Baby Shark C2 Framework communication patterns Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"ab4d2229-0995-b574-aa73-2218445bf643","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"BabyShark Agent Pattern","query":"url.original:*momyshark?key\\=*","meta":{"from":"1m"},"severity":"critical","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
