{"description": "Detects Turla ComRAT patterns", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "d49b6f62-3b95-0856-146c-86d8ddbba0fa", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Turla ComRAT", "query": "url.original:*\\/index\\/index.php\\?h\\=*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
