{"description": "Detects a flashplayer update from an unofficial location", "enabled": false, "false_positives": ["Unknown flash download locations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "c71e4cfb-5f2f-e432-cb20-56c961be183f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Flash Player Update from Suspicious Location", "query": "((url.query:*\\/flash_install.php* OR url.query:*\\/install_flash_player.exe) AND (NOT (url.original:*.adobe.com\\/*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Initial Access", "T1036", "T1189", "T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1189", "name": "Drive-by Compromise", "reference": "https://attack.mitre.org/techniques/T1189"}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://gist.github.com/roycewilliams/a723aaf8a6ac3ba4f817847610935cfb"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
