{"description":"Detects Malleable OneDrive Profile Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"c9b33401-cc6a-4cf6-83bb-57ddcb2407fc","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CobaltStrike Malleable OneDrive Browsing Traffic Profile","query":"((http.request.method:\"GET\" AND url.original:*?manifest\\=wac AND (destination.domain:\"onedrive.live.com\" OR url.domain:\"onedrive.live.com\")) AND (NOT (url.original:http* AND url.original:*\\:\\/\\/onedrive.live.com\\/*)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
