{"description": "Detects Bitsadmin connections to IP addresses instead of FQDN names", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "8ccd35a2-1c7c-468b-b568-ac6cdf80eec3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Bitsadmin to Uncommon IP Server Address", "query": "(user_agent.original:Microsoft\\ BITS\\/* AND (url.domain:(*1 OR *2 OR *3 OR *4 OR *5 OR *6 OR *7 OR *8 OR *9) OR destination.domain:(*1 OR *2 OR *3 OR *4 OR *5 OR *6 OR *7 OR *8 OR *9)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
