{"description": "Detects suspicious empty user agent strings in proxy logs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "21e44d78-95e7-421b-a464-ffd8395659c4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Empty User Agent", "query": "user_agent.original:\"\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Carlos_Perez/status/883455096645931008"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
