{"description":"Detects downloads from PwnDrp web servers developed for red team testing and most likely also used for criminal activity Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"bb317119-fead-569e-ccb1-ec5b5140523e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"PwnDrp Access","query":"url.original:*\\/pwndrop\\/*","meta":{"from":"1m"},"severity":"critical","tags":["T1071","T1102","T1102"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
