{"description": "Detects Malleable (OCSP) Profile with Typo (OSCP) in URL", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "c6cfc5a9-9be2-51d5-d255-a6c0ec4a285d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CobaltStrike Malleable (OCSP) Profile", "query": "(url.original:*\\/oscp\\/* AND (destination.domain:\"ocsp.verisign.com\" OR url.domain:\"ocsp.verisign.com\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/ocsp.profile"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
