{"description":"Detects suspicious user agent strings used by crypto miners in proxy logs Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"fa935401-513b-467b-81f4-f9e77aa0dd78","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Crypto Miner User Agent","query":"user_agent.original:(XMRig\\ * OR ccminer*)","meta":{"from":"1m"},"severity":"high","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
