{"description": "Detects the use of rclone, a command-line program to manage files on cloud storage, via its default user-agent string", "enabled": false, "false_positives": ["Valid requests with this exact user agent to that is used by legitimate scripts or sysadmin operations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "2c03648b-e081-41a5-b9fb-7d854a915091", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rclone Activity via Proxy", "query": "user_agent.original:rclone\\/v*", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://rclone.org/", "https://www.kroll.com/en/insights/publications/cyber/new-m365-business-email-compromise-attacks-with-rclone"], "timestamp_override": "event.ingested", "author": ["Janantha Marasinghe"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
