{"description": "Detects URL pattern used by iOS Implant", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "029a2340-0534-354d-07e1-92415f302d5b", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "iOS Implant URL Pattern", "query": "url.original:*\\/list\\/suc\\?name\\=*", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1005", "T1119", "T1203", "T1528", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1528", "name": "Steal Application Access Token", "reference": "https://attack.mitre.org/techniques/T1528"}, {"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1005", "name": "Data from Local System", "reference": "https://attack.mitre.org/techniques/T1005"}, {"id": "T1119", "name": "Automated Collection", "reference": "https://attack.mitre.org/techniques/T1119"}]}], "version": 1, "references": ["https://googleprojectzero.blogspot.com/2019/08/implant-teardown.html", "https://twitter.com/craiu/status/1167358457344925696"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
