{"description": "Detects suspicious user agent strings used by crypto miners in proxy logs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "bffd743a-d3a2-ad42-db2c-ef01865c62d0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Crypto Miner User Agent", "query": "user_agent.original:(XMRig\\ * OR ccminer*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/xmrig/xmrig/blob/da22b3e6c45825f3ac1f208255126cb8585cd4fc/src/base/kernel/Platform_win.cpp#L65", "https://github.com/xmrig/xmrig/blob/427b6516e0550200c17ca28675118f0fffcc323f/src/version.h"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
