{"description": "Detects Bitsadmin connections to domains with uncommon TLDs - https://twitter.com/jhencinski/status/1102695118455349248 - https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/", "enabled": false, "false_positives": ["Rare programs that use Bitsadmin and update from regional TLDs e.g. .uk or .ca"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "9eb68894-7476-4cd6-8752-23b51f5883a7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Bitsadmin to Uncommon TLD", "query": "(user_agent.original:Microsoft\\ BITS\\/* AND (NOT ((destination.domain:(*.com OR *.net OR *.org OR *.scdn.co OR *.sfx.ms) OR url.domain:(*.com OR *.net OR *.org OR *.scdn.co OR *.sfx.ms)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1071", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
