{"description":"Detects suspicious malformed user agent strings in proxy logs Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"7195a772-4b3f-43a4-a210-6a003d65caa1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious User Agent","query":"((user_agent.original:(user\\-agent* OR Mozilla\\/3.0\\ * OR Mozilla\\/2.0\\ * OR Mozilla\\/1.0\\ * OR Mozilla\\ * OR \\ Mozilla\\/* OR Mozila\\/* OR Mozilla\\/4.0\\ \\(compatible;\\ MSIE\\ 6.0;\\ MS\\ Web\\ Services\\ Client\\ Protocol*) OR user_agent.original:(*\\ \\(compatible;MSIE\\ * OR *.0;Windows\\ NT\\ *) OR user_agent.original:(\"_\" OR \"CertUtil\\ URL\\ Agent\" OR \"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 10.0;\\ Win64;\\ x64;\\ rv\\:60.0\\)\" OR \"Mozilla\\/5.0\\ \\(Windows\\ NT\\ 6.3;\\ WOW64;\\ rv\\:28.0\\)\\ Gecko\\/20100101\\ Firefox\\/28.0\" OR \"HTTPS\")) AND (NOT (user_agent.original:Mozilla\\/3.0\\ *\\ Acrobat\\ *)))","meta":{"from":"1m"},"severity":"high","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
