{"description": "Detects logon events that specify new credentials", "enabled": false, "false_positives": ["Legitimate remote administration activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "aa367e44-1876-0984-afc6-726d089be4fa", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Outgoing Logon with New Credentials", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"9\")", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
