{"description": "Detects suspicious encoded User-Agent strings, as seen used by some malware.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "d443095b-a221-4957-a2c4-cd1756c9b747", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Base64 Encoded User-Agent", "query": "user_agent.original:(Q2hyb21l* OR QXBwbGVXZWJLaX* OR RGFsdmlr* OR TW96aWxsY*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://deviceatlas.com/blog/list-of-user-agent-strings#desktop"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
