{"description": "Detects suspicious user agent string of APT40 Dropbox tool", "author": ["Thomas Patzke"], "enabled": false, "false_positives": ["Old browsers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "5ba715b6-71b7-44fd-8245-f66893e81b3d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "APT40 Dropbox Tool User Agent", "query": "(user_agent.original:\"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36\" AND ((destination.domain:\"api.dropbox.com\") OR (url.domain:\"api.dropbox.com\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071", "T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["Internal research from Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
