{"description": "Detects User Agent strings that end with an equal sign, which can be a sign of base64 encoding.", "author": ["Florian Roth (Nextron Systems)", "Brian Ingram (update)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "894a8613-cf12-48b3-8e57-9085f54aa0c3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Base64 Encoded User-Agent", "query": "user_agent.original:*\\=", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blogs.jpcert.or.jp/en/2022/07/yamabot.html", "https://deviceatlas.com/blog/list-of-user-agent-strings#desktop"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
