{"description": "Detects sql injection that use GET requests by keyword searches in URL strings", "enabled": false, "false_positives": ["Java scripts and CSS Files", "User searches in search boxes of the respective website"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "8909430e-f03c-d693-3707-a2cf2cd8174d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Detect Sql Injection By Keywords", "query": "(*\\=select* OR *\\=union* OR *\\=concat*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Saw Win Naung"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
