{"description":"Detects a successful Grafana path traversal exploitation Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Vulnerability scanners that scan a host that returns 200 status codes even in cases of a file not found or other error"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"7b72b328-5708-414f-9a2a-6a6867c26e16","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Grafana Path Traversal Exploitation CVE-2021-43798","query":"(url.original:*\\/..\\/..\\/..\\/..\\/..\\/..\\/..\\/* AND http.response.status_code:\"200\" AND url.original:(*\\/public\\/plugins\\/live* OR *\\/public\\/plugins\\/icon* OR *\\/public\\/plugins\\/loki* OR *\\/public\\/plugins\\/text* OR *\\/public\\/plugins\\/logs* OR *\\/public\\/plugins\\/news* OR *\\/public\\/plugins\\/stat* OR *\\/public\\/plugins\\/mssql* OR *\\/public\\/plugins\\/mixed* OR *\\/public\\/plugins\\/mysql* OR *\\/public\\/plugins\\/tempo* OR *\\/public\\/plugins\\/graph* OR *\\/public\\/plugins\\/gauge* OR *\\/public\\/plugins\\/table* OR *\\/public\\/plugins\\/debug* OR *\\/public\\/plugins\\/zipkin* OR *\\/public\\/plugins\\/jaeger* OR *\\/public\\/plugins\\/geomap* OR *\\/public\\/plugins\\/canvas* OR *\\/public\\/plugins\\/grafana* OR *\\/public\\/plugins\\/welcome* OR *\\/public\\/plugins\\/xychart* OR *\\/public\\/plugins\\/heatmap* OR *\\/public\\/plugins\\/postgres* OR *\\/public\\/plugins\\/testdata* OR *\\/public\\/plugins\\/opentsdb* OR *\\/public\\/plugins\\/influxdb* OR *\\/public\\/plugins\\/barchart* OR *\\/public\\/plugins\\/annolist* OR *\\/public\\/plugins\\/bargauge* OR *\\/public\\/plugins\\/graphite* OR *\\/public\\/plugins\\/dashlist* OR *\\/public\\/plugins\\/piechart* OR *\\/public\\/plugins\\/dashboard* OR *\\/public\\/plugins\\/nodeGraph* OR *\\/public\\/plugins\\/alertlist* OR *\\/public\\/plugins\\/histogram* OR *\\/public\\/plugins\\/table\\-old* OR *\\/public\\/plugins\\/pluginlist* OR *\\/public\\/plugins\\/timeseries* OR *\\/public\\/plugins\\/cloudwatch* OR *\\/public\\/plugins\\/prometheus* OR *\\/public\\/plugins\\/stackdriver* OR *\\/public\\/plugins\\/alertGroups* OR *\\/public\\/plugins\\/alertmanager* OR *\\/public\\/plugins\\/elasticsearch* OR *\\/public\\/plugins\\/gettingstarted* OR *\\/public\\/plugins\\/state\\-timeline* OR *\\/public\\/plugins\\/status\\-history* OR *\\/public\\/plugins\\/grafana\\-clock\\-panel* OR *\\/public\\/plugins\\/grafana\\-simple\\-json\\-datasource* OR *\\/public\\/plugins\\/grafana\\-azure\\-monitor\\-datasource*))","meta":{"from":"1m"},"severity":"critical","tags":["Initial Access","T1190"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
