{"description": "Detects an issue in apache logs that reports threading related errors", "enabled": false, "false_positives": ["https://bz.apache.org/bugzilla/show_bug.cgi?id=46185"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e50b9175-abb0-43ef-2917-9ee139e4d047", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Apache Threading Error", "query": "\"__pthread_tpp_change_priority\\:\\ Assertion\\ `new_prio\\ \\=\\=\\ \\-1\\ \\||\\ \\(new_prio\\ >\\=\\ fifo_min_prio\\ \\&&\\ new_prio\\ <\\=\\ fifo_max_prio\\)\"", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/hannob/apache-uaf/blob/master/README.md"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
