{"description": "When exploiting this vulnerability with CVE-2021\u201326858, an SSRF attack is used to manipulate virtual directories", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "effee1f6-a932-4297-a81f-acb44064fa3a", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "ProxyLogon Reset Virtual Directories Based On IIS Log", "query": "((http.request.method:\"POST\" AND http.response.status_code:\"200\" AND cs-uri-stem:\"\\/ecp\\/DDI\\/DDIService.svc\\/SetObject\" AND cs-uri-query:*schema\\=Reset* AND cs-uri-query:*VirtualDirectory* AND cs-username:*$) OR (*POST* AND *200* AND *\\/ecp\\/DDI\\/DDIService.svc\\/SetObject* AND *schema\\=Reset* AND *VirtualDirectory* AND *$*))", "meta": {"from": "1m"}, "severity": "critical", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
