{"description": "Detects attempts to exploit the Atlassian Bitbucket Command Injection CVE-2022-36804", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Web vulnerability scanners"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "d7bfdb14-7e2c-6fb9-f639-b7d6613e319a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Atlassian Bitbucket Command Injection Via Archive API", "query": "(cs-uri-query:*\\/rest\\/api\\/latest\\/projects\\/* AND cs-uri-query:*prefix\\=* AND cs-uri-query:*%00\\-\\-exec*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://twitter.com/_0xf4n9x_/status/1572052954538192901", "https://www.rapid7.com/blog/post/2022/09/20/cve-2022-36804-easily-exploitable-vulnerability-in-atlassian-bitbucket-server-and-data-center/", "https://confluence.atlassian.com/bitbucketserver/bitbucket-server-and-data-center-advisory-2022-08-24-1155489835.html", "https://blog.assetnote.io/2022/09/14/rce-in-bitbucket-server/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
