{"description": "Detects CVE-2020-10148 SolarWinds Orion API authentication bypass attempts", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "ff5553d0-07ac-6a1d-ce2b-a4f72d5db49c", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CVE-2020-10148 SolarWinds Orion API Auth Bypass", "query": "((url.original:(*WebResource.axd* OR *ScriptResource.axd* OR *i18n.ashx* OR *Skipi18n*) AND (NOT (url.original:*Orion\\/Skipi18n\\/Profiler\\/*))) AND (NOT (url.original:(*css.i18n.ashx* OR *js.i18n.ashx*))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://kb.cert.org/vuls/id/843464"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
