{"description":"Detects source code enumeration that use GET requests by keyword searches in URL strings Author: James Ahearn. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"953d460b-f810-420a-97a2-cfca4c98e602","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Source Code Enumeration Detection by Keyword","query":"*.git\\/*","meta":{"from":"1m"},"severity":"medium","tags":["T1083"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1083","name":"File and Directory Discovery","reference":"https://attack.mitre.org/techniques/T1083"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
