{"description": "When exploiting this vulnerability with CVE-2021-26858, an SSRF attack is used to manipulate virtual directories", "author": ["frack113"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d4fedf42-3e85-8269-357c-ec160a8eb0cb", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "ProxyLogon Reset Virtual Directories Based On IIS Log", "query": "(((cs-method:\"POST\" AND sc-status:\"200\" AND cs-uri-stem:\"/ecp/DDI/DDIService.svc/SetObject\" AND cs-uri-query:*schema\\=Reset* AND cs-uri-query:*VirtualDirectory* AND cs-username:*$)) OR ((*POST* AND \"200\" AND */ecp/DDI/DDIService.svc/SetObject* AND *schema=Reset* AND *VirtualDirectory* AND *$*)))", "meta": {"from": "1m"}, "severity": "critical", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
