{"description": "Detects possible exploitation of VMware Workspace ONE Access Admin Remote Code Execution vulnerability as described in CVE-2022-31659", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Vulnerability scanners", "Legitimate access to the URI"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "3b183720-4f1e-58d3-7b6b-cfa850f9efec", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CVE-2022-31659 VMware Workspace ONE Access RCE", "query": "(http.request.method:\"POST\" AND cs-uri-query:*\\/SAAS\\/jersey\\/manager\\/api\\/migrate\\/tenant*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://petrusviet.medium.com/dancing-on-the-architecture-of-vmware-workspace-one-access-eng-ad592ae1b6dd"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
