{"description": "Detects a segmentation fault error message caused by a creashing apache worker process", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "8fc305c1-038c-2a46-977c-a279faddd106", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Apache Segmentation Fault", "query": "\"exit\\ signal\\ Segmentation\\ Fault\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1499"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1499", "name": "Endpoint Denial of Service", "reference": "https://attack.mitre.org/techniques/T1499"}]}], "version": 1, "references": ["http://www.securityfocus.com/infocus/1633"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
