{"description": "Detects the exploitation of Microsoft Exchange ProxyToken vulnerability as described in CVE-2021-33766", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "08d49550-8566-34f9-260d-47ec72044f66", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CVE-2021-33766 Exchange ProxyToken Exploitation", "query": "(http.response.status_code:\"500\" AND url.original:*\\/ecp\\/* AND ((http.request.method:\"POST\" AND url.original:*\\/RulesEditor\\/InboxRules.svc\\/NewObject*) OR url.original:*SecurityToken\\=*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://www.zerodayinitiative.com/blog/2021/8/30/proxytoken-an-authentication-bypass-in-microsoft-exchange-server"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Max Altgelt", "Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
