{"description": "Detects XSS attempts injected via GET requests in access logs", "enabled": false, "false_positives": ["JavaScripts,CSS Files and PNG files", "User searches in search boxes of the respective website", "Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as \"User Agent\" strings and more response codes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "477acbda-c324-9cf8-e614-ff064e68780a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Cross Site Scripting Strings", "query": "((http.request.method:\"GET\" AND (*\\=<script>* OR *\\=%3Cscript%3E* OR *\\=%253Cscript%253E* OR *<iframe\\ * OR *%3Ciframe\\ * OR *<svg\\ * OR *%3Csvg\\ * OR *document.cookie* OR *document.domain* OR *\\ onerror\\=* OR *\\ onresize\\=* OR *\\ onload\\=\\\"* OR *onmouseover\\=* OR *$\\{alert* OR *javascript\\:alert* OR *javascript%3Aalert*)) AND (NOT (http.response.status_code:\"404\")))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/payloadbox/xss-payload-list", "https://portswigger.net/web-security/cross-site-scripting/contexts"], "timestamp_override": "event.ingested", "author": ["Saw Win Naung", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
