{"description": "Detects the exploitation of Microsoft Exchange vulnerability as described in CVE-2020-0688", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "e18109b0-4387-d158-9674-a135bb9cf89e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CVE-2020-0688 Exchange Exploitation via Web Log", "query": "(http.request.method:\"GET\" AND url.original:(*\\/ecp\\/* OR *\\/owa\\/*) AND url.original:*__VIEWSTATE\\=*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
