{"description":"Detects the exploitation of the Confluence vulnerability described in CVE-2019-3398 Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"24a26c59-ec90-96b0-47b3-d778fd03cdae","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Confluence Exploitation CVE-2019-3398","query":"(http.request.method:\"POST\" AND url.original:*\\/upload.action* AND url.original:*filename\\=..\\/..\\/..\\/..\\/*)","meta":{"from":"1m"},"severity":"critical","tags":["Initial Access","T1190"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
