{"description": "Detects access to DEWMODE webshell as described in FIREEYE report", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "a8688d15-a44d-8b76-1fb8-021c83679474", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DEWMODE Webshell Access", "query": "(url.original:*.html?* AND ((url.original:*?dwn\\=* AND url.original:*&fn\\=*) OR (url.original:*&dwn\\=* AND url.original:*?fn\\=*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
