{"description": "Detects suspicious access to URLs that was noticed in cases in which attackers exploitated the ADSelfService vulnerability CVE-2021-40539", "author": ["Tobias Michalski", "Max Altgelt"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "1ba17f7e-66ab-9981-a798-39c238eb3a3d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "ADSelfService Exploitation", "query": "cs-uri-query:(*\\/help\\/admin\\-guide\\/Reports\\/ReportGenerate.jsp* OR *\\/ServletApi\\/..\\/RestApi\\/LogonCustomization* OR *\\/ServletApi\\/..\\/RestAPI\\/Connection*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://us-cert.cisa.gov/ncas/alerts/aa21-259a"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
