{"description": "Detects URL patterns that could be found in ProxyShell exploitation attempts against Exchange servers (failed and successful)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "089dc533-a0be-c132-3b9b-e3c714d4b182", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Exchange ProxyShell Pattern", "query": "((url.original:*\\/autodiscover.json* AND url.original:(*\\/powershell* OR *\\/mapi\\/nspi* OR *\\/EWS* OR *X\\-Rps\\-CAT*)) OR url.original:(*autodiscover.json?@* OR *autodiscover.json%3f@* OR *%3f@foo.com* OR *Email\\=autodiscover\\/autodiscover.json* OR *json?@foo.com*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://youtu.be/5mqid-7zp8k?t=2231", "https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html", "https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Rich Warren"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
