{"description": "Detects windows webshells that use GET requests by keyword searches in URL strings", "enabled": false, "false_positives": ["Web sites like wikis with articles on os commands and pages that include the os commands in the URLs", "User searches in search boxes of the respective website"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "ad695685-3820-5b1b-e598-6f9b2cf7388e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Webshell Detection by Keyword", "query": "(*\\=whoami* OR *\\=net%20user* OR *\\=cmd%20\\/c%20* OR *\\=powershell%20* OR *\\=tasklist%20* OR *\\=wmic%20*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
