{"description": "Detects exploitation of flaw in path normalization in Apache HTTP server 2.4.49. An attacker could use a path traversal attack to map URLs to files outside the expected document root. If files outside of the document root are not protected by \"require all denied\" these requests can succeed. Additionally this flaw could leak the source of interpreted files like CGI scripts. This issue is known to be exploited in the wild. This issue only affects Apache 2.4.49 and not earlier versions.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "3007fec6-e761-4319-91af-e32e20ac43f5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CVE-2021-41773 Exploitation Attempt", "query": "(url.original:(*\\/cgi\\-bin\\/.%2e\\/* OR *\\/icons\\/.%2e\\/* OR *\\/cgi\\-bin\\/.%%32%65\\/* OR *\\/icons\\/.%%32%65\\/* OR *\\/cgi\\-bin\\/.%%%25%33* OR *\\/icons\\/.%%%25%33*) AND http.response.status_code:(\"200\" OR \"301\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://nvd.nist.gov/vuln/detail/CVE-2021-41773", "https://github.com/apache/httpd/commit/e150697086e70c552b2588f369f2d17815cb1782", "https://twitter.com/ptswarm/status/1445376079548624899", "https://twitter.com/h4x0r_dz/status/1445401960371429381", "https://github.com/projectdiscovery/nuclei-templates/blob/9d2889356eebba661c8407038e430759dfd4ec31/cves/2021/CVE-2021-41773.yaml", "https://twitter.com/bl4sty/status/1445462677824761878"], "timestamp_override": "event.ingested", "author": ["daffainfo", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
