{"description": "Detects known suspicious (default) user-agents related to scanning/recon tools", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "5187c342-92f4-620f-3861-bcb13b3e85f0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious User-Agents Related To Recon Tools", "query": "user_agent.original:(*Wfuzz\\/* OR *WPScan\\ v* OR *Recon\\-ng\\/v* OR *GIS\\ \\-\\ AppSec\\ Team\\ \\-\\ Project\\ Vision*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://github.com/wpscanteam/wpscan/blob/196fbab5b1ce3870a43515153d4f07878a89d410/lib/wpscan/browser.rb", "https://github.com/xmendez/wfuzz/blob/1b695ee9a87d66a7d7bf6cae70d60a33fae51541/docs/user/basicusage.rst", "https://github.com/lanmaster53/recon-ng/blob/9e907dfe09fce2997f0301d746796408e01a60b7/recon/core/base.py#L92"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
