{"description":"Detects exploitation attempt against log4j RCE vulnerability reported as CVE-2021-44228 in different header fields found in web server logs (Log4Shell) Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Vulnerability scanning"],"filters":[],"from":"now-360s","immutable":false,"index":["filebeat-*"],"interval":"5m","rule_id":"9be472ed-893c-4ec0-94da-312d2765f654","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Log4j RCE CVE-2021-44228 in Fields","query":"(cs-User-Agent:(*$\\{jndi\\:ldap\\:\\/* OR *$\\{jndi\\:rmi\\:\\/* OR *$\\{jndi\\:ldaps\\:\\/* OR *$\\{jndi\\:dns\\:\\/* OR *\\/$%7bjndi\\:* OR *%24%7bjndi\\:* OR *$%7Bjndi\\:* OR *%2524%257Bjndi* OR *%2F%252524%25257Bjndi%3A* OR *$\\{jndi\\:$\\{lower\\:* OR *$\\{\\:\\:\\-j\\}$\\{* OR *$\\{jndi\\:nis* OR *$\\{jndi\\:nds* OR *$\\{jndi\\:corba* OR *$\\{jndi\\:iiop* OR *$\\{$\\{env\\:BARFOO\\:\\-j\\}* OR *$\\{\\:\\:\\-l\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-a\\}$\\{\\:\\:\\-p\\}* OR *$\\{base64\\:JHtqbmRp* OR *$\\{$\\{env\\:ENV_NAME\\:\\-j\\}ndi$\\{env\\:ENV_NAME\\:\\-\\:\\}$\\{env\\:ENV_NAME\\:\\-l\\}dap$\\{env\\:ENV_NAME\\:\\-\\:\\}\\/\\/* OR *$\\{$\\{lower\\:j\\}ndi\\:$\\{lower\\:l\\}$\\{lower\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{upper\\:j\\}ndi\\:$\\{upper\\:l\\}$\\{upper\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{\\:\\:\\-j\\}$\\{\\:\\:\\-n\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-i\\}\\:*) OR user_agent.original:(*$\\{jndi\\:ldap\\:\\/* OR *$\\{jndi\\:rmi\\:\\/* OR *$\\{jndi\\:ldaps\\:\\/* OR *$\\{jndi\\:dns\\:\\/* OR *\\/$%7bjndi\\:* OR *%24%7bjndi\\:* OR *$%7Bjndi\\:* OR *%2524%257Bjndi* OR *%2F%252524%25257Bjndi%3A* OR *$\\{jndi\\:$\\{lower\\:* OR *$\\{\\:\\:\\-j\\}$\\{* OR *$\\{jndi\\:nis* OR *$\\{jndi\\:nds* OR *$\\{jndi\\:corba* OR *$\\{jndi\\:iiop* OR *$\\{$\\{env\\:BARFOO\\:\\-j\\}* OR *$\\{\\:\\:\\-l\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-a\\}$\\{\\:\\:\\-p\\}* OR *$\\{base64\\:JHtqbmRp* OR *$\\{$\\{env\\:ENV_NAME\\:\\-j\\}ndi$\\{env\\:ENV_NAME\\:\\-\\:\\}$\\{env\\:ENV_NAME\\:\\-l\\}dap$\\{env\\:ENV_NAME\\:\\-\\:\\}\\/\\/* OR *$\\{$\\{lower\\:j\\}ndi\\:$\\{lower\\:l\\}$\\{lower\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{upper\\:j\\}ndi\\:$\\{upper\\:l\\}$\\{upper\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{\\:\\:\\-j\\}$\\{\\:\\:\\-n\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-i\\}\\:*) OR cs-uri:(*$\\{jndi\\:ldap\\:\\/* OR *$\\{jndi\\:rmi\\:\\/* OR *$\\{jndi\\:ldaps\\:\\/* OR *$\\{jndi\\:dns\\:\\/* OR *\\/$%7bjndi\\:* OR *%24%7bjndi\\:* OR *$%7Bjndi\\:* OR *%2524%257Bjndi* OR *%2F%252524%25257Bjndi%3A* OR *$\\{jndi\\:$\\{lower\\:* OR *$\\{\\:\\:\\-j\\}$\\{* OR *$\\{jndi\\:nis* OR *$\\{jndi\\:nds* OR *$\\{jndi\\:corba* OR *$\\{jndi\\:iiop* OR *$\\{$\\{env\\:BARFOO\\:\\-j\\}* OR *$\\{\\:\\:\\-l\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-a\\}$\\{\\:\\:\\-p\\}* OR *$\\{base64\\:JHtqbmRp* OR *$\\{$\\{env\\:ENV_NAME\\:\\-j\\}ndi$\\{env\\:ENV_NAME\\:\\-\\:\\}$\\{env\\:ENV_NAME\\:\\-l\\}dap$\\{env\\:ENV_NAME\\:\\-\\:\\}\\/\\/* OR *$\\{$\\{lower\\:j\\}ndi\\:$\\{lower\\:l\\}$\\{lower\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{upper\\:j\\}ndi\\:$\\{upper\\:l\\}$\\{upper\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{\\:\\:\\-j\\}$\\{\\:\\:\\-n\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-i\\}\\:*) OR cs-referer:(*$\\{jndi\\:ldap\\:\\/* OR *$\\{jndi\\:rmi\\:\\/* OR *$\\{jndi\\:ldaps\\:\\/* OR *$\\{jndi\\:dns\\:\\/* OR *\\/$%7bjndi\\:* OR *%24%7bjndi\\:* OR *$%7Bjndi\\:* OR *%2524%257Bjndi* OR *%2F%252524%25257Bjndi%3A* OR *$\\{jndi\\:$\\{lower\\:* OR *$\\{\\:\\:\\-j\\}$\\{* OR *$\\{jndi\\:nis* OR *$\\{jndi\\:nds* OR *$\\{jndi\\:corba* OR *$\\{jndi\\:iiop* OR *$\\{$\\{env\\:BARFOO\\:\\-j\\}* OR *$\\{\\:\\:\\-l\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-a\\}$\\{\\:\\:\\-p\\}* OR *$\\{base64\\:JHtqbmRp* OR *$\\{$\\{env\\:ENV_NAME\\:\\-j\\}ndi$\\{env\\:ENV_NAME\\:\\-\\:\\}$\\{env\\:ENV_NAME\\:\\-l\\}dap$\\{env\\:ENV_NAME\\:\\-\\:\\}\\/\\/* OR *$\\{$\\{lower\\:j\\}ndi\\:$\\{lower\\:l\\}$\\{lower\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{upper\\:j\\}ndi\\:$\\{upper\\:l\\}$\\{upper\\:d\\}a$\\{lower\\:p\\}\\:\\/\\/* OR *$\\{$\\{\\:\\:\\-j\\}$\\{\\:\\:\\-n\\}$\\{\\:\\:\\-d\\}$\\{\\:\\:\\-i\\}\\:*))","meta":{"from":"1m"},"severity":"high","tags":["Initial Access","T1190"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
