{"description": "Detects URP patterns and status codes that indicate a successful ProxyShell exploitation attack against Exchange servers", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["filebeat-*"], "interval": "5m", "rule_id": "57ca78d2-56f1-db9f-726e-d7b79aabbb4e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Successful Exchange ProxyShell Attack", "query": "(url.original:*\\/autodiscover.json* AND url.original:(*\\/powershell* OR *\\/mapi\\/nspi* OR *\\/EWS* OR *X\\-Rps\\-CAT*) AND http.response.status_code:(\"200\" OR \"301\"))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Initial Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://youtu.be/5mqid-7zp8k?t=2231", "https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html", "https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Rich Warren"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
