{"description": "Detects adding and using Exchange PowerShell snap-ins to export mailbox data by HAFNIUM", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "25676e10-2121-446e-80a4-71ff8506af47", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Exchange PowerShell Snap-Ins Used by HAFNIUM", "query": "(process.executable:*\\\\powershell.exe AND process.command_line:*add\\-pssnapin\\ microsoft.exchange.powershell.snapin*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1114"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1114", "name": "Email Collection", "reference": "https://attack.mitre.org/techniques/T1114"}]}], "version": 1, "references": ["https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/", "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"], "timestamp_override": "event.ingested", "author": ["FPT.EagleEye"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
