{"description": "Detects potential installation or installation attempts of known malicious appx packages", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Rare occasions where a malicious package uses the exact same name and version as a legtimate application"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "073ee7b6-c6bb-7646-ed5c-704a2b9cc6bb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Malicious AppX Package Installation Attempts", "query": "(winlog.event_id:(\"400\" OR \"401\") AND PackageFullName:*3669e262\\-ec02\\-4e9d\\-bcb4\\-3d008b4afac9*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/", "https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/", "https://forensicitguy.github.io/analyzing-magnitude-magniber-appx/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
