{"description": "Detects an appx package added the pipeline of the \"to be processed\" packages which is located in uncommon locations", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c977cb50-3dff-4a9f-b873-9290f56132f1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Uncommon AppX Package Locations", "query": "(winlog.event_id:\"854\" AND (NOT ((winlog.event_data.Path:(*C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* OR *C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\* OR *C\\:\\\\Windows\\\\SystemApps\\\\* OR *C\\:\\\\Windows\\\\PrintDialog\\\\* OR *C\\:\\\\Windows\\\\ImmersiveControlPanel\\\\* OR *x\\-windowsupdate\\:\\/\\/* OR *file\\:\\/\\/\\/C\\:\\/Program%20Files*)) OR (winlog.event_data.Path:(*https\\:\\/\\/statics.teams.cdn.office.net\\/* OR *microsoft.com*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/", "https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting", "https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
