{"description": "Detects an appx package added the pipeline of the \"to be processed\" packages which is located in suspicious locations", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ffe37bfd-e680-477a-884e-5aa2ab8289d8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious AppX Package Locations", "query": "(winlog.event_id:\"854\" AND winlog.event_data.Path:(*C\\:\\\\Users\\\\Public\\\\* OR *\\/users\\/public\\/* OR *C\\:\\\\PerfLogs\\\\* OR *C\\:\\/perflogs\\/* OR *\\\\Desktop\\\\* OR *\\/desktop\\/* OR *\\\\Downloads\\\\* OR *\\/Downloads\\/* OR *C\\:\\\\Windows\\\\Temp\\\\* OR *C\\:\\/Windows\\/Temp\\/* OR *\\\\AppdData\\\\Local\\\\Temp\\\\* OR *\\/AppdData\\/Local\\/Temp\\/*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/", "https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting", "https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
