{"description": "Detects an appx package installation with the error code \"0x80073cff\". Whihc indicates that the package didn't meet the sgining requirements and could be suspicious", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate AppX packages not signed by MS used part of an enterprise"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "16daaf93-f45a-66f2-dd29-f127cb3b258f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious AppX Package Installation Attempt", "query": "(winlog.event_id:\"401\" AND ErrorCode:\"0x80073cff\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/", "https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting", "https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
