{"description":"Detects suspicious scripting in WMI Event Consumers Author: Florian Roth, Jonhnathan Ribeiro. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative scripts"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"bc0c5816-1bd9-edb2-e78c-c72d3b77f9fe","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Scripting in a WMI Consumer","query":"((Destination:*new\\-object* AND Destination:*net.webclient* AND Destination:*.downloadstring*) OR (Destination:*new\\-object* AND Destination:*net.webclient* AND Destination:*.downloadfile*) OR Destination:(*\\ iex\\(* OR *WScript.shell* OR *\\ \\-nop\\ * OR *\\ \\-noprofile\\ * OR *\\ \\-decode\\ * OR *\\ \\-enc\\ *) OR Destination:(*WScript.Shell* OR *System.Security.Cryptography.FromBase64Transform*))","meta":{"from":"1m"},"severity":"high","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
