{"description": "Detects suspicious commands that are related to scripting/powershell in WMI Event Consumers", "enabled": false, "false_positives": ["Legitimate administrative scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bc0c5816-1bd9-edb2-e78c-c72d3b77f9fe", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Scripting in a WMI Consumer", "query": "((Destination:*new\\-object* AND Destination:*net.webclient* AND Destination:*.downloadstring*) OR (Destination:*new\\-object* AND Destination:*net.webclient* AND Destination:*.downloadfile*) OR Destination:(*\\ iex\\(* OR *WScript.shell* OR *\\ \\-nop\\ * OR *\\ \\-noprofile\\ * OR *\\ \\-decode\\ * OR *\\ \\-enc\\ *) OR Destination:(*WScript.Shell* OR *System.Security.Cryptography.FromBase64Transform*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/", "https://github.com/Neo23x0/signature-base/blob/615bf1f6bac3c1bdc417025c40c073e6c2771a76/yara/gen_susp_lnk_files.yar#L19", "https://github.com/RiccardoAncarani/LiquidSnake"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Jonhnathan Ribeiro"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
