{"description":"Detects suspicious encoded payloads in WMI Event Consumers Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c790854a-c179-1e9a-4f65-f88fb0af3b94","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Encoded Scripts in a WMI Consumer","query":"Destination:(*V3JpdGVQcm9jZXNzTWVtb3J5* OR *dyaXRlUHJvY2Vzc01lbW9ye* OR *Xcml0ZVByb2Nlc3NNZW1vcn* OR *VGhpcyBwcm9ncmFtIGNhbm5vdCBiZSBydW4gaW4gRE9TIG1vZG* OR *RoaXMgcHJvZ3JhbSBjYW5ub3QgYmUgcnVuIGluIERPUyBtb2Rl* OR *UaGlzIHByb2dyYW0gY2Fubm90IGJlIHJ1biBpbiBET1MgbW9kZ* OR *VGhpcyBwcm9ncmFtIG11c3QgYmUgcnVuIHVuZGVyIFdpbjMy* OR *RoaXMgcHJvZ3JhbSBtdXN0IGJlIHJ1biB1bmRlciBXaW4zM* OR *UaGlzIHByb2dyYW0gbXVzdCBiZSBydW4gdW5kZXIgV2luMz*)","meta":{"from":"1m"},"severity":"high","tags":["T1047","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"}]},{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
