{"description": "High DNS requests amount from host per short period of time", "enabled": false, "false_positives": ["Legitimate high DNS requests rate to domain name which should be added to whitelist"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "bf0aebc9-a968-7e52-0c63-a1664792ff83", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "High DNS Requests Rate", "query": "destination.port:\"53\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1048", "T1071"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "threshold": {"field": "source.ip", "value": 1001}, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
