{"description": "Identifies IPs from which users grant access to other users on azure resources and alerts when a previously unseen source IP address is used.", "author": ["sawwinnnaung"], "enabled": false, "false_positives": ["Valid change"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a622fcd2-4b5a-436a-b8a2-a4171161833c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Granting Of Permissions To An Account", "query": "/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Aa][Uu][Tt][Hh][Oo][Rr][Ii][Zz][Aa][Tt][Ii][Oo][Nn]\\/[Rr][Oo][Ll][Ee][Aa][Ss][Ss][Ii][Gg][Nn][Mm][Ee][Nn][Tt][Ss]\\/[Ww][Rr][Ii][Tt][Ee]/", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/e534407884b1ec5371efc9f76ead282176c9e8bb/Detections/AzureActivity/Granting_Permissions_To_Account_detection.yaml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
