{"description": "Number of VM creations or deployment activities occur in Azure via the azureactivity log.", "author": ["sawwinnnaung"], "enabled": false, "false_positives": ["Valid change"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d2d901db-7a75-45a1-bc39-0cbf00812192", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Number Of Resource Creation Or Deployment Activities", "query": "((/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Cc][Oo][Mm][Pp][Uu][Tt][Ee]\\/[Vv][Ii][Rr][Tt][Uu][Aa][Ll][Mm][Aa][Cc][Hh][Ii][Nn][Ee][Ss]\\/[Ww][Rr][Ii][Tt][Ee]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Rr][Ee][Ss][Oo][Uu][Rr][Cc][Ee][Ss]\\/[Dd][Ee][Pp][Ll][Oo][Yy][Mm][Ee][Nn][Tt][Ss]\\/[Ww][Rr][Ii][Tt][Ee]\\*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/e534407884b1ec5371efc9f76ead282176c9e8bb/Detections/AzureActivity/Creating_Anomalous_Number_Of_Resources_detection.yaml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
