{"description": "Identifies IPs from which users grant access to other users on azure resources and alerts when a previously unseen source IP address is used.", "author": ["sawwinnnaung"], "enabled": false, "false_positives": ["Valid change"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c1182e02-49a3-481c-b3de-0fadc4091488", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rare Subscription-level Operations In Azure", "query": "((/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Dd][Oo][Cc][Uu][Mm][Ee][Nn][Tt][Dd][Bb]\\/[Dd][Aa][Tt][Aa][Bb][Aa][Ss][Ee][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ss]\\/[Ll][Ii][Ss][Tt][Kk][Ee][Yy][Ss]\\/[Aa][Cc][Tt][Ii][Oo][Nn]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Mm][Aa][Pp][Ss]\\/[Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ss]\\/[Ll][Ii][Ss][Tt][Kk][Ee][Yy][Ss]\\/[Aa][Cc][Tt][Ii][Oo][Nn]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Mm][Ee][Dd][Ii][Aa]\\/[Mm][Ee][Dd][Ii][Aa][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\/[Ll][Ii][Ss][Tt][Kk][Ee][Yy][Ss]\\/[Aa][Cc][Tt][Ii][Oo][Nn]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Cc][Oo][Gg][Nn][Ii][Tt][Ii][Vv][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\/[Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ss]\\/[Ll][Ii][Ss][Tt][Kk][Ee][Yy][Ss]\\/[Aa][Cc][Tt][Ii][Oo][Nn]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\/[Ss][Tt][Oo][Rr][Aa][Gg][Ee][Aa][Cc][Cc][Oo][Uu][Nn][Tt][Ss]\\/[Ll][Ii][Ss][Tt][Kk][Ee][Yy][Ss]\\/[Aa][Cc][Tt][Ii][Oo][Nn]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Cc][Oo][Mm][Pp][Uu][Tt][Ee]\\/[Ss][Nn][Aa][Pp][Ss][Hh][Oo][Tt][Ss]\\/[Ww][Rr][Ii][Tt][Ee]\\*/) OR (/\\*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\/[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Gg][Rr][Oo][Uu][Pp][Ss]\\/[Ww][Rr][Ii][Tt][Ee]\\*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1003"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/e534407884b1ec5371efc9f76ead282176c9e8bb/Detections/AzureActivity/RareOperations.yaml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
