{"description": "Detects a highly relevant Antivirus alert that reports a hack tool or other attack tool", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "6606305e-e9b8-6dd6-a679-ea4498aa70eb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Antivirus Hacktool Detection", "query": "(winlog.event_data.Signature:(HTOOL* OR HKTL* OR SecurityTool* OR ATK\\/*) OR winlog.event_data.Signature:*Hacktool*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
