{"description":"Detects the suspicious file that is created from PoC code against Windows Print Spooler Remote Code Execution Vulnerability CVE-2021-34527 (PrinterNightmare), CVE-2021-1675 . Author: Sittikorn S, Nuttakorn T. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"ab791222-3b18-b5f3-3e45-bd4de1f9d65c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Antivirus PrinterNightmare CVE-2021-34527 Exploit Detection","query":"Filename:*C\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\*","meta":{"from":"1m"},"severity":"critical","tags":["Privilege Escalation","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
