{"description": "Detects a highly relevant Antivirus alert that reports a password dumper", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5e8acfaa-f069-41d9-1f81-f986a5d91626", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Antivirus Password Dumper Detection", "query": "winlog.event_data.Signature:(*DumpCreds* OR *Mimikatz* OR *PWCrack* OR *HTool\\/WCE* OR *PSWtool* OR *PWDump* OR *SecurityTool* OR *PShlSpy* OR *Rubeus* OR *Kekeo* OR *LsassDump* OR *Outflank*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003", "T1003", "T1003", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://www.nextron-systems.com/2018/09/08/antivirus-event-analysis-cheat-sheet-v1-4/", "https://www.virustotal.com/gui/file/5fcda49ee7f202559a6cbbb34edb65c33c9a1e0bde9fa2af06a6f11b55ded619/detection"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
