{"description": "Detects a highly relevant Antivirus alert that reports ransomware", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "4c6ca276-d4d0-4a8c-9e4c-d69832f8671f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Antivirus Ransomware Detection", "query": "winlog.event_data.Signature:(*Ransom* OR *Filecoder*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1486"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.nextron-systems.com/?s=antivirus"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
