{"description":"Detects an Antivirus alert in a highly relevant file path or with a relevant file name Author: Florian Roth, Arnim Rupp. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"8ed5f2d5-d776-eb54-04d2-be2f2d140bad","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Antivirus Relevant File Paths Alerts","query":"(Filename:(C\\:\\\\Windows\\\\* OR C\\:\\\\Temp\\\\* OR C\\:\\\\PerfLogs\\\\* OR C\\:\\\\Users\\\\Public\\\\* OR C\\:\\\\Users\\\\Default\\\\*) OR Filename:(*\\\\Client\\\\* OR *\\\\tsclient\\\\* OR *\\\\inetpub\\\\* OR *\\/www\\/* OR *apache* OR *tomcat* OR *nginx* OR *weblogic*) OR Filename:(*.ps1 OR *.psm1 OR *.vbs OR *.bat OR *.cmd OR *.sh OR *.chm OR *.xml OR *.txt OR *.jsp OR *.jspx OR *.asp OR *.aspx OR *.ashx OR *.asax OR *.asmx OR *.php OR *.cfm OR *.py OR *.pyc OR *.pl OR *.rb OR *.cgi OR *.war OR *.ear OR *.hta OR *.lnk OR *.scf OR *.sct OR *.vbe OR *.wsf OR *.wsh OR *.gif OR *.png OR *.jpg OR *.jpeg OR *.svg OR *.dat))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
