{"description": "Detects an Antivirus alert in a highly relevant file path or with a relevant file name", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c9a88268-0047-4824-ba6e-4d81ce0b907c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Antivirus Relevant File Paths Alerts", "query": "(Filename:(C\\:\\\\Windows\\\\* OR C\\:\\\\Temp\\\\* OR C\\:\\\\PerfLogs\\\\* OR C\\:\\\\Users\\\\Public\\\\* OR C\\:\\\\Users\\\\Default\\\\*) OR Filename:(*\\\\Client\\\\* OR *\\\\tsclient\\\\* OR *\\\\inetpub\\\\* OR *\\/www\\/* OR *apache* OR *tomcat* OR *nginx* OR *weblogic*) OR Filename:(*.ps1 OR *.psm1 OR *.vbs OR *.bat OR *.cmd OR *.sh OR *.chm OR *.xml OR *.txt OR *.jsp OR *.jspx OR *.asp OR *.aspx OR *.ashx OR *.asax OR *.asmx OR *.php OR *.cfm OR *.py OR *.pyc OR *.pl OR *.rb OR *.cgi OR *.war OR *.ear OR *.hta OR *.lnk OR *.scf OR *.sct OR *.vbe OR *.wsf OR *.wsh OR *.gif OR *.png OR *.jpg OR *.jpeg OR *.svg OR *.dat))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.nextron-systems.com/2021/03/25/antivirus-event-analysis-cheat-sheet-v1-8/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Arnim Rupp"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
