{"description": "Detects a highly relevant Antivirus alert that reports a web shell. It's highly recommended to tune this rule to the specific strings used by your anti virus solution by downloading a big webshell repo from e.g. github and checking the matches.", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "da9ef7b7-8faf-f46a-8d69-8ddd6725857d", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Antivirus Web Shell Detection", "query": "(winlog.event_data.Signature:(PHP\\/* OR JSP\\/* OR ASP\\/* OR Perl\\/* OR PHP.* OR JSP.* OR ASP.* OR Perl.* OR VBS\\/Uxor* OR IIS\\/BackDoor* OR JAVA\\/Backdoor* OR Troj\\/ASP* OR Troj\\/PHP* OR Troj\\/JSP*) OR winlog.event_data.Signature:(*Webshell* OR *Chopper* OR *SinoChoper* OR *ASPXSpy* OR *Aspdoor* OR *filebrowser* OR *PHP_* OR *JSP_* OR *ASP_* OR *PHP\\:* OR *JSP\\:* OR *ASP\\:* OR *Perl\\:* OR *PHPShell* OR *Trojan.PHP* OR *Trojan.ASP* OR *Trojan.JSP* OR *Trojan.VBS* OR *PHP?Agent* OR *ASP?Agent* OR *JSP?Agent* OR *VBS?Agent* OR *Backdoor?PHP* OR *Backdoor?JSP* OR *Backdoor?ASP* OR *Backdoor?VBS* OR *Backdoor?Java* OR *PShlSpy*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://www.nextron-systems.com/2021/03/25/antivirus-event-analysis-cheat-sheet-v1-8/", "https://github.com/tennc/webshell", "https://www.virustotal.com/gui/file/bd1d52289203866645e556e2766a21d2275877fbafa056a76fe0cf884b7f8819/detection", "https://www.virustotal.com/gui/file/308487ed28a3d9abc1fec7ebc812d4b5c07ab025037535421f64c60d3887a3e8/detection", "https://www.virustotal.com/gui/file/7d3cb8a8ff28f82b07f382789247329ad2d7782a72dde9867941f13266310c80/detection", "https://www.virustotal.com/gui/file/e841675a4b82250c75273ebf0861245f80c6a1c3d5803c2d995d9d3b18d5c4b5/detection", "https://www.virustotal.com/gui/file/a80042c61a0372eaa0c2c1e831adf0d13ef09feaf71d1d20b216156269045801/detection", "https://www.virustotal.com/gui/file/b219f7d3c26f8bad7e175934cd5eda4ddb5e3983503e94ff07d39c0666821b7e/detection", "https://www.virustotal.com/gui/file/b8702acf32fd651af9f809ed42d15135f842788cd98d81a8e1b154ee2a2b76a2/detection"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Arnim Rupp"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
