{"description": "Detects Commandlet names from ShellIntel exploitation scripts.", "author": ["Max Altgelt", "Tobias Michalski"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d1aa6189-006c-fc0c-92a7-e03d9801aebc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Malicious ShellIntel PowerShell Commandlets", "query": "powershell.file.script_block_text:(*Invoke\\-SMBAutoBrute* OR *Invoke\\-GPOLinks* OR *Invoke\\-Potato*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/Shellntel/scripts/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
