{"description": "Detects usage of special strings/null bits in order to potentially bypass AMSI functionalities", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa2559c8-1197-471d-9cdd-05a0273d4522", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential AMSI Bypass Using NULL Bits - ScriptBlockLogging", "query": "ScriptBlockLogging:(*if\\(0\\)\\{\\{\\{0\\}\\}\\}'\\ \\-f\\ $\\(0\\ \\-as\\ \\[char\\]\\)\\ \\+* OR *#<NULL>*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-bypass-using-null-bits-satoshi"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
