{"description": "Detects a Get-Process command on lsass process, which is in almost all cases a sign of malicious activity", "enabled": false, "false_positives": ["Legitimate certificate exports invoked by administrators or users (depends on processes in the environment - filter if unusable)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "84c174ab-d3ef-481f-9c86-a50d0b8e3edb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Get-Process LSASS in ScriptBlock", "query": "powershell.file.script_block_text:*Get\\-Process\\ lsass*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/PythonResponder/status/1385064506049630211"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
