{"description":"Adversaries may employ various system checks to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"32aceca4-af21-e4d5-f5a5-1009357cbc33","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Powershell Detect Virtualization Environment","query":"(powershell.file.script_block_text:*Get\\-WmiObject* AND powershell.file.script_block_text:(*MSAcpi_ThermalZoneTemperature* OR *Win32_ComputerSystem*))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1497"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1497","name":"Virtualization/Sandbox Evasion","reference":"https://attack.mitre.org/techniques/T1497"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
