{"description":"Detects technique used by MAZE ransomware to enumerate directories using Powershell Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate PowerShell scripts"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3385dad7-bfd9-a241-16ad-6016be412116","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Powershell Directory Enumeration","query":"(powershell.file.script_block_text:*foreach* AND powershell.file.script_block_text:*Get\\-ChildItem* AND powershell.file.script_block_text:*\\-Path\\ * AND powershell.file.script_block_text:*\\-ErrorAction\\ * AND powershell.file.script_block_text:*SilentlyContinue* AND powershell.file.script_block_text:*Out\\-File\\ * AND powershell.file.script_block_text:*\\-append*)","meta":{"from":"1m"},"severity":"medium","tags":["T1083"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1083","name":"File and Directory Discovery","reference":"https://attack.mitre.org/techniques/T1083"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
