{"description": "Detects keywords that could indicate clearing PowerShell history", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "17f7495e-36b2-d46c-1a87-ecc74f0acf23", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Clear PowerShell History", "query": "((powershell.file.script_block_text:(*del* OR *Remove\\-Item* OR *rm*) AND powershell.file.script_block_text:*\\(Get\\-PSReadlineOption\\).HistorySavePath*) OR (powershell.file.script_block_text:*Set\\-PSReadlineOption* AND powershell.file.script_block_text:*\u2013HistorySaveStyle* AND powershell.file.script_block_text:*SaveNothing*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a"], "timestamp_override": "event.ingested", "author": ["Ilyas Ochkov", "Jonhnathan Ribeiro", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
