{"description":"Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users.\nAccounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. \n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1873ea3c-f1e2-1a54-d302-7a7a3f7d007f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Remove Account From Domain Admin Group","query":"(powershell.file.script_block_text:*Remove\\-ADGroupMember* AND powershell.file.script_block_text:*\\-Identity\\ * AND powershell.file.script_block_text:*\\-Members\\ *)","meta":{"from":"1m"},"severity":"medium","tags":["T1531"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1531","name":"Account Access Removal","reference":"https://attack.mitre.org/techniques/T1531"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
