{"description": "Detects usage of the \"Add-AppxPackage\" or it's alias \"Add-AppPackage\" to install unsigned AppX packages", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Installation of unsigned packages for testing purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "975b2262-9a49-439d-92a6-0709cccdf0b2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Unsigned AppX Installation Attempt Using Add-AppxPackage - PsScript", "query": "(powershell.file.script_block_text:(*Add\\-AppPackage\\ * OR *Add\\-AppxPackage\\ *) AND powershell.file.script_block_text:*\\ \\-AllowUnsigned*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package", "https://twitter.com/WindowsDocs/status/1620078135080325122"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
