{"description": "Detects PowerShell scripts that have capabilities to read files, loop through them and resolve DNS host entries.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["The same functionality can be implemented by admin scripts, correlate with name and creator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fbc5e92f-3044-4e73-a5c6-1c4359b539de", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Script With File Hostname Resolving Capabilities", "query": "(powershell.file.script_block_text:*Get\\-content\\ * AND powershell.file.script_block_text:*foreach* AND powershell.file.script_block_text:*\\[System.Net.Dns\\]\\:\\:GetHostEntry* AND powershell.file.script_block_text:*Out\\-File*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1020"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1020", "name": "Automated Exfiltration", "reference": "https://attack.mitre.org/techniques/T1020"}]}], "version": 1, "references": ["https://www.fortypoundhead.com/showcontent.asp?artid=24022", "https://labs.withsecure.com/publications/fin7-target-veeam-servers"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
