{"description": "Detects powershell scripts that import modules from suspicious directories", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "21f9162c-5f5d-4b01-89a8-b705bd7d10ab", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Import PowerShell Modules From Suspicious Directories", "query": "powershell.file.script_block_text:(*Import\\-Module\\ \\\"$Env\\:Temp\\\\* OR *Import\\-Module\\ '$Env\\:Temp\\\\* OR *Import\\-Module\\ $Env\\:Temp\\\\* OR *Import\\-Module\\ \\\"$Env\\:Appdata\\\\* OR *Import\\-Module\\ '$Env\\:Appdata\\\\* OR *Import\\-Module\\ $Env\\:Appdata\\\\* OR *Import\\-Module\\ C\\:\\\\Users\\\\Public\\\\* OR *ipmo\\ \\\"$Env\\:Temp\\\\* OR *ipmo\\ '$Env\\:Temp\\\\* OR *ipmo\\ $Env\\:Temp\\\\* OR *ipmo\\ \\\"$Env\\:Appdata\\\\* OR *ipmo\\ '$Env\\:Appdata\\\\* OR *ipmo\\ $Env\\:Appdata\\\\* OR *ipmo\\ C\\:\\\\Users\\\\Public\\\\*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
