{"description": "Deletes Windows Volume Shadow Copies with PowerShell code and Get-WMIObject. This technique is used by numerous ransomware families such as Sodinokibi/REvil", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "88e70148-5b88-2979-a108-f7ade842a1a5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Delete Volume Shadow Copies via WMI with PowerShell", "query": "(powershell.file.script_block_text:*Get\\-WmiObject* AND powershell.file.script_block_text:*Win32_Shadowcopy* AND powershell.file.script_block_text:*.Delete\\(\\)*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
