{"description": "Detects Obfuscated Powershell via use Rundll32 in Scripts", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d0568fd5-628b-236e-8ca9-7d5a45a56161", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Invoke-Obfuscation Via Use Rundll32", "query": "(powershell.file.script_block_text:*\\&&* AND powershell.file.script_block_text:*rundll32* AND powershell.file.script_block_text:*shell32.dll* AND powershell.file.script_block_text:*shellexec_rundll* AND powershell.file.script_block_text:(*value* OR *invoke* OR *comspec* OR *iex*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/Neo23x0/sigma/issues/1009"], "timestamp_override": "event.ingested", "author": ["Nikita Nazarov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
