{"description": "Adversaries may search for common password storage locations to obtain user credentials.\nPasswords are stored in several places on a system, depending on the operating system or application holding the credentials.\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e19a5134-7382-970c-e226-0ff8bece12b3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Enumerate Credentials from Windows Credential Manager With PowerShell", "query": "(powershell.file.script_block_text:*vaultcmd* AND powershell.file.script_block_text:*\\/listcreds\\:* AND powershell.file.script_block_text:(*Windows\\ Credentials* OR *Web\\ Credentials*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555/T1555.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
