{"description": "Detects use of Set-ExecutionPolicy to set insecure policies", "author": ["frack113"], "enabled": false, "false_positives": ["Administrator script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "67cf5ab8-246a-39da-96e3-5e38122e629a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Change PowerShell Policies to an Insecure Level - PowerShell", "query": "((powershell.file.script_block_text:*Set\\-ExecutionPolicy* AND powershell.file.script_block_text:(*Unrestricted* OR *bypass* OR *RemoteSigned*)) AND (NOT (powershell.file.script_block_text:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1'\\)* OR *\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/chocolatey.org\\/install.ps1'\\)* OR *\\\\AppData\\\\Roaming\\\\Code\\\\*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.1", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.1", "https://adsecurity.org/?p=2604"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
