{"description": "Detects suspicious PowerShell invocation command parameters", "enabled": false, "false_positives": ["Very special / sneaky PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "64ce4c5a-7e96-a5f1-9310-3b7810c97dba", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Invocations - Generic", "query": "(powershell.file.script_block_text:(*\\ \\-enc\\ * OR *\\ \\-EncodedCommand\\ *) AND powershell.file.script_block_text:(*\\ \\-w\\ hidden\\ * OR *\\ \\-window\\ hidden\\ * OR *\\ \\-windowstyle\\ hidden\\ *) AND powershell.file.script_block_text:(*\\ \\-noni\\ * OR *\\ \\-noninteractive\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
