{"description": "Detects PowerShell scripts set ACL to of a file or a folder", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cae80281-ef23-44c5-873b-fd48d2666f49", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PowerShell Script Change Permission Via Set-Acl - PsScript", "query": "(powershell.file.script_block_text:*Set\\-Acl\\ * AND powershell.file.script_block_text:*\\-AclObject\\ * AND powershell.file.script_block_text:*\\-Path\\ *)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1222"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1222", "name": "File and Directory Permissions Modification", "reference": "https://attack.mitre.org/techniques/T1222"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
