{"description": "Remove the Zone.Identifier alternate data stream which identifies the file as downloaded from the internet.", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5947497f-1aa4-41dd-9693-c9848d58727d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Unblock-File", "query": "(powershell.file.script_block_text:*Unblock\\-File\\ * AND powershell.file.script_block_text:*\\-Path\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1553"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1553", "name": "Subvert Trust Controls", "reference": "https://attack.mitre.org/techniques/T1553"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1553.005/T1553.005.md#atomic-test-3---remove-the-zoneidentifier-alternate-data-stream", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/unblock-file?view=powershell-7.2"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
