{"description": "Detects the use of various web request commands with commandline tools and Windows PowerShell cmdlets (including aliases) via PowerShell logs", "author": ["James Pemberton / @4A616D6573"], "enabled": false, "false_positives": ["Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1139d2e2-84b1-4226-b445-354492eba8ba", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Usage Of Web Request Commands And Cmdlets - PowerShell", "query": "(powershell.file.script_block_text:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ * OR *Net.WebClient* OR *Start\\-BitsTransfer* OR *\\[System.Net.WebRequest\\]\\:\\:create* OR *Invoke\\-RestMethod* OR *WinHttp.WinHttpRequest*) AND (NOT (winlog.event_data.Path:C\\:\\\\Packages\\\\Plugins\\\\Microsoft.GuestConfiguration.ConfigurationforWindows\\\\*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/", "https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
