{"description": "Attempting to disable scheduled scanning and other parts of windows defender atp.", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6dc901c6-4c45-72cc-e1e9-0fcdb4413a25", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Start-Process PassThru", "query": "(powershell.file.script_block_text:*Set\\-MpPreference* AND powershell.file.script_block_text:*\\ 1* AND powershell.file.script_block_text:(*DisableRealtimeMonitoring* OR *DisableBehaviorMonitoring* OR *DisableScriptScanning* OR *DisableBlockAtFirstSeen* OR *DisableIOAVProtection*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md", "https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
