{"description": "Detects keywords from well-known PowerShell exploitation frameworks", "author": ["Sean Metcalf (source)", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Depending on the scripts, this rule might require some initial tunning to fit the environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f62176f3-8128-4faa-bf6c-83261322e5eb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Malicious PowerShell Keywords", "query": "powershell.file.script_block_text:(*AdjustTokenPrivileges* OR /.*[Ii][Mm][Aa][Gg][Ee]_[Nn][Tt]_[Oo][Pp][Tt][Ii][Oo][Nn][Aa][Ll]_[Hh][Dd][Rr]64_[Mm][Aa][Gg][Ii][Cc].*/ OR *Metasploit* OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ww][Ii][Nn]32\\.[Uu][Nn][Ss][Aa][Ff][Ee][Nn][Aa][Tt][Ii][Vv][Ee][Mm][Ee][Tt][Hh][Oo][Dd][Ss].*/ OR *Mimikatz* OR *MiniDumpWriteDump* OR /.*[Pp][Aa][Gg][Ee]_[Ee][Xx][Ee][Cc][Uu][Tt][Ee]_[Rr][Ee][Aa][Dd].*/ OR /.*[Rr][Ee][Aa][Dd][Pp][Rr][Oo][Cc][Ee][Ss][Ss][Mm][Ee][Mm][Oo][Rr][Yy]\\.[Ii][Nn][Vv][Oo][Kk][Ee].*/ OR /.*[Ss][Ee]_[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee]_[Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]_[Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Aa][Dd][Jj][Uu][Ss][Tt]_[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Aa][Ll][Ll]_[Aa][Cc][Cc][Ee][Ss][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Aa][Ss][Ss][Ii][Gg][Nn]_[Pp][Rr][Ii][Mm][Aa][Rr][Yy].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Dd][Uu][Pp][Ll][Ii][Cc][Aa][Tt][Ee].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Ee][Ll][Ee][Vv][Aa][Tt][Ii][Oo][Nn].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Ii][Mm][Pp][Ee][Rr][Ss][Oo][Nn][Aa][Tt][Ee].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Ii][Nn][Ff][Oo][Rr][Mm][Aa][Tt][Ii][Oo][Nn]_[Cc][Ll][Aa][Ss][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Pp][Rr][Ii][Vv][Ii][Ll][Ee][Gg][Ee][Ss].*/ OR /.*[Tt][Oo][Kk][Ee][Nn]_[Qq][Uu][Ee][Rr][Yy].*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
