{"description": "Detects all variations of obfuscated powershell IEX invocation code generated by Invoke-Obfuscation framework from the following code block \\u2014", "author": ["Daniel Bohannon (@Mandiant/@FireEye)", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "80496df5-dadf-76b3-a780-6e8b208ebfa3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Invoke-Obfuscation Obfuscated IEX Invocation - PowerShell", "query": "(((powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/P/ OR powershell.file.script_block_text:/S/ OR powershell.file.script_block_text:/H/ OR powershell.file.script_block_text:/o/ OR powershell.file.script_block_text:/m/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/{/ OR powershell.file.script_block_text:/1/ OR powershell.file.script_block_text:/,/ OR powershell.file.script_block_text:/3/ OR powershell.file.script_block_text:/}/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/]/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/+/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/P/ OR powershell.file.script_block_text:/S/ OR powershell.file.script_block_text:/H/ OR powershell.file.script_block_text:/o/ OR powershell.file.script_block_text:/m/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/)) OR ((powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/S/ OR powershell.file.script_block_text:/h/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/l/ OR powershell.file.script_block_text:/l/ OR powershell.file.script_block_text:/I/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/{/ OR powershell.file.script_block_text:/1/ OR powershell.file.script_block_text:/,/ OR powershell.file.script_block_text:/3/ OR powershell.file.script_block_text:/}/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/]/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/+/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/S/ OR powershell.file.script_block_text:/h/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/l/ OR powershell.file.script_block_text:/l/ OR powershell.file.script_block_text:/I/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/)) OR ((powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/n/ OR powershell.file.script_block_text:/v/ OR powershell.file.script_block_text:/:/ OR powershell.file.script_block_text:/P/ OR powershell.file.script_block_text:/u/ OR powershell.file.script_block_text:/b/ OR powershell.file.script_block_text:/l/ OR powershell.file.script_block_text:/i/ OR powershell.file.script_block_text:/c/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/{/ OR powershell.file.script_block_text:/1/ OR powershell.file.script_block_text:/,/ OR powershell.file.script_block_text:/3/ OR powershell.file.script_block_text:/}/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/]/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/+/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/n/ OR powershell.file.script_block_text:/v/ OR powershell.file.script_block_text:/:/ OR powershell.file.script_block_text:/P/ OR powershell.file.script_block_text:/u/ OR powershell.file.script_block_text:/b/ OR powershell.file.script_block_text:/l/ OR powershell.file.script_block_text:/i/ OR powershell.file.script_block_text:/c/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/)) OR ((powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/n/ OR powershell.file.script_block_text:/v/ OR powershell.file.script_block_text:/:/ OR powershell.file.script_block_text:/C/ OR powershell.file.script_block_text:/o/ OR powershell.file.script_block_text:/m/ OR powershell.file.script_block_text:/S/ OR powershell.file.script_block_text:/p/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/c/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/[/ OR powershell.file.script_block_text:/(/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/{/ OR powershell.file.script_block_text:/1/ OR powershell.file.script_block_text:/,/ OR powershell.file.script_block_text:/3/ OR powershell.file.script_block_text:/}/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/,/ OR powershell.file.script_block_text:/)/ OR powershell.file.script_block_text:/{/ OR powershell.file.script_block_text:/2/ OR powershell.file.script_block_text:/}/)) OR ((powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/m/ OR powershell.file.script_block_text:/d/ OR powershell.file.script_block_text:/r/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/W/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/*/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/)/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/./ OR powershell.file.script_block_text:/N/ OR powershell.file.script_block_text:/a/ OR powershell.file.script_block_text:/m/ OR powershell.file.script_block_text:/e/)) OR ((powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/$/ OR powershell.file.script_block_text:/V/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/r/ OR powershell.file.script_block_text:/b/ OR powershell.file.script_block_text:/o/ OR powershell.file.script_block_text:/s/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/P/ OR powershell.file.script_block_text:/r/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/f/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/r/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/n/ OR powershell.file.script_block_text:/c/ OR powershell.file.script_block_text:/e/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/./ OR powershell.file.script_block_text:/T/ OR powershell.file.script_block_text:/o/ OR powershell.file.script_block_text:/S/ OR powershell.file.script_block_text:/t/ OR powershell.file.script_block_text:/r/ OR powershell.file.script_block_text:/i/ OR powershell.file.script_block_text:/n/ OR powershell.file.script_block_text:/g/ OR powershell.file.script_block_text:/\\/ OR powershell.file.script_block_text:/(/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
