{"description": "An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.", "enabled": false, "false_positives": ["Highly likely if archive operations are done via PowerShell."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "882a61c7-5222-a88e-8a8c-4139c97e081f", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Data Compressed - PowerShell", "query": "(powershell.file.script_block_text:*\\-Recurse* AND powershell.file.script_block_text:*|* AND powershell.file.script_block_text:*Compress\\-Archive*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1560"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560/T1560.md"], "timestamp_override": "event.ingested", "author": ["Timur Zinniatullin", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
