{"description": "Detects Silence EmpireDNSAgent as described in the Group-IP report", "author": ["Alina Stepchenkova", "Group-IB", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3ceb2083-a27f-449a-be33-14ec1b7cc973", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Silence.EDA Detection", "query": "(powershell.file.script_block_text:*System.Diagnostics.Process* AND powershell.file.script_block_text:*Stop\\-Computer* AND powershell.file.script_block_text:*Restart\\-Computer* AND powershell.file.script_block_text:*Exception\\ in\\ execution* AND powershell.file.script_block_text:*$cmdargs* AND powershell.file.script_block_text:*Close\\-Dnscat2Tunnel* AND powershell.file.script_block_text:*set\\ type\\=$LookupType`nserver* AND powershell.file.script_block_text:*$Command\\ |\\ nslookup\\ 2>&1\\ |\\ Out\\-String* AND powershell.file.script_block_text:*New\\-RandomDNSField* AND powershell.file.script_block_text:*\\[Convert\\]\\:\\:ToString\\($SYNOptions,\\ 16\\)* AND powershell.file.script_block_text:*$Session.Dead\\ \\=\\ $True* AND powershell.file.script_block_text:*$Session\\[\\\"Driver\\\"\\]\\ \\-eq*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059", "T1071", "T1529", "T1572"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1529", "name": "System Shutdown/Reboot", "reference": "https://attack.mitre.org/techniques/T1529"}]}], "version": 1, "references": ["https://www.group-ib.com/resources/threat-research/silence_2.0.going_global.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
