{"description": "Detects usage of the WMI class \"Win32_NTEventlogFile\" in a potentially suspicious way (delete, backup, change permissions, etc.) from a PowerShell script", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate administration and backup scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e2812b49-bae0-4b21-b366-7c142eafcde2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Call To Win32_NTEventlogFile Class - PSScript", "query": "(powershell.file.script_block_text:/.*[Ww][Ii][Nn]32_[Nn][Tt][Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg][Ff][Ii][Ll][Ee].*/ AND powershell.file.script_block_text:(/.*\\.[Bb][Aa][Cc][Kk][Uu][Pp][Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg]\\(.*/ OR /.*\\.[Cc][Hh][Aa][Nn][Gg][Ee][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Ee][Rr][Mm][Ii][Ss][Ss][Ii][Oo][Nn][Ss]\\(.*/ OR /.*\\.[Cc][Hh][Aa][Nn][Gg][Ee][Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Ee][Rr][Mm][Ii][Ss][Ss][Ii][Oo][Nn][Ss][Ee][Xx]\\(.*/ OR /.*\\.[Cc][Ll][Ee][Aa][Rr][Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg]\\(.*/ OR /.*\\.[Dd][Ee][Ll][Ee][Tt][Ee]\\(.*/ OR /.*\\.[Dd][Ee][Ll][Ee][Tt][Ee][Ee][Xx]\\(.*/ OR /.*\\.[Rr][Ee][Nn][Aa][Mm][Ee]\\(.*/ OR /.*\\.[Tt][Aa][Kk][Ee][Oo][Ww][Nn][Ee][Rr][Ss][Hh][Ii][Pp]\\(.*/ OR /.*\\.[Tt][Aa][Kk][Ee][Oo][Ww][Nn][Ee][Rr][Ss][Hh][Ii][Pp][Ee][Xx]\\(.*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
