{"description": "Detects Commandlet names from well-known PowerShell exploitation frameworks", "author": ["Sean Metcalf (source)", "Florian Roth (rule)", "Bartlomiej Czyz @bczyz1 (update)", "oscd.community (update)", "Nasreddine Bencherchali (update)", "Tim Shelton (fp)", "Mustafa Kaan Demir (update)", "Georg Lauenstein (update)", "Max Altgelt (update)", "Tobias Michalski (update)", "Austin Songer (@austinsonger) (update)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8a10059d-2416-3b4d-0487-c8ffe381f789", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Malicious PowerShell Commandlets - ScriptBlock", "query": "(powershell.file.script_block_text:(*Add\\-Exfiltration* OR *Add\\-Persistence* OR *Add\\-RegBackdoor* OR *Add\\-RemoteRegBackdoor* OR *Add\\-ScrnSaveBackdoor* OR *Check\\-VM* OR *ConvertTo\\-Rc4ByteStream* OR *Decrypt\\-Hash* OR *Do\\-Exfiltration* OR *Enabled\\-DuplicateToken* OR *Exploit\\-Jboss* OR *Find\\-Fruit* OR *Find\\-GPOLocation* OR *Find\\-TrustedDocuments* OR *Get\\-ApplicationHost* OR *Get\\-ChromeDump* OR *Get\\-ClipboardContents* OR *Get\\-FoxDump* OR *Get\\-GPPPassword* OR *Get\\-IndexedItem* OR *Get\\-Keystrokes* OR *Get\\-LSASecret* OR *Get\\-PassHashes* OR *Get\\-RegAlwaysInstallElevated* OR *Get\\-RegAutoLogon* OR *Get\\-RemoteBootKey* OR *Get\\-RemoteCachedCredential* OR *Get\\-RemoteLocalAccountHash* OR *Get\\-RemoteLSAKey* OR *Get\\-RemoteMachineAccountHash* OR *Get\\-RemoteNLKMKey* OR *Get\\-RickAstley* OR *Get\\-Screenshot* OR *Get\\-SecurityPackages* OR *Get\\-ServiceFilePermission* OR *Get\\-ServicePermission* OR *Get\\-ServiceUnquoted* OR *Get\\-SiteListPassword* OR *Get\\-System* OR *Get\\-TimedScreenshot* OR *Get\\-UnattendedInstallFile* OR *Get\\-Unconstrained* OR *Get\\-USBKeystrokes* OR *Get\\-VaultCredential* OR *Get\\-VulnAutoRun* OR *Get\\-VulnSchTask* OR *Gupt\\-Backdoor* OR *HTTP\\-Login* OR *Install\\-ServiceBinary* OR *Install\\-SSP* OR *Invoke\\-ACLScanner* OR *Invoke\\-ADSBackdoor* OR *Invoke\\-AllChecks* OR *Invoke\\-ARPScan* OR *Invoke\\-AzureHound* OR *Invoke\\-BackdoorLNK* OR *Invoke\\-BadPotato* OR *Invoke\\-BetterSafetyKatz* OR *Invoke\\-BypassUAC* OR *Invoke\\-Carbuncle* OR *Invoke\\-Certify* OR *Invoke\\-ConPtyShell* OR *Invoke\\-CredentialInjection* OR *Invoke\\-DAFT* OR *Invoke\\-DCSync* OR *Invoke\\-DinvokeKatz* OR *Invoke\\-DllInjection* OR *Invoke\\-DomainPasswordSpray* OR *Invoke\\-DowngradeAccount* OR *Invoke\\-EgressCheck* OR *Invoke\\-Eyewitness* OR *Invoke\\-FakeLogonScreen* OR *Invoke\\-Farmer* OR *Invoke\\-Get\\-RBCD\\-Threaded* OR *Invoke\\-Gopher* OR *Invoke\\-Grouper* OR *Invoke\\-HandleKatz* OR *Invoke\\-Internalmonologue* OR *Invoke\\-Inveigh* OR *Invoke\\-InveighRelay* OR *Invoke\\-KrbRelay* OR *Invoke\\-LdapSignCheck* OR *Invoke\\-Lockless* OR *Invoke\\-MalSCCM* OR *Invoke\\-Mimikatz* OR *Invoke\\-Mimikittenz* OR *Invoke\\-MITM6* OR *Invoke\\-NanoDump* OR *Invoke\\-NetRipper* OR *Invoke\\-Nightmare* OR *Invoke\\-NinjaCopy* OR *Invoke\\-OfficeScrape* OR *Invoke\\-OxidResolver* OR *Invoke\\-P0wnedshell* OR *Invoke\\-Paranoia* OR *Invoke\\-PortScan* OR *Invoke\\-PoshRatHttp* OR *Invoke\\-PostExfil* OR *Invoke\\-PowerDump* OR *Invoke\\-PowerShellTCP* OR *Invoke\\-PowerShellWMI* OR *Invoke\\-PPLDump* OR *Invoke\\-PsExec* OR *Invoke\\-PSInject* OR *Invoke\\-PsUaCme* OR *Invoke\\-ReflectivePEInjection* OR *Invoke\\-ReverseDNSLookup* OR *Invoke\\-Rubeus* OR *Invoke\\-RunAs* OR *Invoke\\-SafetyKatz* OR *Invoke\\-SauronEye* OR *Invoke\\-SCShell* OR *Invoke\\-Seatbelt* OR *Invoke\\-ServiceAbuse* OR *Invoke\\-ShadowSpray* OR *Invoke\\-SharpAllowedToAct* OR *Invoke\\-SharpBlock* OR *Invoke\\-SharpBypassUAC* OR *Invoke\\-SharpChromium* OR *Invoke\\-SharpClipboard* OR *Invoke\\-SharpCloud* OR *Invoke\\-SharpDPAPI* OR *Invoke\\-SharpDump* OR *Invoke\\-SharPersist* OR *Invoke\\-SharpGPOAbuse* OR *Invoke\\-SharpGPO\\-RemoteAccessPolicies* OR *Invoke\\-SharpHandler* OR *Invoke\\-SharpHide* OR *Invoke\\-Sharphound* OR *Invoke\\-SharpImpersonation* OR *Invoke\\-SharpImpersonationNoSpace* OR *Invoke\\-SharpKatz* OR *Invoke\\-SharpLdapRelayScan* OR *Invoke\\-Sharplocker* OR *Invoke\\-SharpLoginPrompt* OR *Invoke\\-SharpMove* OR *Invoke\\-SharpPrinter* OR *Invoke\\-SharpPrintNightmare* OR *Invoke\\-SharpRDP* OR *Invoke\\-SharpSCCM* OR *Invoke\\-SharpSecDump* OR *Invoke\\-Sharpshares* OR *Invoke\\-SharpSniper* OR *Invoke\\-SharpSploit* OR *Invoke\\-SharpSpray* OR *Invoke\\-SharpSSDP* OR *Invoke\\-SharpStay* OR *Invoke\\-SharpUp* OR *Invoke\\-Sharpview* OR *Invoke\\-SharpWatson* OR *Invoke\\-Sharpweb* OR *Invoke\\-SharpWSUS* OR *Invoke\\-Shellcode* OR *Invoke\\-SMBScanner* OR *Invoke\\-Snaffler* OR *Invoke\\-Spoolsample* OR *Invoke\\-SpraySinglePassword* OR *Invoke\\-SSHCommand* OR *Invoke\\-StandIn* OR *Invoke\\-StickyNotesExtract* OR *Invoke\\-Tater* OR *Invoke\\-Thunderfox* OR *Invoke\\-ThunderStruck* OR *Invoke\\-TokenManipulation* OR *Invoke\\-Tokenvator* OR *Invoke\\-TotalExec* OR *Invoke\\-UrbanBishop* OR *Invoke\\-UserHunter* OR *Invoke\\-VoiceTroll* OR *Invoke\\-Whisker* OR *Invoke\\-WinEnum* OR *Invoke\\-winPEAS* OR *Invoke\\-WireTap* OR *Invoke\\-WmiCommand* OR *Invoke\\-WScriptBypassUAC* OR *Invoke\\-Zerologon* OR *MailRaider* OR *New\\-HoneyHash* OR *New\\-InMemoryModule* OR *Out\\-Minidump* OR *Port\\-Scan* OR *PowerBreach* OR *PowerUp* OR *PowerView* OR *Remove\\-Update* OR *Set\\-MacAttribute* OR *Set\\-Wallpaper* OR *Show\\-TargetScreen* OR *Start\\-CaptureServer* OR *Start\\-WebcamRecorder* OR *VolumeShadowCopyTools*) AND (NOT (((powershell.file.script_block_text:(*Get\\-SystemDriveInfo* OR *C\\:\\\\ProgramData\\\\Amazon\\\\EC2\\-Windows\\\\Launch\\\\Module\\\\*))) OR ((powershell.file.script_block_text:#\\ Copyright\\ 2016\\ Amazon.com,\\ Inc.\\ or\\ its\\ affiliates.\\ All\\ Rights\\ Reserved*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1069", "T1069", "T1069", "T1087", "T1087", "T1087", "T1482"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1482", "name": "Domain Trust Discovery", "reference": "https://attack.mitre.org/techniques/T1482"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921", "https://github.com/S3cur3Th1sSh1t/PowerSharpPack/tree/master/PowerSharpBinaries", "https://github.com/BC-SECURITY/Invoke-ZeroLogon/blob/111d17c7fec486d9bb23387e2e828b09a26075e4/Invoke-ZeroLogon.ps1", "https://github.com/xorrior/RandomPS-Scripts/blob/848c919bfce4e2d67b626cbcf4404341cfe3d3b6/Get-DXWebcamVideo.ps1", "https://github.com/rvrsh3ll/Misc-Powershell-Scripts/blob/6f23bb41f9675d7e2d32bacccff75e931ae00554/OfficeMemScraper.ps1", "https://github.com/dafthack/DomainPasswordSpray/blob/b13d64a5834694aa73fd2aea9911a83027c465a7/DomainPasswordSpray.ps1", "https://unit42.paloaltonetworks.com/threat-assessment-black-basta-ransomware/", "https://research.nccgroup.com/2022/06/06/shining-the-light-on-black-basta/", "https://github.com/calebstewart/CVE-2021-1675", "https://github.com/BloodHoundAD/BloodHound/blob/0927441f67161cc6dc08a53c63ceb8e333f55874/Collectors/AzureHound.ps1", "https://bloodhound.readthedocs.io/en/latest/data-collection/azurehound.html", "https://github.com/HarmJ0y/DAMP"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
