{"description": "Detects PowerShell scripts attempting to disable scheduled scanning and other parts of Windows Defender ATP or set default actions to allow.", "author": ["frack113", "elhoim", "Tim Shelton (fps", "alias support)", "Swachchhanda Shrawan Poudel", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate PowerShell scripts that disable Windows Defender for troubleshooting purposes. Must be investigated."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "14c71865-6cd3-44ae-adaa-1db923fae5f2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tamper Windows Defender - ScriptBlockLogging", "query": "(((powershell.file.script_block_text:/.*[Ss][Ee][Tt]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee].*/ AND powershell.file.script_block_text:(/.*\\-[Dd][Bb][Aa][Ff]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Bb][Aa][Ff]\\ 1.*/ OR /.*\\-[Dd][Bb][Mm]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Bb][Mm]\\ 1.*/ OR /.*\\-[Dd][Ii][Pp][Ss]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Pp][Ss]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Rr][Cc][Hh][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Rr][Cc][Hh][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Ee][Vv][Ee][Nn][Tt][Ii][Oo][Nn][Ss][Yy][Ss][Tt][Ee][Mm]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Ee][Vv][Ee][Nn][Tt][Ii][Oo][Nn][Ss][Yy][Ss][Tt][Ee][Mm]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Mm][Oo][Vv][Aa][Bb][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Mm][Oo][Vv][Aa][Bb][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Mm][Aa][Pp][Pp][Ee][Dd][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Dd][Rr][Ii][Vv][Ee][Ss][Ff][Oo][Rr][Ff][Uu][Ll][Ll][Ss][Cc][Aa][Nn]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Mm][Aa][Pp][Pp][Ee][Dd][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Dd][Rr][Ii][Vv][Ee][Ss][Ff][Oo][Rr][Ff][Uu][Ll][Ll][Ss][Cc][Aa][Nn]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ff][Ii][Ll][Ee][Ss]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg][Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ff][Ii][Ll][Ee][Ss]\\ 1.*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ 1.*/ OR /.*\\-[Dd][Rr][Dd][Ss][Cc]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Rr][Dd][Ss][Cc]\\ 1.*/ OR /.*\\-[Dd][Rr][Tt][Mm]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Rr][Tt][Mm]\\ 1.*/ OR /.*\\-[Dd][Ss][Cc][Rr][Pp][Tt][Ss][Cc]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ss][Cc][Rr][Pp][Tt][Ss][Cc]\\ 1.*/ OR /.*\\-[Dd][Ss][Mm][Nn][Dd][Ff]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ss][Mm][Nn][Dd][Ff]\\ 1.*/ OR /.*\\-[Dd][Ss][Nn][Ff]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ss][Nn][Ff]\\ 1.*/ OR /.*\\-[Dd][Ss][Ss]\\ $[Tt][Rr][Uu][Ee].*/ OR /.*\\-[Dd][Ss][Ss]\\ 1.*/))) OR ((powershell.file.script_block_text:/.*[Ss][Ee][Tt]\\-[Mm][Pp][Pp][Rr][Ee][Ff][Ee][Rr][Ee][Nn][Cc][Ee].*/ AND powershell.file.script_block_text:(/.*[Hh][Ii][Gg][Hh][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Hh][Tt][Dd][Ee][Ff][Aa][Cc]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Ll][Oo][Ww][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Ll][Tt][Dd][Ee][Ff][Aa][Cc]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Mm][Oo][Dd][Ee][Rr][Aa][Tt][Ee][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Mm][Tt][Dd][Ee][Ff][Aa][Cc]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Ss][Ee][Vv][Ee][Rr][Ee][Tt][Hh][Rr][Ee][Aa][Tt][Dd][Ee][Ff][Aa][Uu][Ll][Tt][Aa][Cc][Tt][Ii][Oo][Nn]\\ [Aa][Ll][Ll][Oo][Ww].*/ OR /.*[Ss][Tt][Dd][Ee][Ff][Aa][Cc]\\ [Aa][Ll][Ll][Oo][Ww].*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps", "https://bidouillesecurity.com/disable-windows-defender-in-powershell/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
