{"description": "Detecting use WinAPI Functions in PowerShell", "enabled": false, "false_positives": ["Carbon PowerShell Module (https://github.com/webmd-health-services/Carbon)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "03d83090-8cba-44a0-b02f-0b756a050306", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Accessing WinAPI in PowerShell", "query": "(powershell.file.script_block_text:(*WaitForSingleObject* OR *QueueUserApc* OR *RtlCreateUserThread* OR *OpenProcess* OR *VirtualAlloc* OR *VirtualFree* OR *WriteProcessMemory* OR *CreateUserThread* OR *CloseHandle* OR *GetDelegateForFunctionPointer* OR *CreateThread* OR *memcpy* OR *LoadLibrary* OR *GetModuleHandle* OR *GetProcAddress* OR *VirtualProtect* OR *FreeLibrary* OR *ReadProcessMemory* OR *CreateRemoteThread* OR *AdjustTokenPrivileges* OR *WriteInt32* OR *OpenThreadToken* OR *ZeroFreeGlobalAllocUnicode* OR *OpenProcessToken* OR *GetTokenInformation* OR *SetThreadToken* OR *ImpersonateLoggedOnUser* OR *RevertToSelf* OR *GetLogonSessionData* OR *CreateProcessWithToken* OR *DuplicateTokenEx* OR *OpenWindowStation* OR *OpenDesktop* OR *MiniDumpWriteDump* OR *AddSecurityPackage* OR *EnumerateSecurityPackages* OR *GetProcessHandle* OR *DangerousGetHandle* OR *kernel32* OR *Advapi32* OR *msvcrt* OR *ntdll* OR *secur32*) AND (NOT ((powershell.file.script_block_text:#\\ Copyright\\ 2016\\ Amazon.com,\\ Inc.\\ or\\ its\\ affiliates.*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "timestamp_override": "event.ingested", "author": ["Nikita Nazarov", "oscd.community", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
