{"description":"Detects Base64 encoded Shellcode Author: David Ledbetter (shellcode), Florian Roth (rule). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"af9b4312-525d-e822-f37f-824253aab9c8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"PowerShell ShellCode","query":"(powershell.file.script_block_text:*AAAAYInlM* AND powershell.file.script_block_text:(*OiCAAAAYInlM* OR *OiJAAAAYInlM*))","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","Privilege Escalation","T1055","T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
