{"description": "Powershell Remove-Item  with -Path to delete a file or a folder with \"-Recurse\"", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c8d28a91-8406-68ac-9a37-fc7a9481519c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Use Remove-Item to Delete File", "query": "((powershell.file.script_block_text:*Remove\\-Item* AND powershell.file.script_block_text:*\\-Path\\ *) AND (NOT (powershell.file.script_block_text:(*HKCU\\:\\\\* OR *HKLM\\:\\\\*))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.004/T1070.004.md", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/Remove-Item?view=powershell-5.1&viewFallbackFrom=powershell-7"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
