{"description": "Detects powershell scripts that adds a Name Resolution Policy Table (NRPT) rule for the specified namespace. This will bypass the default DNS server and uses a specified server for answering the query.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a139cfd8-6027-04ee-16ea-1ba8730f66c3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell Add Name Resolution Policy Table Rule", "query": "(powershell.file.script_block_text:*Add\\-DnsClientNrptRule* AND powershell.file.script_block_text:*\\-Namesp* AND powershell.file.script_block_text:*\\-NameSe*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1565"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1565", "name": "Data Manipulation", "reference": "https://attack.mitre.org/techniques/T1565"}]}], "version": 1, "references": ["https://twitter.com/NathanMcNulty/status/1569497348841287681", "https://docs.microsoft.com/en-us/powershell/module/dnsclient/add-dnsclientnrptrule?view=windowsserver2022-ps"], "timestamp_override": "event.ingested", "author": ["Borna Talebi"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
