{"description": "Detects suspicious PowerShell invocation command parameters", "author": ["Florian Roth (rule)", "Jonhnathan Ribeiro"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4952abd3-9818-24f7-c18f-3534c6d6ad46", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Invocations - Specific", "query": "((((powershell.file.script_block_text:*\\-nop* AND powershell.file.script_block_text:*\\ \\-w\\ * AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*\\ \\-c\\ * AND powershell.file.script_block_text:*\\[Convert\\]\\:\\:FromBase64String*)) OR ((powershell.file.script_block_text:*\\ \\-w\\ * AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*\\-noni* AND powershell.file.script_block_text:*\\-nop* AND powershell.file.script_block_text:*\\ \\-c\\ * AND powershell.file.script_block_text:*iex* AND powershell.file.script_block_text:*New\\-Object*)) OR ((powershell.file.script_block_text:*\\ \\-w\\ * AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*\\-ep* AND powershell.file.script_block_text:*bypass* AND powershell.file.script_block_text:*\\-Enc*)) OR ((powershell.file.script_block_text:*powershell* AND powershell.file.script_block_text:*reg* AND powershell.file.script_block_text:*add* AND powershell.file.script_block_text:*HKCU\\\\software\\\\microsoft\\\\windows\\\\currentversion\\\\run*)) OR ((powershell.file.script_block_text:*bypass* AND powershell.file.script_block_text:*\\-noprofile* AND powershell.file.script_block_text:*\\-windowstyle* AND powershell.file.script_block_text:*hidden* AND powershell.file.script_block_text:*new\\-object* AND powershell.file.script_block_text:*system.net.webclient* AND powershell.file.script_block_text:*.download*)) OR ((powershell.file.script_block_text:*iex* AND powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*Net.WebClient* AND powershell.file.script_block_text:*.Download*))) AND (NOT ((powershell.file.script_block_text:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1* OR *\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/chocolatey.org\\/install.ps1'\\)* OR *Write\\-ChocolateyWarning*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
