{"description":"Detects when a user disables the Windows Firewall via a Profile to help evade defense. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"05695a7a-e056-a9ee-93a1-1a59d8ee092a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Windows Firewall Profile Disabled","query":"(powershell.file.script_block_text:*Set\\-NetFirewallProfile* AND powershell.file.script_block_text:*\\-Profile* AND powershell.file.script_block_text:*\\-Enabled* AND powershell.file.script_block_text:*False*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
