{"description": "Detects Commandlet names from PowerView of PowerSploit exploitation framework.", "author": ["Bhabesh Raj"], "enabled": false, "false_positives": ["Should not be any as administrators do not use this tool"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dcd74b95-3f36-4ed9-9598-0490951643aa", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Malicious PowerView PowerShell Commandlets", "query": "powershell.file.script_block_text:(*Add\\-DomainGroupMember* OR *Add\\-DomainObjectAcl* OR *Add\\-ObjectAcl* OR *Add\\-RemoteConnection* OR *Convert\\-ADName* OR *ConvertFrom\\-UACValue* OR *Convert\\-NameToSid* OR *ConvertTo\\-SID* OR *Export\\-PowerViewCSV* OR *Find\\-DomainLocalGroupMember* OR *Find\\-DomainObjectPropertyOutlier* OR *Find\\-DomainProcess* OR *Find\\-DomainShare* OR *Find\\-DomainUserEvent* OR *Find\\-DomainUserLocation* OR *Find\\-ForeignGroup* OR *Find\\-ForeignUser* OR *Find\\-GPOComputerAdmin* OR *Find\\-GPOLocation* OR *Find\\-InterestingDomain* OR *Find\\-InterestingFile* OR *Find\\-LocalAdminAccess* OR *Find\\-ManagedSecurityGroups* OR *Get\\-CachedRDPConnection* OR *Get\\-DFSshare* OR *Get\\-DNSRecord* OR *Get\\-DNSZone* OR *Get\\-DomainComputer* OR *Get\\-DomainController* OR *Get\\-DomainDFSShare* OR *Get\\-DomainDNSRecord* OR *Get\\-DomainDNSZone* OR *Get\\-DomainFileServer* OR *Get\\-DomainGPO* OR *Get\\-DomainGroup* OR *Get\\-DomainGroupMember* OR *Get\\-DomainManagedSecurityGroup* OR *Get\\-DomainObject* OR *Get\\-DomainObjectAcl* OR *Get\\-DomainOU* OR *Get\\-DomainPolicy* OR *Get\\-DomainSID* OR *Get\\-DomainSite* OR *Get\\-DomainSPNTicket* OR *Get\\-DomainSubnet* OR *Get\\-DomainUser* OR *Get\\-DomainUserEvent* OR *Get\\-Forest* OR *Get\\-IPAddress* OR *Get\\-LastLoggedOn* OR *Get\\-LoggedOnLocal* OR *Get\\-NetComputer* OR *Get\\-NetDomain* OR *Get\\-NetFileServer* OR *Get\\-NetForest* OR *Get\\-NetGPO* OR *Get\\-NetGroup* OR *Get\\-NetLocalGroup* OR *Get\\-NetLoggedon* OR *Get\\-NetOU* OR *Get\\-NetProcess* OR *Get\\-NetRDPSession* OR *Get\\-NetSession* OR *Get\\-NetShare* OR *Get\\-NetSite* OR *Get\\-NetSubnet* OR *Get\\-NetUser* OR *Get\\-ObjectAcl* OR *Get\\-PathAcl* OR *Get\\-Proxy* OR *Get\\-RegistryMountedDrive* OR *Get\\-RegLoggedOn* OR *Get\\-SiteName* OR *Get\\-UserEvent* OR *Get\\-WMIProcess* OR *Get\\-WMIReg* OR *Invoke\\-ACLScanner* OR *Invoke\\-CheckLocalAdminAccess* OR *Invoke\\-EnumerateLocalAdmin* OR *Invoke\\-EventHunter* OR *Invoke\\-FileFinder* OR *Invoke\\-Kerberoast* OR *Invoke\\-MapDomainTrust* OR *Invoke\\-ProcessHunter* OR *Invoke\\-RevertToSelf* OR *Invoke\\-ShareFinder* OR *Invoke\\-UserHunter* OR *Invoke\\-UserImpersonation* OR *New\\-DomainGroup* OR *New\\-DomainUser* OR *Remove\\-RemoteConnection* OR *Request\\-SPNTicket* OR *Resolve\\-IPAddress* OR *Set\\-ADObject* OR *Set\\-DomainObject* OR *Set\\-DomainUserPassword* OR *Test\\-AdminAccess*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://powersploit.readthedocs.io/en/stable/Recon/README", "https://github.com/PowerShellMafia/PowerSploit/tree/master/Recon", "https://thedfirreport.com/2020/10/08/ryuks-return", "https://adsecurity.org/?p=2277"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
