{"description":"Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment.\nThis may include things such as firewall rules and anti-viru\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f127d590-3e2e-335f-7ffa-75529e25bccf","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Security Software Discovery by Powershell","query":"(powershell.file.script_block_text:*get\\-process* AND powershell.file.script_block_text:*.Description* AND powershell.file.script_block_text:*\\-like* AND powershell.file.script_block_text:(*\\\"*virus*\\\"* OR *\\\"*carbonblack*\\\"* OR *\\\"*defender*\\\"* OR *\\\"*cylance*\\\"*))","meta":{"from":"1m"},"severity":"low","tags":["T1518"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1518","name":"Software Discovery","reference":"https://attack.mitre.org/techniques/T1518"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
