{"description": "Detects PowerShell calling a credential prompt", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ca8b77a9-d499-4095-b793-5d5f330d450e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Credential Prompt", "query": "powershell.file.script_block_text:*PromptForCredential*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://twitter.com/JohnLaTwC/status/850381440629981184", "https://t.co/ezOTGy1a1G"], "timestamp_override": "event.ingested", "author": ["John Lambert (idea)", "Florian Roth (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
