{"description": "Detects the use of PSAttack PowerShell hack tool", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "923e16d7-2f15-5235-e38a-dbd6b274af90", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell PSAttack", "query": "powershell.file.script_block_text:*PS\\ ATTACK\\!\\!\\!*", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2921"], "timestamp_override": "event.ingested", "author": ["Sean Metcalf (source)", "Florian Roth (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
