{"description": "Adversaries may abuse Microsoft Office add-ins to obtain persistence on a compromised system.\nOffice add-ins can be used to add functionality to Office programs\n", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8e501198-ed35-7d73-dc6d-46ed6222c3ea", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Code Executed Via Office Add-in XLL File", "query": "(powershell.file.script_block_text:*new\\-object\\ * AND powershell.file.script_block_text:*\\-ComObject\\ * AND powershell.file.script_block_text:*.application* AND powershell.file.script_block_text:*.RegisterXLL*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1137.006/T1137.006.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
