{"description":"Detects Obfuscated Powershell via COMPRESS OBFUSCATION Author: Timur Zinniatullin, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"20e5497e-331c-4cd5-8d36-935f6e2a9a07","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Invoke-Obfuscation COMPRESS OBFUSCATION","query":"(powershell.file.script_block_text:*new\\-object* AND powershell.file.script_block_text:*text.encoding\\]\\:\\:ascii* AND powershell.file.script_block_text:(*system.io.compression.deflatestream* OR *system.io.streamreader*) AND powershell.file.script_block_text:*readtoend)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1027","T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
