{"description": "Detects execution of ADRecon.ps1 for AD reconnaissance which has been reported to be actively used by FIN7", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2219acd3-8f73-1ced-a916-b8de5772501b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell ADRecon Execution", "query": "powershell.file.script_block_text:(*Function\\ Get\\-ADRExcelComOb* OR *ADRecon\\-Report.xlsx*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/sense-of-security/ADRecon", "https://bi-zone.medium.com/from-pentest-to-apt-attack-cybercriminal-group-fin7-disguises-its-malware-as-an-ethical-hackers-c23c9a75e319"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
