{"description": "Uses PowerShell to install/copy a a file into a system directory such as \"System32\" or \"SysWOW64\"", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "63bf8794-9917-45bc-88dd-e1b5abc0ecfd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell Install a DLL in System32", "query": "(powershell.file.script_block_text:*Copy\\-Item\\ * AND powershell.file.script_block_text:*\\-Destination\\ * AND powershell.file.script_block_text:(*\\\\Windows\\\\System32* OR *\\\\Windows\\\\SysWOW64*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1556"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1556", "name": "Modify Authentication Process", "reference": "https://attack.mitre.org/techniques/T1556"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1556.002/T1556.002.md#atomic-test-1---install-and-register-password-filter-dll"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
