{"description": "Adversaries may gain persistence and elevate privileges by executing malicious content triggered by PowerShell profiles.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5dab3030-47ed-0309-9f27-c492d224c564", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Powershell Trigger Profiles by Add_Content", "query": "(powershell.file.script_block_text:*Add\\-Content* AND powershell.file.script_block_text:*$profile* AND powershell.file.script_block_text:*\\-Value* AND powershell.file.script_block_text:(*Start\\-Process* OR *\\\"\\\"*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.013/T1546.013.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
