{"description": "Uses PowerShell to install a DLL in System32", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "12109a74-bf5a-48b5-74fc-c2567cc9458b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell Install a DLL in System32", "query": "(powershell.file.script_block_text:*Copy\\-Item\\ * AND powershell.file.script_block_text:*\\-Destination\\ * AND powershell.file.script_block_text:*\\\\Windows\\\\System32*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1556"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1556", "name": "Modify Authentication Process", "reference": "https://attack.mitre.org/techniques/T1556"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1556.002/T1556.002.md#atomic-test-1---install-and-register-password-filter-dll"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
