{"description": "The infrastructure for management data and operations that enables local and remote management of Windows personal computers and servers", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0332a266-b584-47b4-933d-a00b103e1b37", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious Get-WmiObject", "query": "powershell.file.script_block_text:(*Get\\-WmiObject* OR *gwmi*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://attack.mitre.org/datasources/DS0005/", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-wmiobject?view=powershell-5.1&viewFallbackFrom=powershell-7"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
