{"description": "Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f3a98ce4-6164-4dd4-867c-4d83de7eca51", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell Token Obfuscation - Powershell", "query": "((((powershell.file.script_block_text:/\\w+`(\\w+|-|.)`[\\w+|\\s]/)) OR ((powershell.file.script_block_text:/\"(\\{\\d\\}){2,}\"\\s*-f/)) OR ((powershell.file.script_block_text:/\\$\\{((e|n|v)*`(e|n|v)*)+:path\\}|\\$\\{((e|n|v)*`(e|n|v)*)+:((p|a|t|h)*`(p|a|t|h)*)+\\}|\\$\\{env:((p|a|t|h)*`(p|a|t|h)*)+\\}/))) AND (NOT ((powershell.file.script_block_text:(*it\\ will\\ return\\ true\\ or\\ false\\ instead* OR *The\\ function\\ also\\ prevents\\ `Get\\-ItemProperty`\\ from\\ failing*)) OR ((winlog.event_data.Path:C\\:\\\\Program\\ Files\\\\Microsoft\\\\Exchange\\ Server\\\\* AND winlog.event_data.Path:*\\\\bin\\\\servicecontrol.ps1 AND powershell.file.script_block_text:*`r`n*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/danielbohannon/Invoke-Obfuscation"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
