{"description":"Adversaries may search local file systems and remote file shares for files containing insecurely stored credentials.\nThese can be files created by users to store their own credentials, shared credential stores for a group of individuals,\nconfiguration files containing passwords for a system or service, or source code/binary files containing embedded passwords.\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f8c6cfba-671d-dfc9-5cc8-ffaed52dc87a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Extracting Information with PowerShell","query":"(powershell.file.script_block_text:*ls* AND powershell.file.script_block_text:*\\ \\-R* AND powershell.file.script_block_text:*select\\-string\\ * AND powershell.file.script_block_text:*\\-Pattern\\ *)","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1552"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
