{"description": "Dnscat exfiltration tool execution", "enabled": false, "false_positives": ["Legitimate usage of PowerShell Dnscat2 \u2014 DNS Exfiltration tool (unlikely)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "73734c5a-1255-73a9-d01f-04730cac566e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Dnscat Execution", "query": "powershell.file.script_block_text:*Start\\-Dnscat2*", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1048", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
