{"description": "Detects potentially suspicious keywords that could indicate the use of a PowerShell exploitation framework", "author": ["Florian Roth (Nextron Systems)", "Perez Diego (@darkquassar)", "Tuan Le (NCSGroup)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1f49f2ab-26bc-48b3-96cc-dcffbc93eadf", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Suspicious PowerShell Keywords", "query": "powershell.file.script_block_text:(*System.Reflection.Assembly.Load\\($* OR *\\[System.Reflection.Assembly\\]\\:\\:Load\\($* OR *\\[Reflection.Assembly\\]\\:\\:Load\\($* OR *System.Reflection.AssemblyName* OR *Reflection.Emit.AssemblyBuilderAccess* OR *Reflection.Emit.CustomAttributeBuilder* OR *Runtime.InteropServices.UnmanagedType* OR *Runtime.InteropServices.DllImportAttribute* OR *SuspendThread* OR *rundll32*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://posts.specterops.io/entering-a-covenant-net-command-and-control-e11038bcf462", "https://github.com/PowerShellMafia/PowerSploit/blob/d943001a7defb5e0d1657085a77a0e78609be58f/CodeExecution/Invoke-ReflectivePEInjection.ps1", "https://github.com/hlldz/Phant0m/blob/30c2935d8cf4aafda17ee2fab7cd0c4aa9a607c2/old/Invoke-Phant0m.ps1", "https://gist.github.com/MHaggis/0dbe00ad401daa7137c81c99c268cfb7"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
