{"description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f898db39-3c98-8c9d-c890-9a26f3ede824", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Powershell Create Scheduled Task", "query": "(powershell.file.script_block_text:(*New\\-ScheduledTaskAction* OR *New\\-ScheduledTaskTrigger* OR *New\\-ScheduledTaskPrincipal* OR *New\\-ScheduledTaskSettingsSet* OR *New\\-ScheduledTask* OR *Register\\-ScheduledTask*) OR (powershell.file.script_block_text:*Invoke\\-CimMethod* AND powershell.file.script_block_text:*\\-ClassName* AND powershell.file.script_block_text:*PS_ScheduledTask* AND powershell.file.script_block_text:*\\-NameSpace* AND powershell.file.script_block_text:*Root\\\\Microsoft\\\\Windows\\\\TaskScheduler*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
