{"description": "Detects code fragments found in small and obfuscated AMSI bypass PowerShell scripts", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "059aee8b-3b96-1425-e371-e53623bc06cf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AMSI Bypass Pattern Assembly GetType", "query": "(powershell.file.script_block_text:*\\[Ref\\].Assembly.GetType* AND powershell.file.script_block_text:*SetValue\\($null,$true\\)* AND powershell.file.script_block_text:*NonPublic,Static*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.mdsec.co.uk/2018/06/exploring-powershell-amsi-and-logging-evasion/", "https://twitter.com/cyb3rops/status/1588574518057979905?s=20&t=A7hh93ONM7ni1Rj1jO5OaA"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
