{"description": "Detect use of X509Enrollment", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate administrative script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "504d63cb-0dba-4d02-8531-e72981aace2c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious X509Enrollment - Ps Script", "query": "powershell.file.script_block_text:(*X509Enrollment.CBinaryConverter* OR *884e2002\\-217d\\-11da\\-b2a4\\-000e7bbb2b09*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42", "https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41", "https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
