{"description": "Detects attempts of decoding a base64 Gzip archive in a PowerShell script. This technique is often used as a method to load malicious content into memory afterward.", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate administrative script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9968d5d5-830d-0232-2d11-9ef959a617fa", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious FromBase64String Usage On Gzip Archive - Ps Script", "query": "(powershell.file.script_block_text:*FromBase64String* AND powershell.file.script_block_text:*MemoryStream* AND powershell.file.script_block_text:*H4sI*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
