{"description": "Detects execution of a PowerShell script that contains calls to the \"Veeam.Backup\" class, in order to dump stored credentials.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Administrators backup scripts (must be investigated)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "976d6e6f-a04b-4900-9713-0134a353e38b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Veeam Backup Servers Credential Dumping Script Execution", "query": "(powershell.file.script_block_text:*\\[Credentials\\]* AND powershell.file.script_block_text:*\\[Veeam.Backup.Common.ProtectedStorage\\]\\:\\:GetLocalString* AND powershell.file.script_block_text:*Invoke\\-Sqlcmd* AND powershell.file.script_block_text:*Veeam\\ Backup\\ and\\ Replication*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.pwndefend.com/2021/02/15/retrieving-passwords-from-veeam-backup-servers/", "https://labs.withsecure.com/publications/fin7-target-veeam-servers"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
