{"description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser.\nWeb browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.\nWeb browsers typically store the credentials in an encrypted format within a credential store.\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc028194-969d-4122-8abe-0470d5b8f12f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Access to Browser Login Data", "query": "(powershell.file.script_block_text:*Copy\\-Item* AND powershell.file.script_block_text:*\\-Destination* AND powershell.file.script_block_text:(*\\\\Opera\\ Software\\\\Opera\\ Stable\\\\Login\\ Data* OR *\\\\Mozilla\\\\Firefox\\\\Profiles* OR *\\\\Microsoft\\\\Edge\\\\User\\ Data\\\\Default* OR *\\\\Google\\\\Chrome\\\\User\\ Data\\\\Default\\\\Login\\ Data* OR *\\\\Google\\\\Chrome\\\\User\\ Data\\\\Default\\\\Login\\ Data\\ For\\ Account*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.003/T1555.003.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
