{"description":"Enumerates Active Directory to determine computers that are joined to the domain Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"859bbe54-4a6d-d60e-f2bf-36b6ded359f6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"DirectorySearcher Powershell Exploitation","query":"(powershell.file.script_block_text:*New\\-Object\\ * AND powershell.file.script_block_text:*System.DirectoryServices.DirectorySearcher* AND powershell.file.script_block_text:*.PropertiesToLoad.Add* AND powershell.file.script_block_text:*.findall\\(\\)* AND powershell.file.script_block_text:*Properties.name*)","meta":{"from":"1m"},"severity":"medium","tags":["T1018"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1018","name":"Remote System Discovery","reference":"https://attack.mitre.org/techniques/T1018"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
