{"description": "Detects usage of a PowerShell command to dump the live memory of a Windows machine", "enabled": false, "false_positives": ["Diagnostics"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "16fe96ad-1033-f1f8-449e-df9f73f83123", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Live Memory Dump Using Powershell", "query": "(powershell.file.script_block_text:*Get\\-StorageDiagnosticInfo* AND powershell.file.script_block_text:*\\-IncludeLiveDump*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1003"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/powershell/module/storage/get-storagediagnosticinfo"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
