{"description": "Detects Base64 encoded Shellcode", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "16b37b70-6fcf-4814-a092-c36bd3aafcbd", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "PowerShell ShellCode", "query": "(powershell.file.script_block_text:*AAAAYInlM* AND powershell.file.script_block_text:(*OiCAAAAYInlM* OR *OiJAAAAYInlM*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "Privilege Escalation", "T1055", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://twitter.com/cyb3rops/status/1063072865992523776"], "timestamp_override": "event.ingested", "author": ["David Ledbetter (shellcode)", "Florian Roth (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
