{"description":"Detects when when a mounted share is removed. Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation Author: oscd.community, @redcanary, Zach Stanford @svch0st. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrators or Power users may remove their shares via cmd line"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f28ec04e-f131-1f7f-329c-1afe664c683d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"PowerShell Deleted Mounted Share","query":"powershell.file.script_block_text:(*Remove\\-SmbShare* OR *Remove\\-FileShare*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1070"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
