{"description": "Detects use of WinAPI Functions in PowerShell scripts", "author": ["Nikita Nazarov", "oscd.community", "Tim Shelton"], "enabled": false, "false_positives": ["Carbon PowerShell Module (https://github.com/webmd-health-services/Carbon)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "03d83090-8cba-44a0-b02f-0b756a050306", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential WinAPI Calls Via PowerShell Scripts", "query": "(powershell.file.script_block_text:(*AddSecurityPackage* OR *AdjustTokenPrivileges* OR *CloseHandle* OR *CreateProcessWithToken* OR *CreateRemoteThread* OR *CreateThread* OR *CreateUserThread* OR *DangerousGetHandle* OR *DuplicateTokenEx* OR *EnumerateSecurityPackages* OR *FreeLibrary* OR *GetDelegateForFunctionPointer* OR *GetLogonSessionData* OR *GetModuleHandle* OR *GetProcAddress* OR *GetProcessHandle* OR *GetTokenInformation* OR *ImpersonateLoggedOnUser* OR *kernel32* OR *LoadLibrary* OR *memcpy* OR *MiniDumpWriteDump* OR *msvcrt* OR *ntdll* OR *OpenDesktop* OR *OpenProcess* OR *OpenProcessToken* OR *OpenThreadToken* OR *OpenWindowStation* OR *QueueUserApc* OR *ReadProcessMemory* OR *RevertToSelf* OR *RtlCreateUserThread* OR *secur32* OR *SetThreadToken* OR *VirtualAlloc* OR *VirtualFree* OR *VirtualProtect* OR *WaitForSingleObject* OR *WriteInt32* OR *WriteProcessMemory* OR *ZeroFreeGlobalAllocUnicode*) AND (NOT (powershell.file.script_block_text:/#\\ [Cc][Oo][Pp][Yy][Rr][Ii][Gg][Hh][Tt]\\ 2016\\ [Aa][Mm][Aa][Zz][Oo][Nn]\\.[Cc][Oo][Mm],\\ [Ii][Nn][Cc]\\.\\ [Oo][Rr]\\ [Ii][Tt][Ss]\\ [Aa][Ff][Ff][Ii][Ll][Ii][Aa][Tt][Ee][Ss]\\..*/ AND powershell.file.script_block_text:(/.*[Ff][Uu][Nn][Cc][Tt][Ii][Oo][Nn]\\ [Ii][Mm][Pp][Oo][Rr][Tt]\\-[Ss][Ee][Rr][Ii][Aa][Ll][Pp][Oo][Rr][Tt][Uu][Tt][Ii][Ll]\\ .*/ OR *CloseHandle* OR /.*[Dd][Ll][Ll][Ii][Mm][Pp][Oo][Rr][Tt]\\(\\\"[Kk][Ee][Rr][Nn][Ee][Ll][Bb][Aa][Ss][Ee]\\.[Dd][Ll][Ll]\\\".*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
