{"description": "Detects PowerShell scripts to set the ACL to a file in the Windows folder", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3bf1d859-3a7e-44cb-8809-a99e066d3478", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Set-Acl On Windows Folder - PsScript", "query": "(powershell.file.script_block_text:*Set\\-Acl\\ * AND powershell.file.script_block_text:*\\-AclObject\\ * AND powershell.file.script_block_text:(*\\-Path\\ \\\"C\\:\\\\Windows* OR *\\-Path\\ \\\"C\\:\\/Windows* OR *\\-Path\\ 'C\\:\\\\Windows* OR *\\-Path\\ 'C\\:\\/Windows* OR *\\-Path\\ C\\:\\\\Windows* OR *\\-Path\\ C\\:\\/Windows* OR *\\-Path\\ $env\\:windir* OR *\\-Path\\ \\\"$env\\:windir* OR *\\-Path\\ '$env\\:windir*) AND powershell.file.script_block_text:(*FullControl* OR *Allow*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1222"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1222", "name": "File and Directory Permissions Modification", "reference": "https://attack.mitre.org/techniques/T1222"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md", "https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
