{"description":"Adversaries may use Valid Accounts to interact with remote systems using Windows Remote Management (WinRM). The adversary may then perform actions as the logged-on user. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["legitim script"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7e409b40-0f21-44a7-fd87-ad6c4a41dfdd","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Enable Windows Remote Management","query":"powershell.file.script_block_text:*Enable\\-PSRemoting\\ *","meta":{"from":"1m"},"severity":"medium","tags":["Lateral Movement","T1021"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
