{"description":"Detects AS-REP roasting is an attack that is often-overlooked. It is not very common as you have to explicitly set accounts that do not require pre-authentication. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate PowerShell scripts"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"91eb2023-43dd-3bd2-5cb3-24a4c2358628","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Get-ADUser Enumeration Using UserAccountControl Flags","query":"(powershell.file.script_block_text:*Get\\-ADUser* AND powershell.file.script_block_text:*\\-Filter* AND powershell.file.script_block_text:*useraccountcontrol* AND powershell.file.script_block_text:*\\-band* AND powershell.file.script_block_text:*4194304*)","meta":{"from":"1m"},"severity":"medium","tags":["T1057"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1057","name":"Process Discovery","reference":"https://attack.mitre.org/techniques/T1057"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
