{"description": "Detects Execution via SyncInvoke in CL_Invocation.ps1 module", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "724ea4e9-6c31-960c-f962-7ef4d0792407", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution via CL_Invocation.ps1", "query": "(powershell.file.script_block_text:*CL_Invocation.ps1* AND powershell.file.script_block_text:*SyncInvoke*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1216", "name": "Signed Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/Cl_invocation.yml", "https://twitter.com/bohops/status/948061991012327424"], "timestamp_override": "event.ingested", "author": ["oscd.community", "Natalia Shornikova"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
