{"description": "DNSExfiltrator allows for transfering (exfiltrate) a file over a DNS request covert channel", "enabled": false, "false_positives": ["Legitimate script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d59d7842-9a21-4bc6-ba98-64bfe0091355", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell DNSExfiltration", "query": "(powershell.file.script_block_text:*Invoke\\-DNSExfiltrator* OR (powershell.file.script_block_text:*\\ \\-i\\ * AND powershell.file.script_block_text:*\\ \\-d\\ * AND powershell.file.script_block_text:*\\ \\-p\\ * AND powershell.file.script_block_text:*\\ \\-doh\\ * AND powershell.file.script_block_text:*\\ \\-t\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1048"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1048/T1048.md#atomic-test-3---dnsexfiltration-doh", "https://github.com/Arno0x/DNSExfiltrator"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
