{"description": "Detects writing data into NTFS alternate data streams from powershell. Needs Script Block Logging.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "61e66df5-7e63-56ec-4f6b-b765d4b073af", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NTFS Alternate Data Stream", "query": "(powershell.file.script_block_text:(*set\\-content* OR *add\\-content*) AND powershell.file.script_block_text:*\\-stream*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["http://www.powertheshell.com/ntfsstreams/", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.004/T1564.004.md"], "timestamp_override": "event.ingested", "author": ["Sami Ruohonen"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
