{"description": "Adversaries may log user keystrokes to intercept credentials as the user types them.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "97764933-c6f2-139c-92b5-3435a85503c6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Powershell Keylogging", "query": "(powershell.file.script_block_text:*Get\\-Keystrokes* OR (powershell.file.script_block_text:*Get\\-ProcAddress\\ user32.dll\\ GetAsyncKeyState* AND powershell.file.script_block_text:*Get\\-ProcAddress\\ user32.dll\\ GetForegroundWindow*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1056"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1056.001/src/Get-Keystrokes.ps1"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
