{"description": "Detect use of Get-GPO to get one GPO or all the GPOs in a domain.", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "eb2fd349-ec67-4caa-9143-d79c7fb34441", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious GPO Discovery With Get-GPO", "query": "powershell.file.script_block_text:*Get\\-GPO*", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1615/T1615.md", "https://docs.microsoft.com/en-us/powershell/module/grouppolicy/get-gpo?view=windowsserver2022-ps"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
