{"description": "Detects Exfiltration Over Alternative Protocol - ICMP. Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel.", "enabled": false, "false_positives": ["Legitimate usage of System.Net.NetworkInformation.Ping class"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3725a620-e55b-5ebd-759c-c89c7845e8a9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell ICMP Exfiltration", "query": "(powershell.file.script_block_text:*New\\-Object* AND powershell.file.script_block_text:*System.Net.NetworkInformation.Ping* AND powershell.file.script_block_text:*.Send\\(*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1048"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1048.003/T1048.003.md#atomic-test-2---exfiltration-over-alternative-protocol---icmp"], "timestamp_override": "event.ingested", "author": ["Bartlomiej Czyz @bczyz1", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
