{"description": "Detects Commandlet names and arguments from the Nishang exploitation framework", "author": ["Alec Costello"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f772cee9-b7c2-4cb2-8f07-49870adc02e0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Malicious Nishang PowerShell Commandlets", "query": "powershell.file.script_block_text:(*Add\\-ConstrainedDelegationBackdoor* OR *Copy\\-VSS* OR *Create\\-MultipleSessions* OR *DataToEncode* OR *DNS_TXT_Pwnage* OR *Do\\-Exfiltration\\-Dns* OR *Download_Execute* OR *Download\\-Execute\\-PS* OR *DownloadAndExtractFromRemoteRegistry* OR *DumpCerts* OR *DumpCreds* OR *DumpHashes* OR *Enable\\-DuplicateToken* OR *Enable\\-Duplication* OR *Execute\\-Command\\-MSSQL* OR *Execute\\-DNSTXT\\-Code* OR *Execute\\-OnTime* OR *ExetoText* OR *exfill* OR *ExfilOption* OR *FakeDC* OR *FireBuster* OR *FireListener* OR *Get\\-Information\\ * OR *Get\\-PassHints* OR *Get\\-Web\\-Credentials* OR *Get\\-WebCredentials* OR *Get\\-WLAN\\-Keys* OR *HTTP\\-Backdoor* OR *Invoke\\-AmsiBypass* OR *Invoke\\-BruteForce* OR *Invoke\\-CredentialsPhish* OR *Invoke\\-Decode* OR *Invoke\\-Encode* OR *Invoke\\-Interceptor* OR *Invoke\\-JSRatRegsvr* OR *Invoke\\-JSRatRundll* OR *Invoke\\-MimikatzWDigestDowngrade* OR *Invoke\\-NetworkRelay* OR *Invoke\\-PowerShellIcmp* OR *Invoke\\-PowerShellUdp* OR *Invoke\\-Prasadhak* OR *Invoke\\-PSGcat* OR *Invoke\\-PsGcatAgent* OR *Invoke\\-SessionGopher* OR *Invoke\\-SSIDExfil* OR *LoggedKeys* OR *Nishang* OR *NotAllNameSpaces* OR *Out\\-CHM* OR *OUT\\-DNSTXT* OR *Out\\-HTA* OR *Out\\-RundllCommand* OR *Out\\-SCF* OR *Out\\-SCT* OR *Out\\-Shortcut* OR *Out\\-WebQuery* OR *Out\\-Word* OR *Parse_Keys* OR *Password\\-List* OR *Powerpreter* OR *Remove\\-Persistence* OR *Remove\\-PoshRat* OR *Remove\\-Update* OR *Run\\-EXEonRemote* OR *Set\\-DCShadowPermissions* OR *Set\\-RemotePSRemoting* OR *Set\\-RemoteWMI* OR *Shellcode32* OR *Shellcode64* OR *StringtoBase64* OR *TexttoExe*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/samratashok/nishang"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
