{"description": "Detects execution of \"TroubleshootingPack\" cmdlets to leverage CVE-2022-30190 or action similar to \"msdt\" lolbin (as described in LOLBAS)", "enabled": false, "false_positives": ["Legitimate usage of \"TroubleshootingPack\" cmdlet for troubleshooting purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "782bb2c5-8093-e2ec-6c29-a83aab18d90c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Troubleshooting Pack Cmdlet Execution", "query": "(powershell.file.script_block_text:*Invoke\\-TroubleshootingPack* AND powershell.file.script_block_text:*C\\:\\\\Windows\\\\Diagnostics\\\\System\\\\PCW* AND powershell.file.script_block_text:*\\-AnswerFile* AND powershell.file.script_block_text:*\\-Unattended*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/nas_bench/status/1537919885031772161", "https://lolbas-project.github.io/lolbas/Binaries/Msdt/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
