{"description": "Detects PowerShell scripts leveraging the \"Invoke-WebRequest\" cmdlet to send data via either \"PUT\" or \"POST\" method.", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d2e3f2f6-7e09-4bf2-bc5d-90186809e7fb", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PowerShell Script With File Upload Capabilities", "query": "(powershell.file.script_block_text:(*Invoke\\-WebRequest* OR *iwr\\ *) AND powershell.file.script_block_text:(*\\-Method\\ Put* OR *\\-Method\\ Post*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1020"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1020", "name": "Automated Exfiltration", "reference": "https://attack.mitre.org/techniques/T1020"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1020/T1020.md", "https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-webrequest?view=powershell-7.2"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
