{"description": "Detects usage of the \"Import-Module\" cmdlet to load the \"Microsoft.ActiveDirectory.Management.dl\" DLL. Which is often used by attackers to perform AD enumeration.", "author": ["frack113", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate use of the library for administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "546705fa-6579-bba5-8119-88bd12c91bd1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Active Directory Enumeration Using AD Module - PsScript", "query": "(((powershell.file.script_block_text:*Import\\-Module\\ * AND powershell.file.script_block_text:*Microsoft.ActiveDirectory.Management.dll*)) OR (powershell.file.script_block_text:*ipmo\\ Microsoft.ActiveDirectory.Management.dll*))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/samratashok/ADModule", "https://twitter.com/cyb3rops/status/1617108657166061568?s=20", "https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/active-directory-enumeration-with-ad-module-without-rsat-or-admin-privileges"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
