{"description": "Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel.\nThe data may also be sent to an alternate network location from the main command and control server.\n", "enabled": false, "false_positives": ["Legitimate script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9a7afa56-4762-43eb-807d-c3dc9ffe211b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Powershell Exfiltration Over SMTP", "query": "(powershell.file.script_block_text:*Send\\-MailMessage* AND (NOT (powershell.file.script_block_text:*CmdletsToExport*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1048"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/send-mailmessage?view=powershell-7.2", "https://www.ietf.org/rfc/rfc2821.txt"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
