{"description":"An adversary may deface systems internal to an organization in an attempt to intimidate or mislead users.\nThis may take the form of modifications to internal websites, or directly to user systems with the replacement of the desktop wallpaper\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9a3c92bc-c0bc-b1a9-9dca-f494d3b9683d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Replace Desktop Wallpaper by Powershell","query":"((powershell.file.script_block_text:*Get\\-ItemProperty* AND powershell.file.script_block_text:*Registry\\:\\:* AND powershell.file.script_block_text:*HKEY_CURRENT_USER\\\\Control\\ Panel\\\\Desktop\\\\* AND powershell.file.script_block_text:*WallPaper*) OR powershell.file.script_block_text:*SystemParametersInfo\\(20,0,*,3\\)*)","meta":{"from":"1m"},"severity":"low","tags":["T1491"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1491","name":"Defacement","reference":"https://attack.mitre.org/techniques/T1491"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
