{"description": "Identifies when a user attempts to clear console history. An adversary may clear the command history of a compromised account to conceal the actions undertaken during an intrusion.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0156560b-01ae-9e05-728d-71b8b107331f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Clearing Windows Console History", "query": "(powershell.file.script_block_text:*Clear\\-History* OR (powershell.file.script_block_text:(*Remove\\-Item* OR *rm*) AND powershell.file.script_block_text:(*ConsoleHost_history.txt* OR *\\(Get\\-PSReadlineOption\\).HistorySavePath*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}, {"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://stefanos.cloud/blog/kb/how-to-clear-the-powershell-command-history/", "https://www.shellhacks.com/clear-history-powershell/", "https://community.sophos.com/sophos-labs/b/blog/posts/powershell-command-history-forensics"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
