{"description":"Detects Obfuscated Powershell via use Rundll32 in Scripts Author: Nikita Nazarov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a5a30a6e-75ca-4233-8b8c-42e0f2037d3b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Invoke-Obfuscation Via Use Rundll32","query":"(powershell.file.script_block_text:*\\&&* AND powershell.file.script_block_text:*rundll32* AND powershell.file.script_block_text:*shell32.dll* AND powershell.file.script_block_text:*shellexec_rundll* AND powershell.file.script_block_text:(*value* OR *invoke* OR *comspec* OR *iex*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1027","T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
