{"description":"Adversaries may attempt to gather information about attached peripheral devices and components connected to a computer system. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["admin script"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"832c5d81-8c93-4c17-ca92-71858a2b35c6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Powershell Suspicious Win32_PnPEntity","query":"powershell.file.script_block_text:*Win32_PnPEntity*","meta":{"from":"1m"},"severity":"low","tags":["T1120"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1120","name":"Peripheral Device Discovery","reference":"https://attack.mitre.org/techniques/T1120"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
