{"description": "Various protocols maybe used to put data on the device for exfil or infil", "enabled": false, "false_positives": ["Generally used to copy configs or IOS images"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5e51acb2-bcbe-435b-99c6-0e3cd5e2aa59", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Cisco Stage Data", "query": "(*tftp* OR *rcp* OR *puts* OR *copy* OR *configure\\ replace* OR *archive\\ tar*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Lateral Movement", "T1074", "T1105", "T1560"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1074", "name": "Data Staged", "reference": "https://attack.mitre.org/techniques/T1074"}, {"id": "T1560", "name": "Archive Collected Data", "reference": "https://attack.mitre.org/techniques/T1560"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Austin Clark"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
