{"description":"See what files are being deleted from flash file systems Author: Austin Clark. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Will be used sometimes by admins to clean up local flash space"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"0bc98715-69d7-8007-cb30-c150774a0aee","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Cisco File Deletion","query":"(*erase* OR *delete* OR *format*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1070","T1561","T1561"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"}]},{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1561","name":"Disk Wipe","reference":"https://attack.mitre.org/techniques/T1561"},{"id":"T1561","name":"Disk Wipe","reference":"https://attack.mitre.org/techniques/T1561"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
