{"description":"See what commands are being input into the device by other people, full credentials can be in the history Author: Austin Clark. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Not commonly run by administrators, especially if remote logging is configured"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"b094d9fb-b1ad-4650-9f1a-fb7be9f1d34b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Cisco Show Commands Input","query":"(*show\\ history* OR *show\\ history\\ all* OR *show\\ logging*)","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1552"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
