{"description": "See what commands are being input into the device by other people, full credentials can be in the history", "author": ["Austin Clark"], "enabled": false, "false_positives": ["Not commonly run by administrators, especially if remote logging is configured"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d48f22ae-e82c-4319-7a5a-bed9c5a17277", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Cisco Show Commands Input", "query": "((*show history*) OR (*show history all*) OR (*show logging*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
