{"description": "Show when private keys are being exported from the device, or when new certificates are installed", "enabled": false, "false_positives": ["Not commonly run by administrators. Also whitelist your known good certificates"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "1f978c6a-4415-47fb-aca5-736a44d7ca3d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Cisco Crypto Commands", "query": "(*crypto\\ pki\\ export* OR *crypto\\ pki\\ import* OR *crypto\\ pki\\ trustpoint*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Defense Evasion", "T1552", "T1553"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1553", "name": "Subvert Trust Controls", "reference": "https://attack.mitre.org/techniques/T1553"}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Austin Clark"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
