{"description": "Detect a system being shutdown or put into different boot mode", "enabled": false, "false_positives": ["Legitimate administrators may run these commands, though rarely."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d94a35f0-7a29-45f6-90a0-80df6159967c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Cisco Denial of Service", "query": "(*shutdown* OR *config\\-register\\ 0x2100* OR *config\\-register\\ 0x2142*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1495", "T1529", "T1565"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1495", "name": "Firmware Corruption", "reference": "https://attack.mitre.org/techniques/T1495"}, {"id": "T1529", "name": "System Shutdown/Reboot", "reference": "https://attack.mitre.org/techniques/T1529"}, {"id": "T1565", "name": "Data Manipulation", "reference": "https://attack.mitre.org/techniques/T1565"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Austin Clark"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
