{"description": "Modifications to a config that will serve an adversary's impacts or persistence", "enabled": false, "false_positives": ["Legitimate administrators may run these commands"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "671ffc77-50a7-464f-9e3d-9ea2b493b26b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Cisco Modify Configuration", "query": "(*ip\\ http\\ server* OR *ip\\ https\\ server* OR *kron\\ policy\\-list* OR *kron\\ occurrence* OR *policy\\-list* OR *access\\-list* OR *ip\\ access\\-group* OR *archive\\ maximum*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053", "T1490", "T1505", "T1565"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}, {"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}, {"id": "T1565", "name": "Data Manipulation", "reference": "https://attack.mitre.org/techniques/T1565"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Austin Clark"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
