{"description":"Find local accounts being created or modified as well as remote authentication configurations Author: Austin Clark. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["When remote authentication is in place, this should not change often"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"b2c09201-e872-f74d-4222-ea8da6cf9abf","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Cisco Local Accounts","query":"(*username* OR *aaa*)","meta":{"from":"1m"},"severity":"high","tags":["T1098","T1136"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098"},{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
