{"description": "Detects suspicious child process creations of VMware Tools process which may indicate persistence setup", "enabled": false, "false_positives": ["Legitimate use by adminstrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "26a1bcbe-ef96-d7ae-4a94-d66467ec712a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "VMToolsd Suspicious Child Process", "query": "((process.parent.executable:*\\\\vmtoolsd.exe AND (process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\wscript.exe OR *\\\\cscript.exe) OR winlog.event_data.OriginalFileName:(\"Cmd.Exe\" OR \"PowerShell.EXE\" OR \"RUNDLL32.EXE\" OR \"REGSVR32.EXE\" OR \"wscript.exe\" OR \"cscript.exe\"))) AND (NOT (process.command_line:(*\\\\VMware\\\\VMware\\ Tools\\\\poweron\\-vm\\-default.bat* OR *\\\\VMware\\\\VMware\\ Tools\\\\poweroff\\-vm\\-default.bat* OR *\\\\VMware\\\\VMware\\ Tools\\\\resume\\-vm\\-default.bat* OR *\\\\VMware\\\\VMware\\ Tools\\\\suspend\\-vm\\-default.bat*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/"], "timestamp_override": "event.ingested", "author": ["behops", "Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
