{"description": "Detects the malicious use of a control panel item", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "15232d29-64f7-e80e-20b9-792a64db2a96", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Control Panel Items", "query": "((process.executable.text:*\\\\reg.exe AND process.command_line.text:*add* AND process.command_line.text:*CurrentVersion\\\\Control\\ Panel\\\\CPLs*) OR (process.command_line.text:*.cpl AND (NOT ((process.command_line.text:(*\\\\System32\\\\* OR *%System%*)) OR (process.command_line.text:*regsvr32\\ * AND process.command_line.text:*\\ \\/s\\ * AND process.command_line.text:*igfxCPL.cpl*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1196/", "https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins"], "timestamp_override": "event.ingested", "author": ["Kyaw Min Thein", "Furkan Caliskan (@caliskanfurkan_)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
