{"description": "Detects the creation of scheduled tasks that involves a temporary folder and runs only once", "enabled": false, "false_positives": ["Administrative activity", "Software installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f50c6fec-a940-9013-444a-6f390eff692e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Scheduled Task Creation Involving Temp Folder", "query": "(process.executable:*\\\\schtasks.exe AND process.command_line:*\\ \\/create\\ * AND process.command_line:*\\ \\/sc\\ once\\ * AND process.command_line:*\\\\Temp\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
