{"description": "Detects a \"regsvr32\" execution where the DLL doesn't contain a common file extension.", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Other legitimate extensions currently not in the list either from third party or specific Windows components."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "50919691-7302-437f-8e10-1fe088afa145", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Regsvr32 DLL Execution With Uncommon Extension", "query": "((((process.executable.text:\"*\\\\regsvr32.exe\") OR (winlog.event_data.OriginalFileName:\"REGSVR32.EXE\")) AND (NOT ((process.command_line.text:(\"*.ax*\" OR \"*.cpl*\" OR \"*.dll*\" OR \"*.ocx*\")) OR (NOT _exists_:process.command_line.text) OR (process.command_line.text:\"\")))) AND (NOT ((process.command_line.text:\"*.ppl*\") OR (process.command_line.text:\"*.bav*\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
