{"description": "Detects execution of \"reg.exe\" commands with the \"delete\" flag on services registry key. Often used by attacker to remove AV software services", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "05b2aa93-1210-42c8-8d9a-2fcc13b284f5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Service Registry Key Deleted Via Reg.EXE", "query": "(((process.executable.text:\"*reg.exe\") OR (winlog.event_data.OriginalFileName:\"reg.exe\")) AND process.command_line.text:\"*\\ delete\\ *\" AND process.command_line.text:\"*\\\\SYSTEM\\\\CurrentControlSet\\\\services\\\\*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
