{"description": "Rename as a legitim Sysinternals Suite tools to evade detection", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7cce6fc8-a07f-4d84-a53e-96e1879843c9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "False Sysinternals Suite Tools", "query": "(process.executable:(*\\\\accesschk.exe OR *\\\\accesschk64.exe OR *\\\\AccessEnum.exe OR *\\\\ADExplorer.exe OR *\\\\ADExplorer64.exe OR *\\\\ADInsight.exe OR *\\\\ADInsight64.exe OR *\\\\adrestore.exe OR *\\\\adrestore64.exe OR *\\\\Autologon.exe OR *\\\\Autologon64.exe OR *\\\\Autoruns.exe OR *\\\\Autoruns64.exe OR *\\\\autorunsc.exe OR *\\\\autorunsc64.exe OR *\\\\Bginfo.exe OR *\\\\Bginfo64.exe OR *\\\\Cacheset.exe OR *\\\\Cacheset64.exe OR *\\\\Clockres.exe OR *\\\\Clockres64.exe OR *\\\\Contig.exe OR *\\\\Contig64.exe OR *\\\\Coreinfo.exe OR *\\\\Coreinfo64.exe OR *\\\\CPUSTRES.EXE OR *\\\\CPUSTRES64.EXE OR *\\\\ctrl2cap.exe OR *\\\\Dbgview.exe OR *\\\\dbgview64.exe OR *\\\\Desktops.exe OR *\\\\Desktops64.exe OR *\\\\disk2vhd.exe OR *\\\\disk2vhd64.exe OR *\\\\diskext.exe OR *\\\\diskext64.exe OR *\\\\Diskmon.exe OR *\\\\Diskmon64.exe OR *\\\\DiskView.exe OR *\\\\DiskView64.exe OR *\\\\du.exe OR *\\\\du64.exe OR *\\\\efsdump.exe OR *\\\\FindLinks.exe OR *\\\\FindLinks64.exe OR *\\\\handle.exe OR *\\\\handle64.exe OR *\\\\hex2dec.exe OR *\\\\hex2dec64.exe OR *\\\\junction.exe OR *\\\\junction64.exe OR *\\\\ldmdump.exe OR *\\\\listdlls.exe OR *\\\\listdlls64.exe OR *\\\\livekd.exe OR *\\\\livekd64.exe OR *\\\\loadOrd.exe OR *\\\\loadOrd64.exe OR *\\\\loadOrdC.exe OR *\\\\loadOrdC64.exe OR *\\\\logonsessions.exe OR *\\\\logonsessions64.exe OR *\\\\movefile.exe OR *\\\\movefile64.exe OR *\\\\notmyfault.exe OR *\\\\notmyfault64.exe OR *\\\\notmyfaultc.exe OR *\\\\notmyfaultc64.exe OR *\\\\ntfsinfo.exe OR *\\\\ntfsinfo64.exe OR *\\\\pendmoves.exe OR *\\\\pendmoves64.exe OR *\\\\pipelist.exe OR *\\\\pipelist64.exe OR *\\\\portmon.exe OR *\\\\procdump.exe OR *\\\\procdump64.exe OR *\\\\procexp.exe OR *\\\\procexp64.exe OR *\\\\Procmon.exe OR *\\\\Procmon64.exe OR *\\\\psExec.exe OR *\\\\psExec64.exe OR *\\\\psfile.exe OR *\\\\psfile64.exe OR *\\\\psGetsid.exe OR *\\\\psGetsid64.exe OR *\\\\psInfo.exe OR *\\\\psInfo64.exe OR *\\\\pskill.exe OR *\\\\pskill64.exe OR *\\\\pslist.exe OR *\\\\pslist64.exe OR *\\\\psLoggedon.exe OR *\\\\psLoggedon64.exe OR *\\\\psloglist.exe OR *\\\\psloglist64.exe OR *\\\\pspasswd.exe OR *\\\\pspasswd64.exe OR *\\\\psping.exe OR *\\\\psping64.exe OR *\\\\psService.exe OR *\\\\psService64.exe OR *\\\\psshutdown.exe OR *\\\\psshutdown64.exe OR *\\\\pssuspend.exe OR *\\\\pssuspend64.exe OR *\\\\RAMMap.exe OR *\\\\RDCMan.exe OR *\\\\RegDelNull.exe OR *\\\\RegDelNull64.exe OR *\\\\regjump.exe OR *\\\\ru.exe OR *\\\\ru64.exe OR *\\\\sdelete.exe OR *\\\\sdelete64.exe OR *\\\\ShareEnum.exe OR *\\\\ShareEnum64.exe OR *\\\\shellRunas.exe OR *\\\\sigcheck.exe OR *\\\\sigcheck64.exe OR *\\\\streams.exe OR *\\\\streams64.exe OR *\\\\strings.exe OR *\\\\strings64.exe OR *\\\\sync.exe OR *\\\\sync64.exe OR *\\\\Sysmon.exe OR *\\\\Sysmon64.exe OR *\\\\tcpvcon.exe OR *\\\\tcpvcon64.exe OR *\\\\tcpview.exe OR *\\\\tcpview64.exe OR *\\\\Testlimit.exe OR *\\\\Testlimit64.exe OR *\\\\vmmap.exe OR *\\\\vmmap64.exe OR *\\\\Volumeid.exe OR *\\\\Volumeid64.exe OR *\\\\whois.exe OR *\\\\whois64.exe OR *\\\\Winobj.exe OR *\\\\Winobj64.exe OR *\\\\ZoomIt.exe OR *\\\\ZoomIt64.exe) AND (NOT ((Company:(\"Sysinternals\\ \\-\\ www.sysinternals.com\" OR \"Sysinternals\")) OR (NOT _exists_:Company))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/sysinternals-suite"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
