{"description": "Detects suspicious children spawned via the Windows Terminal application which could be a sign of persistence via WindowsTerminal (see references section)", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Other legitimate \"Windows Terminal\" profiles"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8de89e52-f6e1-4b5b-afd1-41ecfa300d48", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious WindowsTerminal Child Processes", "query": "((process.parent.executable.text:*\\\\WindowsTerminal.exe AND ((process.executable.text:(*\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\certutil.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\csc.exe)) OR (process.executable.text:(*C\\:\\\\Users\\\\Public\\\\* OR *\\\\Downloads\\\\* OR *\\\\Desktop\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\TEMP\\\\*)) OR (process.command_line.text:(*\\ iex\\ * OR *\\ icm* OR *Invoke\\-* OR *Import\\-Module\\ * OR *ipmo\\ * OR *DownloadString\\(* OR *\\ \\/c\\ * OR *\\ \\/k\\ * OR *\\ \\/r\\ *)))) AND (NOT ((process.command_line.text:*Import\\-Module* AND process.command_line.text:*Microsoft.VisualStudio.DevShell.dll* AND process.command_line.text:*Enter\\-VsDevShell*) OR (process.command_line.text:*\\\\AppData\\\\Local\\\\Packages\\\\Microsoft.WindowsTerminal_* AND process.command_line.text:*\\\\LocalState\\\\settings.json*) OR (process.command_line.text:*C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* AND process.command_line.text:*\\\\Common7\\\\Tools\\\\VsDevCmd.bat*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/windowsterminalprofile.html", "https://twitter.com/nas_bench/status/1550836225652686848"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
