{"description": "Detects the execution of CustomShellHost binary where the child isn't located in 'C:\\Windows\\explorer.exe'", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a2b71f54-f3f6-15c6-f465-d5d92addd105", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious CustomShellHost Execution", "query": "(process.parent.executable.text:*\\\\CustomShellHost.exe AND (NOT (process.executable.text:\"C\\:\\\\Windows\\\\explorer.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1216", "name": "System Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/pull/180"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
