{"description": "Detects suspicious children of application launched from inside the WindowsApps directory. This could be a sign of a rogue \".appx\" package installation/execution", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f91ed517-a6ba-471d-9910-b3b4a398c0f3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Windows App Activity", "query": "(process.parent.executable.text:*C\\:\\\\Program\\ Files\\\\WindowsApps\\\\* AND ((process.executable.text:(*\\\\poweshell.exe OR *\\\\pwsh.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\mshta.exe OR *\\\\cscript.exe OR *\\\\wscript.exe)) OR (process.command_line.text:(*cmd\\ \\/c* OR *Invoke\\-* OR *Base64*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/", "https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
