{"description": "Adversaries may search for private key certificate files on compromised systems for insecurely stored credential", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "213d6a77-3d55-4ce8-ba74-fcfef741974e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Private Keys Reconnaissance Via CommandLine Tools", "query": "(process.command_line.text:(\"*.key*\" OR \"*.pgp*\" OR \"*.gpg*\" OR \"*.ppk*\" OR \"*.p12*\" OR \"*.pem*\" OR \"*.pfx*\" OR \"*.cer*\" OR \"*.p7b*\" OR \"*.asc*\") AND (((((process.executable.text:\"*\\\\cmd.exe\") OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND process.command_line.text:\"*dir\\ *\")) OR ((((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:\"*Get\\-ChildItem\\ *\")) OR (process.executable.text:\"*\\\\findstr.exe\") OR (winlog.event_data.OriginalFileName:\"FINDSTR.EXE\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.004/T1552.004.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
