{"description": "Detects the use of Jlaive to execute assemblies in a copied PowerShell", "author": ["Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0a99eb3e-1617-41bd-b095-13dc767f3def", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "HackTool - Jlaive In-Memory Assembly Execution", "query": "((process.parent.executable.text:\"*\\\\cmd.exe\" AND process.parent.command_line.text:\"*.bat\") AND (((process.executable.text:\"*\\\\xcopy.exe\" AND process.command_line.text:\"*powershell.exe*\" AND process.command_line.text:\"*.bat.exe*\")) OR ((process.executable.text:\"*\\\\xcopy.exe\" AND process.command_line.text:\"*pwsh.exe*\" AND process.command_line.text:\"*.bat.exe*\")) OR ((process.executable.text:\"*\\\\attrib.exe\" AND process.command_line.text:\"*\\+s*\" AND process.command_line.text:\"*\\+h*\" AND process.command_line.text:\"*.bat.exe*\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool", "https://web.archive.org/web/20220514073704/https://github.com/ch2sh/Jlaive"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
