{"description": "Detects usage of the Quarks PwDump tool via commandline arguments", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9c311c15-428c-4020-4706-43b86498eb33", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Quarks PwDump Execution", "query": "((process.executable.text:*\\\\QuarksPwDump.exe) OR (process.command_line.text:(\" -dhl\" OR \" --dump-hash-local\" OR \" -dhdc\" OR \" --dump-hash-domain-cached\" OR \" --dump-bitlocker\" OR \" -dhd \" OR \" --dump-hash-domain \" OR \"--ntds-file\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/quarkslab/quarkspwdump", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
