{"description": "Detects the use of various CLI utilities exfiltrating data via web requests", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7d1aaf3d-4304-425c-b7c3-162055e0b3ab", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Data Exfiltration Activity Via CommandLine Tools", "query": "((((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\cmd.exe\") AND process.command_line.text:(\"*Invoke\\-WebRequest*\" OR \"*iwr\\ *\" OR \"*wget\\ *\" OR \"*curl\\ *\") AND process.command_line.text:\"*\\ \\-ur*\" AND process.command_line.text:\"*\\ \\-me*\" AND process.command_line.text:\"*\\ \\-b*\" AND process.command_line.text:\"*\\ POST\\ *\")) OR ((process.executable.text:\"*\\\\curl.exe\" AND process.command_line.text:\"*\\-\\-ur*\" AND process.command_line.text:(\"*\\ \\-d\\ *\" OR \"*\\ \\-\\-data\\ *\")))) AND ((process.command_line.text:(\"*ToBase64String*\" OR \"*whoami*\" OR \"*nltest*\" OR \"*ifconfig*\" OR \"*hostname*\" OR \"*net\\ view*\" OR \"*qprocess*\" OR \"*netstat*\" OR \"*systeminfo*\" OR \"*tasklist*\" OR \"*sc\\ query*\")) OR ((process.command_line.text:\"*type\\ *\" AND process.command_line.text:\"*\\ >\\ *\" AND process.command_line.text:\"*\\ C\\:\\\\*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
