{"description": "Checks whether the image specified in a process creation event is not a full, absolute path (caused by process ghosting or other unorthodox methods to start a process)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "71158e3f-df67-472b-930e-7d287acaa3e1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution Of Non-Existing File", "query": "((NOT (process.executable:*\\\\*)) AND (NOT ((NOT _exists_:process.executable) OR (process.executable:(\"\\-\" OR \"\")) OR (process.executable:(\"Registry\" OR \"MemCompression\") OR process.command_line:(\"Registry\" OR \"MemCompression\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestlaboratories.com/2021/12/08/process-ghosting/"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
