{"description": "Detects the execution of reg.exe and subsequent command line arguments for enabling RDP service on the host", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "961482ab-49c0-884c-30e9-c2f4bf1e2a0f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Enabling RDP Service via Reg.exe", "query": "((process.executable:*\\\\reg.exe AND process.command_line:*\\ add\\ * AND process.command_line:*\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Terminal\\ Server* AND process.command_line:*REG_DWORD* AND process.command_line:*\\ \\/f*) AND ((process.command_line:*Licensing\\ Core* AND process.command_line:*EnableConcurrentSessions*) OR process.command_line:(*WinStations\\\\RDP\\-Tcp* OR *MaxInstanceCount* OR *fEnableWinStation* OR *TSUserEnabled* OR *TSEnabled* OR *TSAppCompat* OR *IdleWinStationPoolCount* OR *TSAdvertise* OR *AllowTSConnections* OR *fSingleSessionPerUser*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Lateral Movement", "T1021", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"], "timestamp_override": "event.ingested", "author": ["@Kostastsale", "@TheDFIRReport", "slightly modified by pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
