{"description": "Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns", "author": ["Florian Roth (Nextron Systems)", "@blu3_team (idea)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1cdd9a09-06c9-4769-99ff-626e2b3991b8", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Suspicious Double Extension File Execution", "query": "(process.executable.text:(\"*.doc.exe\" OR \"*.docx.exe\" OR \"*.xls.exe\" OR \"*.xlsx.exe\" OR \"*.ppt.exe\" OR \"*.pptx.exe\" OR \"*.rtf.exe\" OR \"*.pdf.exe\" OR \"*.txt.exe\" OR \"*\\ \\ \\ \\ \\ \\ .exe\" OR \"*______.exe\" OR \"*.doc.js\" OR \"*.docx.js\" OR \"*.xls.js\" OR \"*.xlsx.js\" OR \"*.ppt.js\" OR \"*.pptx.js\" OR \"*.rtf.js\" OR \"*.pdf.js\" OR \"*.txt.js\") AND process.command_line.text:(\"*.doc.exe*\" OR \"*.docx.exe*\" OR \"*.xls.exe*\" OR \"*.xlsx.exe*\" OR \"*.ppt.exe*\" OR \"*.pptx.exe*\" OR \"*.rtf.exe*\" OR \"*.pdf.exe*\" OR \"*.txt.exe*\" OR \"*\\ \\ \\ \\ \\ \\ .exe*\" OR \"*______.exe*\" OR \"*.doc.js*\" OR \"*.docx.js*\" OR \"*.xls.js*\" OR \"*.xlsx.js*\" OR \"*.ppt.js*\" OR \"*.pptx.js*\" OR \"*.rtf.js*\" OR \"*.pdf.js*\" OR \"*.txt.js*\"))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Initial Access", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html", "https://twitter.com/blackorbird/status/1140519090961825792"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
