{"description": "Detects the usage of \"reg.exe\" in order to dump sensitive registry hives, which includes SAM, SYSTEM and SECURITY", "author": ["Teymur Kheirkhabarov", "Endgame", "JHasenbusch", "Daniil Yugoslavskiy", "oscd.community", "frack113"], "enabled": false, "false_positives": ["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fd877b94-9bb5-4191-bb25-d79cbd93c167", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Dumping of Sensitive Hives Via Reg.EXE", "query": "(((process.executable.text:\"*\\\\reg.exe\") OR (winlog.event_data.OriginalFileName:\"reg.exe\")) AND process.command_line.text:(\"*save*\" OR \"*export*\" OR \"*\u02e2ave*\" OR \"*e\u02e3port*\") AND process.command_line.text:(\"*hklm*\" OR \"*hk\u02eam*\" OR \"*hkey_local_machine*\" OR \"*hkey_\u02eaocal_machine*\" OR \"*hkey_loca\u02ea_machine*\" OR \"*hkey_\u02eaoca\u02ea_machine*\") AND process.command_line.text:(\"*\\\\system*\" OR \"*\\\\sam*\" OR \"*\\\\security*\" OR \"*\\\\\u02e2ystem*\" OR \"*\\\\sy\u02e2tem*\" OR \"*\\\\\u02e2y\u02e2tem*\" OR \"*\\\\\u02e2am*\" OR \"*\\\\\u02e2ecurity*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "https://eqllib.readthedocs.io/en/latest/analytics/aed95fc6-5e3f-49dc-8b35-06508613f979.html", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md", "https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
