{"description": "Detects a method often used by ransomware. Which combines the \"ping\" to wait a couple of seconds and then \"del\" to delete the file in question. Its used to hide the file responsible for the initial infection for example", "author": ["Ilya Krestinichev"], "enabled": false, "false_positives": ["False positive could occur in admin scripts that execute inline"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "54786ddc-5b8a-11ed-9b6a-0242ac120002", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Ping/Del Command Combination", "query": "(process.command_line.text:(*\\ \\-n\\ * OR *\\ \\/n\\ *) AND process.command_line.text:*Nul* AND process.command_line.text:(*\\ \\/f\\ * OR *\\ \\-f\\ * OR *\\ \\/q\\ * OR *\\ \\-q\\ *) AND process.command_line.text:*ping* AND process.command_line.text:*del\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://blog.sygnia.co/kaseya-ransomware-supply-chain-attack", "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2022/06/23093553/Common-TTPs-of-the-modern-ransomware_low-res.pdf", "https://www.acronis.com/en-us/blog/posts/lockbit-ransomware/", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackbyte-exbyte-ransomware"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
