{"description": "Detects execution of \"rundll32\" with potential obfuscated ordinal calls", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "43fa5350-db63-4b8f-9a01-789a427074e1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Obfuscated Ordinal Call Via Rundll32", "query": "(((process.executable.text:\"*\\\\rundll32.exe\") OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\") OR (process.command_line.text:\"*rundll32*\")) AND process.command_line.text:(\"*#\\+*\" OR \"*#\\-*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
