{"description": "Detects suspicious process related to rundll32 based on arguments", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "73fcad2e-ff14-4c38-b11d-4172c8ac86c7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Rundll32 Script in CommandLine", "query": "(process.command_line:*rundll32* AND process.command_line:*mshtml,RunHTMLApplication* AND process.command_line:(*javascript\\:* OR *vbscript\\:*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
