{"description": "Adversaries may disable security tools to avoid possible detection of their tools and activities by uninstalling Crowdstrike Falcon", "author": ["frack113"], "enabled": false, "false_positives": ["Administrator might leverage the same command line for debugging or other purposes. However this action must be always investigated"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f0f7be61-9cf5-43be-9836-99d6ef448a18", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Uninstall Crowdstrike Falcon Sensor", "query": "(process.command_line.text:\"*\\\\WindowsSensor.exe*\" AND process.command_line.text:\"*\\ \\/uninstall*\" AND process.command_line.text:\"*\\ \\/quiet*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
