{"description":"Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe and fltmc.exe Author: Austin Songer (@austinsonger). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate usage of stordiag.exe."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"961e0abb-1b1e-4c84-a453-aafe56ad0d34","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Execution via stordiag.exe","query":"((process.parent.executable:*\\\\stordiag.exe AND process.executable:(*\\\\schtasks.exe OR *\\\\systeminfo.exe OR *\\\\fltmc.exe)) AND (NOT (process.parent.executable:(c\\:\\\\windows\\\\system32\\\\* OR c\\:\\\\windows\\\\syswow64\\\\*))))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
