{"description": "Detects suspicious use of PCHunter, a tool like Process Hacker to view and manipulate processes, kernel options and other low level stuff", "author": ["Florian Roth", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dadfece0-ea0a-c13a-6b52-d4df80a22e31", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PCHunter Usage", "query": "((process.executable.text:(*\\\\PCHunter64.exe OR *\\\\PCHunter32.exe)) OR (winlog.event_data.OriginalFileName:\"PCHunter.exe\") OR (winlog.event_data.Description:\"Epoolsoft Windows Information View Tools\") OR (winlog.event_data.Hashes:(*SHA1\\=5F1CBC3D99558307BC1250D084FA968521482025* OR *MD5\\=987B65CD9B9F4E9A1AFD8F8B48CF64A7* OR *SHA256\\=2B214BDDAAB130C274DE6204AF6DBA5AEEC7433DA99AA950022FA306421A6D32* OR *IMPHASH\\=444D210CEA1FF8112F256A4997EED7FF* OR *SHA1\\=3FB89787CB97D902780DA080545584D97FB1C2EB* OR *MD5\\=228DD0C2E6287547E26FFBD973A40F14* OR *SHA256\\=55F041BF4E78E9BFA6D4EE68BE40E496CE3A1353E1CA4306598589E19802522C* OR *IMPHASH\\=0479F44DF47CFA2EF1CCC4416A538663*)) OR (md5:(\"228dd0c2e6287547e26ffbd973a40f14\" OR \"987b65cd9b9f4e9a1afd8f8b48cf64a7\")) OR (sha1:(\"5f1cbc3d99558307bc1250d084fa968521482025\" OR \"3fb89787cb97d902780da080545584d97fb1c2eb\")) OR (sha256:(\"2b214bddaab130c274de6204af6dba5aeec7433da99aa950022fa306421a6d32\" OR \"55f041bf4e78e9bfa6d4ee68be40e496ce3a1353e1ca4306598589e19802522c\")) OR (winlog.event_data.Imphash:(\"444d210cea1ff8112f256a4997eed7ff\" OR \"0479f44df47cfa2ef1ccc4416a538663\")))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://www.xuetr.com/", "https://www.crowdstrike.com/blog/falcon-overwatch-report-finds-increase-in-ecrime/", "https://www.hexacorn.com/blog/2018/04/20/kernel-hacking-tool-you-might-have-never-heard-of-xuetr-pchunter/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
