{"description": "Detects changes to the PowerShell execution policy registry key in order to bypass signing requirements for script execution from the CommandLine", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cf2e938e-9a3e-4fe8-a347-411642b28a9f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential PowerShell Execution Policy Tampering - ProcCreation", "query": "(process.command_line.text:(*\\\\ShellIds\\\\Microsoft.PowerShell\\\\ExecutionPolicy* OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ExecutionPolicy*) AND process.command_line.text:(*Bypass* OR *RemoteSigned* OR *Unrestricted*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/de-de/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
