{"description": "Detects usage of the WMI class \"Win32_NTEventlogFile\" in a potentially suspicious way (delete, backup, change permissions, etc.) from a PowerShell script", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "caf201a9-c2ce-4a26-9c3a-2b9525413711", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious Call To Win32_NTEventlogFile Class", "query": "(process.command_line.text:\"*Win32_NTEventlogFile*\" AND process.command_line.text:(\"*.BackupEventlog\\(*\" OR \"*.ChangeSecurityPermissions\\(*\" OR \"*.ChangeSecurityPermissionsEx\\(*\" OR \"*.ClearEventLog\\(*\" OR \"*.Delete\\(*\" OR \"*.DeleteEx\\(*\" OR \"*.Rename\\(*\" OR \"*.TakeOwnerShip\\(*\" OR \"*.TakeOwnerShipEx\\(*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
