{"description": "Detects a privilege elevation attempt by coercing NTLM authentication on the Printer Spooler service", "author": ["Elastic (idea)", "Tobias Michalski (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bb76d96b-821c-47cf-944b-7ce377864492", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious NTLM Authentication on the Printer Spooler Service", "query": "(((process.executable.text:*\\\\rundll32.exe) OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND (process.command_line.text:*C\\:\\\\windows\\\\system32\\\\davclnt.dll,DavSetCookie* AND process.command_line.text:*http* AND process.command_line.text:(*spoolss* OR *srvsvc* OR *\\/print\\/pipe\\/*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Privilege Escalation", "T1212"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1212", "name": "Exploitation for Credential Access", "reference": "https://attack.mitre.org/techniques/T1212"}]}], "version": 1, "references": ["https://twitter.com/med0x2e/status/1520402518685200384", "https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
