{"description": "Detects password change for the logged-on user's via \"ksetup.exe\"", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c9783e20-4793-4164-ba96-d9ee483992c4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Logged-On User Password Change Via Ksetup.EXE", "query": "(((process.executable.text:\"*\\\\ksetup.exe\") OR (winlog.event_data.OriginalFileName:\"ksetup.exe\")) AND process.command_line.text:\"*\\ \\/ChangePassword\\ *\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-gb/windows-server/administration/windows-commands/ksetup"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
