{"description": "Detects usage of \"xor\" or \"bxor\" in combination of a \"foreach\" loop. This pattern is often found in encoded powershell code and commands as a way to avoid detection", "author": ["Teymur Kheirkhabarov (idea)", "Vasiliy Burov (rule)", "oscd.community", "Tim Shelton"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5b572dcf-254b-425c-a8c5-d9af6bea35a6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Xor Encoded PowerShell Command", "query": "(((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.exe\" OR \"pwsh.dll\"))) AND (process.command_line.text:*ForEach* AND process.command_line.text:*Xor*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
