{"description": "Detects a suspicious or uncommon parent processes of PowerShell", "author": ["Teymur Kheirkhabarov", "Harish Segar (rule)"], "enabled": false, "false_positives": ["Other scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "754ed792-634f-40ae-b3bc-e0448d33f695", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Parent Process", "query": "(((process.parent.executable.text:(*\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\services.exe OR *\\\\winword.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\visio.exe OR *\\\\outlook.exe OR *\\\\amigo.exe OR *\\\\chrome.exe OR *\\\\firefox.exe OR *\\\\iexplore.exe OR *\\\\microsoftedgecp.exe OR *\\\\microsoftedge.exe OR *\\\\browser.exe OR *\\\\vivaldi.exe OR *\\\\safari.exe OR *\\\\sqlagent.exe OR *\\\\sqlserver.exe OR *\\\\sqlservr.exe OR *\\\\w3wp.exe OR *\\\\httpd.exe OR *\\\\nginx.exe OR *\\\\php\\-cgi.exe OR *\\\\jbosssvc.exe OR *\\\\MicrosoftEdgeSH.exe)) OR (process.parent.executable.text:*tomcat*)) AND ((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (process.command_line.text:(*\\/c\\ powershell* OR *\\/c\\ pwsh*)) OR (winlog.event_data.Description:\"Windows PowerShell\") OR (Product:\"PowerShell Core 6\") OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
