{"description": "Detects the use of NPS, a port forwarding and intranet penetration proxy server", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "68d37776-61db-42f5-bf54-27e87072d17e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - NPS Tunneling Tool Execution", "query": "((process.executable.text:\"*\\\\npc.exe\") OR ((process.command_line.text:\"*\\ \\-server\\=*\" AND process.command_line.text:\"*\\ \\-vkey\\=*\" AND process.command_line.text:\"*\\ \\-password\\=*\")) OR (process.command_line.text:\"*\\ \\-config\\=npc*\") OR (((winlog.event_data.Hashes:(*MD5\\=AE8ACF66BFE3A44148964048B826D005* OR *SHA1\\=CEA49E9B9B67F3A13AD0BE1C2655293EA3C18181* OR *SHA256\\=5A456283392FFCEEEACA3D3426C306EB470304637520D72FED1CC1FEBBBD6856*)) OR (md5:\"ae8acf66bfe3a44148964048b826d005\") OR (sha1:\"cea49e9b9b67f3a13ad0be1c2655293ea3c18181\") OR (sha256:\"5a456283392ffceeeaca3d3426c306eb470304637520d72fed1cc1febbbd6856\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/ehang-io/nps"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
