{"description": "Detects potentially suspicious child processes of a ClickOnce deployment application", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "67bc0e75-c0a9-4cfc-8754-84a505b63c04", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Child Process Of ClickOnce Application", "query": "(process.parent.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Aa][Pp][Pp][Ss]\\\\\\\\2\\.0\\\\\\\\.*/ AND process.executable:(/.*\\\\\\\\[Cc][Aa][Ll][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Ll][Tt][Ee][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ee][Rr][Ff][Aa][Uu][Ll][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
