{"description": "Detects the execution of SecurityXploded Tools", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8030ac32-f63c-6811-9559-e7f457b05f4e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "SecurityXploded Tool", "query": "(Company:\"SecurityXploded\" OR process.executable:*PasswordDump.exe OR winlog.event_data.OriginalFileName:*PasswordDump.exe)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://securityxploded.com/", "https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
