{"description": "Detects the execution of Xwizard tool with specific arguments which utilized to run custom class properties.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "53d4bb30-3f36-4e8a-b078-69d36c4a79ff", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Custom Class Execution via Xwizard", "query": "(process.executable:*\\\\xwizard.exe AND process.command_line:/{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}}/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Xwizard/"], "timestamp_override": "event.ingested", "author": ["Ensar \u015eamil", "@sblmsrsn", "@oscd_initiative"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
