{"description": "Detects suspicious child processes of the Microsoft OneNote application. This may indicate an attempt to execute malicious embedded objects from a .one file.", "author": ["Tim Rauch (rule)", "Elastic (idea)"], "enabled": false, "false_positives": ["File located in the AppData folder with trusted signature"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c27515df-97a9-4162-8a60-dc0eeb51b775", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Microsoft OneNote Child Process", "query": "(process.parent.executable.text:*\\\\onenote.exe AND ((((winlog.event_data.OriginalFileName:(\"RUNDLL32.exe\" OR \"REGSVR32.exe\" OR \"bitsadmin.exe\" OR \"CertUtil.exe\" OR \"InstallUtil.exe\" OR \"schtasks.exe\" OR \"wmic.exe\" OR \"cscript.exe\" OR \"wscript.exe\" OR \"CMSTP.EXE\" OR \"Microsoft.Workflow.Compiler.exe\" OR \"RegAsm.exe\" OR \"RegSvcs.exe\" OR \"MSHTA.EXE\" OR \"Msxsl.exe\" OR \"IEExec.exe\" OR \"Cmd.Exe\" OR \"PowerShell.EXE\" OR \"HH.exe\" OR \"javaw.exe\" OR \"pcalua.exe\" OR \"curl.exe\" OR \"ScriptRunner.exe\" OR \"CertOC.exe\" OR \"WorkFolders.exe\" OR \"odbcconf.exe\" OR \"msiexec.exe\" OR \"msdt.exe\")) OR (process.executable.text:(*\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\bitsadmin.exe OR *\\\\certutil.exe OR *\\\\installutil.exe OR *\\\\schtasks.exe OR *\\\\wmic.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\cmstp.exe OR *\\\\Microsoft.Workflow.Compiler.exe OR *\\\\regasm.exe OR *\\\\regsvcs.exe OR *\\\\mshta.exe OR *\\\\msxsl.exe OR *\\\\ieexec.exe OR *\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\hh.exe OR *\\\\javaw.exe OR *\\\\pcalua.exe OR *\\\\curl.exe OR *\\\\scriptrunner.exe OR *\\\\certoc.exe OR *\\\\workfolders.exe OR *\\\\odbcconf.exe OR *\\\\msiexec.exe OR *\\\\msdt.exe)))) OR ((process.executable.text:*\\\\explorer.exe AND process.command_line.text:(*.hta* OR *.vb* OR *.wsh* OR *.js* OR *.ps* OR *.scr* OR *.pif* OR *.bat* OR *.cmd*))) OR (process.executable.text:(*\\\\AppData\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\ProgramData\\\\* OR *\\\\Windows\\\\Tasks\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\Windows\\\\System32\\\\Tasks\\\\*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1566", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}, {"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-e34e43eb5666427602ddf488b2bf3b545bd9aae81af3e6f6c7949f9652abdf18"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
