{"description": "Detects process injection using the signed Windows tool Mavinject32.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d2b0bd3f-ac9f-5186-3660-0a1f9af1c64f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "MavInject Process Injection", "query": "process.command_line:*\\ \\/INJECTRUNNING\\ *", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1055", "T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/gN3mes1s/status/941315826107510784", "https://reaqta.com/2017/12/mavinject-microsoft-injector/", "https://twitter.com/Hexacorn/status/776122138063409152"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
