{"description": "Detects invocation of Microsoft Workflow Compiler, which may permit the execution of arbitrary unsigned code.", "enabled": false, "false_positives": ["Legitimate MWC use (unlikely in modern enterprise environments)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "419dbf2b-8a9b-4bea-bf99-7544b050ec8d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Workflow Compiler", "query": "(process.executable:*\\\\Microsoft.Workflow.Compiler.exe OR (winlog.event_data.OriginalFileName:\"Microsoft.Workflow.Compiler.exe\" AND process.command_line:*.xml*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1127", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md"], "timestamp_override": "event.ingested", "author": ["Nik Seetharaman", "frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
