{"description": "Detects suspicious DACL modifications that can  be used to hide services or make them unstopable", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99cf1e02-00fb-4c0d-8375-563f978dfd37", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Service DACL Modification", "query": "(process.executable:*\\\\sc.exe AND process.command_line:*sdset* AND process.command_line:*D;;* AND process.command_line:(*;;;IU* OR *;;;SU* OR *;;;BA* OR *;;;SY* OR *;;;WD*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://www.sans.org/blog/red-team-tactics-hiding-windows-services/", "https://docs.microsoft.com/pt-br/windows/win32/secauthz/sid-strings"], "timestamp_override": "event.ingested", "author": ["Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
