{"description": "Detects REGSVR32.exe to execute DLL hosted on remote shares", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "31ffa63c-4506-7070-51ab-4bdf94d6ec40", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Regsvr32 Execution From Remote Share", "query": "((process.executable.text:*\\\\regsvr32.exe OR winlog.event_data.OriginalFileName:\"\\\\REGSVR32.EXE\") AND process.command_line.text:*\\ \\\\\\\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
