{"description": "Detects suspicious flags used by PsExec and PAExec to escalate a command line to LOCAL_SYSTEM rights", "enabled": false, "false_positives": ["Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance purposes (rare)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8834e2f7-6b4b-4f09-8906-d2276470ee23", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PsExec/PAExec Escalation to LOCAL SYSTEM", "query": "(process.command_line:*\\ \\-s\\ cmd.exe AND process.command_line:(*PsExec* OR *PAExec* OR *accepteula* OR *cmd\\ \\/c\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1587"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec", "https://www.poweradmin.com/paexec/", "https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
