{"description": "Detects the usage of binaries such as 'net', 'sc' or 'powershell' in order to stop, pause or delete critical or important Windows services such as AV, Backup, etc. As seen being used in some ransomware scripts", "author": ["Nasreddine Bencherchali (Nextron Systems)", "frack113"], "enabled": false, "false_positives": ["Administrators or tools shutting down the services due to upgrade or removal purposes. If you experience some false positive, please consider adding filters to the parent process launching this command and not removing the entry"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ce72ef99-22f1-43d4-8695-419dcb5d9330", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Windows Service Tampering", "query": "(process.command_line:(*143Svc* OR /.*[Aa][Cc][Rr][Oo][Nn][Ii][Ss]\\ [Vv][Ss][Ss]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr].*/ OR *AcronisAgent* OR *AcrSch2Svc* OR *Antivirus* OR *ARSM* OR *aswBcc* OR /.*[Aa][Vv][Aa][Ss][Tt]\\ [Bb][Uu][Ss][Ii][Nn][Ee][Ss][Ss]\\ [Cc][Oo][Nn][Ss][Oo][Ll][Ee]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Aa][Vv][Aa][Ss][Tt]\\!\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/ OR /.*[Aa][Vv][Gg]\\ [Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss].*/ OR *avgAdminClient* OR *AvgAdminServer* OR *AVP1* OR *BackupExec* OR *bedbg* OR *BITS* OR *BrokerInfrastructure* OR /.*[Cc][Ll][Ii][Ee][Nn][Tt]\\ [Aa][Gg][Ee][Nn][Tt]\\ 7\\.60.*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Bb][Rr][Oo][Ww][Ss][Ii][Nn][Gg]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Mm][Aa][Ii][Ll]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn].*/ OR /.*[Cc][Oo][Rr][Ee]\\ [Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]\\ [Ss][Ee][Rr][Vv][Ee][Rr].*/ OR *DCAgent* OR *EhttpSr* OR *ekrn* OR /.*[Ee][Nn][Tt][Ee][Rr][Pp][Rr][Ii][Ss][Ee]\\ [Cc][Ll][Ii][Ee][Nn][Tt]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR *epag* OR *EPIntegrationService* OR *EPProtectedService* OR *EPRedline* OR *EPSecurityService* OR *EPUpdateService* OR *EraserSvc11710* OR *EsgShKernel* OR *ESHASRV* OR /.*[Ff][Aa]_[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR *FirebirdGuardianDefaultInstance* OR *FirebirdServerDefaultInstance* OR *HealthTLService* OR *HISSQLFDLauncherSSHAREPOINIT* OR *hmpalertsvc* OR *HMS* OR *IISAdmin* OR *IMANSVC* OR *IMAP4Svc* OR *KAVFS* OR *KAVFSGT* OR *kavfsslp* OR *klbackupdisk* OR *klbackupflt* OR *klflt* OR *klhk* OR *KLIF* OR *klim6* OR *klkbdflt* OR *klmouflt* OR *klnagent* OR *klpd* OR *kltap* OR /.*[Kk][Ss][Dd][Ee]1\\.0\\.0.*/ OR *LogProcessorService* OR *M8EndpointAgent* OR *macmnsvc* OR *masvc* OR *MBAMService* OR *MBCloudEA* OR *MBEndpointAgent* OR *McAfeeDLPAgentService* OR *McAfeeEngineService* OR *MCAFEEEVENTPARSERSRV* OR *McAfeeFramework* OR *MCAFEETOMCATSRV530* OR *McShield* OR *McTaskManager* OR *mfefire* OR *mfemms* OR *mfevto* OR *mfevtp* OR *mfewc* OR *MMS* OR *mozyprobackup* OR *MsDtsServer* OR *MSExchange* OR *msftesq1SPROO* OR /.*[Mm][Ss][Ff][Tt][Ee][Ss][Qq][Ll]$[Pp][Rr][Oo][Dd].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Ss][Qq][Ll]_2008.*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Ss][Yy][Ss][Tt][Ee][Mm]_[Bb][Gg][Cc].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Tt][Pp][Ss].*/ OR /.*[Mm][Ss][Oo][Ll][Aa][Pp]$[Tt][Pp][Ss][Aa][Mm][Aa].*/ OR *MSOLAPSTPS* OR *MSOLAPSTPSAMA* OR *mssecflt* OR /.*[Mm][Ss][Ss][Qq]\\![Ii]\\.[Ss][Pp][Rr][Oo][Ff][Xx][Ee][Nn][Gg][Aa][Gg][Ee][Mm][Ee][Hh][Tt].*/ OR *MSSQ0SHAREPOINT* OR *MSSQ0SOPHOS* OR *MSSQL* OR *MySQL* OR *NanoServiceMain* OR *NetMsmqActivator* OR *ntrtscan* OR *ofcservice* OR /.*[Oo][Nn][Ll][Ii][Nn][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\ [Ss][Yy][Ss][Tt][Ee][Mm].*/ OR *OracleClientCache80* OR *PandaAetherAgent* OR *PccNTUpd* OR *PDVFSService* OR *POP3Svc* OR *POVFSService* OR *PSUAService* OR /.*[Qq][Uu][Ii][Cc][Kk]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR *RepairService* OR *ReportServer* OR /.*[Rr][Ee][Pp][Oo][Rr][Tt][Ss][Ee][Rr][Vv][Ee][Rr]$.*/ OR *RESvc* OR *RpcEptMapper* OR *sacsvr* OR *SamSs* OR *SAVAdminService* OR *SAVService* OR *ScSecSvc* OR *SDRSVC* OR *sense* OR *SentinelAgent* OR *SentinelHelperService* OR *SepMasterService* OR *ShMonitor* OR *Smcinst* OR *SmcService* OR *SMTPSvc* OR *SNAC* OR *SntpService* OR *Sophos* OR *SQ1SafeOLRService* OR /.*[Ss][Qq][Ll]\\ [Bb][Aa][Cc][Kk][Uu][Pp][Ss].*/ OR /.*[Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr].*/ OR *SQLAgent* OR *SQLBrowser* OR *SQLsafe* OR *SQLSERVERAGENT* OR *SQLTELEMETRY* OR *SQLWriter* OR *SSISTELEMETRY130* OR *SstpSvc* OR *svcGenericHost* OR /.*[Ss][Ww][Cc]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ww][Ii]_[Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*[Ss][Ww][Ii]_[Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*[Ss][Ww][Ii]_[Uu][Pp][Dd][Aa][Tt][Ee].*/ OR *Symantec* OR *Telemetryserver* OR *ThreatLockerService* OR *TMBMServer* OR *TmCCSF* OR *TmFilter* OR *TMiCRCScanService* OR *tmlisten* OR *TMLWCSService* OR *TmPfw* OR *TmPreFilter* OR *TmProxy* OR *TMSmartRelayService* OR *tmusa* OR /.*[Tt][Rr][Ee][Nn][Dd]\\ [Mm][Ii][Cc][Rr][Oo]\\ [Dd][Ee][Ee][Pp]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ OR *TrueKey* OR *UI0Detect* OR *UTODetect* OR *Veeam* OR /.*[Vv][Ee][Ee][Mm][Aa][Dd][Ee][Pp]\\/[Oo][Yy][Ss][Vv][Cc].*/ OR /.*[Vv][Ee][Rr][Ii][Tt][Aa][Ss]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ [Rr][Ee][Cc][Oo][Vv][Ee][Rr][Yy].*/ OR *VSApiNt* OR *VSS* OR *W3Svc* OR *wbengine* OR *WdNisSvc* OR *WeanClOudSve* OR /.*[Ww][Ee][Ee][Mm][Ss]\\ [Jj][Yy].*/ OR *WinDefend* OR *wozyprobackup* OR *WRSVC* OR /.*[Zz][Oo][Oo][Ll][Zz]\\ 2\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/) AND (((((((winlog.event_data.OriginalFileName:(/[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\\\\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/))) AND process.command_line:/.*\\ [Ss][Tt][Oo][Pp]\\ .*/)) OR ((((winlog.event_data.OriginalFileName:(/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/)) OR (process.executable:(/.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/))) AND process.command_line:(/.*[Ss][Tt][Oo][Pp]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ .*/ OR /.*[Rr][Ee][Mm][Oo][Vv][Ee]\\-[Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\ .*/))))) OR ((((winlog.event_data.OriginalFileName:/[Ss][Cc]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ss][Cc]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\ [Ss][Tt][Oo][Pp]\\ .*/ OR /.*\\ [Dd][Ee][Ll][Ee][Tt][Ee]\\ .*/ OR /.*\\ [Pp][Aa][Uu][Ss][Ee]\\ .*/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1489"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus/Genshin%20Impact%20Figure%2010.jpg", "https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/", "https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
