{"description": "Detects installation of a new shim using sdbinst.exe. A shim can be used to load malicious DLLs into applications.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "29776727-403e-0a86-8ec0-51952563ad7f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Possible Shim Database Persistence via sdbinst.exe", "query": "((process.executable.text:*\\\\sdbinst.exe AND process.command_line.text:*.sdb*) AND (NOT (process.command_line.text:*iisexpressshim.sdb*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
