{"description": "Adversaries may disable security tools to avoid possible detection of their tools and activities by removing Windows Defender Definition Files", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9719a8aa-401c-41af-8108-ced7ec9cd75c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Defender Definition Files Removed", "query": "(((process.executable:/.*\\\\\\\\[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Mm][Pp][Cc][Mm][Dd][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)) AND (process.command_line:/.*\\ \\-[Rr][Ee][Mm][Oo][Vv][Ee][Dd][Ee][Ff][Ii][Nn][Ii][Tt][Ii][Oo][Nn][Ss].*/ AND process.command_line:/.*\\ \\-[Aa][Ll][Ll].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
