{"description": "Detects execution of the Notepad++ updater (gup) from a process other than Notepad++ to download files.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Other parent processes other than notepad++ using GUP that are not currently identified"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "44143844-0631-49ab-97a0-96387d6b2d7c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Download Using Notepad++ GUP Utility", "query": "((((process.executable.text:\"*\\\\GUP.exe\") OR (winlog.event_data.OriginalFileName:\"gup.exe\")) AND (process.command_line.text:\"*\\ \\-unzipTo\\ *\" AND process.command_line.text:\"*http*\")) AND (NOT process.parent.executable.text:\"*\\\\notepad\\+\\+.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/nas_bench/status/1535322182863179776"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
