{"description": "AnyDesk Remote Desktop silent installation can be used by attacker to gain remote access.", "enabled": false, "false_positives": ["Legitimate deployment of AnyDesk"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2b1899a8-7a58-f2cf-23b5-604bc9b5e8e9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AnyDesk Silent Installation", "query": "(process.command_line:*\\-\\-install* AND process.command_line:*\\-\\-start\\-with\\-win* AND process.command_line:*\\-\\-silent*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20", "https://support.anydesk.com/Automatic_Deployment"], "timestamp_override": "event.ingested", "author": ["J\u00e1n Tren\u010dansk\u00fd"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
