{"description": "Detects events that appear when a user click on a link file with a powershell command in it", "enabled": false, "false_positives": ["Legitimate commands in .lnk files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "72551f53-c247-05e8-f57a-0335959d3922", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Hidden Powershell in Link File Pattern", "query": "(process.parent.executable:\"C\\:\\\\Windows\\\\explorer.exe\" AND process.executable:\"C\\:\\\\Windows\\\\System32\\\\cmd.exe\" AND process.command_line:*powershell* AND process.command_line:*.lnk*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.x86matthew.com/view_post?id=embed_exe_lnk"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
