{"description": "Detects the usage of \"reg.exe\" to tamper with different Windows Defender registry keys in order to disable some important features related to protection and detection", "author": ["Florian Roth (Nextron Systems)", "Swachchhanda Shrawan Poudel", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Rare legitimate use by administrators to test software (should always be investigated)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "452bce90-6fb0-43cc-97a5-affc283139b3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Windows Defender Registry Key Tampering Via Reg.EXE", "query": "((((process.executable.text:\"*\\\\reg.exe\") OR (winlog.event_data.OriginalFileName:\"reg.exe\")) AND process.command_line.text:(\"*SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\*\" OR \"*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\ Security\\ Center*\" OR \"*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\*\")) AND (((process.command_line.text:\"*\\ add\\ *\" AND process.command_line.text:\"*d\\ 0*\" AND process.command_line.text:(\"*DisallowExploitProtectionOverride*\" OR \"*EnableControlledFolderAccess*\" OR \"*MpEnablePus*\" OR \"*PUAProtection*\" OR \"*SpynetReporting*\" OR \"*SubmitSamplesConsent*\" OR \"*TamperProtection*\"))) OR ((process.command_line.text:\"*\\ add\\ *\" AND process.command_line.text:\"*d\\ 1*\" AND process.command_line.text:(\"*DisableAntiSpyware*\" OR \"*DisableAntiSpywareRealtimeProtection*\" OR \"*DisableAntiVirus*\" OR \"*DisableArchiveScanning*\" OR \"*DisableBehaviorMonitoring*\" OR \"*DisableBlockAtFirstSeen*\" OR \"*DisableConfig*\" OR \"*DisableEnhancedNotifications*\" OR \"*DisableIntrusionPreventionSystem*\" OR \"*DisableIOAVProtection*\" OR \"*DisableOnAccessProtection*\" OR \"*DisablePrivacyMode*\" OR \"*DisableRealtimeMonitoring*\" OR \"*DisableRoutinelyTakingAction*\" OR \"*DisableScanOnRealtimeEnable*\" OR \"*DisableScriptScanning*\" OR \"*Notification_Suppress*\" OR \"*SignatureDisableUpdateOnStartupWithoutEngine*\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/", "https://github.com/swagkarna/Defeat-Defender-V1.2.0", "https://www.elevenforum.com/t/video-guide-how-to-completely-disable-microsoft-defender-antivirus.14608/page-2"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
