{"description": "Detects calls to \"SyncInvoke\" that is part of the \"CL_Invocation.ps1\" script to proxy execution using \"System.Diagnostics.Process\"", "author": ["Nasreddine Bencherchali (Nextron Systems)", "oscd.community", "Natalia Shornikova"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a0459f02-ac51-4c09-b511-b8c9203fc429", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Process Execution Proxy Via CL_Invocation.ps1", "query": "(event.category:process AND process.command_line:/.*[Ss][Yy][Nn][Cc][Ii][Nn][Vv][Oo][Kk][Ee]\\ .*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1216", "name": "System Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/", "https://twitter.com/bohops/status/948061991012327424"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
