{"description": "Detects usage of \"cdb.exe\" to launch 64-bit shellcode or arbitrary processes or commands from a debugger script file", "author": ["Beyu Denis", "oscd.community", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate use of debugging tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ae451ac3-cb04-9c80-e5f1-8cd0307879f2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WinDbg/CDB LOLBIN Usage", "query": "(((process.executable.text:*\\\\cdb.exe) OR (winlog.event_data.OriginalFileName:\"CDB.Exe\")) AND process.command_line.text:(*\\ \\-c\\ * OR *\\ \\-cf\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1106", "T1127", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Cdb/", "https://web.archive.org/web/20170715043507/http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html", "https://twitter.com/nas_bench/status/1534957360032120833"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
