{"description": "Detecting Emotet DLL loading by looking for rundll32.exe processes with command lines ending in ,RunDLL or ,Control_RunDLL", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5c1c2e91-057a-87ae-c0af-fb933b683499", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Emotet RunDLL32 Process Creation", "query": "(((process.executable:*\\\\rundll32.exe AND process.command_line:(*,RunDLL OR *,Control_RunDLL)) AND (NOT (process.parent.executable:*\\\\tracker.exe))) AND (NOT (process.command_line:(*.dll,Control_RunDLL OR *.dll\\\",Control_RunDLL OR *.dll',Control_RunDLL))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://paste.cryptolaemus.com/emotet/2020/12/22/emotet-malware-IoCs_12-22-20.html", "https://cyber.wtf/2021/11/15/guess-whos-back/"], "timestamp_override": "event.ingested", "author": ["FPT.EagleEye"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
