{"description": "This rule detects suspicious processes with parent images located in the C:\\Users\\Public folder", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "583f421b-8303-0bf6-7c91-d6c34a4f1f95", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Parent in Public Folder Suspicious Process", "query": "(process.parent.executable:C\\:\\\\Users\\\\Public\\\\* AND process.command_line:(*powershell* OR *cmd.exe\\ \\/c\\ * OR *cmd\\ \\/c\\ * OR *wscript.exe* OR *cscript.exe* OR *bitsadmin* OR *certutil* OR *mshta.exe*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/blackbyte-ransomware/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
