{"description": "Detects net use command combo which executes files from WebDAV server; seen in malicious LNK files", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f0507c0f-a3a2-40f5-acc6-7f543c334993", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Net Use Command Combo", "query": "(process.executable.text:*\\\\cmd.exe* AND process.command_line.text:*\\ net\\ use\\ http* AND process.command_line.text:*&\\ start\\ \\/b\\ * AND process.command_line.text:*\\\\DavWWWRoot\\\\* AND process.command_line.text:(*.exe\\ * OR *.dll\\ * OR *.bat\\ * OR *.vbs\\ * OR *.ps1\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://twitter.com/ShadowChasing1/status/1552595370961944576", "https://www.virustotal.com/gui/file/a63376ee1dba76361df73338928e528ca5b20171ea74c24581605366dcaa0104/behavior"], "timestamp_override": "event.ingested", "author": ["pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
