{"description":"Detects the use of Windows hacktools based on their import hash (imphash) even if the files have been renamed Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of one of these tools"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"473e0282-ffd1-2214-60b3-78380750dbf4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Windows Hacktool Imphash","query":"(winlog.event_data.Imphash:(\"bcca3c247b619dcd13c8cdff5f123932\" OR \"3a19059bd7688cb88e70005f18efc439\" OR \"9da6d5d77be11712527dcab86df449a3\" OR \"a6e01bc1ab89f8d91d9eab72032aae88\" OR \"d21bbc50dcc169d7b4d0f01962793154\" OR \"9528a0e91e28fbb88ad433feabca2456\" OR \"4c1b52a19748428e51b14c278d0f58e3\" OR \"725bb81dc24214f6ecacc0cfb36ad30d\" OR \"672b13f4a0b6f27d29065123fe882dfc\" OR \"0c106686a31bfe2ba931ae1cf6e9dbc6\" OR \"23867a89c2b8fc733be6cf5ef902f2d1\" OR \"9fb060c2977a9d9b782440b98d410c3e\" OR \"b18a1401ff8f444056d29450fbc0a6ce\" OR \"13f08707f759af6003837a150a371ba1\" OR \"749a7bb1f0b4c4455949c0b2bf7f9e9f\" OR \"94cb940a1a6b65bed4d5a8f849ce9793\" OR \"1781f06048a7e58b323f0b9259be798b\" OR \"cb567f9498452721d77a451374955f5f\" OR \"730073214094cd328547bf1f72289752\" OR \"6eefd92bffbfb27f378b81c09ca96786\" OR \"ac615fb1d93576fa3c26077a619c9144\") OR winlog.event_data.Hashes:(*bcca3c247b619dcd13c8cdff5f123932* OR *3a19059bd7688cb88e70005f18efc439* OR *9da6d5d77be11712527dcab86df449a3* OR *a6e01bc1ab89f8d91d9eab72032aae88* OR *d21bbc50dcc169d7b4d0f01962793154* OR *9528a0e91e28fbb88ad433feabca2456* OR *4c1b52a19748428e51b14c278d0f58e3* OR *725bb81dc24214f6ecacc0cfb36ad30d* OR *672b13f4a0b6f27d29065123fe882dfc* OR *0c106686a31bfe2ba931ae1cf6e9dbc6* OR *23867a89c2b8fc733be6cf5ef902f2d1* OR *9fb060c2977a9d9b782440b98d410c3e* OR *b18a1401ff8f444056d29450fbc0a6ce* OR *13f08707f759af6003837a150a371ba1* OR *749a7bb1f0b4c4455949c0b2bf7f9e9f* OR *94cb940a1a6b65bed4d5a8f849ce9793* OR *1781f06048a7e58b323f0b9259be798b* OR *cb567f9498452721d77a451374955f5f* OR *730073214094cd328547bf1f72289752* OR *6eefd92bffbfb27f378b81c09ca96786* OR *ac615fb1d93576fa3c26077a619c9144*))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
