{"description": "Detects PowerShell Strings applied to rundll as seen in PowerShdll.dll", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a7d411ac-dd88-479e-caac-950202553b15", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Detection of PowerShell Execution via DLL", "query": "((process.executable:*\\\\rundll32.exe OR winlog.event_data.Description:*Windows\\-Hostprozess\\ \\(Rundll32\\)*) AND process.command_line:(*Default.GetString* OR *FromBase64String*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/p3nt4/PowerShdll/blob/master/README.md"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
