{"description": "Detects the use of IOX - a tool for port forwarding and intranet proxy purposes", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d7654f02-e04b-4934-9838-65c46f187ebc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA- IOX Tunneling Tool Execution", "query": "((process.executable.text:\"*\\\\iox.exe\") OR (process.command_line.text:(\"*.exe\\ fwd\\ \\-l\\ *\" OR \"*.exe\\ fwd\\ \\-r\\ *\" OR \"*.exe\\ proxy\\ \\-l\\ *\" OR \"*.exe\\ proxy\\ \\-r\\ *\")) OR (winlog.event_data.Hashes:(*MD5\\=9DB2D314DD3F704A02051EF5EA210993* OR *SHA1\\=039130337E28A6623ECF9A0A3DA7D92C5964D8DD* OR *SHA256\\=C6CF82919B809967D9D90EA73772A8AA1C1EB3BC59252D977500F64F1A0D6731*)) OR (md5:\"9db2d314dd3f704a02051ef5ea210993\") OR (sha1:\"039130337e28a6623ecf9a0a3da7d92c5964d8dd\") OR (sha256:\"c6cf82919b809967d9d90ea73772a8aa1c1eb3bc59252d977500f64f1a0d6731\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/EddieIvan01/iox"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
