{"description": "Detects PowerShell script execution via input stream redirect", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9c7a51cf-9e68-3a5c-ba5b-6992bf4f91a5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Run PowerShell Script from Redirected Input Stream", "query": "(process.executable:*\\\\powershell.exe AND process.command_line:/\\s-\\s*</)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Powershell.yml", "https://twitter.com/Moriarty_Meng/status/984380793383370752"], "timestamp_override": "event.ingested", "author": ["Moriarty Meng (idea)", "Anton Kutepov (rule)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
