{"description": "Detect filter driver unloading activity via fltmc.exe", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4931188c-178e-4ee7-a348-39e8a7a56821", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Filter Driver Unloaded Via Fltmc.EXE", "query": "((((process.executable.text:\"*\\\\fltMC.exe\") OR (winlog.event_data.OriginalFileName:\"fltMC.exe\")) AND process.command_line.text:\"*unload*\") AND (NOT process.command_line.text:\"*unload\\ rtp_filesystem_filter\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070", "T1562", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon", "https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
