{"description": "Detects usage of the Get-ADUser cmdlet to collect user information and output it to a file", "enabled": false, "false_positives": ["Legitimate admin scripts may use the same technique, it's better to exclude specific computers or users who execute these commands or scripts often"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c2993223-6da8-4b1a-88ee-668b8bf315e9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "User Discovery And Export Via Get-ADUser Cmdlet", "query": "((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) OR winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\")) AND (process.command_line.text:*Get\\-ADUser\\ * AND process.command_line.text:*\\ \\-Filter\\ \\*) AND process.command_line.text:(*\\ >\\ * OR *Out\\-File* OR *Set\\-Content* OR *Add\\-Content*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1033"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1033", "name": "System Owner/User Discovery", "reference": "https://attack.mitre.org/techniques/T1033"}]}], "version": 1, "references": ["http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html", "https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
