{"description": "Initial execution of malicious document calls wmic to execute the file with regsvr32", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "04f5363a-6bca-42ff-be70-0d28bf629ead", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Office Applications Spawning Wmi Cli", "query": "((process.executable:*\\\\wbem\\\\WMIC.exe OR process.command_line:*wmic\\ *) AND process.parent.executable:(\"\\\\winword.exe\" OR \"\\\\excel.exe\" OR \"\\\\powerpnt.exe\" OR \"\\\\msaccess.exe\" OR \"\\\\mspub.exe\" OR \"\\\\eqnedt32.exe\" OR \"\\\\visio.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1047", "T1204", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/", "https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml"], "timestamp_override": "event.ingested", "author": ["Vadim Khrykov (ThreatIntel)", "Cyb3rEng (Rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
