{"description": "Detects usage of bitsadmin downloading a file with a suspicious extension", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5b80a791-ad9b-4b75-bcc1-ad4e1e89c200", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File With Suspicious Extension Downloaded Via Bitsadmin", "query": "(((process.executable:/.*\\\\\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:(/.*\\.7[Zz].*/ OR /.*\\.[Aa][Ss][Aa][Xx].*/ OR /.*\\.[Aa][Ss][Hh][Xx].*/ OR /.*\\.[Aa][Ss][Mm][Xx].*/ OR /.*\\.[Aa][Ss][Pp].*/ OR /.*\\.[Aa][Ss][Pp][Xx].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Ff][Mm].*/ OR /.*\\.[Cc][Gg][Ii].*/ OR /.*\\.[Cc][Hh][Mm].*/ OR /.*\\.[Cc][Mm][Dd].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Gg][Ii][Ff].*/ OR /.*\\.[Jj][Pp][Ee][Gg].*/ OR /.*\\.[Jj][Pp][Gg].*/ OR /.*\\.[Jj][Ss][Pp].*/ OR /.*\\.[Jj][Ss][Pp][Xx].*/ OR /.*\\.[Ll][Oo][Gg].*/ OR /.*\\.[Pp][Nn][Gg].*/ OR /.*\\.[Pp][Ss]1.*/ OR /.*\\.[Pp][Ss][Mm]1.*/ OR /.*\\.[Rr][Aa][Rr].*/ OR /.*\\.[Ss][Cc][Ff].*/ OR /.*\\.[Ss][Cc][Tt].*/ OR /.*\\.[Tt][Xx][Tt].*/ OR /.*\\.[Vv][Bb][Ee].*/ OR /.*\\.[Vv][Bb][Ss].*/ OR /.*\\.[Ww][Aa][Rr].*/ OR /.*\\.[Ww][Ss][Ff].*/ OR /.*\\.[Ww][Ss][Hh].*/ OR /.*\\.[Xx][Ll][Ll].*/ OR /.*\\.[Zz][Ii][Pp].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
