{"description": "Detects execution of Net.exe, whether suspicious or benign.", "enabled": false, "false_positives": ["Will need to be tuned. If using Splunk, I recommend | stats count by Computer,CommandLine following the search for easy hunting by computer/CommandLine."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "37d352dd-7bb6-1478-3586-658a7f2ab814", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Net.exe Execution", "query": "(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:(*\\ group* OR *\\ localgroup* OR *\\ user* OR *\\ view* OR *\\ share* OR *\\ accounts* OR *\\ stop\\ * OR *\\ start*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Lateral Movement", "T1007", "T1018", "T1021", "T1049", "T1069", "T1069", "T1087", "T1087", "T1135", "T1201"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1007", "name": "System Service Discovery", "reference": "https://attack.mitre.org/techniques/T1007"}, {"id": "T1018", "name": "Remote System Discovery", "reference": "https://attack.mitre.org/techniques/T1018"}, {"id": "T1049", "name": "System Network Connections Discovery", "reference": "https://attack.mitre.org/techniques/T1049"}, {"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1135", "name": "Network Share Discovery", "reference": "https://attack.mitre.org/techniques/T1135"}, {"id": "T1201", "name": "Password Policy Discovery", "reference": "https://attack.mitre.org/techniques/T1201"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://pentest.blog/windows-privilege-escalation-methods-for-pentesters/", "https://eqllib.readthedocs.io/en/latest/analytics/4d2e7fc1-af0b-4915-89aa-03d25ba7805e.html", "https://eqllib.readthedocs.io/en/latest/analytics/e61f557c-a9d0-4c25-ab5b-bbc46bb24deb.html", "https://eqllib.readthedocs.io/en/latest/analytics/9b3dd402-891c-4c4d-a662-28947168ce61.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1007/T1007.md#atomic-test-2---system-service-discovery---netexe"], "timestamp_override": "event.ingested", "author": ["Michael Haag", "Mark Woan (improvements)", "James Pemberton / @4A616D6573 / oscd.community (improvements)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
