{"description": "Detects execution of the Notepad++ updater (gup) from a process other than Notepad++ to download files.", "enabled": false, "false_positives": ["Other parent processes other than notepad++ using GUP that are not currently identified"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "879047fd-1fe0-d717-22e6-c9bde4fb0df0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Download Files Using Notepad++ GUP Utility", "query": "(((process.executable:*\\\\GUP.exe OR winlog.event_data.OriginalFileName:\"gup.exe\") AND (process.command_line:*\\ \\-unzipTo\\ * AND process.command_line:*http*)) AND (NOT (process.parent.executable:*\\\\notepad\\+\\+.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/nas_bench/status/1535322182863179776"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
