{"description": "Detects possible search for office tokens via CLI by looking for the string \"eyJ0eX\". This string is used as an anchor to look for the start of the JWT token used by office and similar apps.", "enabled": false, "false_positives": ["Legitimate command-lines containing the string mentioned in the command-line"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6d3a3952-6530-44a3-8554-cf17c116c615", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Office Token Search Via CLI", "query": "process.command_line.text:(*eyJ0eXAiOi* OR *\\ eyJ0eX* OR *\\ \\\"eyJ0eX\\\"* OR *\\ 'eyJ0eX'*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1528"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1528", "name": "Steal Application Access Token", "reference": "https://attack.mitre.org/techniques/T1528"}]}], "version": 1, "references": ["https://mrd0x.com/stealing-tokens-from-office-applications/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
