{"description": "Detects attempts to remove windows defender configuration using the 'MpPreference' cmdlet", "enabled": false, "false_positives": ["Legitimate PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "938e1abc-f668-35e3-49c8-9a27f7bd9ba8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tamper Windows Defender Remove-MpPreference", "query": "(process.command_line.text:*Remove\\-MpPreference* AND process.command_line.text:(*\\-ControlledFolderAccessProtectedFolders\\ * OR *\\-AttackSurfaceReductionRules_Ids\\ * OR *\\-AttackSurfaceReductionRules_Actions\\ * OR *\\-CheckForSignaturesBeforeRunningScan\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/windows-10-controlled-folder-access-event-search/ba-p/2326088"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
