{"description": "Detects a suspicious process pattern which could be a sign of an exploited Serv-U service", "enabled": false, "false_positives": ["Legitimate uses in which users or programs use the SSH service of Serv-U for remote command execution"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "58f4ea09-0fc2-4520-ba18-b85c540b0eaf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Serv-U Process Pattern", "query": "(process.parent.executable:*\\\\Serv\\-U.exe AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\schtasks.exe OR *\\\\regsvr32.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\msiexec.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
