{"description": "Detects calls to \"LoadAssemblyFromPath\" or \"LoadAssemblyFromNS\" that are part of the \"CL_LoadAssembly.ps1\" script. This can be abused to load different assemblies and bypass App locker controls.", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c57872c7-614f-4d7f-a40d-b78c8df2d30d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Assembly Loading Via CL_LoadAssembly.ps1", "query": "(event.category:process AND process.command_line:(/.*[Ll][Oo][Aa][Dd][Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy][Ff][Rr][Oo][Mm][Pp][Aa][Tt][Hh]\\ .*/ OR /.*[Ll][Oo][Aa][Dd][Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy][Ff][Rr][Oo][Mm][Nn][Ss]\\ .*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1216", "name": "System Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://bohops.com/2018/01/07/executing-commands-and-bypassing-applocker-with-powershell-diagnostic-scripts/", "https://lolbas-project.github.io/lolbas/Scripts/CL_LoadAssembly/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
