{"description": "Shadow Copies deletion using operating systems utilities", "enabled": false, "false_positives": ["Legitimate Administrator deletes Shadow Copies using operating systems utilities for legitimate reason", "LANDesk LDClient Ivanti-PSModule (PS EncodedCommand)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "31e21730-238c-d45d-a099-b083d45ebea1", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Shadow Copies Deletion Using Operating Systems Utilities", "query": "((process.executable:(*\\\\powershell.exe OR *\\\\wmic.exe OR *\\\\vssadmin.exe OR *\\\\diskshadow.exe) AND process.command_line:*shadow* AND process.command_line:*delete*) OR (process.executable:*\\\\wbadmin.exe AND process.command_line:*delete* AND process.command_line:*catalog* AND process.command_line:*quiet*) OR (process.executable:*\\\\vssadmin.exe AND process.command_line:*resize* AND process.command_line:*shadowstorage* AND process.command_line:*unbounded*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1070", "T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}, {"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "https://blog.talosintelligence.com/2017/05/wannacry.html", "https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/", "https://www.bleepingcomputer.com/news/security/why-everyone-should-disable-vssadmin-exe-now/", "https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100", "https://github.com/Neo23x0/Raccine#the-process", "https://github.com/Neo23x0/Raccine/blob/main/yara/gen_ransomware_command_lines.yar", "https://redcanary.com/blog/intelligence-insights-october-2021/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Michael Haag", "Teymur Kheirkhabarov", "Daniil Yugoslavskiy", "oscd.community", "Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
