{"description": "Detects suspicious Plink tunnel remote forarding to a local port", "enabled": false, "false_positives": ["Administrative activity using a remote port forwarding to a local port"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "93510b8a-ff35-6197-3189-7e72ce8da7de", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Plink Remote Forwarding", "query": "(winlog.event_data.Description:\"Command\\-line\\ SSH,\\ Telnet,\\ and\\ Rlogin\\ client\" AND process.command_line.text:*\\ \\-R\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1572"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://www.real-sec.com/2019/04/bypassing-network-restrictions-through-rdp-tunneling/", "https://medium.com/@informationsecurity/remote-ssh-tunneling-with-plink-exe-7831072b3d7d"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
