{"description": "Detects execution of RClone utility for exfiltration as used by various ransomwares strains like REvil, Conti, FiveHands, etc", "enabled": false, "false_positives": ["Legitimate RClone use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e37db05d-d1f9-49c8-b464-cee1a4b11638", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rclone Execution via Command Line or PowerShell", "query": "((process.command_line:*\\-\\-config\\ * AND process.command_line:*\\-\\-no\\-check\\-certificate\\ * AND process.command_line:*\\ copy\\ *) OR (process.command_line:(*pass* OR *user* OR *copy* OR *sync* OR *config* OR *lsd* OR *remote* OR *ls* OR *mega* OR *pcloud* OR *ftp* OR *ignore\\-existing* OR *auto\\-confirm* OR *transfers* OR *multi\\-thread\\-streams* OR *no\\-check\\-certificate\\ *) AND (winlog.event_data.Description:\"Rsync\\ for\\ cloud\\ storage\" OR (process.executable:*\\\\rclone.exe AND process.parent.executable:(*\\\\PowerShell.exe OR *\\\\cmd.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/", "https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware", "https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a", "https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone", "https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj", "Sittikorn S", "Aaron Greetham (@beardofbinary) - NCC Group"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
