{"description": "Detects the execution of format.com with a suspicious filesystem selection that could indicate a defense evasion activity in which format.com is used to load malicious DLL files or other programs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40269a26-8a40-122b-8331-58688f6d41f3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Format.com FileSystem LOLBIN", "query": "((process.executable:*\\\\format.com AND process.command_line:*\\/fs\\:*) AND (NOT ((process.command_line:(*\\/fs\\:FAT* OR *\\/fs\\:exFAT* OR *\\/fs\\:NTFS* OR *\\/fs\\:UDF* OR *\\/fs\\:ReFS*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/0gtweet/status/1477925112561209344", "https://twitter.com/wdormann/status/1478011052130459653?s=20"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
