{"description": "Detects execution of Netcat. Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network", "author": ["frack113", "Florian Roth"], "enabled": false, "false_positives": ["Legitimate ncat use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d57a7126-d757-7edd-88ce-7cb4299790d5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Netcat Suspicious Execution", "query": "((process.executable.text:(*\\\\nc.exe OR *\\\\ncat.exe OR *\\\\netcat.exe)) OR (process.command_line.text:(*\\ \\-lvp\\ * OR *\\ \\-lvnp* OR *\\ \\-l\\ \\-v\\ \\-p\\ * OR *\\ \\-lv\\ \\-p\\ * OR *\\ \\-l\\ \\-\\-proxy\\-type\\ http\\ * OR *\\ \\-vnl\\ \\-\\-exec\\ * OR *\\ \\-vnl\\ \\-e\\ * OR *\\ \\-\\-lua\\-exec\\ * OR *\\ \\-\\-sh\\-exec\\ *)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1095"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://nmap.org/ncat/", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md", "https://www.revshells.com/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
