{"description": "Detects when a user bypasses Defender by renaming a tool to dump64.exe and placing it in a Visual Studio folder", "author": ["Austin Songer @austinsonger", "Florian Roth"], "enabled": false, "false_positives": ["Dump64.exe in other folders than the excluded one"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "129966c9-de17-4334-a123-8b58172e664d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Dump64.exe Execution", "query": "(((process.executable.text:\"*\\\\dump64.exe\" AND (NOT process.executable.text:\"*\\\\Installer\\\\Feedback\\\\dump64.exe*\"))) OR ((process.executable.text:\"*\\\\dump64.exe\" AND process.command_line.text:(\"*\\ \\-ma\\ *\" OR \"*accepteula*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1460597833917251595"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
