{"description": "Detects potential \"ShellDispatch.dll\" functionality abuse to execute arbitrary binaries via \"ShellExecute\"", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "82343930-652f-43f5-ab70-2ee9fdd6d5e9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential ShellDispatch.DLL Functionality Abuse", "query": "(((process.executable.text:\"*\\\\rundll32.exe\") OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND process.command_line.text:\"*RunDll_ShellExecuteW*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.hexacorn.com/blog/2023/06/07/this-lolbin-doesnt-exist/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
