{"description": "WinPEAS is a script that search for possible paths to escalate privileges on Windows hosts. The checks are explained on book.hacktricks.xyz", "author": ["Georg Lauenstein (sure[secure])"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "98b53e78-ebaf-46f8-be06-421aafd176d9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - winPEAS Execution", "query": "((winlog.event_data.OriginalFileName:\"winPEAS.exe\") OR (process.executable.text:(\"*\\\\winPEASany.exe\" OR \"*\\\\winPEASany_ofs.exe\" OR \"*\\\\winPEASx64.exe\" OR \"*\\\\winPEASx64_ofs.exe\" OR \"*\\\\winPEASx86.exe\" OR \"*\\\\winPEASx86_ofs.exe\")) OR (process.command_line.text:(\"*\\ applicationsinfo*\" OR \"*\\ browserinfo*\" OR \"*\\ eventsinfo*\" OR \"*\\ fileanalysis*\" OR \"*\\ filesinfo*\" OR \"*\\ processinfo*\" OR \"*\\ servicesinfo*\" OR \"*\\ windowscreds*\")) OR (process.command_line.text:\"*https\\:\\/\\/github.com\\/carlospolop\\/PEASS\\-ng\\/releases\\/latest\\/download\\/*\") OR (process.parent.command_line.text:\"*\\ \\-linpeas\") OR (process.command_line.text:\"*\\ \\-linpeas\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1046", "T1082", "T1087"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/carlospolop/PEASS-ng", "https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
