{"description": "Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones of a domain. DNS zones used to host the DNS records for a particular domain.", "author": ["@gott_cyber"], "enabled": false, "false_positives": ["Legitimate administration use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b6457d63-d2a2-4e29-859d-4e7affc153d1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Discovery Activity Via Dnscmd.EXE", "query": "(process.executable.text:\"*\\\\dnscmd.exe\" AND process.command_line.text:(\"*\\/enumrecords*\" OR \"*\\/enumzones*\" OR \"*\\/ZonePrint*\" OR \"*\\/info*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1543"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd", "https://docs.microsoft.com/en-us/azure/dns/dns-zones-records", "https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
