{"description": "Detects the use of rcedit to potentially alter executable PE metadata properties, which could conceal efforts to rename system utilities for defense evasion.", "author": ["Micah Babinski"], "enabled": false, "false_positives": ["Legitimate use of the tool by administrators or users to update metadata of a binary"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0c92f2e6-f08f-4b73-9216-ecb0ca634689", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PUA - Potential PE Metadata Tamper Using Rcedit", "query": "(((process.executable.text:(\"*\\\\rcedit\\-x64.exe\" OR \"*\\\\rcedit\\-x86.exe\")) OR (winlog.event_data.Description:\"Edit resources of exe\") OR (Product:\"rcedit\")) AND process.command_line.text:\"*\\-\\-set\\-*\" AND process.command_line.text:(\"*OriginalFileName*\" OR \"*CompanyName*\" OR \"*FileDescription*\" OR \"*ProductName*\" OR \"*ProductVersion*\" OR \"*LegalCopyright*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027", "T1027", "T1036", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://security.stackexchange.com/questions/210843/is-it-possible-to-change-original-filename-of-an-exe", "https://www.virustotal.com/gui/file/02e8e8c5d430d8b768980f517b62d7792d690982b9ba0f7e04163cbc1a6e7915", "https://github.com/electron/rcedit"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
