{"description": "Detects usage of findstr to identify and execute a lnk file as seen within the HHS redirect attack", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "33339be3-148b-4e16-af56-ad16ec6c7e7b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Findstr Launching .lnk File", "query": "(process.executable:*\\\\findstr.exe AND process.command_line:*.lnk)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027", "T1036", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://www.bleepingcomputer.com/news/security/hhsgov-open-redirect-used-by-coronavirus-phishing-to-spread-malware/"], "timestamp_override": "event.ingested", "author": ["Trent Liffick"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
