{"description": "Detects suspicious command line in which a user gets added to the local Remote Desktop Users group", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2a17f981-0bb8-9aac-f369-bf003a285337", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Add User to Remote Desktop Users Group", "query": "(((process.command_line.text:*localgroup\\ * AND process.command_line.text:*\\ \\/add*) OR (process.command_line.text:*Add\\-LocalGroupMember\\ * AND process.command_line.text:*\\ \\-Group\\ *)) AND process.command_line.text:(*Remote\\ Desktop\\ Users* OR *Utilisateurs\\ du\\ Bureau\\ \u00e0\\ distance* OR *Usuarios\\ de\\ escritorio\\ remoto*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1133", "T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1133", "name": "External Remote Services", "reference": "https://attack.mitre.org/techniques/T1133"}, {"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/11/16/evolving-trends-in-iranian-threat-actor-activity-mstic-presentation-at-cyberwarcon-2021/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
