{"description": "Detects word documents leveraging the \"ms-msdt\" handler or the \"msdt.exe\" binary to execute arbitrary commands", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "258fc8ce-8352-443a-9120-8a11e4857fa5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execute Arbitrary Commands Using MSDT.EXE", "query": "((process.parent.executable:*\\\\WINWORD.exe AND process.executable:*\\\\msdt.exe) OR ((process.executable:*\\\\msdt.exe OR winlog.event_data.OriginalFileName:\"msdt.exe\") AND process.command_line:*IT_BrowseForFile\\=*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/nao_sec/status/1530196847679401984", "https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
