{"description": "Detects a Windows program executable started from a suspicious folder", "author": ["Florian Roth (Nextron Systems)", "Patrick Bareiss", "Anton Kutepov", "oscd.community", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Exotic software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e4a6b256-3e47-40fc-89d2-7a477edd6915", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "System File Execution Location Anomaly", "query": "(event.category:process AND process.executable:(/.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ii][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Tt][Ii][Mm][Ee][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Mm][Aa][Rr][Tt][Ss][Cc][Rr][Ee][Ee][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Dd][Ii][Oo][Dd][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ll][Aa][Nn][Ee][Xx][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Aa][Ss][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Tt][Bb][Rr][Oo][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Bb][Cc][Dd][Ee][Dd][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ee][Rr][Tt][Rr][Ee][Qq]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Ss][Tt][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Nn][Ss][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ee][Ff][Rr][Aa][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Ss][Tt]3[Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Vv][Ee][Nn][Tt][Vv][Ww][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Vv][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Oo][Gg][Oo][Nn][Uu][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ww][Mm]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ss][Aa][Ii][Ss][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Tt][Oo][Ss][Kk][Rr][Nn][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Mm][Pp][Rr][Oo][Vv][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ff][Rr][Gg][Uu][Ii]\\.[Ee][Xx][Ee]/) AND (NOT ((((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/)) OR (process.executable:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\7\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\\\7\\-[Pp][Rr][Ee][Vv][Ii][Ee][Ww]\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Cc][Oo][Rr][Pp][Oo][Rr][Aa][Tt][Ii][Oo][Nn][Ii][Ii]\\.[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Ss][Uu][Bb][Ss][Yy][Ss][Tt][Ee][Mm][Ff][Oo][Rr][Ll][Ii][Nn][Uu][Xx].*/ AND process.executable:/.*\\\\[Ww][Ss][Ll]\\.[Ee][Xx][Ee]/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/GelosSnake/status/934900723426439170", "https://asec.ahnlab.com/en/39828/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
