{"description": "Detects uncommon \"conhost\" child processes. This could be a sign of \"conhost\" usage as a LOLBIN or potential process injection activity.", "author": ["omkar72"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7dc2dedd-7603-461a-bc13-15803d132355", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Uncommon Child Process Of Conhost.EXE", "query": "(process.parent.executable:/.*\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND (NOT ((Provider_Name:/[Ss][Yy][Ss][Tt][Ee][Mm][Tt][Rr][Aa][Cc][Ee][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]/) OR ((Provider_Name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Kk][Ee][Rr][Nn][Ee][Ll]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]/ AND process.executable:/.*\\\\\\\\[Gg][Ii][Tt]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:(/.*\\ [Ss][Hh][Oo][Ww]\\ \\-\\-[Tt][Ee][Xx][Tt][Cc][Oo][Nn][Vv]\\ .*/ OR /.*\\ [Cc][Aa][Tt]\\-[Ff][Ii][Ll][Ee]\\ \\-[Ss]\\ .*/))) OR ((process.parent.command_line:/.*[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ 0[Xx]4.*/ AND process.command_line:(/.*\\ [Ss][Hh][Oo][Ww]\\ \\-\\-[Tt][Ee][Xx][Tt][Cc][Oo][Nn][Vv]\\ .*/ OR /.*\\ [Cc][Aa][Tt]\\-[Ff][Ii][Ll][Ee]\\ \\-[Ss]\\ .*/))) OR ((Provider_Name:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Kk][Ee][Rr][Nn][Ee][Ll]\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss]/ AND process.parent.command_line:(/.*\\ [Cc][Aa][Tt]\\-[Ff][Ii][Ll][Ee]\\ \\-[Ss]\\ .*/ OR /.*[Ss][Hh][Oo][Ww]\\ \\-\\-[Tt][Ee][Xx][Tt][Cc][Oo][Nn][Vv].*/) AND process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR ((process.parent.command_line:(/\\\\\\\\\\\\\\\\\\\\\\\\?\\\\\\\\?\\\\\\\\\\\\\\\\[Cc]\\:\\\\\\\\\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ 0[Xx]4/ OR /\\\\\\\\\\\\\\\\\\\\\\\\?\\\\\\\\?\\\\\\\\\\\\\\\\[Cc]\\:\\\\\\\\\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ 0[Xx][Ff][Ff][Ff][Ff][Ff][Ff][Ff][Ff]\\ \\-[Ff][Oo][Rr][Cc][Ee][Vv]1/) AND process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR ((process.parent.command_line:(/\\\\\\\\\\\\\\\\\\\\\\\\?\\\\\\\\?\\\\\\\\\\\\\\\\[Cc]\\:\\\\\\\\\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ 0[Xx][Ff][Ff][Ff][Ff][Ff][Ff][Ff][Ff]\\ \\-[Ff][Oo][Rr][Cc][Ee][Vv]1'/ OR /\\\\\\\\\\\\\\\\\\\\\\\\?\\\\\\\\?\\\\\\\\\\\\\\\\[Cc]\\:\\\\\\\\\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\\\\\\\\\[Cc][Oo][Nn][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]\\ 0[Xx]4'/) AND process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Gg][Ii][Tt]\\\\\\\\[Mm][Ii][Nn][Gg][Ww]64\\\\\\\\[Bb][Ii][Nn]\\\\\\\\[Gg][Ii][Tt]\\.[Ee][Xx][Ee]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
