{"description": "Detects potentially suspicious child processes spawned by PowerShell", "author": ["Florian Roth (Nextron Systems)", "Tim Shelton"], "enabled": false, "false_positives": ["Some false positive is to be expected from PowerShell scripts that might make use of additional binaries such as \"mshta\", \"bitsadmin\", etc. Apply additional filters for those scripts when needed."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e4b6d2a7-d8a4-4f19-acbd-943c16d90647", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious PowerShell Child Processes", "query": "((process.parent.executable.text:(\"*\\\\powershell_ise.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\") AND process.executable.text:(\"*\\\\bash.exe\" OR \"*\\\\bitsadmin.exe\" OR \"*\\\\certutil.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\forfiles.exe\" OR \"*\\\\hh.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\schtasks.exe\" OR \"*\\\\scrcons.exe\" OR \"*\\\\scriptrunner.exe\" OR \"*\\\\sh.exe\" OR \"*\\\\wmic.exe\" OR \"*\\\\wscript.exe\")) AND (NOT (process.parent.command_line.text:\"*\\\\Program\\ Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\*\" AND process.command_line.text:\"*\\\\Program\\ Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/ankit_anubhav/status/1518835408502620162"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
