{"description":"Detects file execution using the msdeploy.exe lolbin Author: Beyu Denis, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["System administrator Usage","Penetration test"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"646bc99f-6682-4b47-a73a-17b1b64c9d34","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Execute Files with Msdeploy.exe","query":"(process.command_line:*verb\\:sync* AND process.command_line:*\\-source\\:RunCommand* AND process.command_line:*\\-dest\\:runCommand* AND process.executable:*\\\\msdeploy.exe)","meta":{"from":"1m"},"severity":"medium","tags":["T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
