{"description": "Detects uncommon \"conhost\" child processes. This could be a sign of \"conhost\" usage as a LOLBIN or potential process injection activity.", "author": ["omkar72"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7dc2dedd-7603-461a-bc13-15803d132355", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Uncommon Child Process Of Conhost.EXE", "query": "(process.parent.executable.text:\"*\\\\conhost.exe\" AND (NOT ((Provider_Name:\"SystemTraceProvider-Process\") OR ((Provider_Name:\"Microsoft-Windows-Kernel-Process\" AND process.executable.text:\"*\\\\git.exe\" AND process.parent.command_line.text:(\"*\\ show\\ \\-\\-textconv\\ *\" OR \"*\\ cat\\-file\\ \\-s\\ *\"))) OR ((process.parent.command_line.text:\"*C\\:\\\\WINDOWS\\\\system32\\\\conhost.exe\\ 0x4*\" AND process.command_line.text:(\"*\\ show\\ \\-\\-textconv\\ *\" OR \"*\\ cat\\-file\\ \\-s\\ *\"))) OR ((Provider_Name:\"Microsoft-Windows-Kernel-Process\" AND process.parent.command_line.text:(\"*\\ cat\\-file\\ \\-s\\ *\" OR \"*show\\ \\-\\-textconv*\") AND process.executable.text:\"C:\\Windows\\System32\\conhost.exe\")) OR ((process.parent.command_line.text:(\\\\\\?\\?\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4 OR \\\\\\?\\?\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0xffffffff -ForceV1) AND process.executable.text:\"C:\\Windows\\System32\\conhost.exe\")) OR ((process.parent.command_line.text:(\\\\\\?\\?\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0xffffffff -ForceV1' OR \\\\\\?\\?\\\\C:\\\\WINDOWS\\\\system32\\\\conhost.exe 0x4') AND process.executable.text:\"C:\\Program Files\\Git\\mingw64\\bin\\git.exe\")))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
