{"description": "Detects using Diskshadow.exe to execute arbitrary code in text file", "enabled": false, "false_positives": ["False postitve can be if administrators use diskshadow tool in their infrastructure as a main backup tool with scripts."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0c2f8629-7129-4a8a-9897-7e0768f13ff2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution via Diskshadow.exe", "query": "(process.executable:*\\\\diskshadow.exe AND process.command_line:(*\\/s* OR *\\-s*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/", "https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration"], "timestamp_override": "event.ingested", "author": ["Ivan Dyachkov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
