{"description": "Detects suspicious child processes of the Veeam service process. This could indicate potential RCE or SQL Injection.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d55b793d-f847-4eea-b59a-5ab09908ac90", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Suspicious Child Process Of Veeam Dabatase", "query": "((process.parent.executable.text:\"*\\\\sqlservr.exe\" AND process.parent.command_line.text:\"*VEEAMSQL*\") AND (((process.executable.text:(\"*\\\\cmd.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\wsl.exe\" OR \"*\\\\wt.exe\") AND process.command_line.text:(\"*\\-ex\\ *\" OR \"*bypass*\" OR \"*cscript*\" OR \"*DownloadString*\" OR \"*http\\:\\/\\/*\" OR \"*https\\:\\/\\/*\" OR \"*mshta*\" OR \"*regsvr32*\" OR \"*rundll32*\" OR \"*wscript*\" OR \"*copy\\ *\"))) OR (process.executable.text:(\"*\\\\net.exe\" OR \"*\\\\net1.exe\" OR \"*\\\\netstat.exe\" OR \"*\\\\nltest.exe\" OR \"*\\\\ping.exe\" OR \"*\\\\tasklist.exe\" OR \"*\\\\whoami.exe\"))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Initial Access", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://labs.withsecure.com/publications/fin7-target-veeam-servers"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
