{"description": "Detects the use of Ngrok, a utility used for port forwarding and tunneling, often used by threat actors to make local protected services publicly available. Involved domains are bin.equinox.io for download and *.ngrok.io for connections.", "enabled": false, "false_positives": ["Another tool that uses the command line switches of Ngrok", "Ngrok http 3978 (https://docs.microsoft.com/en-us/azure/bot-service/bot-service-debug-channel-ngrok?view=azure-bot-service-4.0)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9945ecff-18f9-b5dc-6501-3397b0b81b07", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Ngrok Usage", "query": "(process.command_line.text:(*\\ tcp\\ 139* OR *\\ tcp\\ 445* OR *\\ tcp\\ 3389* OR *\\ tcp\\ 5985* OR *\\ tcp\\ 5986*) OR (process.command_line.text:*\\ start\\ * AND process.command_line.text:*\\-\\-all* AND process.command_line.text:*\\-\\-config* AND process.command_line.text:*.yml*) OR (process.executable.text:*ngrok.exe AND process.command_line.text:(*\\ tcp\\ * OR *\\ http\\ * OR *\\ authtoken\\ *)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1572"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://ngrok.com/docs", "https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html", "https://stackoverflow.com/questions/42442320/ssh-tunnel-to-ngrok-and-initiate-rdp", "https://www.virustotal.com/gui/file/58d21840d915aaf4040ceb89522396124c82f325282f805d1085527e1e2ccfa1/detection", "https://cybleinc.com/2021/02/15/ngrok-platform-abused-by-hackers-to-deliver-a-new-wave-of-phishing-attacks/."], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
