{"description": "Local accounts, System Owner/User discovery using operating systems utilities", "enabled": false, "false_positives": ["Legitimate administrator or user enumerates local users for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab39c9f7-2668-88c8-044b-e3451f8c802c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Local Accounts Discovery", "query": "(((process.executable:*\\\\whoami.exe OR (process.executable:*\\\\wmic.exe AND process.command_line:*useraccount* AND process.command_line:*get*) OR process.executable:(*\\\\quser.exe OR *\\\\qwinsta.exe) OR (process.executable:*\\\\cmdkey.exe AND process.command_line:*\\/list*) OR (process.executable:*\\\\cmd.exe AND process.command_line:*\\/c* AND process.command_line:*dir\\ * AND process.command_line:*\\\\Users\\\\*)) AND (NOT (process.command_line:*\\ rmdir\\ *))) OR ((process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*user*) AND (NOT (process.command_line:(*\\/domain* OR *\\/add* OR *\\/delete* OR *\\/active* OR *\\/expires* OR *\\/passwordreq* OR *\\/scriptpath* OR *\\/times* OR *\\/workstations*)))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1033", "T1087"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1033", "name": "System Owner/User Discovery", "reference": "https://attack.mitre.org/techniques/T1033"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1033/T1033.md"], "timestamp_override": "event.ingested", "author": ["Timur Zinniatullin", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
