{"description": "Detects execution of of Dxcap.exe", "enabled": false, "false_positives": ["Legitimate execution of dxcap.exe by legitimate user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "60f16a96-db70-42eb-8f76-16763e333590", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Application Whitelisting Bypass via Dxcap.exe", "query": "((process.executable:*\\\\DXCap.exe OR OriginalFilename:\"DXCap.exe\") AND process.command_line:*\\ \\-c\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dxcap/", "https://twitter.com/harr0ey/status/992008180904419328"], "timestamp_override": "event.ingested", "author": ["Beyu Denis", "oscd.community", "Nasreddine Bencherchali (update)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
