{"description": "Detects execution of \"sc.exe\" to query information about registered services on the system", "enabled": false, "false_positives": ["Legitimate query of a service by an administrator to get more information such as the state or PID"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "57712d7a-679c-4a41-a913-87e7175ae429", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "SC.EXE Query Execution", "query": "(process.executable.text:*\\\\sc.exe AND winlog.event_data.OriginalFileName:*sc.exe AND process.command_line.text:*\\ query*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1007"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1007", "name": "System Service Discovery", "reference": "https://attack.mitre.org/techniques/T1007"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1007/T1007.md#atomic-test-1---system-service-discovery"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
