{"description": "Detects unusual parent or children of the ImagingDevices.exe (Windows Contacts) and Wabmig.exe (Microsoft Address Book Import Tool) processes as seen being used with bumblebee activity", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7bf89a76-dfcb-f4b3-21f7-a65a11337edd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "ImagingDevices Unusual Parent/Child Processes", "query": "(((process.parent.executable.text:(*\\\\WmiPrvSE.exe OR *\\\\svchost.exe OR *\\\\dllhost.exe) AND process.executable.text:*\\\\ImagingDevices.exe)) OR (process.parent.executable.text:*\\\\ImagingDevices.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/09/26/bumblebee-round-two/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
