{"description": "Detects calls to PowerShell with Invoke-WebRequest cmdlet using direct IP access", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1edff897-9146-48d2-9066-52e8d8f80a2f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Invoke-WebRequest Execution With DirectIP", "query": "(((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:(\"*curl\\ *\" OR \"*Invoke\\-WebRequest*\" OR \"*iwr\\ *\" OR \"*wget\\ *\") AND process.command_line.text:(\"*\\:\\/\\/1*\" OR \"*\\:\\/\\/2*\" OR \"*\\:\\/\\/3*\" OR \"*\\:\\/\\/4*\" OR \"*\\:\\/\\/5*\" OR \"*\\:\\/\\/6*\" OR \"*\\:\\/\\/7*\" OR \"*\\:\\/\\/8*\" OR \"*\\:\\/\\/9*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.huntress.com/blog/critical-vulnerabilities-in-papercut-print-management-software"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
