{"description": "Detects a suspicious call to the user32.dll function that locks the user workstation", "author": ["frack113"], "enabled": false, "false_positives": ["Scripts or links on the user desktop used to lock the workstation instead of Windows+L or the menu option"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3b5b0213-0460-4e3f-8937-3abf98ff7dcc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Workstation Locking via Rundll32", "query": "(((process.executable.text:\"*\\\\rundll32.exe\") OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND process.parent.executable.text:\"*\\\\cmd.exe\" AND process.command_line.text:\"*user32.dll,*\" AND process.command_line.text:\"*LockWorkStation*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
