{"description": "Detects base64 encoded powershell cmdlet invocation of known suspicious cmdlets", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "15c1b2af-0234-25a1-a258-c0c261d5bcd4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Malicious Base64 Encoded Powershell Invoke Cmdlets", "query": "process.command_line:(*SQBuAHYAbwBrAGUALQBCAGwAbwBvAGQASABvAHUAbgBkA* OR *kAbgB2AG8AawBlAC0AQgBsAG8AbwBkAEgAbwB1AG4AZA* OR *JAG4AdgBvAGsAZQAtAEIAbABvAG8AZABIAG8AdQBuAGQA* OR *SQBuAHYAbwBrAGUALQBNAGkAbQBpAGsAYQB0AHoA* OR *kAbgB2AG8AawBlAC0ATQBpAG0AaQBrAGEAdAB6A* OR *JAG4AdgBvAGsAZQAtAE0AaQBtAGkAawBhAHQAeg* OR *SQBuAHYAbwBrAGUALQBXAE0ASQBFAHgAZQBjA* OR *kAbgB2AG8AawBlAC0AVwBNAEkARQB4AGUAYw* OR *JAG4AdgBvAGsAZQAtAFcATQBJAEUAeABlAGMA*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/"], "timestamp_override": "event.ingested", "author": ["pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
