{"description": "Detects suspicious PowerShell invocation with a parameter substring", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "36210e0d-5b19-485d-a087-c096088885f0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Parameter Substring", "query": "(process.executable:(*\\\\Powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*\\ \\-windowstyle\\ h\\ * OR *\\ \\-windowstyl\\ h* OR *\\ \\-windowsty\\ h* OR *\\ \\-windowst\\ h* OR *\\ \\-windows\\ h* OR *\\ \\-windo\\ h* OR *\\ \\-wind\\ h* OR *\\ \\-win\\ h* OR *\\ \\-wi\\ h* OR *\\ \\-win\\ h\\ * OR *\\ \\-win\\ hi\\ * OR *\\ \\-win\\ hid\\ * OR *\\ \\-win\\ hidd\\ * OR *\\ \\-win\\ hidde\\ * OR *\\ \\-NoPr\\ * OR *\\ \\-NoPro\\ * OR *\\ \\-NoProf\\ * OR *\\ \\-NoProfi\\ * OR *\\ \\-NoProfil\\ * OR *\\ \\-nonin\\ * OR *\\ \\-nonint\\ * OR *\\ \\-noninte\\ * OR *\\ \\-noninter\\ * OR *\\ \\-nonintera\\ * OR *\\ \\-noninterac\\ * OR *\\ \\-noninteract\\ * OR *\\ \\-noninteracti\\ * OR *\\ \\-noninteractiv\\ * OR *\\ \\-ec\\ * OR *\\ \\-encodedComman\\ * OR *\\ \\-encodedComma\\ * OR *\\ \\-encodedComm\\ * OR *\\ \\-encodedCom\\ * OR *\\ \\-encodedCo\\ * OR *\\ \\-encodedC\\ * OR *\\ \\-encoded\\ * OR *\\ \\-encode\\ * OR *\\ \\-encod\\ * OR *\\ \\-enco\\ * OR *\\ \\-en\\ * OR *\\ \\-executionpolic\\ * OR *\\ \\-executionpoli\\ * OR *\\ \\-executionpol\\ * OR *\\ \\-executionpo\\ * OR *\\ \\-executionp\\ * OR *\\ \\-execution\\ bypass* OR *\\ \\-executio\\ bypass* OR *\\ \\-executi\\ bypass* OR *\\ \\-execut\\ bypass* OR *\\ \\-execu\\ bypass* OR *\\ \\-exec\\ bypass* OR *\\ \\-exe\\ bypass* OR *\\ \\-ex\\ bypass* OR *\\ \\-ep\\ bypass* OR *\\ \\/windowstyle\\ h\\ * OR *\\ \\/windowstyl\\ h* OR *\\ \\/windowsty\\ h* OR *\\ \\/windowst\\ h* OR *\\ \\/windows\\ h* OR *\\ \\/windo\\ h* OR *\\ \\/wind\\ h* OR *\\ \\/win\\ h* OR *\\ \\/wi\\ h* OR *\\ \\/win\\ h\\ * OR *\\ \\/win\\ hi\\ * OR *\\ \\/win\\ hid\\ * OR *\\ \\/win\\ hidd\\ * OR *\\ \\/win\\ hidde\\ * OR *\\ \\/NoPr\\ * OR *\\ \\/NoPro\\ * OR *\\ \\/NoProf\\ * OR *\\ \\/NoProfi\\ * OR *\\ \\/NoProfil\\ * OR *\\ \\/nonin\\ * OR *\\ \\/nonint\\ * OR *\\ \\/noninte\\ * OR *\\ \\/noninter\\ * OR *\\ \\/nonintera\\ * OR *\\ \\/noninterac\\ * OR *\\ \\/noninteract\\ * OR *\\ \\/noninteracti\\ * OR *\\ \\/noninteractiv\\ * OR *\\ \\/ec\\ * OR *\\ \\/encodedComman\\ * OR *\\ \\/encodedComma\\ * OR *\\ \\/encodedComm\\ * OR *\\ \\/encodedCom\\ * OR *\\ \\/encodedCo\\ * OR *\\ \\/encodedC\\ * OR *\\ \\/encoded\\ * OR *\\ \\/encode\\ * OR *\\ \\/encod\\ * OR *\\ \\/enco\\ * OR *\\ \\/en\\ * OR *\\ \\/executionpolic\\ * OR *\\ \\/executionpoli\\ * OR *\\ \\/executionpol\\ * OR *\\ \\/executionpo\\ * OR *\\ \\/executionp\\ * OR *\\ \\/execution\\ bypass* OR *\\ \\/executio\\ bypass* OR *\\ \\/executi\\ bypass* OR *\\ \\/execut\\ bypass* OR *\\ \\/execu\\ bypass* OR *\\ \\/exec\\ bypass* OR *\\ \\/exe\\ bypass* OR *\\ \\/ex\\ bypass* OR *\\ \\/ep\\ bypass*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["http://www.danielbohannon.com/blog-1/2017/3/12/powershell-execution-argument-obfuscation-how-it-can-make-detection-easier"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)", "Daniel Bohannon (idea)", "Roberto Rodriguez (Fix)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
