{"description": "Detects updates to Sysmon's configuration. Attackers might update or replace the Sysmon configuration with a bare bone one to avoid monitoring without shutting down the service completely", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate administrators might use this command to update Sysmon configuration."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "87911521-7098-470b-a459-9a57fc80bdfd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Sysmon Configuration Update", "query": "(((process.executable.text:(\"*\\\\Sysmon64.exe\" OR \"*\\\\Sysmon.exe\")) OR (winlog.event_data.Description:\"System activity monitor\")) AND process.command_line.text:(\"*\\-c*\" OR \"*\\/c*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
