{"description": "Detects potentially uncommon child processes of SndVol.exe (the Windows volume mixer)", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ba42babc-0666-4393-a4f7-ceaf5a69191e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Uncommon Child Processes Of SndVol.exe", "query": "(process.parent.executable:/.*\\\\\\\\[Ss][Nn][Dd][Vv][Oo][Ll]\\.[Ee][Xx][Ee]/ AND (NOT (process.executable:/.*\\\\\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ [Ss][Hh][Ee][Ll][Ll]32\\.[Dd][Ll][Ll],[Cc][Oo][Nn][Tt][Rr][Oo][Ll]_[Rr][Uu][Nn][Dd][Ll][Ll]\\ .*/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Max_Mal_/status/1661322732456353792"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
