{"description": "Detects dump of credentials in VeeamBackup dbo", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b57ba453-b384-4ab9-9f40-1038086b4e53", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "VeeamBackup Database Credentials Dump", "query": "(process.executable:*\\\\sqlcmd.exe AND process.command_line:*SELECT* AND process.command_line:*TOP* AND process.command_line:*\\[VeeamBackup\\].\\[dbo\\].\\[Credentials\\]*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1005"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1005", "name": "Data from Local System", "reference": "https://attack.mitre.org/techniques/T1005"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/12/13/diavol-ransomware/", "https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
