{"description": "Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let the user execute programs with different permissions (System, Trusted Installer, Administrator...etc)", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bdeeabc9-ff2a-4a51-be59-bb253aac7891", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - Wsudo Suspicious Execution", "query": "((process.executable.text:\"*\\\\wsudo.exe\") OR (winlog.event_data.OriginalFileName:\"wsudo.exe\") OR (winlog.event_data.Description:\"Windows sudo utility\") OR (process.parent.executable.text:\"*\\\\wsudo\\-bridge.exe\") OR (process.command_line.text:(\"*\\-u\\ System*\" OR \"*\\-uSystem*\" OR \"*\\-u\\ TrustedInstaller*\" OR \"*\\-uTrustedInstaller*\" OR \"*\\ \\-\\-ti\\ *\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/M2Team/Privexec/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
