{"description": "Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.", "enabled": false, "false_positives": ["Legitimate administrative use (Should be investigated either way)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f44800ac-38ec-471f-936e-3fa7d9c53100", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CleanWipe Usage", "query": "(process.executable.text:*\\\\SepRemovalToolNative_x64.exe OR (process.executable.text:*\\\\CATClean.exe AND process.command_line.text:*\\-\\-uninstall*) OR (process.executable.text:*\\\\NetInstaller.exe AND process.command_line.text:*\\-r*) OR (process.executable.text:*\\\\WFPUnins.exe AND process.command_line.text:*\\/uninstall* AND process.command_line.text:*\\/enterprise*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali @nas_bench"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
