{"description": "Detects the executiob of TTDInject.exe, which is used by Windows 10 v1809 and newer to debug time travel (underlying call of tttracer.exe)", "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c0f53ffd-db18-b31f-8d79-fa03bcd0a06a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of TTDInject.exe", "query": "(process.executable:*ttdinject.exe OR winlog.event_data.OriginalFileName:\"TTDInject.EXE\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1127"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
