{"description": "Detects the creation of a schtask via PowerSploit or Empire Default Configuration.", "author": ["Markus Neis", "@Karneades"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56c217c3-2de2-479b-990f-5c109ba8458f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Default PowerSploit/Empire Scheduled Task Creation", "query": "(process.parent.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\") AND process.executable.text:\"*\\\\schtasks.exe\" AND process.command_line.text:\"*\\/Create*\" AND process.command_line.text:\"*powershell.exe\\ \\-NonI*\" AND process.command_line.text:\"*\\/TN\\ Updater\\ \\/TR*\" AND process.command_line.text:(\"*\\/SC\\ ONLOGON*\" OR \"*\\/SC\\ DAILY\\ \\/ST*\" OR \"*\\/SC\\ ONIDLE*\" OR \"*\\/SC\\ HOURLY*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1053", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://github.com/0xdeadbeefJERKY/PowerSploit/blob/8690399ef70d2cad10213575ac67e8fa90ddf7c3/Persistence/Persistence.psm1", "https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/powershell/persistence/userland/schtasks.py"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
