{"description": "Detects execution of the SharpImpersonation tool. Which can be used to manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively", "author": ["Sai Prashanth Pulisetti @pulisettis", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f89b08d0-77ad-4728-817b-9b16c5a69c7a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - SharpImpersonation Execution", "query": "((process.executable.text:\"*\\\\SharpImpersonation.exe\") OR (winlog.event_data.OriginalFileName:\"SharpImpersonation.exe\") OR ((process.command_line.text:\"*\\ user\\:*\" AND process.command_line.text:\"*\\ binary\\:*\")) OR ((process.command_line.text:\"*\\ user\\:*\" AND process.command_line.text:\"*\\ shellcode\\:*\")) OR (process.command_line.text:(\"*\\ technique\\:CreateProcessAsUserW*\" OR \"*\\ technique\\:ImpersonateLoggedOnuser*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1134", "T1134"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}, {"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}, {"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}], "version": 1, "references": ["https://s3cur3th1ssh1t.github.io/SharpImpersonation-Introduction/", "https://github.com/S3cur3Th1sSh1t/SharpImpersonation"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
