{"description":"Adversaries can abuse wuauclt.exe (Windows Update client) to run code execution by specifying an arbitrary DLL. Author: Sreeman. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Wuaueng.dll which is a module belonging to Microsoft Windows Update."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ba1bb0cb-73da-42de-ad3a-de10c643a5d0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Monitoring Wuauclt.exe For Lolbas Execution Of DLL","query":"((process.command_line:*wuauclt.exe* AND process.command_line:*\\/UpdateDeploymentProvider* AND process.command_line:*\\/Runhandlercomserver*) AND (NOT (process.command_line:(*wuaueng.dll* OR *UpdateDeploymentProvider.dll\\ \\/ClassId*))))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
