{"description":"Detects requests to disable Microsoft Defender features using PowerShell commands Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Possible Admin Activity","Other Cmdlets that may use the same parameters"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e35a6eba-31c7-e7be-af1a-071b2571ca78","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Powershell Defender Disable Scan Feature","query":"((process.command_line:(*Add\\-MpPreference\\ * OR *Set\\-MpPreference\\ *) AND process.command_line:(*DisableRealtimeMonitoring\\ * OR *DisableIOAVProtection\\ * OR *DisableBehaviorMonitoring\\ * OR *DisableBlockAtFirstSeen\\ *) AND process.command_line:(*$true* OR *\\ 1\\ *)) OR (process.command_line:(*RGlzYWJsZVJlYWx0aW1lTW9uaXRvcmluZy* OR *Rpc2FibGVSZWFsdGltZU1vbml0b3Jpbmcg* OR *EaXNhYmxlUmVhbHRpbWVNb25pdG9yaW5nI* OR *RGlzYWJsZUlPQVZQcm90ZWN0aW9uI* OR *Rpc2FibGVJT0FWUHJvdGVjdGlvbi* OR *EaXNhYmxlSU9BVlByb3RlY3Rpb24g* OR *RGlzYWJsZUJlaGF2aW9yTW9uaXRvcmluZy* OR *Rpc2FibGVCZWhhdmlvck1vbml0b3Jpbmcg* OR *EaXNhYmxlQmVoYXZpb3JNb25pdG9yaW5nI* OR *RGlzYWJsZUJsb2NrQXRGaXJzdFNlZW4g* OR *Rpc2FibGVCbG9ja0F0Rmlyc3RTZWVuI* OR *EaXNhYmxlQmxvY2tBdEZpcnN0U2Vlbi* OR *ZGlzYWJsZXJlYWx0aW1lbW9uaXRvcmluZy* OR *Rpc2FibGVyZWFsdGltZW1vbml0b3Jpbmcg* OR *kaXNhYmxlcmVhbHRpbWVtb25pdG9yaW5nI* OR *ZGlzYWJsZWlvYXZwcm90ZWN0aW9uI* OR *Rpc2FibGVpb2F2cHJvdGVjdGlvbi* OR *kaXNhYmxlaW9hdnByb3RlY3Rpb24g* OR *ZGlzYWJsZWJlaGF2aW9ybW9uaXRvcmluZy* OR *Rpc2FibGViZWhhdmlvcm1vbml0b3Jpbmcg* OR *kaXNhYmxlYmVoYXZpb3Jtb25pdG9yaW5nI* OR *ZGlzYWJsZWJsb2NrYXRmaXJzdHNlZW4g* OR *Rpc2FibGVibG9ja2F0Zmlyc3RzZWVuI* OR *kaXNhYmxlYmxvY2thdGZpcnN0c2Vlbi*) AND process.command_line:(*RABpAHMAYQBiAGwAZQBSAGUAYQBsAHQAaQBtAGUATQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAUgBlAGEAbAB0AGkAbQBlAE0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *EAGkAcwBhAGIAbABlAFIAZQBhAGwAdABpAG0AZQBNAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *RABpAHMAYQBiAGwAZQBJAE8AQQBWAFAAcgBvAHQAZQBjAHQAaQBvAG4AIA* OR *QAaQBzAGEAYgBsAGUASQBPAEEAVgBQAHIAbwB0AGUAYwB0AGkAbwBuACAA* OR *EAGkAcwBhAGIAbABlAEkATwBBAFYAUAByAG8AdABlAGMAdABpAG8AbgAgA* OR *RABpAHMAYQBiAGwAZQBCAGUAaABhAHYAaQBvAHIATQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAQgBlAGgAYQB2AGkAbwByAE0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *EAGkAcwBhAGIAbABlAEIAZQBoAGEAdgBpAG8AcgBNAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *RABpAHMAYQBiAGwAZQBCAGwAbwBjAGsAQQB0AEYAaQByAHMAdABTAGUAZQBuACAA* OR *QAaQBzAGEAYgBsAGUAQgBsAG8AYwBrAEEAdABGAGkAcgBzAHQAUwBlAGUAbgAgA* OR *EAGkAcwBhAGIAbABlAEIAbABvAGMAawBBAHQARgBpAHIAcwB0AFMAZQBlAG4AIA* OR *ZABpAHMAYQBiAGwAZQByAGUAYQBsAHQAaQBtAGUAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAcgBlAGEAbAB0AGkAbQBlAG0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *kAGkAcwBhAGIAbABlAHIAZQBhAGwAdABpAG0AZQBtAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *ZABpAHMAYQBiAGwAZQBpAG8AYQB2AHAAcgBvAHQAZQBjAHQAaQBvAG4AIA* OR *QAaQBzAGEAYgBsAGUAaQBvAGEAdgBwAHIAbwB0AGUAYwB0AGkAbwBuACAA* OR *kAGkAcwBhAGIAbABlAGkAbwBhAHYAcAByAG8AdABlAGMAdABpAG8AbgAgA* OR *ZABpAHMAYQBiAGwAZQBiAGUAaABhAHYAaQBvAHIAbQBvAG4AaQB0AG8AcgBpAG4AZwAgA* OR *QAaQBzAGEAYgBsAGUAYgBlAGgAYQB2AGkAbwByAG0AbwBuAGkAdABvAHIAaQBuAGcAIA* OR *kAGkAcwBhAGIAbABlAGIAZQBoAGEAdgBpAG8AcgBtAG8AbgBpAHQAbwByAGkAbgBnACAA* OR *ZABpAHMAYQBiAGwAZQBiAGwAbwBjAGsAYQB0AGYAaQByAHMAdABzAGUAZQBuACAA* OR *QAaQBzAGEAYgBsAGUAYgBsAG8AYwBrAGEAdABmAGkAcgBzAHQAcwBlAGUAbgAgA* OR *kAGkAcwBhAGIAbABlAGIAbABvAGMAawBhAHQAZgBpAHIAcwB0AHMAZQBlAG4AIA*)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
