{"description": "This rule detect common flag combinations used by CrackMapExec in order to detect its use even if the binary has been replaced.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "42a993dd-bb3e-48c8-b372-4d6684c4106c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CrackMapExec Command Line Flags", "query": "((process.command_line:*\\ \\-M\\ pe_inject\\ * OR (process.command_line:*\\ \\-\\-local\\-auth* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-x\\ *) OR (process.command_line:*\\ \\-\\-local\\-auth* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\-H\\ 'NTHASH'*) OR (process.command_line:*\\ mssql\\ * AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\-M\\ * AND process.command_line:*\\ \\-d\\ *) OR (process.command_line:*\\ smb\\ * AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-H\\ * AND process.command_line:*\\ \\-M\\ * AND process.command_line:*\\ \\-o\\ *) OR (process.command_line:*\\ smb\\ * AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\-\\-local\\-auth*)) OR (process.command_line:*\\ \\-\\-local\\-auth* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ 10.* AND process.command_line:*\\ 192.168.* AND process.command_line:*\\/24\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://mpgn.gitbook.io/crackmapexec/smb-protocol/authentication/checking-credentials-local", "https://www.mandiant.com/resources/telegram-malware-iranian-espionage", "https://www.infosecmatter.com/crackmapexec-module-library/?cmem=mssql-mimikatz", "https://www.infosecmatter.com/crackmapexec-module-library/?cmem=smb-pe_inject"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
