{"description": "Detects a usage of the manage-bde.wsf script that may indicate an attempt of proxy execution from script", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "98890d07-9760-6298-dedb-e1872818b05e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Usage of the Manage-bde.wsf Script", "query": "(process.command_line.text:*cscript* AND process.command_line.text:*manage\\-bde.wsf*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1216", "name": "System Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Scripts/Manage-bde/", "https://gist.github.com/bohops/735edb7494fe1bd1010d67823842b712", "https://twitter.com/bohops/status/980659399495741441", "https://twitter.com/JohnLaTwC/status/1223292479270600706", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md"], "timestamp_override": "event.ingested", "author": ["oscd.community", "Natalia Shornikova"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
