{"description": "Detects suspicious renamed PAExec execution as often used by attackers", "enabled": false, "false_positives": ["Weird admins that rename their tools", "Software companies that bundle PAExec with their software and rename it, so that it is less embarrassing"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f194b7b8-ce4a-22dc-d28a-2ff1a48b6bae", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed PAExec", "query": "((winlog.event_data.Description:\"PAExec\\ Application\" OR winlog.event_data.OriginalFileName:\"PAExec.exe\") AND (NOT (process.executable.text:(*\\\\PAexec.exe OR *\\\\paexec.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://www.poweradmin.com/paexec/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
