{"description": "Detects Wscript/Cscript executing a file with an uncommon (i.e. non-script) extension", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99b7460d-c9f1-40d7-a316-1f36f61d52ee", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Cscript/Wscript Uncommon Script Extension Execution", "query": "(((winlog.event_data.OriginalFileName:(/[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\\\\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/))) AND process.command_line:(/.*\\.[Cc][Ss][Vv].*/ OR /.*\\.[Dd][Aa][Tt].*/ OR /.*\\.[Dd][Oo][Cc].*/ OR /.*\\.[Gg][Ii][Ff].*/ OR /.*\\.[Jj][Pp][Ee][Gg].*/ OR /.*\\.[Jj][Pp][Gg].*/ OR /.*\\.[Pp][Nn][Gg].*/ OR /.*\\.[Pp][Pp][Tt].*/ OR /.*\\.[Tt][Xx][Tt].*/ OR /.*\\.[Xx][Ll][Ss].*/ OR /.*\\.[Xx][Mm][Ll].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
