{"description": "Detects suspicious start of rundll32.exe with a parent process of Explorer.exe. Variant of Raspberry Robin, as first reported by Red Canary.", "author": ["CD_ROM_"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7c64d15f-bffb-4939-b865-e6e711349b0d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rundll32 With Suspicious Parent Process", "query": "((((process.executable.text:*\\\\rundll32.exe) OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND process.parent.executable.text:*\\\\explorer.exe) AND (NOT ((process.command_line.text:*\\ C\\:\\\\Windows\\\\System32\\\\*) OR (process.command_line.text:*\\ \\-localserver\\ 22d8c27b\\-47a1\\-48d1\\-ad08\\-7da7abd79617))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/raspberry-robin/", "https://thedfirreport.com/2022/09/26/bumblebee-round-two/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
