{"description": "Detects Certify a tool for Active Directory certificate abuse based on PE metadata characteristics and common command line arguments.", "author": ["pH-T (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "762f2482-ff21-4970-8939-0aa317a886bb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Certify Execution", "query": "((((process.executable.text:\"*\\\\Certify.exe\") OR (winlog.event_data.OriginalFileName:\"Certify.exe\") OR (winlog.event_data.Description:*Certify*))) OR ((process.command_line.text:(\"*.exe\\ cas\\ *\" OR \"*.exe\\ find\\ *\" OR \"*.exe\\ pkiobjects\\ *\" OR \"*.exe\\ request\\ *\" OR \"*.exe\\ download\\ *\") AND process.command_line.text:(\"*\\ \\/vulnerable*\" OR \"*\\ \\/template\\:*\" OR \"*\\ \\/altname\\:*\" OR \"*\\ \\/domain\\:*\" OR \"*\\ \\/path\\:*\" OR \"*\\ \\/ca\\:*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/GhostPack/Certify"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
