{"description": "Checks whether the image specified in a process creation event doesn't refer to an .exe file (caused by process ghosting or other unorthodox methods to start a process)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c09dad97-1c78-4f71-b127-7edb2b8e491a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution of Suspicious File Type Extension", "query": "((NOT (process.executable:(*.exe OR *.tmp))) AND (NOT ((NOT _exists_:process.executable) OR (process.executable:(\"Registry\" OR \"MemCompression\")) OR (process.executable:(\"\\-\" OR \"\")) OR (process.executable:C\\:\\\\Windows\\\\Installer\\\\MSI*) OR (process.parent.executable:(C\\:\\\\ProgramData\\\\Avira\\\\* OR C\\:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\*)) OR (process.executable:*.scr) OR (process.executable:*NVIDIA\\\\NvBackend\\\\* AND process.executable:*.dat) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*) AND process.executable:*.com) OR (process.executable:*\\\\WinSCP.com) OR (process.executable:*C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\* AND process.executable:*.tmp* AND process.executable:*CodeSetup*) OR (process.executable:*\\\\program\\\\soffice.bin) OR (process.executable:(\"C\\:\\\\Program\\ Files\\\\EMC\\ NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi\\-bin\\\\update_jnlp.cgi\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\EMC\\ NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi\\-bin\\\\update_jnlp.cgi\")) OR (process.executable:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\WINPAKPRO\\\\* OR C\\:\\\\Program\\ Files\\\\WINPAKPRO\\\\*) AND process.executable:*.ngn) OR (process.executable:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\MyQ\\\\Server\\\\pcltool.dll\" OR \"C\\:\\\\Program\\ Files\\\\MyQ\\\\Server\\\\pcltool.dll\")) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio*) AND process.executable:*.com) OR (process.executable:C\\:\\\\Config.Msi\\\\* AND process.executable:(*.rbf OR *.rbs)) OR (process.executable:*\\\\AppData\\\\Local\\\\Packages\\\\* AND process.executable:*\\\\LocalState\\\\rootfs\\\\*) OR (process.executable:*\\\\LZMA_EXE))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestlaboratories.com/2021/12/08/process-ghosting/"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
