{"description": "Detects suspicious command line patterns used when rundll32 is used to run JavaScript code", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9f06447a-a33a-4cbe-a94f-a3f43184a7a3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rundll32 JS RunHTMLApplication Pattern", "query": "((process.command_line:*rundll32* AND process.command_line:*javascript* AND process.command_line:*..\\\\..\\\\mshtml,RunHTMLApplication*) OR process.command_line:*;document.write\\(\\);GetObject\\(\\\"script*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_DETECTION_BYPASS.txt"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
