{"description": "Detects when a user performs data exfiltration by using DataSvcUtil.exe", "enabled": false, "false_positives": ["DataSvcUtil.exe being used may be performed by a system administrator.", "Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "DataSvcUtil.exe being executed from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dffd0f4f-8a69-a01a-8968-27eb3e7b0c33", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "LOLBAS Data Exfiltration by DataSvcUtil.exe", "query": "(process.command_line:*\\/in\\:* AND process.command_line:*\\/out\\:* AND process.executable:*\\\\DataSvcUtil.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://gist.github.com/teixeira0xfffff/837e5bfed0d1b0a29a7cb1e5dbdd9ca6", "https://docs.microsoft.com/en-us/dotnet/framework/data/wcf/wcf-data-service-client-utility-datasvcutil-exe", "https://docs.microsoft.com/en-us/dotnet/framework/data/wcf/generating-the-data-service-client-library-wcf-data-services", "https://docs.microsoft.com/en-us/dotnet/framework/data/wcf/how-to-add-a-data-service-reference-wcf-data-services"], "timestamp_override": "event.ingested", "author": ["Ialle Teixeira @teixeira0xfffff", "Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
