{"description": "Detects PowerShell script execution from Alternate Data Stream (ADS)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "45a594aa-1fbd-4972-a809-ff5a99dd81b8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Run PowerShell Script from ADS", "query": "(process.parent.executable:*\\\\powershell.exe AND process.executable:*\\\\powershell.exe AND process.command_line:*Get\\-Content* AND process.command_line:*\\-Stream*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://github.com/p0shkatz/Get-ADS/blob/master/Get-ADS.ps1"], "timestamp_override": "event.ingested", "author": ["Sergey Soldatov", "Kaspersky Lab", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
