{"description": "Detects usage of Sysinternals PsService for service reconnaissance or tamper", "enabled": false, "false_positives": ["Legitimate use of PsService by an administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "afc6648d-57a5-1736-91c9-28688e7049de", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of Sysinternals PsService", "query": "(winlog.event_data.OriginalFileName:\"psservice.exe\" OR process.executable:(*\\\\PsService.exe OR *\\\\PsService64.exe))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/psservice"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
