{"description":"Detects the use of NirCmd tool for command execution, which could be the result of legitimate administrative activity Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use by administrators"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4e2ed651-1906-4a59-a78a-18220fca1b22","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"NirCmd Tool Execution","query":"(process.executable:*\\\\nircmd.exe OR (process.command_line:*\\ execmd\\ * AND process.command_line:*\\ attrib\\ *) OR (process.command_line:*\\ execmd\\ * AND process.command_line:*\\ copy\\ *) OR (process.command_line:*\\ execmd\\ * AND process.command_line:*\\ del\\ * AND process.command_line:*\\ \\/Q\\ *))","meta":{"from":"1m"},"severity":"medium","tags":["T1569"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1569","name":"System Services","reference":"https://attack.mitre.org/techniques/T1569"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
