{"description": "This rule looks for Windows Installer service (msiexec.exe) trying to install MSI packages with SYSTEM privilege", "enabled": false, "false_positives": ["System administrator Usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd951fdc-4b2f-47f5-ba99-a33bf61e3770", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Always Install Elevated Windows Installer", "query": "((user.name:(*AUTHORI* OR *AUTORI*) AND ((process.executable:*\\\\Windows\\\\Installer\\\\* AND process.executable:*msi* AND process.executable:*tmp) OR (process.executable:*\\\\msiexec.exe AND IntegrityLevel:\"System\"))) AND (NOT ((process.parent.executable:\"C\\:\\\\Windows\\\\System32\\\\services.exe\") OR (process.command_line:*\\\\system32\\\\msiexec.exe\\ \\/V OR process.parent.command_line:*\\\\system32\\\\msiexec.exe\\ \\/V))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-48-638.jpg"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov (idea)", "Mangatas Tondang (rule)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
