{"description": "Adversaries can carry out malicious operations using a virtual instance to avoid detection. This rule is built to detect the registration of the Virtualbox driver or start of a Virtualbox VM.", "enabled": false, "false_positives": ["This may have false positives on hosts where Virtualbox is legitimately being used for operations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "09a870bb-24e6-99ae-4b64-eb57f9e3b0d2", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Detect Virtualbox Driver Installation OR Starting Of VMs", "query": "(process.command_line:(*VBoxRT.dll,RTR3Init* OR *VBoxC.dll* OR *VBoxDrv.sys*) OR process.command_line:(*startvm* OR *controlvm*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1564", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}, {"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1564/006/", "https://news.sophos.com/en-us/2020/05/21/ragnar-locker-ransomware-deploys-virtual-machine-to-dodge-security/", "https://threatpost.com/maze-ransomware-ragnar-locker-virtual-machine/159350/"], "timestamp_override": "event.ingested", "author": ["Janantha Marasinghe"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
