{"description": "Detects potential process patterns related to Cobalt Strike beacon activity", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f35c5d71-b489-4e22-a115-f003df287317", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential CobaltStrike Process Patterns", "query": "(((process.command_line.text:\"*cmd.exe\\ \\/C\\ whoami\" AND process.parent.executable.text:\"C\\:\\\\Temp\\\\*\")) OR ((process.parent.executable.text:(\"*\\\\runonce.exe\" OR \"*\\\\dllhost.exe\") AND process.command_line.text:\"*cmd.exe\\ \\/c\\ echo*\" AND process.command_line.text:\"*>\\ \\\\\\\\.\\\\pipe*\")) OR ((process.parent.command_line.text:\"*cmd.exe\\ \\/C\\ echo*\" AND process.parent.command_line.text:\"*\\ >\\ \\\\\\\\.\\\\pipe*\" AND process.command_line.text:\"*conhost.exe\\ 0xffffffff\\ \\-ForceV1\")) OR ((process.parent.command_line.text:\"*\\/C\\ whoami\" AND process.command_line.text:\"*conhost.exe\\ 0xffffffff\\ \\-ForceV1\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://hausec.com/2021/07/26/cobalt-strike-and-tradecraft/", "https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
