{"description": "Detects execution of \"reg.exe\" to disable security services such as Windows Defender.", "author": ["Florian Roth (Nextron Systems)", "John Lambert (idea)", "elhoim"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5e95028c-5229-4214-afae-d653d573d0ec", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Security Service Disabled Via Reg.EXE", "query": "(process.command_line.text:*reg* AND process.command_line.text:*add* AND process.command_line:/.*[Dd]\\ 4.*/ AND process.command_line:/.*[Vv]\\ [Ss][Tt][Aa][Rr][Tt].*/ AND process.command_line:(/.*\\\\\\\\[Aa][Pp][Pp][Ii][Dd][Ss][Vv][Cc].*/ OR /.*\\\\\\\\[Mm][Ss][Mm][Pp][Ss][Vv][Cc].*/ OR /.*\\\\\\\\[Nn][Ii][Ss][Ss][Rr][Vv].*/ OR /.*\\\\\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Hh][Ee][Aa][Ll][Tt][Hh][Ss][Ee][Rr][Vv][Ii][Cc][Ee].*/ OR /.*\\\\\\\\[Ss][Ee][Nn][Ss][Ee].*/ OR /.*\\\\\\\\[Uu][Ss][Oo][Ss][Vv][Cc].*/ OR /.*\\\\\\\\[Ww][Dd][Bb][Oo][Oo][Tt].*/ OR /.*\\\\\\\\[Ww][Dd][Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*\\\\\\\\[Ww][Dd][Nn][Ii][Ss][Dd][Rr][Vv].*/ OR /.*\\\\\\\\[Ww][Dd][Nn][Ii][Ss][Ss][Vv][Cc].*/ OR /.*\\\\\\\\[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd].*/ OR /.*\\\\\\\\[Ww][Ss][Cc][Ss][Vv][Cc].*/ OR /.*\\\\\\\\[Ww][Uu][Aa][Uu][Ss][Ee][Rr][Vv].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/JohnLaTwC/status/1415295021041979392", "https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1", "https://vms.drweb.fr/virus/?i=24144899", "https://bidouillesecurity.com/disable-windows-defender-in-powershell/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
