{"description": "Identifies use of various commands to query a systems time. This technique may be used before executing a scheduled task or to discover the time zone of a target system.", "enabled": false, "false_positives": ["Legitimate use of the system utilities to discover system time for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b243b280-65fe-48df-ba07-6ddea7646427", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Discovery of a System Time", "query": "((process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*time*) OR (process.executable:*\\\\w32tm.exe AND process.command_line:*tz*) OR (process.executable:*\\\\powershell.exe AND process.command_line:*Get\\-Date*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1124"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1124", "name": "System Time Discovery", "reference": "https://attack.mitre.org/techniques/T1124"}]}], "version": 1, "references": ["https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1124/T1124.md"], "timestamp_override": "event.ingested", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
