{"description": "Detects use of chcp to look up the system locale value as part of host discovery", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "82a8cac5-dc04-baba-014c-ed89f5289890", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CHCP CodePage Locale Lookup", "query": "(process.parent.executable:*\\\\cmd.exe AND process.parent.command_line:*\\ \\/c\\ * AND process.executable:*\\\\chcp.com AND process.command_line:(*chcp OR *chcp\\  OR *chcp\\ \\ ))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/chcp"], "timestamp_override": "event.ingested", "author": ["_pete_0", "TheDFIRReport"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
