{"description": "Detects a suspicious command line execution that invokes PowerShell with reference to an AppData folder", "enabled": false, "false_positives": ["Administrative scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ac175779-025a-4f12-98b0-acdaeb77ea85", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Script Run in AppData", "query": "(process.command_line:(*powershell.exe* OR *\\\\powershell* OR *\\\\pwsh* OR *pwsh.exe*) AND process.command_line:*\\/c\\ * AND process.command_line:*\\\\AppData\\\\* AND process.command_line:(*Local\\\\* OR *Roaming\\\\*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://twitter.com/JohnLaTwC/status/1082851155481288706", "https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
