{"description": "Detects specific process characteristics of Chinese TAIDOOR RAT malware load", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8ab3f81e-544a-a152-6784-78fc4bc8baea", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "TAIDOOR RAT DLL Load", "query": "(process.command_line:(*dll,MyStart* OR *dll\\ MyStart*) OR (process.command_line:*\\ MyStart AND process.command_line:*rundll32.exe*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1055"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://us-cert.cisa.gov/ncas/analysis-reports/ar20-216a"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
