{"description": "Detects suspicious calls of DLLs in rundll32.dll exports by ordinal", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment", "Windows control panel elements have been identified as source (mmc)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a65b7b64-ce87-06a2-ee29-dd2b378cbc12", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Call by Ordinal", "query": "((process.executable.text:*\\\\rundll32.exe AND process.command_line.text:(*,#* OR *,\\ #* OR *.dll\\ #* OR *.ocx\\ #*)) AND (NOT ((process.command_line.text:*EDGEHTML.dll* AND process.command_line.text:*#141*) OR (process.command_line.text:*EDGEHTML.dll* AND process.command_line.text:*#141*) OR (process.parent.executable.text:*\\\\Msbuild\\\\Current\\\\Bin\\\\Tracker.exe AND process.command_line.text:(*\\\\FileTracker32.dll,#1* OR *\\\\FileTracker32.dll\\\",#1* OR *\\\\FileTracker64.dll,#1* OR *\\\\FileTracker64.dll\\\",#1*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://techtalk.pcmatic.com/2017/11/30/running-dll-files-malware-analysis/", "https://github.com/Neo23x0/DLLRunner", "https://twitter.com/cyb3rops/status/1186631731543236608", "https://www.welivesecurity.com/2022/03/01/isaacwiper-hermeticwizard-wiper-worm-targeting-ukraine/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
