{"description": "Detects PowerShell commands that decrypt an \".LNK\" \"file to drop the next stage of the malware.", "author": ["X__Junior (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "434c08ba-8406-4d15-8b24-782cb071a691", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Execution With Potential Decryption Capabilities", "query": "(process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\") AND winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\") AND process.command_line.text:(\"*Get\\-ChildItem\\ *\" OR \"*dir\\ *\" OR \"*gci\\ *\" OR \"*ls\\ *\") AND process.command_line.text:(\"*Get\\-Content\\ *\" OR \"*gc\\ *\" OR \"*cat\\ *\" OR \"*type\\ *\") AND process.command_line.text:\"*\\ \\^|\\ *\" AND process.command_line.text:\"*\\\\*.lnk*\" AND process.command_line.text:\"*\\-Recurse*\" AND process.command_line.text:\"*\\-Skip\\ *\")", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://research.checkpoint.com/2023/chinese-threat-actors-targeting-europe-in-smugx-campaign/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
