{"description": "Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe and fltmc.exe", "enabled": false, "false_positives": ["Legitimate usage of stordiag.exe."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "07d90add-6504-861b-896b-ccaa537b050d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution via stordiag.exe", "query": "((process.parent.executable:*\\\\stordiag.exe AND process.executable:(*\\\\schtasks.exe OR *\\\\systeminfo.exe OR *\\\\fltmc.exe)) AND (NOT (process.parent.executable:(c\\:\\\\windows\\\\system32\\\\* OR c\\:\\\\windows\\\\syswow64\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://strontic.github.io/xcyclopedia/library/stordiag.exe-1F08FC87C373673944F6A7E8B18CD845.html", "https://twitter.com/eral4m/status/1451112385041911809"], "timestamp_override": "event.ingested", "author": ["Austin Songer (@austinsonger)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
