{"description": "Detects suspicious command line to remove and 'exe' or 'dll'", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a29f5730-dc5b-1de4-a13c-1acdef3ff340", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Del in CommandLine", "query": "(process.command_line.text:*del\\ * AND ((process.command_line.text:*\\*.exe* AND process.command_line.text:*\\/f\\ * AND process.command_line.text:*\\/q\\ *) OR (process.command_line.text:*\\*.dll* AND process.command_line.text:*C\\:\\\\ProgramData\\\\*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
