{"description": "Detects a suspicious script executions from temporary folder", "enabled": false, "false_positives": ["Administrative scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d645772a-2a7d-dad8-4a8a-6d2e0169ea8e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Script Execution From Temp Folder", "query": "((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\mshta.exe OR *\\\\wscript.exe OR *\\\\cscript.exe) AND process.command_line.text:(*\\\\Windows\\\\Temp* OR *\\\\Temporary\\ Internet* OR *\\\\AppData\\\\Local\\\\Temp* OR *\\\\AppData\\\\Roaming\\\\Temp* OR *%TEMP%* OR *%TMP%* OR *%LocalAppData%\\\\Temp*)) AND (NOT (process.command_line.text:(*\\ >* OR *Out\\-File* OR *ConvertTo\\-Json* OR *\\-WindowStyle\\ hidden\\ \\-Verb\\ runAs* OR *\\\\Windows\\\\system32\\\\config\\\\systemprofile\\\\AppData\\\\Local\\\\Temp\\\\Amazon\\\\EC2\\-Windows\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Max Altgelt", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
