{"description": "Detects execution of \"curl.exe\" with the \"--insecure\" flag.", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Access to badly maintained internal or development systems"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Insecure Transfer Via Curl.EXE", "query": "(((process.executable.text:\"*\\\\curl.exe\") OR (winlog.event_data.OriginalFileName:\"curl.exe\")) AND (((process.command_line:/\\s-k\\s/)) OR (process.command_line.text:\"*\\-\\-insecure*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
