{"description": "Detects a certain command line flag combination used by Microsoft.NodejsTools.PressAnyKey.exe that can be used to execute any other binary", "enabled": false, "false_positives": ["Other tools with the same command line flag combination", "Legitimate uses as part of Visual Studio development"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f198be49-40b9-e903-7be0-06836e0be1d3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NodejsTools PressAnyKey Lolbin", "query": "((process.command_line:*Microsoft.NodejsTools.PressAnyKey.exe\\ normal\\ * OR (process.command_line:*.exe\\ normal\\ * AND process.command_line:*.exe)) AND (NOT ((process.executable:*\\\\Microsoft\\\\NodeJsTools\\\\NodeJsTools*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1463526834918854661"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
