{"description": "Detects Possible Squirrel Packages Manager as Lolbin", "enabled": false, "false_positives": ["1Clipboard", "Beaker Browser", "Caret", "Collectie", "Discord", "Figma", "Flow", "Ghost", "GitHub Desktop", "GitKraken", "Hyper", "Insomnia", "JIBO", "Kap", "Kitematic", "Now Desktop", "Postman", "PostmanCanary", "Rambox", "Simplenote", "Skype", "Slack", "SourceTree", "Stride", "Svgsus", "WebTorrent", "WhatsApp", "WordPress.com", "Atom", "Gitkraken", "Slack", "Teams"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa4b21c9-0057-4493-b289-2556416ae4d7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Squirrel Lolbin", "query": "((process.executable.text:*\\\\update.exe AND process.command_line.text:*.exe* AND process.command_line.text:(*\\-\\-processStart* OR *\\-\\-processStartAndWait* OR *\\-\\-createShortcut*)) AND (NOT ((process.command_line.text:*C\\:\\\\Users\\\\* AND process.command_line.text:*\\\\AppData\\\\Local\\\\Discord\\\\Update.exe* AND process.command_line.text:*\\ \\-\\-processStart\\ Discord.exe* OR process.command_line.text:*C\\:\\\\Users\\\\* AND process.command_line.text:*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\Update.exe\\ \\-\\-createShortcut\\ GitHubDesktop.exe* OR process.command_line.text:*C\\:\\\\Users\\\\* AND process.command_line.text:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe\\\"\\ \\-\\-processStart\\ \\\"Teams.exe\\\"*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/", "http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/"], "timestamp_override": "event.ingested", "author": ["Karneades / Markus Neis", "Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
