{"description": "Detects the usage of schtasks with the delete flag and the asterisk symbole to delete all tasks from the schedule of the local computer, including tasks scheduled by other users.", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "220457c1-1c9f-4c2e-afe6-9598926222c1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Delete All Scheduled Tasks", "query": "(process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\ \\/delete\\ * AND process.command_line.text:*\\/tn\\ \\* AND process.command_line.text:*\\ \\/f*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1489"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1489", "name": "Service Stop", "reference": "https://attack.mitre.org/techniques/T1489"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-delete"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
