{"description": "Performs execution of specified file, can be used for defensive evasion.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4aa4e90a-c4ad-1426-6f4b-faede47d9857", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Subsystem for Linux Bash Execution", "query": "((process.command_line.text:*bash.exe* AND process.command_line.text:*\\-c\\ *) AND (NOT ((process.parent.command_line.text:(*C\\:\\\\Program\\ Files\\\\Git\\\\post\\-install.bat* OR *C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Git\\\\post\\-install.bat* OR *echo\\ \\/etc\\/post\\-install\\/*.post*) OR process.command_line.text:*echo\\ \\/etc\\/post\\-install\\/*.post*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Bash/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
