{"description": "Detects the execution of a renamed binary often used by attackers or malware leveraging new Sysmon OriginalFileName datapoint.", "enabled": false, "false_positives": ["Custom applications use renamed binaries adding slight change to binary name. Typically this is easy to spot and add to whitelist", "PsExec installed via Windows Store doesn't contain original filename field (False negative)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1e957421-a5ae-c50f-f325-582b297c3000", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Renamed Binary", "query": "(winlog.event_data.OriginalFileName:(\"Cmd.Exe\" OR \"CONHOST.EXE\" OR \"PowerShell.EXE\" OR \"pwsh.dll\" OR \"powershell_ise.EXE\" OR \"psexec.exe\" OR \"psexec.c\" OR \"cscript.exe\" OR \"wscript.exe\" OR \"MSHTA.EXE\" OR \"REGSVR32.EXE\" OR \"wmic.exe\" OR \"CertUtil.exe\" OR \"RUNDLL32.EXE\" OR \"CMSTP.EXE\" OR \"msiexec.exe\" OR \"7z.exe\" OR \"WinRAR.exe\" OR \"wevtutil.exe\" OR \"net.exe\" OR \"net1.exe\" OR \"netsh.exe\") AND (NOT (process.executable:(*\\\\cmd.exe OR *\\\\conhost.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe OR *\\\\psexec.exe OR *\\\\psexec64.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\mshta.exe OR *\\\\regsvr32.exe OR *\\\\WMIC.exe OR *\\\\certutil.exe OR *\\\\rundll32.exe OR *\\\\cmstp.exe OR *\\\\msiexec.exe OR *\\\\7z.exe OR *\\\\WinRAR.exe OR *\\\\wevtutil.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\netsh.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1036/", "https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html", "https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html"], "timestamp_override": "event.ingested", "author": ["Matthew Green - @mgreen27", "Ecco", "James Pemberton / @4A616D6573", "oscd.community (improvements)", "Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
