{"description": "Adversaries may destroy data and files on specific systems or in large numbers on a network to interrupt availability to systems, services, and network resources.\nData destruction is likely to render stored data irrecoverable by forensic techniques through overwriting files or data on local and remote drives\n", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4b046706-5789-4673-b111-66f25fe99534", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Overwrite Deleted Data with Cipher", "query": "(((winlog.event_data.OriginalFileName:\"CIPHER.EXE\") OR (process.executable.text:*\\\\cipher.exe)) AND process.command_line.text:*\\ \\/w\\:*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1485"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1485", "name": "Data Destruction", "reference": "https://attack.mitre.org/techniques/T1485"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md#atomic-test-3---overwrite-deleted-data-on-c-drive"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
