{"description": "Detects the addition of a new LogonScript to the registry value \"UserInitMprLogonScript\" for potential persistence", "author": ["Tom Ueltschi (@c_APT_ure)"], "enabled": false, "false_positives": ["Legitimate addition of Logon Scripts via the command line by administrators or third party tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "21d856f9-9281-4ded-9377-51a1a6e2a432", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Logon Scripts - CommandLine", "query": "process.command_line.text:\"*UserInitMprLogonScript*\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1037"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1037", "name": "Boot or Logon Initialization Scripts", "reference": "https://attack.mitre.org/techniques/T1037"}]}], "version": 1, "references": ["https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
