{"description": "Dump sam, system or security hives using REG.exe utility", "enabled": false, "false_positives": ["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "db570a86-d26a-347d-05cd-394dc34c75ff", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Grabbing Sensitive Hives via Reg Utility", "query": "(process.executable:*\\\\reg.exe AND process.command_line:(*save* OR *export* OR *\u02e2ave* OR *e\u02e3port*) AND process.command_line:(*hklm* OR *hk\u02eam* OR *hkey_local_machine* OR *hkey_\u02eaocal_machine* OR *hkey_loca\u02ea_machine* OR *hkey_\u02eaoca\u02ea_machine*) AND process.command_line:(*\\\\system OR *\\\\sam OR *\\\\security OR *\\\\\u02e2ystem OR *\\\\sy\u02e2tem OR *\\\\\u02e2y\u02e2tem OR *\\\\\u02e2am OR *\\\\\u02e2ecurity))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment", "https://eqllib.readthedocs.io/en/latest/analytics/aed95fc6-5e3f-49dc-8b35-06508613f979.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003/T1003.md", "https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov", "Endgame", "JHasenbusch", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
