{"description": "Identifies suspicious mshta.exe commands.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4c7b5015-47d5-ba9c-7b04-25c2373a9426", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Mshta JavaScript Execution", "query": "(process.executable:*\\\\mshta.exe AND process.command_line:*javascript*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://eqllib.readthedocs.io/en/latest/analytics/6bc283c4-21f2-4aed-a05c-a9a3ffa95dd4.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.005/T1218.005.md"], "timestamp_override": "event.ingested", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
