{"description": "Detects when a user enable developer features such as \"Developer Mode\" or \"Application Sideloading\". Which allows the user to install untrusted packages.", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b8bf1493-e191-cd5e-31ed-8d0ed5783c0e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Signing Bypass Via Windows Developer Features", "query": "(((process.executable.text:*\\\\SystemSettingsAdminFlows.exe) OR (winlog.event_data.OriginalFileName:\"SystemSettingsAdminFlows.EXE\")) AND process.command_line.text:*TurnOnDeveloperFeatures* AND process.command_line.text:(*DeveloperUnlock* OR *EnableSideloading*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
