{"description": "Detects suspicious Windows Error Reporting manager (wermgr.exe) child process", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "396f6630-f3ac-44e3-bfc8-1b161bc00c4e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Child Process Of Wermgr.EXE", "query": "(event.category:process AND process.parent.executable:/.*\\\\[Ww][Ee][Rr][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Pp][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ee][Tt][Ss][Tt][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Nn][Ss][Ll][Oo][Oo][Kk][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\_[Ii][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Ii][Nn][Ff][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Hh][Oo][Aa][Mm][Ii]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html", "https://www.echotrail.io/insights/search/wermgr.exe", "https://github.com/binderlabs/DirCreate2System"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
