{"description": "Detects the execution of the LocalPotato POC based on basic PE metadata information and default CLI examples", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6bd75993-9888-4f91-9404-e1e4e4e34b77", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - LocalPotato Execution", "query": "((process.executable.text:\"*\\\\LocalPotato.exe\") OR ((process.command_line.text:\"*.exe\\ \\-i\\ C\\:\\\\*\" AND process.command_line.text:\"*\\-o\\ Windows\\\\*\")) OR (winlog.event_data.Hashes:(*IMPHASH\\=E1742EE971D6549E8D4D81115F88F1FC* OR *IMPHASH\\=DD82066EFBA94D7556EF582F247C8BB5*)) OR (winlog.event_data.Imphash:(\"E1742EE971D6549E8D4D81115F88F1FC\" OR \"DD82066EFBA94D7556EF582F247C8BB5\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.localpotato.com/localpotato_html/LocalPotato.html", "https://github.com/decoder-it/LocalPotato"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
