{"description": "Detects a tscon.exe start as LOCAL SYSTEM", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7af547b6-7d9b-6c9d-2ee2-3a4521296d43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious TSCON Start as SYSTEM", "query": "(user.name:(NT\\ AUTHORITY\\\\SYSTEM* OR AUTORITE\\ NT\\\\Sys*) AND process.executable:*\\\\tscon.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html", "https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6", "https://www.ired.team/offensive-security/lateral-movement/t1076-rdp-hijacking-for-lateral-movement"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
