{"description": "Detects usage of \"rar\" to add files to an archive for potential compression. An adversary may compress data (e.g. sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network.", "author": ["Timur Zinniatullin", "E.M. Anhaus", "oscd.community"], "enabled": false, "false_positives": ["Highly likely if rar is a default archiver in the monitored environment."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6f3e2987-db24-4c78-a860-b4f4095a7095", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Files Added To An Archive Using Rar.EXE", "query": "(process.executable.text:*\\\\rar.exe AND process.command_line.text:*\\ a\\ *)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1560"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1560", "name": "Archive Collected Data", "reference": "https://attack.mitre.org/techniques/T1560"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md", "https://eqllib.readthedocs.io/en/latest/analytics/1ec33c93-3d0b-4a28-8014-dbdaae5c60ae.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
