{"description": "Detects suspicious process patterns found in logs when CrackMapExec is used", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f26307d8-14cd-47e3-a26b-4b4769f24af6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - CrackMapExec Process Patterns", "query": "(((process.command_line.text:\"*tasklist\\ \\/fi\\ *\" AND process.command_line.text:\"*Imagename\\ eq\\ lsass.exe*\" AND process.command_line.text:(\"*cmd.exe\\ \\/c\\ *\" OR \"*cmd.exe\\ \\/r\\ *\" OR \"*cmd.exe\\ \\/k\\ *\" OR \"*cmd\\ \\/c\\ *\" OR \"*cmd\\ \\/r\\ *\" OR \"*cmd\\ \\/k\\ *\") AND user.name:(*AUTHORI* OR *AUTORI*))) OR ((process.command_line.text:\"*do\\ rundll32.exe\\ C\\:\\\\windows\\\\System32\\\\comsvcs.dll,\\ MiniDump*\" AND process.command_line.text:\"*\\\\Windows\\\\Temp\\\\*\" AND process.command_line.text:\"*\\ full*\" AND process.command_line.text:\"*%%B*\")) OR ((process.command_line.text:\"*tasklist\\ \\/v\\ \\/fo\\ csv*\" AND process.command_line.text:\"*findstr\\ \\/i\\ \\\"lsass\\\"*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
