{"description": "Detects wmiprvse spawning processes", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a182f9ad-91aa-b852-a799-edc5a2eae1ff", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Wmiprvse Spawning Process", "query": "((process.parent.executable:*\\\\WmiPrvSe.exe AND (NOT (LogonId:(\"0x3e7\" OR \"null\") OR user.name:(NT\\ AUTHORITY\\\\SYSTEM* OR AUTORITE\\ NT\\\\Sys*) OR process.executable:(*\\\\WmiPrvSE.exe OR *\\\\WerFault.exe)))) AND (NOT (NOT _exists_:LogonId)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
