{"description": "Detects suspicious patterns in program names or folders that are often found in malicious samples or hacktools", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate tools that accidentally match on the searched patterns"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Program Names", "query": "((process.executable.text:(\"*\\\\CVE\\-202*\" OR \"*\\\\CVE202*\")) OR (process.executable.text:(\"*\\\\poc.exe\" OR \"*\\\\artifact.exe\" OR \"*\\\\artifact64.exe\" OR \"*\\\\artifact_protected.exe\" OR \"*\\\\artifact32.exe\" OR \"*\\\\artifact32big.exe\" OR \"*obfuscated.exe\" OR \"*obfusc.exe\" OR \"*\\\\meterpreter\")) OR (process.command_line.text:(\"*inject.ps1*\" OR \"*Invoke\\-CVE*\" OR \"*pupy.ps1*\" OR \"*payload.ps1*\" OR \"*beacon.ps1*\" OR \"*PowerView.ps1*\" OR \"*bypass.ps1*\" OR \"*obfuscated.ps1*\" OR \"*obfusc.ps1*\" OR \"*obfus.ps1*\" OR \"*obfs.ps1*\" OR \"*evil.ps1*\" OR \"*MiniDogz.ps1*\" OR \"*_enc.ps1*\" OR \"*\\\\shell.ps1*\" OR \"*\\\\rshell.ps1*\" OR \"*revshell.ps1*\" OR \"*\\\\av.ps1*\" OR \"*\\\\av_test.ps1*\" OR \"*adrecon.ps1*\" OR \"*mimikatz.ps1*\" OR \"*\\\\PowerUp_*\" OR \"*powerup.ps1*\" OR \"*\\\\Temp\\\\a.ps1*\" OR \"*\\\\Temp\\\\p.ps1*\" OR \"*\\\\Temp\\\\1.ps1*\" OR \"*Hound.ps1*\" OR \"*encode.ps1*\" OR \"*powercat.ps1*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
