{"description": "Detects the execution of an Office application that points to a document that is located in a trusted location. Attackers often used this to avoid macro security and execute their malicious code.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f99abdf0-6283-4e71-bd2b-b5c048a94743", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious Office Document Executed From Trusted Location", "query": "((process.parent.executable.text:(\"*\\\\explorer.exe\" OR \"*\\\\dopus.exe\") AND ((process.executable.text:(\"*\\\\EXCEL.EXE\" OR \"*\\\\POWERPNT.EXE\" OR \"*\\\\WINWORD.exe\")) OR (winlog.event_data.OriginalFileName:(\"Excel.exe\" OR \"POWERPNT.EXE\" OR \"WinWord.exe\"))) AND process.command_line.text:(\"*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Templates*\" OR \"*\\\\AppData\\\\Roaming\\\\Microsoft\\\\Word\\\\Startup\\\\*\" OR \"*\\\\Microsoft\\ Office\\ \\(x86\\)\\\\root\\\\Templates\\\\*\" OR \"*\\\\Microsoft\\ Office\\ \\(x86\\)\\\\Templates\\\\*\" OR \"*\\\\Microsoft\\ Office\\\\root\\\\Templates\\\\*\" OR \"*\\\\Microsoft\\ Office\\\\Templates\\\\*\")) AND (NOT process.command_line.text:(\"*.dotx\" OR \"*.xltx\" OR \"*.potx\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["Internal Research", "https://twitter.com/Max_Mal_/status/1633863678909874176", "https://techcommunity.microsoft.com/t5/microsoft-365-blog/new-security-hardening-policies-for-trusted-documents/ba-p/3023465", "https://twitter.com/_JohnHammond/status/1588155401752788994"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
