{"description": "load malicious registered COM objects", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f1edd233-30b5-4823-9e6a-c4171b24d316", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rundll32 Registered COM Objects", "query": "(((process.executable.text:*\\\\rundll32.exe) OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND (process.command_line.text:(*\\-sta\\ * OR *\\-localserver\\ *) AND process.command_line.text:*\\{* AND process.command_line.text:*\\}*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://nasbench.medium.com/a-deep-dive-into-rundll32-exe-642344b41e90", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.015/T1546.015.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
