{"description": "Detects certain command line parameters often used during reconnaissance activity via web shells", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bed2a484-9348-4143-8a8a-b801c979301c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Webshell Detection With Command Line Keywords", "query": "((process.parent.executable:(*\\\\w3wp.exe OR *\\\\php\\-cgi.exe OR *\\\\nginx.exe OR *\\\\httpd.exe OR *\\\\caddy.exe OR *\\\\ws_tomcatservice.exe) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.executable:(*\\-tomcat\\-* OR *\\\\tomcat*)) OR (process.parent.executable:(*\\\\java.exe OR *\\\\javaw.exe) AND process.command_line:(*catalina.jar* OR *CATALINA_HOME*))) AND ((process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:(*\\ user\\ * OR *\\ use\\ * OR *\\ group\\ *)) OR (process.executable:*\\\\ping.exe AND process.command_line:*\\ \\-n\\ *) OR process.command_line:(*&cd&echo* OR *cd\\ \\/d\\ *) OR (process.executable:*\\\\wmic.exe AND process.command_line:*\\ \\/node\\:*) OR process.executable:(*\\\\whoami.exe OR *\\\\systeminfo.exe OR *\\\\quser.exe OR *\\\\ipconfig.exe OR *\\\\pathping.exe OR *\\\\tracert.exe OR *\\\\netstat.exe OR *\\\\schtasks.exe OR *\\\\vssadmin.exe OR *\\\\wevtutil.exe OR *\\\\tasklist.exe) OR process.command_line:(*\\ Test\\-NetConnection\\ * OR *dir\\ \\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1018", "T1033", "T1087", "T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-ii.html", "https://unit42.paloaltonetworks.com/bumblebee-webshell-xhunt-campaign/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Jonhnathan Ribeiro", "Anton Kutepov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
