{"description": "Detects the execution of netsh with the \"trace\" flag in order to start a network capture", "author": ["Kutepov Anton", "oscd.community"], "enabled": false, "false_positives": ["Legitimate administration activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d3c3861d-c504-4c77-ba55-224ba82d0118", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Network Trace Capture Started Via Netsh.EXE", "query": "(((process.executable.text:\"*\\\\netsh.exe\") OR (winlog.event_data.OriginalFileName:\"netsh.exe\")) AND (process.command_line.text:\"*trace*\" AND process.command_line.text:\"*start*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1040"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1040", "name": "Network Sniffing", "reference": "https://attack.mitre.org/techniques/T1040"}]}, {"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1040", "name": "Network Sniffing", "reference": "https://attack.mitre.org/techniques/T1040"}]}], "version": 1, "references": ["https://blogs.msdn.microsoft.com/canberrapfe/2012/03/30/capture-a-network-trace-without-installing-anything-capture-a-network-trace-of-a-reboot/", "https://klausjochem.me/2016/02/03/netsh-the-cyber-attackers-tool-of-choice/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
