{"description": "Detects Schtask creations that point to a suspicious folder or an environment variable often used by malware", "enabled": false, "false_positives": ["Benign scheduled tasks creations or executions that happen often during software installations", "Software that uses the AppData folder and scheduled tasks to update the software in the AppData folders"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b9cc11ac-3865-7175-dca5-0c0c06a11814", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Schtasks From Env Var Folder", "query": "(((process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\ \\/create\\ * AND process.command_line.text:(*%AppData%* OR *\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\Roaming\\\\* OR *%Public%* OR *\\\\Users\\\\Public* OR *C\\:\\\\Windows\\\\Temp* OR *C\\:\\\\Perflogs*)) OR (process.parent.command_line.text:*\\\\svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ Schedule AND process.command_line.text:(*%Public%* OR *\\\\Users\\\\Public* OR *C\\:\\\\Windows\\\\Temp* OR *C\\:\\\\Perflogs*))) AND (NOT ((process.command_line.text:(*update_task.xml* OR *\\/Create\\ \\/TN\\ TVInstallRestore\\ \\/TR*) OR process.parent.command_line.text:*unattended.ini*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/", "https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
