{"description": "Detects the removal of Sysmon, which could be a potential attempt at defense evasion", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate administrators might use this command to remove Sysmon for debugging purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6a5f68d1-c4b5-46b9-94ee-5324892ea939", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Uninstall Sysinternals Sysmon", "query": "(((process.executable.text:(\"*\\\\Sysmon64.exe\" OR \"*\\\\Sysmon.exe\")) OR (winlog.event_data.Description:\"System activity monitor\")) AND process.command_line.text:(\"*\\-u*\" OR \"*\\/u*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-11---uninstall-sysmon"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
