{"description": "Shadow Copies storage symbolic link creation using operating systems utilities", "author": ["Teymur Kheirkhabarov", "oscd.community"], "enabled": false, "false_positives": ["Legitimate administrator working with shadow copies, access for backup purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40b19fa6-d835-400c-b301-41f3a2baacaf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "VolumeShadowCopy Symlink Creation Via Mklink", "query": "(process.command_line.text:\"*mklink*\" AND process.command_line.text:\"*HarddiskVolumeShadowCopy*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
