{"description": "Detects the execution of WMIC to query information on a remote system", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7773b877-5abb-4a3e-b9c9-fd0369b59b00", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WMIC Remote Command Execution", "query": "((((process.executable.text:\"*\\\\WMIC.exe\") OR (winlog.event_data.OriginalFileName:\"wmic.exe\")) AND process.command_line.text:\"*\\/node\\:*\") AND (NOT process.command_line.text:(\"*\\/node\\:127.0.0.1\\ *\" OR \"*\\/node\\:localhost\\ *\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wmic"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
