{"description": "Detects use of aspnet_regiis to decrypt Microsoft IIS connection strings. An attacker with Microsoft IIS web server access via a webshell or alike can decrypt and dump any hardcoded connection strings, such as the MSSQL service account password using aspnet_regiis command.", "author": ["Tim Rauch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "97dbf6e2-e436-44d8-abee-4261b24d3e41", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft IIS Connection Strings Decryption", "query": "(((process.executable.text:*\\\\aspnet_regiis.exe) OR (winlog.event_data.OriginalFileName:\"aspnet_regiis.exe\")) AND (process.command_line.text:*connectionStrings* AND process.command_line.text:*\\ \\-pdf*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/microsoft-iis-connection-strings-decryption.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
