{"description": "Detects the execution of CSharp interactive console by PowerShell", "enabled": false, "false_positives": ["Possible depending on environment. Pair with other factors such as net connections, command-line args, etc."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e71c3338-1c9d-de23-c229-a6d3be8c7366", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Use of CSharp Interactive Console", "query": "(process.executable:*\\\\csi.exe AND process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe) AND winlog.event_data.OriginalFileName:\"csi.exe\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1127"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/detecting-attacks-leveraging-the-net-framework/"], "timestamp_override": "event.ingested", "author": ["Michael R. (@nahamike01)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
