{"description": "Detects a suspicious parent of csc.exe, which could by a sign of payload delivery", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "de5c0b15-b6fd-4789-9f25-54eb8fa6b6dd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Parent of Csc.exe", "query": "(process.executable:*\\\\csc.exe AND process.parent.executable:(*\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\mshta.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059", "T1059", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1094924091256176641"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
