{"description": "Execute Hashcat.exe with provided SAM file from registry of Windows and Password list to crack against", "enabled": false, "false_positives": ["Tools that accidentally use the same command line flags and values"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "39b31e81-5f5f-4898-9c0e-2160cfc0f9bf", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Password Cracking with Hashcat", "query": "(process.executable:*\\\\hashcat.exe OR (process.command_line:*\\-a\\ * AND process.command_line:*\\-m\\ 1000\\ * AND process.command_line:*\\-r\\ *))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat", "https://hashcat.net/wiki/doku.php?id=hashcat"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
