{"description": "Detects the use of a Microsoft signed script 'REGISTER_APP.VBS' to register a VSS/VDS Provider as a COM+ application.", "enabled": false, "false_positives": ["Legitimate usage of the script. Always investigate what's being registred to confirm if it's benign"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1c8774a0-44d4-4db0-91f8-e792359c70bd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "REGISTER_APP.VBS Proxy Execution", "query": "(process.command_line.text:*\\\\register_app.vbs* AND process.command_line.text:*\\-register*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/sblmsrsn/status/1456613494783160325?s=20"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
