{"description": "Adversaries may use NTFS file attributes to hide their malicious data in order to evade detection", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7f43c430-5001-4f8b-aaa9-c3b88f18fa5c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Execute From Alternate Data Streams", "query": "(process.command_line:*txt\\:* AND ((process.command_line:*type\\ * AND process.command_line:*\\ >\\ *) OR (process.command_line:*makecab\\ * AND process.command_line:*.cab*) OR (process.command_line:*reg\\ * AND process.command_line:*\\ export\\ *) OR (process.command_line:*regedit\\ * AND process.command_line:*\\ \\/E\\ *) OR (process.command_line:*esentutl\\ * AND process.command_line:*\\ \\/y\\ * AND process.command_line:*\\ \\/d\\ * AND process.command_line:*\\ \\/o\\ *)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.004/T1564.004.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
