{"description": "Detects usage of \"MSPUB\" (Microsoft Publisher) to download arbitrary files", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3b3c7f55-f771-4dd6-8a6e-08d057a17caf", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Download Arbitrary Files Via MSPUB.EXE", "query": "((process.executable.text:*\\\\MSPUB.exe OR winlog.event_data.OriginalFileName:\"MSPUB.exe\") AND process.command_line.text:(*http\\:\\/\\/* OR *https\\:\\/\\/* OR *ftp\\:\\/\\/*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/pull/238/files"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
