{"description": "Detects an svchost process spawning an instance of an office application. This happens when the initial word application creates an instance of one of the Office COM objects such as 'Word.Application', 'Excel.Application', etc.\nThis can be used by malicious actors to create malicious Office documents with macros on the fly. (See vba2clr project in the references)\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage of office automation via scripting"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9bdaf1e9-fdef-443b-8081-4341b74a7e28", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious New Instance Of An Office COM Object", "query": "(process.parent.executable.text:\"*\\\\svchost.exe\" AND process.executable.text:(\"*\\\\winword.exe\" OR \"*\\\\excel.exe\" OR \"*\\\\powerpnt.exe\" OR \"*\\\\msaccess.exe\" OR \"*\\\\mspub.exe\" OR \"*\\\\eqnedt32.exe\" OR \"*\\\\visio.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/previous-versions/office/troubleshoot/office-developer/automate-word-create-file-using-visual-basic", "https://github.com/med0x2e/vba2clr"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
