{"description": "Detects potential DLL sideloading using the Microsoft Office winword process via the '/l' flag.", "author": ["Victor Sergeev", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f7375e28-5c14-432f-b8d1-1db26c832df3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Arbitrary DLL Load Using Winword", "query": "(((process.executable.text:\"*\\\\WINWORD.exe\") OR (winlog.event_data.OriginalFileName:\"WinWord.exe\")) AND (process.command_line.text:\"*\\/l\\ *\" AND process.command_line.text:\"*.dll*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
