{"description": "Detects the execution of a renamed meg.exe of MegaSync during incident response engagements associated with ransomware families like Nefilim, Sodinokibi, Pysa, and Conti.", "enabled": false, "false_positives": ["Software that illegaly integrates MegaSync in a renamed form", "Administrators that have renamed MegaSync"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2cb510ea-f1d0-cae8-0d82-6c8e339512df", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed MegaSync", "query": "((process.parent.executable.text:*\\\\explorer.exe AND process.command_line.text:*C\\:\\\\Windows\\\\Temp\\\\meg.exe*) OR (winlog.event_data.OriginalFileName:\"meg.exe\" AND (NOT (process.executable.text:*\\\\meg.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://redcanary.com/blog/rclone-mega-extortion/"], "timestamp_override": "event.ingested", "author": ["Sittikorn S"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
