{"description": "Detects when the Console Window Host (conhost.exe) process is spawned by a suspicious parent process, which could be indicative of code injection.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cbb9e3d1-2386-4e59-912e-62f1484f7a89", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Conhost Spawned By Suspicious Parent Process", "query": "((process.executable.text:*\\\\conhost.exe AND process.parent.executable.text:(*\\\\svchost.exe OR *\\\\lsass.exe OR *\\\\services.exe OR *\\\\smss.exe OR *\\\\winlogon.exe OR *\\\\explorer.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\userinit.exe OR *\\\\wininit.exe OR *\\\\spoolsv.exe OR *\\\\ctfmon.exe)) AND (NOT (process.parent.command_line.text:(*\\-k\\ apphost\\ \\-s\\ AppHostSvc* OR *\\-k\\ imgsvc* OR *\\-k\\ netsvcs\\ \\-p\\ \\-s\\ NetSetupSvc* OR *\\-k\\ LocalSystemNetworkRestricted\\ \\-p\\ \\-s\\ NgcSvc* OR *\\-k\\ wsappx\\ \\-p\\ \\-s\\ ClipSVC* OR *\\-k\\ netsvcs\\ \\-p\\ \\-s\\ wlidsvc*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html"], "timestamp_override": "event.ingested", "author": ["Tim Rauch"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
