{"description": "Detects use of an encoded/obfuscated version of an IP address (hex, octal...) in an URL combined with a download command", "author": ["Florian Roth (Nextron Systems)", "X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cb5a2333-56cf-4562-8fcb-22ba1bca728d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Obfuscated IP Download Activity", "query": "(event.category:process AND (process.command_line:(/.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt].*/ OR /.*[Ii][Ww][Rr]\\ .*/ OR /.*[Ww][Gg][Ee][Tt]\\ .*/ OR /.*[Cc][Uu][Rr][Ll]\\ .*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee].*/ OR /.*[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg].*/) AND ((process.command_line:(/.*\\/\\/0[Xx].*/ OR /.*\\.0[Xx].*/ OR /.*\\.00[Xx].*/)) OR ((process.command_line:/.*[Hh][Tt][Tt][Pp]\\:\\/\\/\\%.*/ AND process.command_line:/.*\\%2[Ee].*/)) OR ((((process.command_line:/https?://[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,5}/)) OR ((process.command_line:/https?://[0-9]{1,3}\\.[0-9]{1,8}/)) OR ((process.command_line:/https?://[0-9]{1,10}/)) OR ((process.command_line:/https?://(0[0-9]{1,11}\\.){3}0[0-9]{1,11}/)) OR ((process.command_line:/https?://0[0-9]{1,11}/)))))) AND (NOT (process.command_line:/https?://((25[0-5]|(2[0-4]|1\\d|[1-9]|)\\d)\\.?\\b){4}/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://h.43z.one/ipconverter/", "https://twitter.com/Yasser_Elsnbary/status/1553804135354564608", "https://twitter.com/fr0s7_/status/1712780207105404948"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
