{"description": "Detect an interactive AT job, which may be used as a form of privilege escalation.", "enabled": false, "false_positives": ["Unlikely (at.exe deprecated as of Windows 8)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ade74e65-e407-d7ba-fccf-0648be366dc8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Interactive AT Job", "query": "(process.executable:*\\\\at.exe AND process.command_line:*interactive*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.002/T1053.002.md", "https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html"], "timestamp_override": "event.ingested", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
