{"description": "Detects the use of the lesser known remote execution tool named CsExec (a PsExec alternative)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d08a2711-ee8b-4323-bdec-b7d85e892b31", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CsExec Remote Execution Tool Usage", "query": "(process.executable.text:*\\\\csexec.exe OR winlog.event_data.Description:\"csexec\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1569", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://github.com/malcomvetter/CSExec", "https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
