{"description": "Detects the PowerShell command lines with special characters", "author": ["Teymur Kheirkhabarov (idea)", "Vasiliy Burov (rule)", "oscd.community", "Tim Shelton (fp)"], "enabled": false, "false_positives": ["Amazon SSM Document Worker", "Windows Defender ATP"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d7bcd677-645d-4691-a8d4-7a5602b780d1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential PowerShell Command Line Obfuscation", "query": "((((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND (((process.command_line:/.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*\\+.*/)) OR ((process.command_line:/.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*\\{.*/)) OR ((process.command_line:/.*\\^.*\\^.*\\^.*\\^.*\\^.*/)) OR ((process.command_line:/.*`.*`.*`.*`.*`.*/)))) AND (NOT ((process.parent.executable.text:\"C:\\Program Files\\Amazon\\SSM\\ssm-document-worker.exe\") OR (process.command_line.text:(\"*new\\ EventSource\\(\\\"Microsoft.Windows.Sense.Client.Management\\\"*\" OR \"*public\\ static\\ extern\\ bool\\ InstallELAMCertificateInfo\\(SafeFileHandle\\ handle\\);*\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=64"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
