{"description": "Uninstall an application with wmic", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "de9fa8ae-27a2-edcf-c3eb-3e911e12b1a4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WMI Uninstall An Application", "query": "((process.executable:*\\\\WMIC.exe OR winlog.event_data.OriginalFileName:\"wmic.exe\") AND process.command_line:*call\\ uninstall*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.md#atomic-test-10---application-uninstall-using-wmic"], "timestamp_override": "event.ingested", "author": ["frac113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
