{"description": "Execution of well known tools for data exfiltration and tunneling", "enabled": false, "false_positives": ["Legitimate Administrator using tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dea1c3de-f435-c701-5681-cdf841287d44", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Exfiltration and Tunneling Tools Execution", "query": "process.executable:(*\\\\plink.exe OR *\\\\socat.exe OR *\\\\stunnel.exe OR *\\\\httptunnel.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1041", "T1071", "T1572"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1041", "name": "Exfiltration Over C2 Channel", "reference": "https://attack.mitre.org/techniques/T1041"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
