{"description": "Detects suspicious use of XORDump process memory dumping utility", "enabled": false, "false_positives": ["Another tool that uses the command line switches of XORdump"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "66e563f9-1cbd-4a22-a957-d8b7c0f44372", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "XORDump Use", "query": "(process.executable:*\\\\xordump.exe OR process.command_line:(*\\ \\-process\\ lsass.exe\\ * OR *\\ \\-m\\ comsvcs\\ * OR *\\ \\-m\\ dbghelp\\ * OR *\\ \\-m\\ dbgcore\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://github.com/audibleblink/xordump"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
