{"description": "Detects uses of a renamed legitimate createdump.exe LOLOBIN utility to dump process memory", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Command lines that use the same flags"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1a1ed54a-2ba4-4221-94d5-01dee560d71e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed CreateDump Utility Execution", "query": "(((winlog.event_data.OriginalFileName:\"FX_VER_INTERNALNAME_STR\") OR ((process.command_line.text:\"*\\ \\-u\\ *\" AND process.command_line.text:\"*\\ \\-f\\ *\" AND process.command_line.text:\"*.dmp*\")) OR ((process.command_line.text:\"*\\ \\-\\-full\\ *\" AND process.command_line.text:\"*\\ \\-\\-name\\ *\" AND process.command_line.text:\"*.dmp*\"))) AND (NOT process.executable.text:\"*\\\\createdump.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/", "https://twitter.com/bopin2020/status/1366400799199272960"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
