{"description": "Detects AnyDesk Remote Desktop silent installation. Which can be used by attackers to gain remote access.", "author": ["J\u00e1n Tren\u010dansk\u00fd"], "enabled": false, "false_positives": ["Legitimate deployment of AnyDesk"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "114e7f1c-f137-48c8-8f54-3088c24ce4b9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Access Tool - AnyDesk Silent Installation", "query": "(process.command_line.text:\"*\\-\\-install*\" AND process.command_line.text:\"*\\-\\-start\\-with\\-win*\" AND process.command_line.text:\"*\\-\\-silent*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/TheDFIRReport/status/1423361119926816776?s=20", "https://support.anydesk.com/Automatic_Deployment"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
