{"description": "Detects usage of the \"Add-WindowsCapability\" cmdlet to add Windows capabilities. Notable capabilities could be \"OpenSSH\" and others.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage of the capabilities by administrators or users. Add additional filters accordingly."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b36d01a3-ddaf-4804-be18-18a6247adfcd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Add Windows Capability Via PowerShell Cmdlet", "query": "(((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:\"*Add\\-WindowsCapability*\" AND process.command_line.text:\"*OpenSSH.*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse?tabs=powershell", "https://www.virustotal.com/gui/file/af1c82237b6e5a3a7cdbad82cc498d298c67845d92971bada450023d1335e267/content"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
