{"description": "Detects potential exploitation attempt of undocumented Windows Server Pre Auth Remote Code Execution (RCE)", "author": ["Florian Roth", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6d5b8176-d87d-4402-8af4-53aee9db7b5d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Exploitation Attempt Of Undocumented WindowsServer RCE", "query": "(process.parent.executable.text:*\\\\svchost.exe AND process.executable.text:*\\\\svchost.exe AND process.parent.command_line.text:*\\-k\\ DHCPServer* AND process.command_line.text:*\\-k\\ DHCPServer* AND user.name:(*NETWORK\\ SERVICE* OR *NETZWERKDIENST* OR *SERVIZIO\\ DI\\ RETE* OR *SERVICIO\\ DE\\ RED*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/YanZiShuang/status/1616777483646533632?s=20&t=TQT9tUuPbQJai4v6HtsOQw", "https://twitter.com/hackerfantastic/status/1616455335203438592?s=20"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
