{"description": "Detects execution of the built-in script located in \"C:\\Windows\\System32\\gatherNetworkInfo.vbs\". Which can be used to gather information about the target machine", "author": ["blueteamer8699"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "47b7d26e-eabc-814a-5614-ba4f428dd180", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Reconnaissance Activity Via GatherNetworkInfo.VBS", "query": "(((process.executable.text:(*\\\\cscript.exe OR *\\\\wscript.exe)) OR (winlog.event_data.OriginalFileName:(\"cscript.exe\" OR \"wscript.exe\"))) AND process.command_line.text:*gatherNetworkInfo.vbs*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059", "T1615"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1615", "name": "Group Policy Discovery", "reference": "https://attack.mitre.org/techniques/T1615"}]}], "version": 1, "references": ["https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs", "https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
