{"description": "Detects Task Scheduler .job import arbitrary DACL write\\par", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e5f54ee8-c1c3-f41d-3238-c16a8e1ea78d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows 10 Scheduled Task SandboxEscaper 0-day", "query": "(process.executable:*\\\\schtasks.exe AND winlog.event_data.OriginalFileName:\"schtasks.exe\" AND process.command_line:*\\/change* AND process.command_line:*\\/TN* AND process.command_line:*\\/RU* AND process.command_line:*\\/RP*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://github.com/SandboxEscaper/polarbearrepo/tree/master/bearlpe"], "timestamp_override": "event.ingested", "author": ["Olaf Hartong"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
