{"description": "Detects a file or folder's permissions being modified.", "enabled": false, "false_positives": ["Users interacting with the files on their own (unlikely unless privileged users).", "Dynatrace app"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3d88da35-814c-1d25-17f1-9adca3050a3d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File or Folder Permissions Modifications", "query": "(((process.executable.text:(*\\\\cacls.exe OR *\\\\icacls.exe OR *\\\\net.exe OR *\\\\net1.exe) AND process.command_line.text:*\\/grant*) OR (process.executable.text:*\\\\attrib.exe AND process.command_line.text:*\\-r*) OR process.executable.text:*\\\\takeown.exe) AND (NOT ((process.command_line.text:*ICACLS\\ C\\:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\connectivity.history\\ \\/reset) OR (process.command_line.text:*ICACLS\\ C\\:\\\\ProgramData\\\\dynatrace\\\\gateway\\\\config\\\\config.properties\\ \\/grant\\ \\:r\\ * AND process.command_line.text:*S\\-1\\-5\\-19\\:F*) OR (process.command_line.text:*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code* OR process.parent.executable.text:*\\\\Microsoft\\ VS\\ Code\\\\Code.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1222"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1222", "name": "File and Directory Permissions Modification", "reference": "https://attack.mitre.org/techniques/T1222"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh750728(v=ws.11)"], "timestamp_override": "event.ingested", "author": ["Jakob Weinzettl", "oscd.community", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
