{"description": "Detect modification of services configuration (ImagePath, FailureCommand and ServiceDLL) in registry by processes with Medium integrity level", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56384687-7154-1ff2-03e4-81abc6cd7ddf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Possible Privilege Escalation via Service Permissions Weakness", "query": "(IntegrityLevel:\"Medium\" AND process.command_line.text:*ControlSet* AND process.command_line.text:*services* AND process.command_line.text:(*\\\\ImagePath* OR *\\\\FailureCommand* OR *\\\\ServiceDll*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment", "https://pentestlab.blog/2017/03/31/insecure-registry-permissions/"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
