{"description": "Detects launch of executable by calling the LaunchApplication function from pcwutl.dll library.", "author": ["Julia Fomina", "oscd.community"], "enabled": false, "false_positives": ["Use of Program Compatibility Troubleshooter Helper"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9386d78a-7207-4048-9c9f-a93a7c2d1c05", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Code Execution via Pcwutl.dll", "query": "(((process.executable.text:*\\\\rundll32.exe) OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND (process.command_line.text:*pcwutl* AND process.command_line.text:*LaunchApplication*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Libraries/Pcwutl/", "https://twitter.com/harr0ey/status/989617817849876488"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
