{"description": "Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b3512211-c67e-4707-bedc-66efc7848863", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Downgrade Attack", "query": "(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*\\ \\-version\\ 2\\ * OR *\\ \\-versio\\ 2\\ * OR *\\ \\-versi\\ 2\\ * OR *\\ \\-vers\\ 2\\ * OR *\\ \\-ver\\ 2\\ * OR *\\ \\-ve\\ 2\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/"], "timestamp_override": "event.ingested", "author": ["Harish Segar (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
