{"description": "Detects suspicious command line patterns used when rundll32 is used to run JavaScript code", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d4e464b0-01cd-84f6-ee0c-a493b99de71a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rundll32 JS RunHTMLApplication Pattern", "query": "(((process.command_line.text:*rundll32* AND process.command_line.text:*javascript* AND process.command_line.text:*..\\\\..\\\\mshtml,RunHTMLApplication*)) OR (process.command_line.text:*;document.write\\(\\);GetObject\\(\\\"script*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_DETECTION_BYPASS.txt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
