{"description": "Threat actors can use auditpol binary to change audit policy configuration to impair detection capability.\nThis can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.\n", "author": ["Janantha Marasinghe (https://github.com/blueteam0ps)"], "enabled": false, "false_positives": ["Administrator or administrator scripts might leverage the flags mentioned in the detection section. Either way, it should always be monitored"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0a13e132-651d-11eb-ae93-0242ac130002", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Audit Policy Tampering Via Auditpol", "query": "(((process.executable.text:\"*\\\\auditpol.exe\") OR (winlog.event_data.OriginalFileName:\"AUDITPOL.EXE\")) AND process.command_line.text:(\"*disable*\" OR \"*clear*\" OR \"*remove*\" OR \"*restore*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
