{"description": "Detects the creation of scheduled tasks in user session", "enabled": false, "false_positives": ["Administrative activity", "Software installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3a5a71be-e5f9-cb59-dec6-456a393b685e", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Scheduled Task Creation", "query": "((process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\ \\/create\\ *) AND (NOT (user.name:(*AUTHORI* OR *AUTORI*))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Privilege Escalation", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
