{"description": "Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on user.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "566014df-030a-b237-9478-2d5278749de5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remote Desktop Protocol Use Mstsc", "query": "((process.executable:*\\\\mstsc.exe AND process.command_line:*\\ \\/v\\:*) OR (process.executable:*\\\\cmdkey.exe AND process.command_line:*\\/generic\\:* AND process.command_line:*\\/user\\:* AND process.command_line:*\\/pass\\:*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/mstsc"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
