{"description": "Detects suspicious PowerShell download patterns that are often used in malicious scripts, stagers or downloaders (make sure that your backend applies the strings case-insensitive)", "enabled": false, "false_positives": ["Software installers that pull packages from remote systems and execute them"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "05f313f4-81d6-b3fe-942c-fa2a2a296d6b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Download and Execute Pattern", "query": "process.command_line:(*IEX\\ \\(\\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *IEX\\ \\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *IEX\\(\\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *IEX\\(New\\-Object\\ Net.WebClient\\).DownloadString* OR *\\ \\-command\\ \\(New\\-Object\\ System.Net.WebClient\\).DownloadFile\\(* OR *\\ \\-c\\ \\(New\\-Object\\ System.Net.WebClient\\).DownloadFile\\(*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
