{"description": "Detects when the Console Window Host (conhost.exe) process is spawned by an uncommon parent process, which could be indicative of potential code injection activity.", "author": ["Tim Rauch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cbb9e3d1-2386-4e59-912e-62f1484f7a89", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Conhost Spawned By Uncommon Parent Process", "query": "(((process.executable.text:\"*\\\\conhost.exe\" AND process.parent.executable.text:(\"*\\\\explorer.exe\" OR \"*\\\\lsass.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\services.exe\" OR \"*\\\\smss.exe\" OR \"*\\\\spoolsv.exe\" OR \"*\\\\svchost.exe\" OR \"*\\\\userinit.exe\" OR \"*\\\\wininit.exe\" OR \"*\\\\winlogon.exe\")) AND (NOT process.parent.command_line.text:(\"*\\-k\\ apphost\\ \\-s\\ AppHostSvc*\" OR \"*\\-k\\ imgsvc*\" OR \"*\\-k\\ localService\\ \\-p\\ \\-s\\ RemoteRegistry*\" OR \"*\\-k\\ LocalSystemNetworkRestricted\\ \\-p\\ \\-s\\ NgcSvc*\" OR \"*\\-k\\ NetSvcs\\ \\-p\\ \\-s\\ NcaSvc*\" OR \"*\\-k\\ netsvcs\\ \\-p\\ \\-s\\ NetSetupSvc*\" OR \"*\\-k\\ netsvcs\\ \\-p\\ \\-s\\ wlidsvc*\" OR \"*\\-k\\ NetworkService\\ \\-p\\ \\-s\\ DoSvc*\" OR \"*\\-k\\ wsappx\\ \\-p\\ \\-s\\ AppXSvc*\" OR \"*\\-k\\ wsappx\\ \\-p\\ \\-s\\ ClipSVC*\"))) AND (NOT process.parent.command_line.text:(\"*C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Dropbox\\\\Client\\\\*\" OR \"*C\\:\\\\Program\\ Files\\\\Dropbox\\\\Client\\\\*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
