{"description": "Detects suspicious child processes of SysAidServer (as seen in MERCURY threat actor intrusions)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "60bfeac3-0d35-4302-8efb-1dd16f715bc6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious SysAidServer Child", "query": "(process.parent.executable.text:(*\\\\java.exe OR *\\\\javaw.exe) AND process.parent.command_line.text:*SysAidServer*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
