{"description": "Detect usage of the \"ssh.exe\" binary as a proxy to launch other programs", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7fc888de-b3df-f208-54c9-683b5e18c3d5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Lolbin Ssh.exe Use As Proxy", "query": "process.parent.executable.text:\"C:\\Windows\\System32\\OpenSSH\\sshd.exe\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ssh/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
