{"description": "Detects requests to exclude files, folders or processes from Antivirus scanning using PowerShell cmdlets", "enabled": false, "false_positives": ["Possible Admin Activity", "Other Cmdlets that may use the same parameters"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e15177d6-3de7-4d7d-85b3-2b1ff2de930f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Powershell Defender Exclusion", "query": "(process.command_line:(*Add\\-MpPreference\\ * OR *Set\\-MpPreference\\ *) AND process.command_line:(*\\ \\-ExclusionPath\\ * OR *\\ \\-ExclusionExtension\\ * OR *\\ \\-ExclusionProcess\\ * OR *\\ \\-ExclusionIpAddress\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md", "https://twitter.com/AdamTheAnalyst/status/1483497517119590403"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
