{"description": "Detects usage of 7zip utilities (7z.exe, 7za.exe and 7zr.exe) to extract password protected zip files.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate activity is expected since extracting files with a password can be common in some environement."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b717b8fd-6467-4d7d-b3d3-27f9a463af77", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Password Protected Compressed File Extraction Via 7Zip", "query": "(((winlog.event_data.Description:*7\\-Zip*) OR (process.executable.text:(\"*\\\\7z.exe\" OR \"*\\\\7zr.exe\" OR \"*\\\\7za.exe\")) OR (winlog.event_data.OriginalFileName:(\"7z.exe\" OR \"7za.exe\"))) AND (process.command_line.text:\"*\\ \\-p*\" AND process.command_line.text:\"*\\ x\\ *\" AND process.command_line.text:\"*\\ \\-o*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1560"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1560", "name": "Archive Collected Data", "reference": "https://attack.mitre.org/techniques/T1560"}]}], "version": 1, "references": ["https://blog.cyble.com/2022/06/07/bumblebee-loader-on-the-rise/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
