{"description": "Detects usage of bitsadmin downloading a file using an URL that contains an IP", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99c840f2-2012-46fd-9141-c761987550ef", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Download From Direct IP Via Bitsadmin", "query": "((((process.executable.text:\"*\\\\bitsadmin.exe\") OR (winlog.event_data.OriginalFileName:\"bitsadmin.exe\")) AND process.command_line.text:(\"*\\ \\/transfer\\ *\" OR \"*\\ \\/create\\ *\" OR \"*\\ \\/addfile\\ *\") AND process.command_line.text:(\"*\\:\\/\\/1*\" OR \"*\\:\\/\\/2*\" OR \"*\\:\\/\\/3*\" OR \"*\\:\\/\\/4*\" OR \"*\\:\\/\\/5*\" OR \"*\\:\\/\\/6*\" OR \"*\\:\\/\\/7*\" OR \"*\\:\\/\\/8*\" OR \"*\\:\\/\\/9*\")) AND (NOT process.command_line.text:\"*\\:\\/\\/7\\-*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/", "https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
