{"description": "Detects a specific PowerShell command line pattern used by the UNC2452 actors as mentioned in Microsoft and Symantec reports", "enabled": false, "false_positives": ["Unknown, unlikely, but possible"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "779b6a3f-1b2f-c031-3193-b31b550744dc", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "UNC2452 PowerShell Pattern", "query": "((process.command_line:*Invoke\\-WMIMethod\\ win32_process\\ \\-name\\ create\\ \\-argumentlist* AND process.command_line:*rundll32\\ c\\:\\\\windows*) OR (process.command_line:*wmic\\ \\/node\\:* AND process.command_line:*process\\ call\\ create\\ \\\"rundll32\\ c\\:\\\\windows*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1047", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware", "https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.md#atomic-test-7---create-a-process-using-wmi-query-and-an-encoded-command"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
