{"description": "Detects execution of the Impersonate tool. Which can be used to manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively", "author": ["Sai Prashanth Pulisetti @pulisettis"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cf0c254b-22f1-4b2b-8221-e137b3c0af94", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "HackTool - Impersonate Execution", "query": "(((process.command_line.text:*impersonate.exe* AND process.command_line.text:(*\\ list\\ * OR *\\ exec\\ * OR *\\ adduser\\ *))) OR (((winlog.event_data.Hashes:(*MD5\\=9520714AB576B0ED01D1513691377D01* OR *SHA256\\=E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A* OR *IMPHASH\\=0A358FFC1697B7A07D0E817AC740DF62*)) OR (md5:\"9520714AB576B0ED01D1513691377D01\") OR (sha256:\"E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A\") OR (winlog.event_data.Imphash:\"0A358FFC1697B7A07D0E817AC740DF62\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1134", "T1134"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}, {"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}, {"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}], "version": 1, "references": ["https://sensepost.com/blog/2022/abusing-windows-tokens-to-compromise-active-directory-without-touching-lsass/", "https://github.com/sensepost/impersonate"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
