{"description": "Detects process execution patterns found in intrusions related to the Hermetic Wiper malware attacks against Ukraine in February 2022", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2f974656-6d83-4059-bbdf-68ac5403422f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Hermetic Wiper TG Process Patterns", "query": "(process.executable.text:*\\\\policydefinitions\\\\postgresql.exe OR process.command_line.text:(*CSIDL_SYSTEM_DRIVE\\\\temp\\\\sys.tmp* OR *\\ 1>\\ \\\\\\\\127.0.0.1\\\\ADMIN$\\\\__16*) OR (process.command_line.text:*powershell\\ \\-c\\ * AND process.command_line.text:*\\\\comsvcs.dll\\ MiniDump\\ * AND process.command_line.text:*\\\\winupd.log\\ full*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
