{"description": "Detects execution of \"rundll32\" calling \"advpack.dll\" with potential obfuscated ordinal calls in order to leverage the \"RegisterOCX\" function", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a1473adb-5338-4a20-b4c3-126763e2d3d3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Advpack Call Via Rundll32.EXE", "query": "(((process.executable.text:\"*\\\\rundll32.exe\") OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\") OR (process.command_line.text:\"*rundll32*\")) AND process.command_line.text:\"*advpack*\" AND (((process.command_line.text:\"*#\\+*\" AND process.command_line.text:\"*12*\")) OR (process.command_line.text:\"*#\\-*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Hexacorn/status/1224848930795552769", "http://www.hexacorn.com/blog/2020/02/05/stay-positive-lolbins-not/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
