{"description": "Detects a suspicious process spawning from one of the Microsoft Office suite products (Word, Excel, PowerPoint, Publisher, Visio, etc.)", "author": ["Florian Roth (Nextron Systems)", "Markus Neis", "FPT.EagleEye Team", "Vadim Khrykov", "Cyb3rEng", "Michael Haag", "Christopher Peacock @securepeacock", "@scythe_io"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "438025f9-5856-4663-83f7-52f878a70a50", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Microsoft Office Child Process", "query": "(process.parent.executable.text:(\"*\\\\EQNEDT32.EXE\" OR \"*\\\\EXCEL.EXE\" OR \"*\\\\MSACCESS.EXE\" OR \"*\\\\MSPUB.exe\" OR \"*\\\\ONENOTE.EXE\" OR \"*\\\\POWERPNT.exe\" OR \"*\\\\VISIO.exe\" OR \"*\\\\WINWORD.EXE\" OR \"*\\\\wordpad.exe\" OR \"*\\\\wordview.exe\") AND ((winlog.event_data.OriginalFileName:(\"bitsadmin.exe\" OR \"CertOC.exe\" OR \"CertUtil.exe\" OR \"Cmd.Exe\" OR \"CMSTP.EXE\" OR \"cscript.exe\" OR \"curl.exe\" OR \"HH.exe\" OR \"IEExec.exe\" OR \"InstallUtil.exe\" OR \"javaw.exe\" OR \"Microsoft.Workflow.Compiler.exe\" OR \"msdt.exe\" OR \"MSHTA.EXE\" OR \"msiexec.exe\" OR \"Msxsl.exe\" OR \"odbcconf.exe\" OR \"pcalua.exe\" OR \"PowerShell.EXE\" OR \"RegAsm.exe\" OR \"RegSvcs.exe\" OR \"REGSVR32.exe\" OR \"RUNDLL32.exe\" OR \"schtasks.exe\" OR \"ScriptRunner.exe\" OR \"wmic.exe\" OR \"WorkFolders.exe\" OR \"wscript.exe\")) OR (process.executable.text:(\"*\\\\AppVLP.exe\" OR \"*\\\\bash.exe\" OR \"*\\\\bitsadmin.exe\" OR \"*\\\\certoc.exe\" OR \"*\\\\certutil.exe\" OR \"*\\\\cmd.exe\" OR \"*\\\\cmstp.exe\" OR \"*\\\\control.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\curl.exe\" OR \"*\\\\forfiles.exe\" OR \"*\\\\hh.exe\" OR \"*\\\\ieexec.exe\" OR \"*\\\\installutil.exe\" OR \"*\\\\javaw.exe\" OR \"*\\\\mftrace.exe\" OR \"*\\\\Microsoft.Workflow.Compiler.exe\" OR \"*\\\\msbuild.exe\" OR \"*\\\\msdt.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\msidb.exe\" OR \"*\\\\msiexec.exe\" OR \"*\\\\msxsl.exe\" OR \"*\\\\odbcconf.exe\" OR \"*\\\\pcalua.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\regasm.exe\" OR \"*\\\\regsvcs.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\schtasks.exe\" OR \"*\\\\scrcons.exe\" OR \"*\\\\scriptrunner.exe\" OR \"*\\\\sh.exe\" OR \"*\\\\svchost.exe\" OR \"*\\\\verclsid.exe\" OR \"*\\\\wmic.exe\" OR \"*\\\\workfolders.exe\" OR \"*\\\\wscript.exe\")) OR (process.executable.text:(\"*\\\\AppData\\\\*\" OR \"*\\\\Users\\\\Public\\\\*\" OR \"*\\\\ProgramData\\\\*\" OR \"*\\\\Windows\\\\Tasks\\\\*\" OR \"*\\\\Windows\\\\Temp\\\\*\" OR \"*\\\\Windows\\\\System32\\\\Tasks\\\\*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1047", "T1204", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100", "https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html", "https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/", "https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e", "https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml", "https://github.com/splunk/security_content/blob/develop/detections/endpoint/office_spawning_control.yml", "https://twitter.com/andythevariable/status/1576953781581144064?s=20&t=QiJILvK4ZiBdR8RJe24u-A", "https://www.elastic.co/security-labs/exploring-the-ref2731-intrusion-set", "https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml", "https://www.vmray.com/analyses/2d2fa29185ad/report/overview.html", "https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
