{"description": "Detects LockerGoga Ransomware command line.", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "74db3488-fd28-480a-95aa-b7af626de068", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "LockerGoga Ransomware", "query": "process.command_line:*\\-i\\ SM\\-tgytutrc\\ \\-s*", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1486"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1486", "name": "Data Encrypted for Impact", "reference": "https://attack.mitre.org/techniques/T1486"}]}], "version": 1, "references": ["https://medium.com/@malwaredancer/lockergoga-input-arguments-ipc-communication-and-others-bd4e5a7ba80a", "https://blog.f-secure.com/analysis-of-lockergoga-ransomware/", "https://www.carbonblack.com/blog/tau-threat-intelligence-notification-lockergoga-ransomware/"], "timestamp_override": "event.ingested", "author": ["Vasiliy Burov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
