{"description": "Detects usage of the Chisel tunneling tool via the commandline arguments", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Some false positives may occur with other tools with similar commandlines"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8b0e12da-d3c3-49db-bb4f-256703f380e5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - Chisel Tunneling Tool Execution", "query": "((process.executable.text:\"*\\\\chisel.exe\") OR ((process.command_line.text:(\"*exe\\ client\\ *\" OR \"*exe\\ server\\ *\") AND process.command_line.text:(\"*\\-socks5*\" OR \"*\\-reverse*\" OR \"*\\ r\\:*\" OR \"*\\:127.0.0.1\\:*\" OR \"*\\-tls\\-skip\\-verify\\ *\" OR \"*\\:socks*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/jpillora/chisel/", "https://arcticwolf.com/resources/blog/lorenz-ransomware-chiseling-in/", "https://blog.sekoia.io/lucky-mouse-incident-response-to-detection-engineering/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
