{"description": "Detects EnableUnsafeClientMailRules used for Script Execution from Outlook", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bab8618e-b778-f485-100e-31973ca71b1b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Execution from Outlook", "query": "(process.command_line:*EnableUnsafeClientMailRules* OR (process.parent.executable:*\\\\outlook.exe AND process.command_line:*\\\\\\\\\\* AND process.command_line:*\\\\\\* AND process.command_line:*.exe*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/sensepost/ruler", "https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
