{"description": "Detects SILENTTRINITY stager use via PE metadata", "author": ["Aleksey Potapov", "oscd.community"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "03552375-cc2c-4883-bbe4-7958d5a980be", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - SILENTTRINITY Stager Execution", "query": "winlog.event_data.Description:*st2stager*", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/byt3bl33d3r/SILENTTRINITY"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
