{"description": "Detects WMIC executions in which a event consumer gets created in order to establish persistence", "enabled": false, "false_positives": ["Legitimate software creating script event consumers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "169a777f-59da-edc7-36e2-c1fc8e24e746", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious WMIC ActiveScriptEventConsumer Creation", "query": "(process.command_line.text:*ActiveScriptEventConsumer* AND process.command_line.text:*\\ CREATE\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://twitter.com/johnlatwc/status/1408062131321270282?s=12", "https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-windows-management-instrumentation.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
