{"description": "Detects suspicious print spool service (spoolsv.exe) child processes.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4ec7c307-0b92-7286-8144-0904e89518cb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Spool Service Child Process", "query": "((process.parent.executable:*\\\\spoolsv.exe AND IntegrityLevel:\"System\") AND (((((process.executable:(*\\\\gpupdate.exe OR *\\\\whoami.exe OR *\\\\nltest.exe OR *\\\\taskkill.exe OR *\\\\wmic.exe OR *\\\\taskmgr.exe OR *\\\\sc.exe OR *\\\\findstr.exe OR *\\\\curl.exe OR *\\\\wget.exe OR *\\\\certutil.exe OR *\\\\bitsadmin.exe OR *\\\\accesschk.exe OR *\\\\wevtutil.exe OR *\\\\bcdedit.exe OR *\\\\fsutil.exe OR *\\\\cipher.exe OR *\\\\schtasks.exe OR *\\\\write.exe OR *\\\\wuauclt.exe) OR (process.executable:*\\\\net.exe AND (NOT (process.command_line:*start*)))) OR (process.executable:*\\\\cmd.exe AND (NOT (process.command_line:(*.spl* OR *route\\ add* OR *program\\ files*))))) OR (process.executable:*\\\\netsh.exe AND (NOT (process.command_line:(*add\\ portopening* OR *rule\\ name*))))) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND (NOT (process.command_line:*.spl*)))) OR (process.executable:*\\\\rundll32.exe AND process.command_line:*rundll32.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1068", "T1203"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Exploits/Print%20Spooler%20RCE/Suspicious%20Spoolsv%20Child%20Process.md"], "timestamp_override": "event.ingested", "author": ["Justin C. (@endisphotic)", "@dreadphones (detection)", "Thomas Patzke (Sigma rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
