{"description":"Checks whether the image specified in a process creation event doesn't refer to an .exe file (caused by process ghosting or other unorthodox methods to start a process) Author: Max Altgelt. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2f1fc67a-854c-0b1d-227c-ee4e6150e76f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Execution File Type Other Than .exe","query":"((NOT (process.executable:*.exe)) AND (NOT ((NOT _exists_:process.executable) OR (process.executable:\"Registry\") OR (process.executable:(\"\\-\" OR \"\")) OR (process.executable:C\\:\\\\Windows\\\\Installer\\\\MSI*) OR (process.parent.executable:C\\:\\\\ProgramData\\\\Avira\\\\*) OR (process.executable:C\\:\\\\Windows\\\\Temp\\\\* AND process.executable:*\\\\avira_speedup_setup_update.tmp) OR (process.executable:*.scr) OR (process.executable:*NVIDIA\\\\NvBackend\\\\* AND process.executable:*.dat) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*) AND process.executable:*.com) OR (process.executable:*\\\\WinSCP.com) OR (process.executable:*\\\\program\\\\soffice.bin) OR (process.executable:(*C\\:\\\\Windows\\\\Temp\\\\is\\-* OR *\\\\AppData\\\\Local\\\\Temp\\\\is\\-*) AND process.executable:(*.tmp\\\\target.tmp OR *.tmp\\\\_isetup\\\\_setup64.tmp)))))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
