{"description": "The \"Squirrel.exe\" binary that is part of multiple softwares (Slack, Teams, Discord...etc) can be used as a LOLBIN", "enabled": false, "false_positives": ["See rule (fa4b21c9-0057-4493-b289-2556416ae4d7) for possible FPs"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "45239e6a-b035-4aaf-b339-8ad379fcb67e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of Squirrel.exe", "query": "(process.executable:*\\\\squirrel.exe AND process.command_line:(*\\ \\-\\-download\\ * OR *\\ \\-\\-update\\ * OR *\\ \\-\\-updateRollback\\=*) AND process.command_line:*http*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
