{"description": "Detects the execution of a renamed ProcDump executable often used by attackers or malware", "enabled": false, "false_positives": ["Procdump illegaly bundled with legitimate software", "Weird admins who renamed binaries"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "18b6e079-765c-5cc2-bfe7-8f4e279e9c8b", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Renamed ProcDump", "query": "(((winlog.event_data.OriginalFileName:\"procdump\" OR (process.command_line:*\\ \\-ma\\ * AND process.command_line:*\\ \\-accepteula\\ *)) OR (process.command_line:*\\ \\-ma\\ * AND process.command_line:*.dmp*)) AND (NOT (process.executable:(*\\\\procdump.exe OR *\\\\procdump64.exe))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/procdump"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
