{"description": "Detects user accept agreement execution in psexec commandline", "author": ["omkar72"], "enabled": false, "false_positives": ["Administrative scripts."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "730fc21b-eaff-474b-ad23-90fd265d4988", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Psexec Execution", "query": "((process.executable.text:\"*\\\\psexec.exe\") OR (winlog.event_data.OriginalFileName:\"psexec.c\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1021", "T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
