{"description": "Detects WMI spawning PowerShell", "enabled": false, "false_positives": ["AppvClient", "CCM"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "692f0bec-83ba-4d04-af7e-e884a96059b6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WMI Spawning Windows PowerShell", "query": "(((process.parent.executable:*\\\\wmiprvse.exe AND (process.executable:*\\\\powershell.exe OR winlog.event_data.OriginalFileName:\"PowerShell.EXE\")) AND (NOT (process.command_line:\"null\"))) AND (NOT (NOT _exists_:process.command_line)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_shell_spawn_susp_program.yml", "https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e"], "timestamp_override": "event.ingested", "author": ["Markus Neis / @Karneades"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
