{"description": "Detects execution of the Windows Kernel Debugger \"kd.exe\".", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Rare occasions of legitimate cases where kernel debugging is necessary in production. Investigation is required"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "27ee9438-90dc-4bef-904b-d3ef927f5e7e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Kernel Debugger Execution", "query": "((process.executable.text:\"*\\\\kd.exe\") OR (winlog.event_data.OriginalFileName:\"kd.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
