{"description": "Detects the use of KrbRelay, a Kerberos relaying tool", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e96253b8-6b3b-4f90-9e59-3b24b99cf9b4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "KrbRelay Hack Tool", "query": "(process.executable:*\\\\KrbRelay.exe OR OriginalFilename:\"KrbRelay.exe\" OR (process.command_line:*\\ \\-spn\\ * AND process.command_line:*\\ \\-clsid\\ * AND process.command_line:*\\ \\-rbcd\\ *) OR (process.command_line:*shadowcred* AND process.command_line:*clsid* AND process.command_line:*spn*) OR (process.command_line:*spn\\ * AND process.command_line:*session\\ * AND process.command_line:*clsid\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://github.com/cube0x0/KrbRelay"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
