{"description": "Detects KrbRelayUp used to perform a universal no-fix local privilege escalation in windows domain environments where LDAP signing is not enforced", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f506ee5a-ec66-cd16-18d6-89230c233b6a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "KrbRelayUp Hack Tool", "query": "(process.executable:*\\\\KrbRelayUp.exe OR (process.command_line:*\\ relay\\ * AND process.command_line:*\\ \\-Domain\\ * AND process.command_line:*\\ \\-ComputerName\\ *) OR (process.command_line:*\\ krbscm\\ * AND process.command_line:*\\ \\-sc\\ *) OR (process.command_line:*\\ spawn\\ * AND process.command_line:*\\ \\-d\\ * AND process.command_line:*\\ \\-cn\\ * AND process.command_line:*\\ \\-cp\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Lateral Movement", "T1550", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://github.com/Dec0ne/KrbRelayUp"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
