{"description": "Detects using SettingSyncHost.exe to run hijacked binary", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b2ddd389-f676-4ac4-845a-e00781a48e5f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Using SettingSyncHost.exe as LOLBin", "query": "((NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))) AND (process.parent.command_line:*cmd.exe\\ \\/c* AND process.parent.command_line:*RoamDiag.cmd* AND process.parent.command_line:*\\-outputpath*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.hexacorn.com/blog/2020/02/02/settingsynchost-exe-as-a-lolbin"], "timestamp_override": "event.ingested", "author": ["Anton Kutepov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
