{"description": "Detects suspicious PowerShell invocation command parameters", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "24332dca-2af7-574c-08dc-615090636935", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious PowerShell Invocations - Specific - ProcessCreation", "query": "((((process.command_line.text:*\\-nop* AND process.command_line.text:*\\ \\-w\\ * AND process.command_line.text:*hidden* AND process.command_line.text:*\\ \\-c\\ * AND process.command_line.text:*\\[Convert\\]\\:\\:FromBase64String*)) OR ((process.command_line.text:*\\ \\-w\\ * AND process.command_line.text:*hidden* AND process.command_line.text:*\\-noni* AND process.command_line.text:*\\-nop* AND process.command_line.text:*\\ \\-c\\ * AND process.command_line.text:*iex* AND process.command_line.text:*New\\-Object*)) OR ((process.command_line.text:*\\ \\-w\\ * AND process.command_line.text:*hidden* AND process.command_line.text:*\\-ep* AND process.command_line.text:*bypass* AND process.command_line.text:*\\-Enc*)) OR ((process.command_line.text:*powershell* AND process.command_line.text:*reg* AND process.command_line.text:*add* AND process.command_line.text:*\\\\software\\\\*)) OR ((process.command_line.text:*bypass* AND process.command_line.text:*\\-noprofile* AND process.command_line.text:*\\-windowstyle* AND process.command_line.text:*hidden* AND process.command_line.text:*new\\-object* AND process.command_line.text:*system.net.webclient* AND process.command_line.text:*.download*)) OR ((process.command_line.text:*iex* AND process.command_line.text:*New\\-Object* AND process.command_line.text:*Net.WebClient* AND process.command_line.text:*.Download*))) AND (NOT ((process.command_line.text:(*\\(New\\-Object\\ System.Net.WebClient\\).DownloadString\\('https\\:\\/\\/community.chocolatey.org\\/install.ps1* OR *Write\\-ChocolateyWarning*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
