{"description": "detects the usage of path traversal in conhost.exe indicating possible command/argument confusion/hijacking", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ee5e119b-1f75-4b34-add8-3be976961e39", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Conhost.exe CommandLine Path Traversal", "query": "(process.parent.command_line:*conhost* AND process.command_line:*\\/..\\/..\\/*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://pentestlab.blog/2020/07/06/indirect-command-execution/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
