{"description": "ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into a password-protected zip file.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f1c4fbea-368b-71cb-6797-5fd56d0f52c9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious ZipExec Execution", "query": "(process.command_line:*.zip* AND ((process.command_line:*\\/generic\\:Microsoft_Windows_Shell_ZipFolder\\:filename\\=* AND process.command_line:*\\/pass\\:* AND process.command_line:*\\/user\\:*) OR (process.command_line:*\\/delete* AND process.command_line:*Microsoft_Windows_Shell_ZipFolder\\:filename\\=*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1451237393017839616", "https://github.com/Tylous/ZipExec"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
