{"description": "Detects the use of SharpUp, a tool for local privilege escalation", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c484e533-ee16-4a93-b6ac-f0ea4868b2f1", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "HackTool - SharpUp PrivEsc Tool Execution", "query": "((process.executable.text:\"*\\\\SharpUp.exe\") OR (winlog.event_data.Description:\"SharpUp\") OR (process.command_line.text:(\"*HijackablePaths*\" OR \"*UnquotedServicePath*\" OR \"*ProcessDLLHijack*\" OR \"*ModifiableServiceBinaries*\" OR \"*ModifiableScheduledTask*\" OR \"*DomainGPPPassword*\" OR \"*CachedGPPPassword*\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1569", "T1574", "T1615"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://github.com/GhostPack/SharpUp"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
