{"description": "Detects execution of LiveKD with the \"-m\" flag to potentially dump the kernel memory", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely in production environement"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c7746f1c-47d3-43d6-8c45-cd1e54b6b0a2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Kernel Memory Dump Via LiveKD", "query": "(((process.executable.text:(\"*\\\\livekd.exe\" OR \"*\\\\livekd64.exe\")) OR (winlog.event_data.OriginalFileName:\"livekd.exe\")) AND (process.command_line.text:\"*\\ \\/m*\" AND process.command_line.text:\"*\\ \\-m*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/livekd", "https://4sysops.com/archives/creating-a-complete-memory-dump-without-a-blue-screen/", "https://kb.acronis.com/content/60892"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
