{"description": "Detects suspicious ways to run Invoke-Execution using IEX acronym", "enabled": false, "false_positives": ["Legitimate scripts that use IEX"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "09576804-7a05-458e-a817-eb718ca91f54", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell IEX Execution Patterns", "query": "((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line.text:(*\\ |\\ iex;* OR *\\ |\\ iex\\ * OR *\\ |\\ iex\\}* OR *\\ |\\ IEX;* OR *\\ |\\ IEX\\ ;* OR *\\ |\\ IEX\\ \\-Error* OR *\\ |\\ IEX\\ \\(new* OR *\\ |\\ IEX\\ \\(New* OR *\\);IEX\\ *) AND process.command_line.text:(*\\:\\:FromBase64String* OR *.GetString\\(\\[System.Convert\\]\\:\\:*)) OR process.command_line.text:(*\\)|iex;$* OR *\\)|IEX;$* OR *\\);iex\\($* OR *\\);iex\\ $* OR *\\ |\\ IEX\\ |\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-expression?view=powershell-7.2"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
