{"description": "Detects script file execution (.js, .jse, .vba, .vbe, .vbs, .wsf) by Wscript/Cscript", "author": ["Michael Haag"], "enabled": false, "false_positives": ["Some additional tunning is required. It is recommended to add the user profile path in CommandLine if it is getting too noisy."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1e33157c-53b1-41ad-bbcc-780b80b58288", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WSF/JSE/JS/VBA/VBE File Execution Via Cscript/Wscript", "query": "(((winlog.event_data.OriginalFileName:(\"wscript.exe\" OR \"cscript.exe\")) OR (process.executable.text:(\"*\\\\wscript.exe\" OR \"*\\\\cscript.exe\"))) AND process.command_line.text:(\"*.js*\" OR \"*.jse*\" OR \"*.vba*\" OR \"*.vbe*\" OR \"*.vbs*\" OR \"*.wsf*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
