{"description": "Use of the commandline to shutdown or reboot windows", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f4f2de85-5210-7b21-028b-0e3e824d6d36", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Execution of Shutdown", "query": "(process.executable.text:*\\\\shutdown.exe AND process.command_line.text:(*\\/r\\ * OR *\\/s\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1529"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1529", "name": "System Shutdown/Reboot", "reference": "https://attack.mitre.org/techniques/T1529"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
