{"description": "Detects suspicious command line that adds an account to the local administrators/administrateurs group", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9fedc58f-551b-e2dd-fd84-877061c01605", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Add User to Local Administrators", "query": "(((process.command_line.text:*localgroup\\ * AND process.command_line.text:*\\ \\/add*) OR (process.command_line.text:*Add\\-LocalGroupMember\\ * AND process.command_line.text:*\\ \\-Group\\ *)) AND process.command_line.text:(*\\ administrators\\ * OR *\\ administrateur*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
