{"description":"Detects suspicious Windows Update Agent activity in which a wuauclt.exe process command line doesn't contain any command line flags Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"52d097e2-063e-4c9c-8fbb-855c8948d135","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Windows Update Agent Empty Cmdline","query":"(process.executable:*\\\\Wuauclt.exe AND process.command_line:*\\\\Wuauclt.exe)","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
