{"description": "Detects scheduled task creation events that include suspicious actions, and is run once at 00:00", "author": ["pH-T (Nextron Systems)"], "enabled": false, "false_positives": ["Software installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "970823b7-273b-460a-8afc-3a6811998529", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Uncommon One Time Only Scheduled Task At 00:00", "query": "(((process.executable.text:\"*\\\\schtasks.exe*\") OR (winlog.event_data.OriginalFileName:\"schtasks.exe\")) AND process.command_line.text:(\"*wscript*\" OR \"*vbscript*\" OR \"*cscript*\" OR \"*wmic\\ *\" OR \"*wmic.exe*\" OR \"*regsvr32.exe*\" OR \"*powershell*\" OR \"*\\\\AppData\\\\*\") AND (process.command_line.text:\"*once*\" AND process.command_line.text:\"*00\\:00*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
