{"description": "Detects a certain command line flag combination used by regsvr32 when used to download and register a DLL from a remote address which uses HTTP (not HTTPS) and a IP address and not FQDN", "author": ["Florian Roth"], "enabled": false, "false_positives": ["FQDNs that start with a number"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3312c582-cfe1-bdce-3902-86fd9d2b0e99", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Regsvr32 HTTP IP Pattern", "query": "(process.command_line.text:*\\ \\/s* AND process.command_line.text:*\\ \\/u* AND process.command_line.text:(*\\ \\/i\\:http\\:\\/\\/1* OR *\\ \\/i\\:http\\:\\/\\/2* OR *\\ \\/i\\:http\\:\\/\\/3* OR *\\ \\/i\\:http\\:\\/\\/4* OR *\\ \\/i\\:http\\:\\/\\/5* OR *\\ \\/i\\:http\\:\\/\\/6* OR *\\ \\/i\\:http\\:\\/\\/7* OR *\\ \\/i\\:http\\:\\/\\/8* OR *\\ \\/i\\:http\\:\\/\\/9* OR *\\ \\/i\\:https\\:\\/\\/1* OR *\\ \\/i\\:https\\:\\/\\/2* OR *\\ \\/i\\:https\\:\\/\\/3* OR *\\ \\/i\\:https\\:\\/\\/4* OR *\\ \\/i\\:https\\:\\/\\/5* OR *\\ \\/i\\:https\\:\\/\\/6* OR *\\ \\/i\\:https\\:\\/\\/7* OR *\\ \\/i\\:https\\:\\/\\/8* OR *\\ \\/i\\:https\\:\\/\\/9*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1461041276514623491c19-ps", "https://twitter.com/tccontre18/status/1480950986650832903"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
