{"description": "Detects usage of the \"Add-AppxPackage\" or it's alias \"Add-AppPackage\" to install unsigned AppX packages", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Installation of unsigned packages for testing purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "37651c2a-42cd-4a69-ae0d-22a4349aa04a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Unsigned AppX Installation Attempt Using Add-AppxPackage", "query": "(((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:(\"*Add\\-AppPackage\\ *\" OR \"*Add\\-AppxPackage\\ *\") AND process.command_line.text:\"*\\ \\-AllowUnsigned*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package", "https://twitter.com/WindowsDocs/status/1620078135080325122"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
