{"description": "Detects PowerShell spawning chrome.exe containing load-extension and AppData\\Local in the process command line", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1371a6dc-ffe3-fb4b-cbeb-850e079ade1f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell ChromeLoader Browser Hijacker", "query": "(process.executable:*\\\\chrome.exe AND process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*\\-\\-load\\-extension\\=* AND process.command_line:*\\\\AppData\\\\Local\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1176"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1176", "name": "Browser Extensions", "reference": "https://attack.mitre.org/techniques/T1176"}]}], "version": 1, "references": ["https://redcanary.com/blog/chromeloader/", "https://emkc.org/s/RJjuLa"], "timestamp_override": "event.ingested", "author": ["Aedan Russell", "frack113 (sigma)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
