{"description": "Detects potential commandline obfuscation using unicode characters.\nAdversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit.\n", "author": ["frack113", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e0552b19-5a83-4222-b141-b36184bb8d79", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Commandline Obfuscation Using Unicode Characters", "query": "((process.command_line.text:(\"*\u02e3*\" OR \"*\u02ea*\" OR \"*\u02e2*\")) OR (process.command_line.text:(\"*\u2215*\" OR \"*\u2044*\")) OR (process.command_line.text:(\"*\u2015*\" OR \"*\u2014*\")) OR (process.command_line.text:(\"*\u00e2*\" OR \"*\u20ac*\" OR \"*\u00a3*\" OR \"*\u00af*\" OR \"*\u00ae*\" OR \"*\u00b5*\" OR \"*\u00b6*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
