{"description": "Detects chromium based browsers starting in headless and debugging mode and pointing to a user profile. This could be a sign of data stealing or remote control", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99cbda10-7581-b86e-c593-731ef1626067", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Data Stealing Via Chromium Headless Debugging", "query": "(process.command_line.text:*\\-\\-remote\\-debugging\\-* AND process.command_line.text:*\\-\\-user\\-data\\-dir* AND process.command_line.text:*\\-\\-headless*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1185"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/defaultnamehere/cookie_crimes/", "https://mango.pdf.zone/stealing-chrome-cookies-without-a-password", "https://embracethered.com/blog/posts/2020/cookie-crimes-on-mirosoft-edge/", "https://embracethered.com/blog/posts/2020/chrome-spy-remote-control/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
