{"description": "Adversaries may  modify system firewalls in order to bypass controls limiting network usage", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "347906f3-e207-4d18-ae5b-a9403d6bcdef", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Netsh Allow Group Policy on Microsoft Defender Firewall", "query": "(process.executable.text:*\\\\netsh.exe AND process.command_line.text:*advfirewall* AND process.command_line.text:*firewall* AND process.command_line.text:*set* AND process.command_line.text:*rule* AND process.command_line.text:*group\\=* AND process.command_line.text:*new* AND process.command_line.text:*enable\\=Yes*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-3---allow-smb-and-rdp-on-microsoft-defender-firewall", "https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
