{"description": "Adversaries can abuse winget to download payloads remotely and execute them without touching disk. Winget will be included by default in Windows 10 and is already available in Windows 10 insider programs. The manifest option enables you to install an application by passing in a YAML file directly to the client. Winget can be used to download and install exe's, msi, msix files later.", "enabled": false, "false_positives": ["Admin activity installing packages not in the official Microsoft repo. Winget probably won't be used by most users."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ce7500e6-0465-6970-98f2-01b28f12fb71", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Monitoring Winget For LOLbin Execution", "query": "(process.command_line:*winget* AND process.command_line:*install* AND process.command_line:(*\\-m\\ * OR *\\-\\-manifest*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/package-manager/winget/install#local-install"], "timestamp_override": "event.ingested", "author": ["Sreeman", "Florian Roth", "Frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
