{"description": "Detects Possible usage of Windows Subsystem for Linux (WSL) binary as a LOLBIN", "enabled": false, "false_positives": ["Automation and orchestration scripts may use this method execute scripts etc"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6e137906-4ddf-752e-8767-4d629c99554c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WSL Execution", "query": "((process.executable:*\\\\wsl.exe OR winlog.event_data.OriginalFileName:\"wsl.exe\") AND process.command_line:(*\\ \\-e\\ * OR *\\ \\-\\-exec\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/"], "timestamp_override": "event.ingested", "author": ["oscd.community", "Zach Stanford @svch0st"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
