{"description": "Detects execution of the \"cloudflared\" tool with the tunnel \"cleanup\" flag in order to cleanup tunnel connections.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage of Cloudflared."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7050bba1-1aed-454e-8f73-3f46f09ce56a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Cloudflared Tunnel Connections Cleanup", "query": "(process.command_line.text:\"*\\ tunnel\\ *\" AND process.command_line.text:\"*cleanup\\ *\" AND process.command_line.text:(\"*\\ \\-\\-config\\ *\" OR \"*\\ \\-\\-connector\\-id\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1090", "T1102", "T1572"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/cloudflare/cloudflared", "https://developers.cloudflare.com/cloudflare-one/connections/connect-apps"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
