{"description": "Checks whether the image specified in a process creation event doesn't refer to an .exe file (caused by process ghosting or other unorthodox methods to start a process)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7f46171e-381a-9685-1e8b-70d79d267399", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution of Suspicious File Type Extension", "query": "((NOT (process.executable.text:(*.exe OR *.tmp))) AND (NOT ((NOT _exists_:process.executable.text) OR (process.executable.text:(\"Registry\" OR \"MemCompression\" OR \"vmmem\")) OR (process.executable.text:(\"\\-\" OR \"\")) OR (process.executable.text:C\\:\\\\Windows\\\\Installer\\\\MSI*) OR (process.parent.executable.text:(C\\:\\\\ProgramData\\\\Avira\\\\* OR C\\:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\*)) OR (process.executable.text:*.scr) OR (process.executable.text:*NVIDIA\\\\NvBackend\\\\* AND process.executable.text:*.dat) OR (process.executable.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*) AND process.executable.text:*.com) OR (process.executable.text:*\\\\WinSCP.com) OR (process.executable.text:*C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\* AND process.executable.text:*.tmp* AND process.executable.text:*CodeSetup*) OR (process.executable.text:*\\\\program\\\\soffice.bin) OR (process.executable.text:(\"C\\:\\\\Program\\ Files\\\\EMC\\ NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi\\-bin\\\\update_jnlp.cgi\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\EMC\\ NetWorker\\\\Management\\\\GST\\\\apache\\\\cgi\\-bin\\\\update_jnlp.cgi\")) OR (process.executable.text:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\WINPAKPRO\\\\* OR C\\:\\\\Program\\ Files\\\\WINPAKPRO\\\\*) AND process.executable.text:*.ngn) OR (process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\MyQ\\\\Server\\\\pcltool.dll\" OR \"C\\:\\\\Program\\ Files\\\\MyQ\\\\Server\\\\pcltool.dll\")) OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\Microsoft\\ Visual\\ Studio\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Visual\\ Studio*) AND process.executable.text:*.com) OR (process.executable.text:C\\:\\\\Config.Msi\\\\* AND process.executable.text:(*.rbf OR *.rbs)) OR (process.executable.text:*\\\\AppData\\\\Local\\\\Packages\\\\* AND process.executable.text:*\\\\LocalState\\\\rootfs\\\\*) OR (process.executable.text:*\\\\LZMA_EXE))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestlaboratories.com/2021/12/08/process-ghosting/"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
