{"description": "Detects execution of the built-in script located in \"C:\\Windows\\System32\\gatherNetworkInfo.vbs\". Which can be used to gather information about the target machine", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "07aa184a-870d-413d-893a-157f317f6f58", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Reconnaissance Activity Via GatherNetworkInfo.VBS", "query": "(process.command_line.text:\"*gatherNetworkInfo.vbs*\" AND (NOT process.executable.text:(\"*\\\\cscript.exe\" OR \"*\\\\wscript.exe\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1615"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1615", "name": "Group Policy Discovery", "reference": "https://attack.mitre.org/techniques/T1615"}]}], "version": 1, "references": ["https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs", "https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
