{"description": "Detects a potential command line flag anomaly related to \"regsvr32\" in which the \"/i\" flag is used without the \"/n\" which should be uncommon.", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Administrator typo might cause some false positives"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b236190c-1c61-41e9-84b3-3fe03f6d76b0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Regsvr32 Commandline Flag Anomaly", "query": "((process.executable.text:\"*\\\\regsvr32.exe\" AND process.command_line.text:(\"*\\ \\/i\\:*\" OR \"*\\ \\-i\\:*\")) AND (NOT process.command_line.text:(\"*\\ \\/n\\ *\" OR \"*\\ \\-n\\ *\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/sbousseaden/status/1282441816986484737?s=12"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
