{"description": "Detects suspicious renamed SysInternals DebugView execution", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd764533-2e07-40d6-a718-cfeec7f2da7f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed SysInternals Debug View", "query": "(Product:(\"Sysinternals\\ DebugView\" OR \"Sysinternals\\ Debugview\") AND (NOT (winlog.event_data.OriginalFileName:\"Dbgview.exe\" AND process.executable:*\\\\Dbgview.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.epicturla.com/blog/sysinturla"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
