{"description": "Detects suspicious ways to download files or content using PowerShell", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Scripts or tools that download files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f3fe0ff2-72c8-21d0-2cb3-bbb18e5ca776", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Web Download", "query": "process.command_line.text:(*.DownloadString\\(* OR *.DownloadFile\\(* OR *Invoke\\-WebRequest\\ * OR *iwr\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
