{"description":"Detects suspicious scheduled task creations from a parent stored in a temporary folder Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Software installers that run from temporary folders and also install scheduled tasks"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"48db58a9-5053-37f3-7eb9-472644a4a9ab","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Add Scheduled Task Parent","query":"((process.executable:*schtasks.exe AND process.command_line:*\\/Create\\ * AND process.parent.executable:(*\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\Roaming\\\\* OR *\\\\Temporary\\ Internet* OR *\\\\Users\\\\Public\\\\*)) AND (NOT ((process.command_line:(*update_task.xml* OR *unattended.ini*)))))","meta":{"from":"1m"},"severity":"medium","tags":["T1053"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
