{"description": "Detects attempts of decoding a base64 Gzip archive via PowerShell. This technique is often used as a method to load malicious content into memory afterward.", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate administrative script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d1fc0863-6eda-05b5-58cb-edc429b65223", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious FromBase64String Usage On Gzip Archive - Process Creation", "query": "(process.command_line.text:*FromBase64String* AND process.command_line.text:*MemoryStream* AND process.command_line.text:*H4sI*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
