{"description": "Detects when the registration of a VSS/VDS Provider as a COM+ application.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "28c8f68b-098d-45af-8d43-8089f3e35403", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Registration via cscript.exe", "query": "(process.executable:*\\\\cscript.exe AND process.command_line:*\\-register* AND process.command_line:(*\\\\Windows\\ Kits\\\\10\\\\bin\\\\10.0.22000.0\\\\x64* OR *\\\\Windows\\ Kits\\\\10\\\\bin\\\\10.0.19041.0\\\\x64* OR *\\\\Windows\\ Kits\\\\10\\\\bin\\\\10.0.17763.0\\\\x64*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/sblmsrsn/status/1456613494783160325?s=20", "https://ss64.com/vb/cscript.html"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
