{"description": "Detects the execution of Windows binaries from within a WSL instance. This could be used to masquerade parent-child relationships", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ed825c86-c009-4014-b413-b76003e33d35", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Binary Executed From WSL", "query": "((process.executable:/[a-zA-Z]:\\\\/) AND process.working_directory.text:\"*\\\\\\\\wsl.localhost*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
