{"description": "Detects when adversaries stop services or processes by disabling their respective schdueled tasks in order to conduct data destructive activities", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dbc1f800-0fe0-4bc0-9c66-292c2abe3f78", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Delete Important Scheduled Task", "query": "(process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\/delete* AND process.command_line.text:*\\/tn* AND process.command_line.text:(*\\\\Windows\\\\SystemRestore\\\\SR* OR *\\\\Windows\\\\Windows\\ Defender\\\\* OR *\\\\Windows\\\\BitLocker* OR *\\\\Windows\\\\WindowsBackup\\\\* OR *\\\\Windows\\\\WindowsUpdate\\\\* OR *\\\\Windows\\\\UpdateOrchestrator\\\\* OR *\\\\Windows\\\\ExploitGuard*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1489"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1489", "name": "Service Stop", "reference": "https://attack.mitre.org/techniques/T1489"}]}], "version": 1, "references": ["Internal Research"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
