{"description": "Detects the execution of \"lodctr.exe\" to rebuild the performance counter registry values. This can be abused by attackers by providing a malicious config file to overwrite performance counter configuration to confuse and evade monitoring and security solutions.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage by an administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cc9d3712-6310-4320-b2df-7cb408274d53", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rebuild Performance Counter Values Via Lodctr.EXE", "query": "(process.executable:/.*\\\\\\\\[Ll][Oo][Dd][Cc][Tt][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.OriginalFileName:/[Ll][Oo][Dd][Cc][Tt][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Rr].*/ OR /.*\\ \\-[Rr].*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/security/identity-protection/virtual-smart-cards/virtual-smart-card-tpmvscmgr"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
