{"description": "Detects service path modification via the \"sc\" binary to a suspicious command or path", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "138d3531-8793-4f50-a2cd-f291b2863d78", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Service Path Modification", "query": "(process.executable:*\\\\sc.exe AND process.command_line:*config* AND process.command_line:*binPath* AND process.command_line:(*powershell* OR *cmd* OR *mshta* OR *wscript* OR *cscript* OR *rundll32* OR *C\\:\\\\Users\\\\Public* OR *\\\\Downloads\\\\* OR *\\\\Desktop\\\\* OR *\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\AppData\\\\Local\\\\Temp*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "oscd.community", "Nasreddine Bencherchali (update)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
