{"description":"Detects the suspicious minimized start of MsEdge browser, which can be used to download files from the Internet Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Software that uses MsEdge to download components in the background (see ParentImage, ParentCommandLine)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8cac7a53-05c2-8fb5-73f8-8996bb1eb5bd","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Minimized MSEdge Start","query":"process.command_line:*start\\ \\/min\\ msedge*","meta":{"from":"1m"},"severity":"high","tags":["T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
