{"description": "Detects the use of parent process ID spoofing tools like Didier Stevens tool SelectMyParent", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "08bdf691-12c5-1214-4aa1-0593e1f12e0a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PPID Spoofing Tool Usage", "query": "(process.executable:*\\\\SelectMyParent.exe OR process.command_line:(*PPID\\-spoof* OR *ppid_spoof* OR *spoof\\-ppid* OR *spoof_ppid* OR *ppidspoof* OR *spoofppid* OR *spoofedppid* OR *\\ \\-spawnto\\ *) OR winlog.event_data.OriginalFileName:(*PPID\\-spoof* OR *ppid_spoof* OR *spoof\\-ppid* OR *spoof_ppid* OR *ppidspoof* OR *spoofppid* OR *spoofedppid*) OR winlog.event_data.Description:\"SelectMyParent\" OR winlog.event_data.Imphash:(\"04d974875bd225f00902b4cad9af3fbc\" OR \"a782af154c9e743ddf3f3eb2b8f3d16e\" OR \"89059503d7fbf470e68f7e63313da3ad\" OR \"ca28337632625c8281ab8a130b3d6bad\") OR winlog.event_data.Hashes:(*IMPHASH\\=04D974875BD225F00902B4CAD9AF3FBC* OR *IMPHASH\\=A782AF154C9E743DDF3F3EB2B8F3D16E* OR *IMPHASH\\=89059503D7FBF470E68F7E63313DA3AD* OR *IMPHASH\\=CA28337632625C8281AB8A130B3D6BAD*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1134"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}], "version": 1, "references": ["https://pentestlab.blog/2020/02/24/parent-pid-spoofing/", "https://www.picussecurity.com/resource/blog/how-to-detect-parent-pid-ppid-spoofing-attacks", "https://www.ired.team/offensive-security/defense-evasion/parent-process-id-ppid-spoofing", "https://www.virustotal.com/gui/search/filename%253A*spoof*%2520filename%253A*ppid*/files"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
