{"description": "Detects Office Applications executing a Windows child process including directory traversal patterns", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "868955d9-697e-45d4-a3da-360cefd7c216", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Office Directory Traversal CommandLine", "query": "(process.parent.executable:(*\\\\winword.exe OR *\\\\excel.exe OR *\\\\powerpnt.exe OR *\\\\msaccess.exe OR *\\\\mspub.exe OR *\\\\eqnedt32.exe OR *\\\\visio.exe) AND process.executable:(*\\\\Windows\\\\System32\\\\* OR *\\\\Windows\\\\SysWOW64\\\\*) AND process.command_line:(\"..\\/..\\/..\\/..\" OR \"..\\\\..\\\\..\\\\..\" OR \"..\\/\\/..\\/\\/..\\/\\/..\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/sbousseaden/status/1531653369546301440"], "timestamp_override": "event.ingested", "author": ["@SBousseaden (idea)", "Christian Burkard (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
