{"description": "Detects Golden Chickens deployment method as used by Evilnum in report published in July 2020", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ddb4fe1a-6cd2-0be3-8c52-b447a37a2439", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "EvilNum Golden Chickens Deployment via OCX Files", "query": "(process.command_line:*regsvr32* AND process.command_line:*\\/s* AND process.command_line:*\\/i* AND process.command_line:*\\\\AppData\\\\Roaming\\\\* AND process.command_line:*.ocx*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2020/07/09/more-evil-deep-look-evilnum-toolset/", "https://app.any.run/tasks/33d37fdf-158d-4930-aa68-813e1d5eb8ba/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
