{"description": "Detects email exfiltration via powershell cmdlets", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "312d0384-401c-4b8b-abdf-685ffba9a332", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Email Exifiltration Via Powershell", "query": "(process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line.text:*Add\\-PSSnapin* AND process.command_line.text:*Get\\-Recipient* AND process.command_line.text:*\\-ExpandProperty* AND process.command_line.text:*EmailAddresses* AND process.command_line.text:*SmtpAddress* AND process.command_line.text:*\\-hidetableheaders*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/", "https://github.com/Azure/Azure-Sentinel/blob/7e6aa438e254d468feec061618a7877aa528ee9f/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/DEV-0270/Email%20data%20exfiltration%20via%20PowerShell.yaml"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali (rule)", " Azure-Sentinel (idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
