{"description": "Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "11452c2e-0491-0e69-003b-3f7893340c2b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Regedit as Trusted Installer", "query": "(process.executable.text:*\\\\regedit.exe AND process.parent.executable.text:(*\\\\TrustedInstaller.exe OR *\\\\ProcessHacker.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://twitter.com/1kwpeter/status/1397816101455765504"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
