{"description":"This rule detects process execution patterns found in intrusions related to the Hermetic Wiper malware attacks against Ukraine in February 2022 Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2f974656-6d83-4059-bbdf-68ac5403422f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Hermetic Wiper TG Process Patterns","query":"(process.executable:*\\\\policydefinitions\\\\postgresql.exe OR process.command_line:(*CSIDL_SYSTEM_DRIVE\\\\temp\\\\sys.tmp* OR *\\ 1>\\ \\\\127.0.0.1\\\\ADMIN$\\\\__16*) OR (process.command_line:*powershell\\ \\-c\\ * AND process.command_line:*\\\\comsvcs.dll\\ MiniDump\\ * AND process.command_line:*\\\\winupd.log\\ full*))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
