{"description": "Detects the creation or update of a scheduled task to run with \"NT AUTHORITY\\SYSTEM\" privileges", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "89ca78fd-b37c-4310-b3d3-81a023f83936", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Schtasks Creation Or Modification With SYSTEM Privileges", "query": "((process.executable.text:*\\\\schtasks.exe AND process.command_line.text:(*\\ \\/change\\ * OR *\\ \\/create\\ *) AND process.command_line.text:*\\/ru\\ * AND process.command_line.text:(*NT\\ AUT* OR *\\ SYSTEM\\ *)) AND (NOT (process.parent.executable.text:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.parent.executable.text:*TeamViewer_.exe* AND process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\/TN\\ TVInstallRestore*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
