{"description": "Detects the use of a renamed SysInternals Sdelete, which is something an administrator shouldn't do (the renaming)", "enabled": false, "false_positives": ["System administrator usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c1d867fe-8d95-4487-aab4-e53f2d339f90", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed Sysinternals Sdelete Usage", "query": "(winlog.event_data.OriginalFileName:\"sdelete.exe\" AND (NOT (process.executable.text:(*\\\\sdelete.exe OR *\\\\sdelete64.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1485"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1485", "name": "Data Destruction", "reference": "https://attack.mitre.org/techniques/T1485"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/sdelete", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
