{"description": "Detects the execution of the PoC that can be used to exploit Sysmon CVE-2022-41120", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bc140b3f-71f5-6d26-886a-e40262f22518", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "SysmonEOP Hack Tool", "query": "((process.executable.text:*\\\\SysmonEOP.exe) OR (winlog.event_data.Hashes:(\"IMPHASH=22F4089EB8ABA31E1BB162C6D9BF72E5\" OR \"IMPHASH=5123FA4C4384D431CD0D893EEB49BBEC\")) OR (winlog.event_data.Imphash:(\"22f4089eb8aba31e1bb162c6d9bf72e5\" OR \"5123fa4c4384d431cd0d893eeb49bbec\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["https://github.com/Wh04m1001/SysmonEoP"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
