{"description": "Detects a certain command line flag combination used by mpiexec.exe LOLBIN from HPC pack that can be used to execute any other binary", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "47bf08fd-9eda-5059-1f49-f2fea52e74ca", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MpiExec Lolbin", "query": "((process.executable:*\\\\mpiexec.exe OR winlog.event_data.Imphash:\"d8b52ef6aaa3a81501bdfff9dbb96217\" OR winlog.event_data.Hashes:*IMPHASH\\=d8b52ef6aaa3a81501bdfff9dbb96217*) AND process.command_line:(*\\ \\/n\\ 1\\ * OR *\\ \\-n\\ 1\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1465058133303246867", "https://docs.microsoft.com/en-us/powershell/high-performance-computing/mpiexec?view=hpc19-ps"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
