{"description": "Detection of unusual child processes by different system processes", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e90c9d8b-b5df-fb0d-5645-71b988379a5c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Abused Debug Privilege by Arbitrary Parent Processes", "query": "((process.parent.executable:(*\\\\winlogon.exe OR *\\\\services.exe OR *\\\\lsass.exe OR *\\\\csrss.exe OR *\\\\smss.exe OR *\\\\wininit.exe OR *\\\\spoolsv.exe OR *\\\\searchindexer.exe) AND process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe) AND user.name:(*AUTHORI* OR *AUTORI*)) AND (NOT (process.command_line:*\\ route\\ * AND process.command_line:*\\ ADD\\ *)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-74-638.jpg"], "timestamp_override": "event.ingested", "author": ["Semanur Guneysu @semanurtg", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
