{"description":"Detects suspicious ways to download files or content using PowerShell Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Scripts or tools that download files"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6e897651-f157-4d8f-aaeb-df8151488385","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"PowerShell Web Download","query":"process.command_line:(*.DownloadString\\(* OR *.DownloadFile\\(*)","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
