{"description": "Detects the use of Inveigh a cross-platform .NET IPv4/IPv6 machine-in-the-middle tool", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Very unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b99a1518-1ad5-4f65-bc95-1ffff97a8fd0", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "HackTool - Inveigh Execution", "query": "((process.executable.text:\"*\\\\Inveigh.exe\") OR (winlog.event_data.OriginalFileName:(\"\\Inveigh.exe\" OR \"\\Inveigh.dll\")) OR (winlog.event_data.Description:\"Inveigh\") OR (process.command_line.text:(\"*\\ \\-SpooferIP*\" OR \"*\\ \\-ReplyToIPs\\ *\" OR \"*\\ \\-ReplyToDomains\\ *\" OR \"*\\ \\-ReplyToMACs\\ *\" OR \"*\\ \\-SnifferIP*\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/Kevin-Robertson/Inveigh", "https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
