{"description":"Detects WMI SquiblyTwo Attack with possible renamed WMI by looking for imphash Author: Markus Neis / Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8d63dadf-b91b-4187-87b6-34a1114577ea","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"SquiblyTwo","query":"((process.executable:*\\\\wmic.exe AND process.command_line:*wmic* AND process.command_line:*format* AND process.command_line:*http*) OR ((winlog.event_data.Imphash:(\"1B1A3F43BF37B5BFE60751F2EE2F326E\" OR \"37777A96245A3C74EB217308F3546F4C\" OR \"9D87C9D67CE724033C0B40CC4CA1B206\") OR winlog.event_data.Hashes:(*1B1A3F43BF37B5BFE60751F2EE2F326E* OR *37777A96245A3C74EB217308F3546F4C* OR *9D87C9D67CE724033C0B40CC4CA1B206*)) AND (process.command_line:*format\\:* AND process.command_line:*http*)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1047","T1059","T1059","T1220"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"},{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"},{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1220","name":"XSL Script Processing","reference":"https://attack.mitre.org/techniques/T1220"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
