{"description": "Detects execution of renamed Remote Utilities (RURAT) via Product PE header field", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9ef27c24-4903-4192-881a-3adde7ff92a5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Renamed Remote Utilities RAT (RURAT) Execution", "query": "(Product:\"Remote Utilities\" AND (NOT process.executable.text:(\"*\\\\rutserv.exe\" OR \"*\\\\rfusclient.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
