{"description": "Detects execution of client32.exe (NetSupport RAT) from an unusual location (outside of 'C:\\Program Files')", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "37e8d358-6408-4853-82f4-98333fca7014", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remote Access Tool - NetSupport Execution From Unusual Location", "query": "(((process.executable.text:\"*\\\\client32.exe\") OR (Product:*NetSupport\\ Remote\\ Control*) OR (winlog.event_data.OriginalFileName:*client32.exe*) OR (winlog.event_data.Imphash:\"a9d50692e95b79723f3e76fcf70d023e\") OR (winlog.event_data.Hashes:*IMPHASH\\=a9d50692e95b79723f3e76fcf70d023e*)) AND (NOT process.executable.text:(\"C\\:\\\\Program\\ Files\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
