{"description": "Detect use of Ilasm.exe to compile c# code into dll or exe.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "850d55f9-6eeb-4492-ad69-a72338f65ba4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Ilasm Lolbin Use Compile C-Sharp", "query": "process.executable:*\\\\Ilasm.exe", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1127"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ilasm/", "https://www.echotrail.io/insights/search/ilasm.exe"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
