{"description": "Detects new process creation using WMIC via the \"process call create\" flag", "author": ["Michael Haag", "Florian Roth (Nextron Systems)", "juju4", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "526be59f-a573-4eea-b5f7-f0973207634d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Process Created Via Wmic.EXE", "query": "(((process.executable.text:\"*\\\\wmic.exe\") OR (winlog.event_data.OriginalFileName:\"wmic.exe\")) AND (process.command_line.text:\"*process*\" AND process.command_line.text:\"*call*\" AND process.command_line.text:\"*create*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://www.sans.org/blog/wmic-for-incident-response/", "https://github.com/redcanaryco/atomic-red-team/blob/84215139ee5127f8e3a117e063b604812bd71928/atomics/T1047/T1047.md#atomic-test-5---wmi-execute-local-process"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
