{"description": "Execute commands and binaries from the context of \"forfiles\". This is used as a LOLBIN for example to bypass application whitelisting.", "enabled": false, "false_positives": ["Legitimate use by a via a batch script or by an administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9aa5106d-bce3-4b13-86df-3a20f1d5cf0b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of Forfiles For Execution", "query": "((process.executable:*\\\\forfiles.exe OR winlog.event_data.OriginalFileName:\"forfiles.exe\") AND process.command_line:(*\\ \\/p\\ * OR *\\ \\-p\\ *) AND process.command_line:(*\\ \\/m\\ * OR *\\ \\-m\\ *) AND process.command_line:(*\\ \\/c\\ * OR *\\ \\-c\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Forfiles/", "https://pentestlab.blog/2020/07/06/indirect-command-execution/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
