{"description": "Detects execution of the binary \"wpbbin\" which is used as part of the UEFI based persistence method described in the refernece section", "enabled": false, "false_positives": ["Legitimate usage of the file by hardware manufacturer such as lenovo (Thanks @0gtweet for the tip)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4abc0ec4-db5a-412f-9632-26659cddf145", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "UEFI Persistence Via Wpbbin - ProcessCreation", "query": "process.executable:\"C\\:\\\\Windows\\\\System32\\\\wpbbin.exe\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1542"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1542", "name": "Pre-OS Boot", "reference": "https://attack.mitre.org/techniques/T1542"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1542", "name": "Pre-OS Boot", "reference": "https://attack.mitre.org/techniques/T1542"}]}], "version": 1, "references": ["https://grzegorztworek.medium.com/using-uefi-to-inject-executable-files-into-bitlocker-protected-drives-8ff4ca59c94c", "https://persistence-info.github.io/Data/wpbbin.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
