{"description": "Detects a suspicious curl process start on Windows and outputs the requested document to a local file", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e218595b-bbe7-4ee5-8a96-f32a24ad3468", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Curl Usage on Windows", "query": "((process.executable:*\\\\curl.exe OR Product:\"The\\ curl\\ executable\") AND (process.command_line:(*\\\\AppData\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Temp* OR *%AppData%* OR *%Temp%* OR *%Public%* OR *\\\\Desktop*) OR process.command_line:(*.jpg OR *.jpeg OR *.png OR *.gif OR *.tmp OR *.temp OR *.txt) OR process.command_line:(*\\ \\-O* OR *\\-\\-remote\\-name*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/max_mal_/status/1542461200797163522", "https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464", "https://github.com/pr0xylife/Qakbot/blob/main/Qakbot_AA_23.06.2022.txt"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali (updated)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
