{"description": "Execute C# code located in the consoleapp folder", "enabled": false, "false_positives": ["Legitimate use of dnx.exe by legitimate user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5acc7323-42e7-d589-2d1d-d7a499af6904", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Application Whitelisting Bypass via Dnx.exe", "query": "process.executable:*\\\\dnx.exe", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Csi.yml", "https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/"], "timestamp_override": "event.ingested", "author": ["Beyu Denis", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
