{"description": "Detects possible password spraying attempts using Dsacls", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use of dsacls to bind to an LDAP session"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bac9fb54-2da7-44e9-988f-11e9a5edbc0c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Password Spraying Attempt Using Dsacls.EXE", "query": "(((process.executable.text:\"*\\\\dsacls.exe\") OR (winlog.event_data.OriginalFileName:\"DSACLS.EXE\")) AND (process.command_line.text:\"*\\/user\\:*\" AND process.command_line.text:\"*\\/passwd\\:*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone", "https://ss64.com/nt/dsacls.html", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
