{"description": "Detects suspicious use of 'calc.exe' with command line parameters or in a suspicious directory, which is likely caused by some PoC or detection evasion", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40ab1e71-dc11-ca87-c95c-a8b3776f688c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Calculator Usage", "query": "(process.command_line.text:*\\\\calc.exe\\ * OR (process.executable.text:*\\\\calc.exe AND (NOT (process.executable.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/ItsReallyNick/status/1094080242686312448"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
