{"description": "Detects the addition of a new rule to the Windows firewall via netsh", "author": ["Markus Neis", "Sander Wiebing"], "enabled": false, "false_positives": ["Legitimate administration activity", "Software installations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Firewall Rule Added Via Netsh.EXE", "query": "((((process.executable.text:\"*\\\\netsh.exe\") OR (winlog.event_data.OriginalFileName:\"netsh.exe\")) AND (process.command_line.text:\"*\\ firewall\\ *\" AND process.command_line.text:\"*\\ add\\ *\")) AND (NOT ((process.command_line.text:(\"*\\\\netsh.exe\\ advfirewall\\ firewall\\ add\\ rule\\ name\\=Dropbox\\ dir\\=in\\ action\\=allow\\ \\\"program\\=C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\"\\ enable\\=yes\\ profile\\=Any*\" OR \"*\\\\netsh.exe\\ advfirewall\\ firewall\\ add\\ rule\\ name\\=Dropbox\\ dir\\=in\\ action\\=allow\\ \\\"program\\=C\\:\\\\Program\\ Files\\\\Dropbox\\\\Client\\\\Dropbox.exe\\\"\\ enable\\=yes\\ profile\\=Any*\")) OR ((process.parent.executable.text:\"C\\:\\\\Windows\\\\Temp\\\\asgard2\\-agent\\\\*\" AND process.parent.executable.text:\"*\\\\thor64.exe\" AND process.command_line.text:\"*advfirewall\\ firewall\\ show\\ rule\\ name\\=all*\")))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
