{"description": "Detects suspicious IIS native-code module installations via command line", "enabled": false, "false_positives": ["Unknown as it may vary from organisation to arganisation how admins use to install IIS modules"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9465ddf4-f9e4-4ebd-8d98-702df3a93239", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "IIS Native-Code Module Command Line Installation", "query": "(process.executable:*\\\\appcmd.exe AND process.command_line:*install* AND process.command_line:*module* AND process.command_line:*\\/name\\:*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
