{"description": "Detects execution of \"Diskshadow.exe\" in script mode using the \"/s\" flag where the script is located in a potentially suspicious location.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives may occur if you execute the script from one of the paths mentioned in the rule. Apply additional filters that fits your org needs."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa1a7e52-3d02-435b-81b8-00da14dd66c1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Diskshadow Script Mode - Execution From Potential Suspicious Location", "query": "(event.category:process AND ((winlog.event_data.OriginalFileName:/[Dd][Ii][Ss][Kk][Ss][Hh][Aa][Dd][Oo][Ww]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Dd][Ii][Ss][Kk][Ss][Hh][Aa][Dd][Oo][Ww]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\/[Ss]\\ .*/ OR /.*\\-[Ss]\\ .*/) AND process.command_line:(/.*\\:\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/ OR /.*\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\.*/ OR /.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/", "https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration", "https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4", "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow", "https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf", "https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware", "https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
