{"description": "Winword can be abused as a LOLBIN to download arbitary file or load arbitary DLLs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4ae3e30b-b03f-43aa-87e3-b622f4048eed", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Winword LOLBIN Usage", "query": "((process.executable:*\\\\WINWORD.exe OR winlog.event_data.OriginalFileName:\"WinWord.exe\") AND (process.command_line:(*http\\:\\/\\/* OR *https\\:\\/\\/*) OR process.command_line:(*\\/l\\ * OR *.dll*)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/", "https://github.com/D4Vinci/One-Lin3r/blob/master/one_lin3r/core/liners/windows/cmd/dll_loader_word.py"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
