{"description": "Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1c67a717-32ba-409b-a45d-0fb704a73a81", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious Listing of Network Connections", "query": "(process.command_line:*netstat* OR (process.command_line:*net\\ * AND (process.command_line:(*\\ use OR *\\ sessions) OR process.command_line:(*\\ use\\ * OR *\\ sessions\\ *))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1049"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1049", "name": "System Network Connections Discovery", "reference": "https://attack.mitre.org/techniques/T1049"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
