{"description": "Detects when a user installs certificates by using CertOC.exe to loads the target DLL file.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "73a4a187-a06f-7dc4-6a51-01351924f66c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Load DLL via CertOC.exe", "query": "(process.executable:*\\\\certoc.exe AND process.command_line:*\\-LoadDLL* AND process.command_line:*.dll*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/sblmsrsn/status/1445758411803480072?s=20"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
