{"description": "Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.\nMsiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)\n", "enabled": false, "false_positives": ["Legitimate script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3498ba2a-d8e0-2bae-d923-c87800372b92", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Msiexec Execute Arbitrary DLL", "query": "((process.executable.text:*\\\\msiexec.exe AND process.command_line.text:(*\\ \\/y* OR *\\ \\-y*)) AND (NOT ((process.command_line.text:(*\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\\\Bonjour\\\\mdnsNSP.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Bonjour\\\\mdnsNSP.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Apple\\ Software\\ Update\\\\ScriptingObjectModel.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Apple\\ Software\\ Update\\\\SoftwareUpdateAdmin.dll* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ \\\"C\\:\\\\Windows\\\\CCM\\\\* OR *\\\\MsiExec.exe\\\"\\ \\/Y\\ C\\:\\\\Windows\\\\CCM\\\\*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md", "https://twitter.com/_st0pp3r_/status/1583914515996897281"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
