{"description":"Detects a Windows command and scripting interpreter executable started from Microsoft Word, Excel, Powerpoint, Publisher and Visio Author: Michael Haag, Florian Roth, Markus Neis, Elastic, FPT.EagleEye Team. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"208748f7-881d-47ac-a29c-07ea84bf691d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Microsoft Outlook Product Spawning Windows Shell","query":"(process.parent.executable:*\\\\OUTLOOK.EXE AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\scrcons.exe OR *\\\\schtasks.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\msiexec.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe OR *\\\\svchost.exe OR *\\\\msbuild.exe))","meta":{"from":"1m"},"severity":"high","tags":["T1204"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
