{"description": "Detects execution of \"git\" in order to clone a remote repository that contain suspicious keywords which might be suspicious", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "aef9d1f1-7396-4e92-a927-4567c7a495c1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Git Clone", "query": "(((process.executable.text:(*\\\\git.exe OR *\\\\git\\-remote\\-https.exe)) OR (winlog.event_data.OriginalFileName:\"git.exe\")) AND process.command_line.text:(*\\ clone\\ * OR *git\\-remote\\-https\\ *) AND process.command_line.text:(*exploit* OR *Vulns* OR *vulnerability* OR *RemoteCodeExecution* OR *Invoke\\-* OR *CVE\\-* OR *poc\\-* OR *ProofOfConcept* OR *proxyshell* OR *log4shell* OR *eternalblue* OR *eternal\\-blue* OR *MS17\\-*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1593"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0043", "reference": "https://attack.mitre.org/tactics/TA0043", "name": "Reconnaissance"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1593", "name": "Search Open Websites/Domains", "reference": "https://attack.mitre.org/techniques/T1593"}]}], "version": 1, "references": ["https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
