{"description": "Detects execition of commands and binaries from the context of The program compatibility assistant (Pcalua.exe). This can be used as a LOLBIN in order to bypass application whitelisting.", "author": ["Nasreddine Bencherchali", "E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "enabled": false, "false_positives": ["Legitimate use by a via a batch script or by an administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b0c3c10f-685b-466d-8863-c416a59fec18", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of Pcalua For Execution", "query": "(process.executable.text:*\\\\pcalua.exe AND process.command_line.text:*\\ \\-a*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Pcalua/", "https://pentestlab.blog/2020/07/06/indirect-command-execution/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
