{"description": "Detect use of WebBrowserPassView.exe", "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40c041d4-a858-92eb-fdf2-1278843f2e98", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Launch WebBrowserPassView Executable", "query": "(winlog.event_data.Description:\"Web\\ Browser\\ Password\\ Viewer\" OR process.executable.text:*\\\\WebBrowserPassView.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1555.003/T1555.003.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
