{"description": "Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b29d45fa-1bc3-690d-0d90-8a55aec7ca86", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Root Certificate Installed From Susp Locations", "query": "(process.command_line.text:*Import\\-Certificate* AND process.command_line.text:*\\ \\-FilePath\\ * AND process.command_line.text:*Cert\\:\\\\LocalMachine\\\\Root* AND process.command_line.text:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Perflogs\\\\* OR *\\:\\\\Users\\\\Public\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1553"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1553", "name": "Subvert Trust Controls", "reference": "https://attack.mitre.org/techniques/T1553"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/", "https://docs.microsoft.com/en-us/powershell/module/pki/import-certificate?view=windowsserver2022-ps"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
