{"description": "Detects specific process characteristics of Winnti malware noticed in Dec/Jan 2020 in a campaign against Honk Kong universities", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3121461b-5aa0-4a41-b910-66d25524edbb", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Winnti Malware HK University Campaign", "query": "((process.parent.executable:(*C\\:\\\\Windows\\\\Temp* OR *\\\\hpqhvind.exe*) AND process.executable:C\\:\\\\ProgramData\\\\DRM*) OR (process.parent.executable:C\\:\\\\ProgramData\\\\DRM* AND process.executable:*\\\\wmplayer.exe) OR (process.parent.executable:*\\\\Test.exe AND process.executable:*\\\\wmplayer.exe) OR process.executable:\"C\\:\\\\ProgramData\\\\DRM\\\\CLR\\\\CLR.exe\" OR (process.parent.executable:C\\:\\\\ProgramData\\\\DRM\\\\Windows* AND process.executable:*\\\\SearchFilterHost.exe))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2020/01/31/winnti-group-targeting-universities-hong-kong/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
