{"description":"Detects a Windows command and scripting interpreter executable started from Microsoft Word, Excel, Powerpoint, Publisher and Visio Author: Michael Haag, Florian Roth, Markus Neis, Elastic, FPT.EagleEye Team. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"34ad6713-bef4-b9e4-8a79-bf2d0c3a43b7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Microsoft Office Product Spawning Windows Shell","query":"((process.parent.executable:(*\\\\WINWORD.EXE OR *\\\\EXCEL.EXE OR *\\\\POWERPNT.exe OR *\\\\MSPUB.exe OR *\\\\VISIO.exe OR *\\\\OUTLOOK.EXE OR *\\\\MSACCESS.EXE OR *\\\\EQNEDT32.EXE) AND process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\scrcons.exe OR *\\\\schtasks.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\msiexec.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe OR *\\\\svchost.exe OR *\\\\msbuild.exe)) AND (NOT ((process.parent.executable:*\\\\OUTLOOK.EXE AND process.executable:*\\\\rundll32.exe AND process.command_line:*\\\\PhotoViewer.dll*) OR (process.parent.executable:*\\\\OUTLOOK.EXE AND process.executable:*\\\\rundll32.exe AND process.command_line:*shell32.dll,Control_RunDLL* AND process.command_line:*\\\\SYSTEM32\\\\SPOOL\\\\DRIVERS\\\\*))))","meta":{"from":"1m"},"severity":"high","tags":["T1204"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
