{"description": "Detects patterns found in process executions cause by China Chopper like tiny (ASPX) webshells", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5f517401-eda0-66f6-41bd-b6346058b788", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Chopper Webshell Process Pattern", "query": "((process.executable.text:*\\\\w3wp.exe OR process.parent.executable.text:*\\\\w3wp.exe) AND process.command_line.text:(*&ipconfig&echo* OR *&quser&echo* OR *&whoami&echo* OR *&c\\:&echo* OR *&cd&echo* OR *&dir&echo* OR *&echo\\ \\[E\\]* OR *&echo\\ \\[S\\]*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1018", "T1033", "T1087", "T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)", "MSTI (query)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
