{"description": "Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8f70ac5f-1f6f-4f8e-b454-db19561216c5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell DownloadFile", "query": "(process.command_line:*powershell* AND process.command_line:*.DownloadFile* AND process.command_line:*System.Net.WebClient*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1104", "T1105"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
