{"description": "Suspicious add key for BitLocker", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bc5b4d65-5d52-cf97-3073-f5adb08537dd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Reg Add BitLocker", "query": "(process.command_line:*REG* AND process.command_line:*ADD* AND process.command_line:*HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\FVE* AND process.command_line:*\\/v* AND process.command_line:*\\/f* AND process.command_line:(*EnableBDEWithNoTPM* OR *UseAdvancedStartup* OR *UseTPM* OR *UseTPMKey* OR *UseTPMKeyPIN* OR *RecoveryKeyMessageSource* OR *UseTPMPIN* OR *RecoveryKeyMessage*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1486"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1486", "name": "Data Encrypted for Impact", "reference": "https://attack.mitre.org/techniques/T1486"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
