{"description":"Detects a certain command line flag combination used by mpiexec.exe LOLBIN from HPC pack that can be used to execute any other binary Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"729ce0ea-5d8f-4769-9762-e35de441586d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"MpiExec Lolbin","query":"((process.executable:*\\\\mpiexec.exe OR winlog.event_data.Imphash:\"d8b52ef6aaa3a81501bdfff9dbb96217\" OR winlog.event_data.Hashes:*d8b52ef6aaa3a81501bdfff9dbb96217*) AND process.command_line:(*\\ \\/n\\ 1\\ * OR *\\ \\-n\\ 1\\ *))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
