{"description": "Detects the execution of the PurpleSharp adversary simulation tool", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ff23ffbc-3378-435e-992f-0624dcf93ab4", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "PurpleSharp Indicator", "query": "(process.command_line:(*xyz123456.exe* OR *PurpleSharp*) OR winlog.event_data.OriginalFileName:\"PurpleSharp.exe\")", "meta": {"from": "1m"}, "severity": "critical", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/mvelazc0/PurpleSharp"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
