{"description": "Detects suspicious powershell process which includes bxor command, alternative obfuscation method to b64 encoded commands.", "author": ["Sami Ruohonen", "Harish Segar (improvement)", "Tim Shelton"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "36b982cc-8963-a677-08c3-becf9f835691", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious XOR Encoded PowerShell Command Line", "query": "((((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\")) OR (winlog.event_data.Description:\"Windows PowerShell\") OR (Product:\"PowerShell Core 6\")) AND process.command_line.text:(*bxor* OR *\\-join\\ * OR *\\-join'* OR *\\-join\\\"* OR *\\-join`* OR *char*)) AND (NOT (((process.parent.executable.text:\"C:\\Program Files\\Amazon\\SSM\\ssm-document-worker.exe\")) OR ((process.command_line.text:*function\\ Convert\\-GuidToCompressedGuid* AND process.command_line.text:*ValueFromPipelineByPropertyName* AND process.command_line.text:*\\:\\:ParseExact\\(* AND process.command_line.text:*KB\\[000000\\-999999\\]*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027", "T1059", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
