{"description": "Detects potential Amazon SSM agent hijack attempts as outlined in the Mitiga research reoport.", "author": ["Muhammad Faisal"], "enabled": false, "false_positives": ["Legitimate activity of system administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d20ee2f4-822c-4827-9e15-41500b1fff10", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Amazon SSM Agent Hijacking", "query": "(process.executable:/.*\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\-[Ss][Ss][Mm]\\-[Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\-[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr]\\ .*/ AND process.command_line:/.*\\-[Cc][Oo][Dd][Ee]\\ .*/ AND process.command_line:/.*\\-[Ii][Dd]\\ .*/ AND process.command_line:/.*\\-[Rr][Ee][Gg][Ii][Oo][Nn]\\ .*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.mitiga.io/blog/mitiga-security-advisory-abusing-the-ssm-agent-as-a-remote-access-trojan", "https://www.bleepingcomputer.com/news/security/amazons-aws-ssm-agent-can-be-used-as-post-exploitation-rat-malware/", "https://www.helpnetsecurity.com/2023/08/02/aws-instances-attackers-access/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
