{"description": "Detects usage of bitsadmin downloading a file using an URL that contains an IP", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99c840f2-2012-46fd-9141-c761987550ef", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Bitsadmin Download File from IP", "query": "(process.executable:*\\\\bitsadmin.exe AND process.command_line:(*\\ \\/transfer\\ * OR *\\ \\/create\\ * OR *\\ \\/addfile\\ *) AND process.command_line:(*http\\:\\/\\/1* OR *http\\:\\/\\/2* OR *http\\:\\/\\/3* OR *http\\:\\/\\/4* OR *http\\:\\/\\/5* OR *http\\:\\/\\/6* OR *http\\:\\/\\/7* OR *http\\:\\/\\/8* OR *http\\:\\/\\/9* OR *https\\:\\/\\/1* OR *https\\:\\/\\/2* OR *https\\:\\/\\/3* OR *https\\:\\/\\/4* OR *https\\:\\/\\/5* OR *https\\:\\/\\/6* OR *https\\:\\/\\/7* OR *https\\:\\/\\/8* OR *https\\:\\/\\/9*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
