{"description": "Detects a WMI backdoor in Exchange Transport Agents via WMI event filters", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7fdf3d0d-f864-cb8b-40de-c001dc917bb7", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "WMI Backdoor Exchange Transport Agent", "query": "(process.parent.executable:*\\\\EdgeTransport.exe AND (NOT (process.executable:\"C\\:\\\\Windows\\\\System32\\\\conhost.exe\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://twitter.com/cglyer/status/1182389676876980224", "https://twitter.com/cglyer/status/1182391019633029120"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
