{"description": "Detect usage of the \"driverquery\" utility. Which can be used to perform reconnaissance on installed drivers", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate use by third party tools in order to investigate installed drivers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b1375470-6ad0-85e3-23dd-b6fc55291d98", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DriverQuery.EXE Usage", "query": "((process.executable.text:*driverquery.exe) OR (winlog.event_data.OriginalFileName:\"drvqry.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/", "https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/", "https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
