{"description": "Detects suspicious child processes of the Microsoft OneNote application. This may indicate an attempt to execute malicious embedded objects from a .one file.", "author": ["Tim Rauch (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)", "Elastic (idea)"], "enabled": false, "false_positives": ["File located in the AppData folder with trusted signature"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c27515df-97a9-4162-8a60-dc0eeb51b775", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Microsoft OneNote Child Process", "query": "((process.parent.executable.text:\"*\\\\onenote.exe\" AND ((((winlog.event_data.OriginalFileName:(\"bitsadmin.exe\" OR \"CertOC.exe\" OR \"CertUtil.exe\" OR \"Cmd.Exe\" OR \"CMSTP.EXE\" OR \"cscript.exe\" OR \"curl.exe\" OR \"HH.exe\" OR \"IEExec.exe\" OR \"InstallUtil.exe\" OR \"javaw.exe\" OR \"Microsoft.Workflow.Compiler.exe\" OR \"msdt.exe\" OR \"MSHTA.EXE\" OR \"msiexec.exe\" OR \"Msxsl.exe\" OR \"odbcconf.exe\" OR \"pcalua.exe\" OR \"PowerShell.EXE\" OR \"RegAsm.exe\" OR \"RegSvcs.exe\" OR \"REGSVR32.exe\" OR \"RUNDLL32.exe\" OR \"schtasks.exe\" OR \"ScriptRunner.exe\" OR \"wmic.exe\" OR \"WorkFolders.exe\" OR \"wscript.exe\")) OR (process.executable.text:(\"*\\\\AppVLP.exe\" OR \"*\\\\bash.exe\" OR \"*\\\\bitsadmin.exe\" OR \"*\\\\certoc.exe\" OR \"*\\\\certutil.exe\" OR \"*\\\\cmd.exe\" OR \"*\\\\cmstp.exe\" OR \"*\\\\control.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\curl.exe\" OR \"*\\\\forfiles.exe\" OR \"*\\\\hh.exe\" OR \"*\\\\ieexec.exe\" OR \"*\\\\installutil.exe\" OR \"*\\\\javaw.exe\" OR \"*\\\\mftrace.exe\" OR \"*\\\\Microsoft.Workflow.Compiler.exe\" OR \"*\\\\msbuild.exe\" OR \"*\\\\msdt.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\msidb.exe\" OR \"*\\\\msiexec.exe\" OR \"*\\\\msxsl.exe\" OR \"*\\\\odbcconf.exe\" OR \"*\\\\pcalua.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\regasm.exe\" OR \"*\\\\regsvcs.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\schtasks.exe\" OR \"*\\\\scrcons.exe\" OR \"*\\\\scriptrunner.exe\" OR \"*\\\\sh.exe\" OR \"*\\\\svchost.exe\" OR \"*\\\\verclsid.exe\" OR \"*\\\\wmic.exe\" OR \"*\\\\workfolders.exe\" OR \"*\\\\wscript.exe\")))) OR ((process.executable.text:\"*\\\\explorer.exe\" AND process.command_line.text:(\"*.hta*\" OR \"*.vb*\" OR \"*.wsh*\" OR \"*.js*\" OR \"*.ps*\" OR \"*.scr*\" OR \"*.pif*\" OR \"*.bat*\" OR \"*.cmd*\"))) OR (process.executable.text:(\"*\\\\AppData\\\\*\" OR \"*\\\\Users\\\\Public\\\\*\" OR \"*\\\\ProgramData\\\\*\" OR \"*\\\\Windows\\\\Tasks\\\\*\" OR \"*\\\\Windows\\\\Temp\\\\*\" OR \"*\\\\Windows\\\\System32\\\\Tasks\\\\*\")))) AND (NOT (((process.executable.text:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\" AND process.command_line.text:\"*\\-Embedding\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*\" AND process.executable.text:\"*\\\\FileCoAuth.exe\" AND process.command_line.text:\"*\\-Embedding\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1566", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}, {"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-e34e43eb5666427602ddf488b2bf3b545bd9aae81af3e6f6c7949f9652abdf18", "https://micahbabinski.medium.com/detecting-onenote-one-malware-delivery-407e9321ecf0"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
