{"description": "Detects manual execution of the \"Microsoft Compatibility Appraiser\" task via schtasks.\nIn order to trigger persistence stored in the \"\\AppCompatFlags\\TelemetryController\" registry key.\n", "author": ["Sreeman"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f548a603-c9f2-4c89-b511-b089f7e94549", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via Microsoft Compatibility Appraiser", "query": "(((process.executable.text:\"*\\\\schtasks.exe\") OR (winlog.event_data.OriginalFileName:\"schtasks.exe\")) AND (process.command_line.text:\"*run\\ *\" AND process.command_line.text:\"*\\\\Application\\ Experience\\\\Microsoft\\ Compatibility\\ Appraiser*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
