{"description": "Detects command line parameters used by Koadic hack tool", "author": ["wagga", "Jonhnathan Ribeiro", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5cddf373-ef00-4112-ad72-960ac29bac34", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Koadic Execution", "query": "(((process.executable.text:\"*\\\\cmd.exe\") OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND (process.command_line.text:\"*\\/q*\" AND process.command_line.text:\"*\\/c*\" AND process.command_line.text:\"*chcp*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://unit42.paloaltonetworks.com/unit42-sofacy-groups-parallel-attacks/", "https://github.com/offsecginger/koadic/blob/457f9a3ff394c989cdb4c599ab90eb34fb2c762c/data/stager/js/stdlib.js", "https://blog.f-secure.com/hunting-for-koadic-a-com-based-rootkit/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
