{"description": "Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1 module", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99465c8f-f102-4157-b11c-b0cddd53b79a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution via CL_Mutexverifiers.ps1", "query": "(process.command_line:*CL_Mutexverifiers.ps1* AND process.command_line:*runAfterCancelProcess*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1216", "name": "Signed Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/CL_mutexverifiers.yml", "https://twitter.com/pabraeken/status/995111125447577600"], "timestamp_override": "event.ingested", "author": ["oscd.community", "Natalia Shornikova"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
