{"description": "Detects a suspicious curl process start on Windows and outputs the requested document to a local file", "enabled": false, "false_positives": ["Scripts created by developers and admins", "Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bdd97c33-6005-b44a-8841-5762daf05012", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Curl Usage on Windows", "query": "((process.executable:*\\\\curl.exe OR Product:\"The\\ curl\\ executable\") AND process.command_line:(*\\ \\-O* OR *\\-\\-remote\\-name*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
