{"description": "Detects usage of Gpg4win to encrypt/decrypt files located in potentially suspicious locations.", "author": ["Nasreddine Bencherchali (Nextron Systems)", "X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Encryption/Decryption Via Gpg4win From Suspicious Locations", "query": "(event.category:process AND ((process.executable:(/.*\\\\[Gg][Pp][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Pp][Gg]2\\.[Ee][Xx][Ee]/)) OR (Product:/[Gg][Nn][Uu]\\ [Pp][Rr][Ii][Vv][Aa][Cc][Yy]\\ [Gg][Uu][Aa][Rr][Dd]\\ \\([Gg][Nn][Uu][Pp][Gg]\\)/) OR (winlog.event_data.Description:/[Gg][Nn][Uu][Pp][Gg]\u2019[Ss]\\ [Oo][Pp][Ee][Nn][Pp][Gg][Pp]\\ [Tt][Oo][Oo][Ll]/)) AND process.command_line:/.*\\-[Pp][Aa][Ss][Ss][Pp][Hh][Rr][Aa][Ss][Ee].*/ AND process.command_line:(/.*\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\.*/ OR /.*\\:\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\.*/))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html", "https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
