{"description": "This rule looks for Windows Installer service (msiexec.exe) spawned command line and/or powershell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1e53dd56-8d83-4eb4-a43e-b790a05510aa", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Always Install Elevated MSI Spawned Cmd And Powershell", "query": "((process.executable.text:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe) OR winlog.event_data.OriginalFileName:(\"Cmd.Exe\" OR \"PowerShell.EXE\" OR \"pwsh.dll\")) AND (process.parent.executable.text:*\\\\Windows\\\\Installer\\\\* AND process.parent.executable.text:*msi* AND process.parent.executable.text:*tmp))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-50-638.jpg"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov (idea)", "Mangatas Tondang (rule)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
