{"description": "Detects the use of the filename DumpStack.log to evade Microsoft Defender", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4f647cfa-b598-4e12-ad69-c68dd16caef8", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "DumpStack.log Defender Evasion", "query": "(process.executable:*\\\\DumpStack.log OR process.command_line:*\\ \\-o\\ DumpStack.log*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/mrd0x/status/1479094189048713219"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
