{"description": "Detects possible NTLM coercion via certutil using the 'syncwithWU' flag", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6c6d9280-e6d0-4b9d-80ac-254701b64916", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential NTLM Coercion Via Certutil.EXE", "query": "(((process.executable.text:\"*\\\\certutil.exe\") OR (winlog.event_data.OriginalFileName:\"CertUtil.exe\")) AND (process.command_line.text:\"*\\ \\-syncwithWU\\ *\" AND process.command_line.text:\"*\\ \\\\\\\\*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/issues/243"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
