{"description": "Detects DarkSide Ransomware and helpers", "enabled": false, "false_positives": ["Unknown", "UAC bypass method used by other malware"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e708c7da-49c4-321d-4ec4-7e6d0fc4ff11", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "DarkSide Ransomware Pattern", "query": "(process.command_line:(*\\=\\[char\\]\\[byte\\]\\('0x'\\+* OR *\\ \\-work\\ worker0\\ \\-path\\ *) OR (process.parent.command_line:*DllHost.exe\\ \\/Processid\\:\\{3E5FC7F9\\-9A51\\-4367\\-9063\\-A120244FBEC7\\}* AND process.executable:*\\\\AppData\\\\Local\\\\Temp\\\\*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html", "https://app.any.run/tasks/8b9a571b-bcc1-4783-ba32-df4ba623b9c0/", "https://www.joesandbox.com/analysis/411752/0/html#7048BB9A06B8F2DD9D24C77F389D7B2B58D2"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
