{"description": "Detects suspicious command lines used in Covenant luanchers", "author": ["Florian Roth (Nextron Systems)", "Jonhnathan Ribeiro", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c260b6db-48ba-4b4a-a76f-2f67644e99d2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Covenant PowerShell Launcher", "query": "(((process.command_line.text:\"*\\-Sta*\" AND process.command_line.text:\"*\\-Nop*\" AND process.command_line.text:\"*\\-Window*\" AND process.command_line.text:\"*Hidden*\" AND process.command_line.text:(\"*\\-Command*\" OR \"*\\-EncodedCommand*\"))) OR (process.command_line.text:(\"*sv\\ o\\ \\(New\\-Object\\ IO.MemorySteam\\);sv\\ d\\ *\" OR \"*mshta\\ file.hta*\" OR \"*GruntHTTP*\" OR \"*\\-EncodedCommand\\ cwB2ACAAbwAgA*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://posts.specterops.io/covenant-v0-5-eee0507b85ba"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
