{"description": "Detects a suspicious RDP session redirect using tscon.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious RDP Redirect Using TSCON", "query": "process.command_line:*\\ \\/dest\\:rdp\\-tcp\\:*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1563"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}, {"id": "T1563", "name": "Remote Service Session Hijacking", "reference": "https://attack.mitre.org/techniques/T1563"}]}], "version": 1, "references": ["http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html", "https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
