{"description": "Detects various command line and scripting engines/processes such as \"PowerShell\", \"Wscript\", \"Cmd\", etc. spawning a \"regsvr32\" instance.", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate \".bat\", \".hta\", \".ps1\" or \".vbs\" scripts leverage legitimately often. Apply additional filter and exclusions as necessary", "Some legitimate Windows services"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab37a6ec-6068-432b-a64e-2c7bf95b1d22", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Scripting/CommandLine Process Spawned Regsvr32", "query": "((process.parent.executable.text:(\"*\\\\cmd.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\powershell_ise.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\wscript.exe\") AND process.executable.text:\"*\\\\regsvr32.exe\") AND (NOT (process.parent.executable.text:\"C:\\Windows\\System32\\cmd.exe\" AND process.command_line.text:\"*\\ \\/s\\ C\\:\\\\Windows\\\\System32\\\\RpcProxy\\\\RpcProxy.dll\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://web.archive.org/web/20171001085340/https://subt0x10.blogspot.com/2017/04/bypass-application-whitelisting-script.html", "https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
