{"description": "Detects different process creation events as described in various threat reports on Lazarus group activity", "enabled": false, "false_positives": ["Overlap with legitimate process activity in some cases (especially selection 3 and 4)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f1742b73-b427-2161-f145-7c0ecf553041", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Lazarus Activity", "query": "(process.command_line:(*reg.exe\\ save\\ hklm\\\\sam\\ %temp%\\\\\\~reg_sam.save* OR *1q2w3e4r@#$@#$@#$* OR *\\ \\-hp1q2w3e4\\ * OR *.dat\\ data03\\ 10000\\ \\-p\\ *) OR (process.command_line:*process\\ call\\ create* AND process.command_line:*\\ >\\ %temp%\\\\\\~*) OR (process.command_line:*netstat\\ \\-aon\\ |\\ find\\ * AND process.command_line:*\\ >\\ %temp%\\\\\\~*) OR process.command_line:*.255\\ 10\\ C\\:\\\\ProgramData\\\\*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://securelist.com/lazarus-covets-covid-19-related-intelligence/99906/", "https://www.hvs-consulting.de/lazarus-report/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
