{"description": "Detects use of executionpolicy option to set a unsecure policies", "enabled": false, "false_positives": ["Administrator script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "796084d8-511c-2c85-0f75-bcd3a22f29eb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Change PowerShell Policies to an Unsecure Level", "query": "(process.command_line:(*\\ \\-executionpolicy\\ * OR *\\ \\-ep\\ * OR *\\ \\-exec\\ *) AND process.command_line:(*Unrestricted* OR *bypass* OR *RemoteSigned*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.1", "https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.1", "https://adsecurity.org/?p=2604", "https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
