{"description": "Detects Service Principal Name Enumeration used for Kerberoasting", "enabled": false, "false_positives": ["Administrator Activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1eeed653-dbc8-4187-ad0c-eeebb20e6599", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Possible SPN Enumeration", "query": "((process.executable:*\\\\setspn.exe OR (winlog.event_data.Description:*Query\\ or\\ reset\\ the\\ computer* AND winlog.event_data.Description:*SPN\\ attribute*)) AND process.command_line:*\\-q*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://p16.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation"], "timestamp_override": "event.ingested", "author": ["Markus Neis", "keepwatch"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
