{"description": "Detects when an adversary uses the reg.exe utility to add or modify new keys or subkeys", "enabled": false, "false_positives": ["Rare legitimate add to registry via cli (to these locations)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b7e2a8d4-74bb-4b78-adc9-3f92af2d4829", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Reg Add Suspicious Paths", "query": "((process.executable.text:*\\\\reg.exe OR winlog.event_data.OriginalFileName:\"reg.exe\") AND process.command_line.text:(*\\\\AppDataLow\\\\Software\\\\Microsoft\\\\* OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\OOBE* OR *\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon* OR *\\\\CurrentControlSet\\\\Control\\\\SecurityProviders\\\\WDigest* OR *\\\\Microsoft\\\\Windows\\ Defender\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md", "https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.001/T1562.001.md"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
