{"description": "Detect use of ie4uinit.exe to execute commands from a specially prepared ie4uinit.inf file from a directory other than the usual directories", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d3bf399f-b0cf-4250-8bb4-dfc192ab81dc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Ie4uinit Lolbin Use From Invalid Path", "query": "(process.executable:*\\\\ie4uinit.exe AND (NOT ((process.working_directory:(\"c\\:\\\\windows\\\\system32\\\\\" OR \"c\\:\\\\windows\\\\sysWOW64\\\\\")) OR (NOT _exists_:process.working_directory))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ie4uinit/", "https://bohops.com/2018/03/10/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence-part-2/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
