{"description": "Detects a suspicious curl process start on Windows with set useragent options", "enabled": false, "false_positives": ["Scripts created by developers and admins", "Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b365f491-70d4-a7c5-fae5-cb829df68a96", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Curl Change User Agents", "query": "((process.executable:*\\\\curl.exe OR Product:\"The\\ curl\\ executable\") AND process.command_line:(*\\ \\-A\\ * OR *\\ \\-\\-user\\-agent\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://curl.se/docs/manpage.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1071.001/T1071.001.md#atomic-test-2---malicious-user-agents---cmd"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
