{"description": "Detects suspicious file execution by wscript and cscript", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "966e4016-627f-44f7-8341-f394905c361f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "WMIExec VBS Script", "query": "(process.executable:*\\\\cscript.exe AND process.command_line:*.vbs* AND process.command_line:*\\/shell*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
