{"description": "Detects regsvr32 execution to download and install DLLs located remotely where the address is an IP address.", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["FQDNs that start with a number such as \"7-Zip\""], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2dd2c217-bf68-437a-b57c-fe9fd01d5de8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious Regsvr32 HTTP IP Pattern", "query": "(((process.executable.text:\"*\\\\regsvr32.exe\") OR (winlog.event_data.OriginalFileName:\"REGSVR32.EXE\")) AND process.command_line.text:(\"*\\ \\/i\\:http\\:\\/\\/1*\" OR \"*\\ \\/i\\:http\\:\\/\\/2*\" OR \"*\\ \\/i\\:http\\:\\/\\/3*\" OR \"*\\ \\/i\\:http\\:\\/\\/4*\" OR \"*\\ \\/i\\:http\\:\\/\\/5*\" OR \"*\\ \\/i\\:http\\:\\/\\/6*\" OR \"*\\ \\/i\\:http\\:\\/\\/7*\" OR \"*\\ \\/i\\:http\\:\\/\\/8*\" OR \"*\\ \\/i\\:http\\:\\/\\/9*\" OR \"*\\ \\/i\\:https\\:\\/\\/1*\" OR \"*\\ \\/i\\:https\\:\\/\\/2*\" OR \"*\\ \\/i\\:https\\:\\/\\/3*\" OR \"*\\ \\/i\\:https\\:\\/\\/4*\" OR \"*\\ \\/i\\:https\\:\\/\\/5*\" OR \"*\\ \\/i\\:https\\:\\/\\/6*\" OR \"*\\ \\/i\\:https\\:\\/\\/7*\" OR \"*\\ \\/i\\:https\\:\\/\\/8*\" OR \"*\\ \\/i\\:https\\:\\/\\/9*\" OR \"*\\ \\-i\\:http\\:\\/\\/1*\" OR \"*\\ \\-i\\:http\\:\\/\\/2*\" OR \"*\\ \\-i\\:http\\:\\/\\/3*\" OR \"*\\ \\-i\\:http\\:\\/\\/4*\" OR \"*\\ \\-i\\:http\\:\\/\\/5*\" OR \"*\\ \\-i\\:http\\:\\/\\/6*\" OR \"*\\ \\-i\\:http\\:\\/\\/7*\" OR \"*\\ \\-i\\:http\\:\\/\\/8*\" OR \"*\\ \\-i\\:http\\:\\/\\/9*\" OR \"*\\ \\-i\\:https\\:\\/\\/1*\" OR \"*\\ \\-i\\:https\\:\\/\\/2*\" OR \"*\\ \\-i\\:https\\:\\/\\/3*\" OR \"*\\ \\-i\\:https\\:\\/\\/4*\" OR \"*\\ \\-i\\:https\\:\\/\\/5*\" OR \"*\\ \\-i\\:https\\:\\/\\/6*\" OR \"*\\ \\-i\\:https\\:\\/\\/7*\" OR \"*\\ \\-i\\:https\\:\\/\\/8*\" OR \"*\\ \\-i\\:https\\:\\/\\/9*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1461041276514623491", "https://twitter.com/tccontre18/status/1480950986650832903", "https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
