{"description": "Detects renamed ftp.exe, ftp.exe script execution and child processes ran by ftp.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d38449a4-5b84-0cf5-13b2-f93085b6dbb9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious ftp.exe", "query": "((process.command_line:*\\-s\\:* AND (process.executable:*ftp.exe OR winlog.event_data.OriginalFileName:*ftp.exe*)) OR (winlog.event_data.OriginalFileName:*ftp.exe* AND (NOT (process.executable:*ftp.exe))) OR process.parent.executable:*ftp.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Ftp.yml"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
