{"description": "Detects the import of the '.reg' files from suspicious paths using the 'reg.exe' utility", "enabled": false, "false_positives": ["Legitimate import of keys"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "780fdb03-d3ca-f9e7-2e6b-21ecac00bbc9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Imports Registry Key From a File Using Reg.exe", "query": "(process.executable.text:*\\\\reg.exe AND process.command_line.text:*\\ import\\ * AND process.command_line.text:(*C\\:\\\\Users\\\\* OR *%temp%* OR *%appdata%* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Windows\\\\Temp\\\\* OR *C\\:\\\\ProgramData\\\\*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
