{"description": "Detects execution of netsh with the \"advfirewall\" and the \"set\" option in order to set new values for properties of a existing rule", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate administration activity", "Software installations and removal"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a70dcb37-3bee-453a-99df-d0c683151be6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Firewall Rule Update Via Netsh.EXE", "query": "(((process.executable.text:\"*\\\\netsh.exe\") OR (winlog.event_data.OriginalFileName:\"netsh.exe\")) AND (process.command_line.text:\"*\\ firewall\\ *\" AND process.command_line.text:\"*\\ set\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://ss64.com/nt/netsh.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
