{"description": "Detects usage of cmdkey to look for cached credentials", "enabled": false, "false_positives": ["Legitimate administrative tasks"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "72ed9f46-b0c7-f95f-5116-182ac01237e7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Cmdkey Cached Credentials Recon", "query": "((process.executable:*\\\\cmdkey.exe OR winlog.event_data.OriginalFileName:\"cmdkey.exe\") AND process.command_line:(*\\ \\/l* OR *\\ \\-l*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation", "https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx"], "timestamp_override": "event.ingested", "author": ["jmallette", "Florian Roth", "Nasreddine Bencherchali (update)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
