{"description": "Detects installation of a potentially suspicious new shim with an uncommon extension using sdbinst.exe.\nAdversaries may establish persistence and/or elevate privileges by executing malicious content triggered by application shims\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "18ee686c-38a3-4f65-9f44-48a077141f42", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Shim Database Installation via Sdbinst.EXE", "query": "(event.category:process AND ((process.executable:/.*\\\\[Ss][Dd][Bb][Ii][Nn][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Ss][Dd][Bb][Ii][Nn][Ss][Tt]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.command_line:/.*\\.[Ss][Dd][Bb].*/) OR ((process.parent.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Dd][Bb][Ii][Nn][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Mm]\\ \\-[Bb][Gg].*/)) OR ((process.parent.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Dd][Bb][Ii][Nn][Ss][Tt]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\ \\-[Mm][Mm]/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
