{"description": "Detects a command line process that uses explorer.exe to launch arbitrary commands or binaries, which is similar to cmd.exe /c, only it breaks the process tree and makes its parent a new instance of explorer spawning from \"svchost\"", "enabled": false, "false_positives": ["Unknown how many legitimate software products use that method"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "949f1ffb-6e85-4f00-ae1e-c3c5b190d605", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Explorer Process Tree Break", "query": "(process.command_line.text:*\\/factory,\\{75dff2b7\\-6936\\-4c06\\-a8bb\\-676a7b00b24b\\}* OR (process.command_line.text:*explorer.exe* AND process.command_line.text:*\\ \\/root,*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/CyberRaiju/status/1273597319322058752", "https://twitter.com/bohops/status/1276357235954909188?s=12", "https://twitter.com/nas_bench/status/1535322450858233858", "https://securityboulevard.com/2019/09/deobfuscating-ostap-trickbots-34000-line-javascript-downloader/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali", "@gott_cyber"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
