{"description": "This rule detects DLL injection and execution via LOLBAS - Tracker.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e54e7b96-2318-1d0d-e875-387b518df040", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DLL Injection with Tracker.exe", "query": "(((process.executable.text:*\\\\tracker.exe OR winlog.event_data.Description:\"Tracker\") AND process.command_line.text:(*\\ \\/d\\ * OR *\\ \\/c\\ *)) AND (NOT ((process.parent.executable.text:*\\\\Msbuild\\\\Current\\\\Bin\\\\MSBuild.exe AND process.command_line.text:*\\\\VC\\\\Tools\\\\MSVC\\\\* AND process.command_line.text:*\\\\bin\\\\HostX86\\\\x64\\\\*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/"], "timestamp_override": "event.ingested", "author": ["Avneet Singh @v3t0_", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
