{"description": "Detects when a shell program such as the windows Command Prompt or PowerShell is launched with system privileges.", "author": ["frack113", "Tim Shelton (update fp)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "14cbe1b8-d0a7-c0ca-e570-f12b776b7c49", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Elevated System Shell", "query": "((((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\cmd.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\" OR \"Cmd.Exe\"))) AND (user.name:(*AUTHORI* OR *AUTORI*) AND LogonId:\"0x3e7\")) AND (NOT (((process.parent.executable.text:\"C:\\Windows\\System32\\CompatTelRunner.exe\" AND process.parent.command_line.text:*\\-m\\:appraiser.dll\\ \\-f\\:DoScheduledTelemetryRun* AND winlog.event_data.OriginalFileName:\"PowerShell.EXE\" AND process.command_line.text:*\\-ExecutionPolicy\\ Restricted\\ \\-Command\\ Write\\-Host*)) OR ((process.parent.executable.text:C\\:\\\\Program\\ Files\\\\erl\\-* AND process.parent.executable.text:*\\\\bin\\\\erl.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/Wh04m1001/SysmonEoP"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
