{"description": "Detects process creation with a renamed Msdt.exe", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa66fe83-b749-a9ba-d7f3-d8b9a5d69fc8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed Msdt.exe", "query": "(winlog.event_data.OriginalFileName:\"msdt.exe\" AND (NOT ((process.executable:*\\\\msdt.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Msdt/"], "timestamp_override": "event.ingested", "author": ["pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
