{"description": "Injects arbitrary DLL into running process specified by process ID. Requires Windows 10.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0598d542-0fde-15e9-8109-59caac4dff4b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Mavinject Inject DLL Into Running Process", "query": "(process.command_line:*\\ \\/INJECTRUNNING* AND process.command_line:*.dll* AND winlog.event_data.OriginalFileName:*mavinject*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1056", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1056.004/T1056.004.md", "https://posts.specterops.io/mavinject-exe-functionality-deconstructed-c29ab2cf5c0e"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
