{"description": "Detects execution of ftp.exe script execution with the \"-s\" or \"/s\" flag and any child processes ran by ftp.exe", "author": ["Victor Sergeev", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "06b401f4-107c-4ff9-947f-9ec1e7649f1e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "LOLBIN Execution Of The FTP.EXE Binary", "query": "(event.category:process AND ((process.parent.executable:/.*\\\\[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/) OR ((((process.executable:/.*\\\\[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Ff][Tt][Pp]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\-[Ss]\\:.*/ OR /.*\\/[Ss]\\:.*/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ftp/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
