{"description": "Execute Hashcat.exe with provided SAM file from registry of Windows and Password list to crack against", "author": ["frack113"], "enabled": false, "false_positives": ["Tools that use similar command line flags and values"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "39b31e81-5f5f-4898-9c0e-2160cfc0f9bf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Hashcat Password Cracker Execution", "query": "((process.executable.text:\"*\\\\hashcat.exe\") OR ((process.command_line.text:\"*\\-a\\ *\" AND process.command_line.text:\"*\\-m\\ 1000\\ *\" AND process.command_line.text:\"*\\-r\\ *\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat", "https://hashcat.net/wiki/doku.php?id=hashcat"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
