{"description": "Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems", "author": ["frack113", "Christopher Peacock '@securepeacock'", "SCYTHE '@scythe_io'"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0e4164da-94bc-450d-a7be-a4b176179f1f", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious Firewall Configuration Discovery Via Netsh.EXE", "query": "(((process.executable.text:\"*\\\\netsh.exe\") OR (winlog.event_data.OriginalFileName:\"netsh.exe\")) AND (process.command_line.text:\"*netsh\\ *\" AND process.command_line.text:\"*show\\ *\" AND process.command_line.text:\"*firewall\\ *\" AND process.command_line.text:(\"*config\\ *\" OR \"*state\\ *\" OR \"*rule\\ *\" OR \"*name\\=all*\")))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1016"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1016", "name": "System Network Configuration Discovery", "reference": "https://attack.mitre.org/techniques/T1016"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules", "https://ss64.com/nt/netsh.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
