{"description": "Detect the use of Jlaive to execute assemblies in a copied PowerShell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "576bcd78-1834-5851-bc08-ef6d5bf96f3d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Jlaive Usage For Assembly Execution In-Memory", "query": "(process.parent.executable:*\\\\cmd.exe AND process.parent.command_line:*.bat AND process.command_line:*.bat.exe* AND ((process.executable:*\\\\xcopy.exe AND process.command_line:*powershell.exe*) OR (process.executable:*\\\\xcopy.exe AND process.command_line:*pwsh.exe*) OR (process.executable:*\\\\attrib.exe AND process.command_line:*\\+s* AND process.command_line:*\\+h*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool", "https://github.com/ch2sh/Jlaive"], "timestamp_override": "event.ingested", "author": ["Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
