{"description": "Detects the execution of a renamed AutoIt2.exe or AutoIt3.exe.\nAutoIt is a scripting language and automation tool for Windows systems. While primarily used for legitimate automation tasks, it can be misused in cyber attacks.\nAttackers can leverage AutoIt to create and distribute malware, including keyloggers, spyware, and botnets. A renamed AutoIt executable is particularly suspicious.\n", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f4264e47-f522-4c38-a420-04525d5b880f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed AutoIt Execution", "query": "(((process.command_line:(/.*\\ \\/[Aa][Uu][Tt][Oo][Ii][Tt]3[Ee][Xx][Ee][Cc][Uu][Tt][Ee][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*\\ \\/[Ee][Rr][Rr][Oo][Rr][Ss][Tt][Dd][Oo][Uu][Tt].*/)) OR (winlog.event_data.Imphash:(fdc554b3a8683918d731685855683ddf OR cd30a61b60b3d60cecdb034c8c83c290)) OR (winlog.event_data.Hashes:(/.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Ff][Dd][Cc]554[Bb]3[Aa]8683918[Dd]731685855683[Dd][Dd][Ff].*/ OR /.*[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Cc][Dd]30[Aa]61[Bb]60[Bb]3[Dd]60[Cc][Ee][Cc][Dd][Bb]034[Cc]8[Cc]83[Cc]290.*/)) OR (winlog.event_data.OriginalFileName:(/[Aa][Uu][Tt][Oo][Ii][Tt]3\\.[Ee][Xx][Ee]/ OR /[Aa][Uu][Tt][Oo][Ii][Tt]2\\.[Ee][Xx][Ee]/))) AND (NOT process.executable.text:*AutoIt*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://twitter.com/malmoeb/status/1665463817130725378?s=12&t=C0_T_re0wRP_NfKa27Xw9w", "https://www.autoitscript.com/site/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
