{"description":"This rule detects execution of PowerShell scripts located in the C:\\Users\\Public folder Author: Max Altgelt. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"499040c2-8ac1-5aa6-b29e-11e63bfe3cd8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Execution of Powershell Script in Public Folder","query":"(process.executable:*\\\\powershell.exe AND process.command_line:(*\\-f\\ C\\:\\\\Users\\\\Public* OR *\\-f\\ \\\"C\\:\\\\Users\\\\Public* OR *\\-f\\ %Public%*))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
