{"description": "Detects the use of Fast Reverse Proxy. frp is a fast reverse proxy to help you expose a local server behind a NAT or firewall to the Internet.", "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dbef36a5-430b-e2be-16eb-eb7fa350ebb2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Fast Reverse Proxy (FRP)", "query": "(process.executable.text:(*\\\\frpc.exe OR *\\\\frps.exe) AND process.command_line.text:*\\\\frpc.ini*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://asec.ahnlab.com/en/38156/", "https://github.com/fatedier/frp"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
