{"description": "Detects a ping command that uses a hex encoded IP address", "enabled": false, "false_positives": ["Unlikely, because no sane admin pings IP addresses in a hexadecimal form"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1a0d4aba-7668-4365-9ce4-6d79ab088dfd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Ping Hex IP", "query": "(process.executable:*\\\\ping.exe AND process.command_line:*0x*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://github.com/vysec/Aggressor-VYSEC/blob/master/ping.can", "https://twitter.com/vysecurity/status/977198418354491392"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
