{"description":"Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups. Author: @ROxPinTeddy, Nasreddine Bencherchali @nas_bench. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administrative use"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"bef37fa2-f205-4a7b-b484-0759bfd5f86f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Advanced IP Scanner","query":"(process.executable:*\\\\advanced_ip_scanner* OR (process.command_line:*\\/portable* AND process.command_line:*\\/lng*))","meta":{"from":"1m"},"severity":"medium","tags":["T1046","T1135"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1046","name":"Network Service Scanning","reference":"https://attack.mitre.org/techniques/T1046"},{"id":"T1135","name":"Network Share Discovery","reference":"https://attack.mitre.org/techniques/T1135"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
