{"description": "Executes arbitrary PowerShell code using SyncAppvPublishingServer.vbs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3a760752-00ff-45eb-0089-56136acbcfc3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "SyncAppvPublishingServer VBS Execute Arbitrary PowerShell Code", "query": "(process.command_line:*\\\\SyncAppvPublishingServer.vbs* AND process.command_line:*;*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1216/T1216.md", "https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
