{"description": "Detects the conhost execution as parent process. Can be used to evaded defense mechanism.", "enabled": false, "false_positives": ["Unlikely, conhost is a child less process"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "11a07874-1a62-7a4f-1aa4-5f114ffb4534", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Conhost Parent Process Executions", "query": "(process.parent.executable.text:*\\\\conhost.exe AND (NOT ((Provider_Name:\"SystemTraceProvider\\-Process\") OR (process.executable.text:*\\\\git.exe AND process.parent.command_line.text:*\\ show\\ *))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/"], "timestamp_override": "event.ingested", "author": ["omkar72"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
