{"description": "Detects execution of \"odbcconf\" where the path of the DLL being registered is located in a potentially suspicious location.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6b65c28e-11f3-46cb-902a-68f2cafaf474", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Odbcconf.EXE Suspicious DLL Location", "query": "(((process.executable.text:\"*\\\\odbcconf.exe\") OR (winlog.event_data.OriginalFileName:\"odbcconf.exe\")) AND process.command_line.text:(\"*\\:\\\\PerfLogs\\\\*\" OR \"*\\:\\\\ProgramData\\\\*\" OR \"*\\:\\\\Temp\\\\*\" OR \"*\\:\\\\Users\\\\Public\\\\*\" OR \"*\\:\\\\Windows\\\\Registration\\\\CRMLog*\" OR \"*\\:\\\\Windows\\\\System32\\\\com\\\\dmp\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\FxsTmp\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\*\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\*\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\*\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*\" OR \"*\\:\\\\Windows\\\\Tasks\\\\*\" OR \"*\\:\\\\Windows\\\\Temp\\\\*\" OR \"*\\:\\\\Windows\\\\Tracing\\\\*\" OR \"*\\\\AppData\\\\Local\\\\Temp\\\\*\" OR \"*\\\\AppData\\\\Roaming\\\\*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16", "https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html", "https://securityintelligence.com/posts/raspberry-robin-worm-dridex-malware/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
