{"description":"Detects the execution of rundll32 with a command line that doesn't contain a .dll file Author: Tim Shelton, Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c3a99af4-35a9-4668-879e-c09aeb4f2bdf","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Application Executed Non-Executable Extension","query":"(process.executable:*\\\\rundll32.exe AND (NOT ((NOT _exists_:process.command_line) OR (process.command_line:*.dll* OR process.command_line:\"\") OR (process.parent.executable:*\\:\\\\Program\\ Files\\\\Internet\\ Explorer\\\\iexplore.exe AND process.command_line:*.cpl*) OR (process.parent.executable:*\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe AND process.command_line:C\\:\\\\Windows\\\\syswow64\\\\MsiExec.exe\\ \\-Embedding*))))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
