{"description": "Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting a specific service starting", "author": ["Teymur Kheirkhabarov", "Ecco", "Florian Roth"], "enabled": false, "false_positives": ["Commandlines containing components like cmd accidentally", "Jobs and services started with cmd"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "15619216-e993-4721-b590-4c520615a67d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Meterpreter/CobaltStrike Activity", "query": "((process.parent.executable.text:\"*\\\\services.exe\" AND (((process.command_line.text:\"*\\/c*\" AND process.command_line.text:\"*echo*\" AND process.command_line.text:\"*\\\\pipe\\\\*\" AND process.command_line.text:(\"*cmd*\" OR \"*%COMSPEC%*\"))) OR ((process.command_line.text:\"*rundll32*\" AND process.command_line.text:\"*.dll,a*\" AND process.command_line.text:\"*\\/p\\:*\")))) AND (NOT process.command_line.text:\"*MpCmdRun*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1134", "T1134"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}, {"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment", "https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
