{"description": "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilities", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate activity is expected since compressing files with a password is common."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9fbf5927-5261-4284-a71d-f681029ea574", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Compress Data and Lock With Password for Exfiltration With 7-ZIP", "query": "(((winlog.event_data.Description:*7\\-Zip*) OR (process.executable.text:(\"*\\\\7z.exe\" OR \"*\\\\7zr.exe\" OR \"*\\\\7za.exe\")) OR (winlog.event_data.OriginalFileName:(\"7z.exe\" OR \"7za.exe\"))) AND process.command_line.text:\"*\\ \\-p*\" AND process.command_line.text:(\"*\\ a\\ *\" OR \"*\\ u\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1560"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1560", "name": "Archive Collected Data", "reference": "https://attack.mitre.org/techniques/T1560"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
