{"description": "Detects the execution of an executable that is typically used by PlugX for DLL side loading started from an uncommon location", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "64fe788d-ca6b-7a3c-f932-d1ab69ecbad1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Executable Used by PlugX in Uncommon Location", "query": "((((((((((((process.executable:*\\\\CamMute.exe AND (NOT (process.executable:(*\\\\Lenovo\\\\Communication\\ Utility\\\\* OR *\\\\Lenovo\\\\Communications\\ Utility\\\\*)))) OR (process.executable:*\\\\chrome_frame_helper.exe AND (NOT (process.executable:*\\\\Google\\\\Chrome\\\\application\\\\*)))) OR (process.executable:*\\\\dvcemumanager.exe AND (NOT (process.executable:*\\\\Microsoft\\ Device\\ Emulator\\\\*)))) OR (process.executable:*\\\\Gadget.exe AND (NOT (process.executable:*\\\\Windows\\ Media\\ Player\\\\*)))) OR (process.executable:*\\\\hcc.exe AND (NOT (process.executable:*\\\\HTML\\ Help\\ Workshop\\\\*)))) OR (process.executable:*\\\\hkcmd.exe AND (NOT (process.executable:(*\\\\System32\\\\* OR *\\\\SysNative\\\\* OR *\\\\SysWow64\\\\*))))) OR (process.executable:*\\\\Mc.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Visual\\ Studio* OR *\\\\Microsoft\\ SDK* OR *\\\\Windows\\ Kit*))))) OR (process.executable:*\\\\MsMpEng.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Security\\ Client\\\\* OR *\\\\Windows\\ Defender\\\\* OR *\\\\AntiMalware\\\\*))))) OR (process.executable:*\\\\msseces.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Security\\ Center\\\\* OR *\\\\Microsoft\\ Security\\ Client\\\\* OR *\\\\Microsoft\\ Security\\ Essentials\\\\*))))) OR (process.executable:*\\\\OInfoP11.exe AND (NOT (process.executable:*\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\*)))) OR (process.executable:*\\\\OleView.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Visual\\ Studio* OR *\\\\Microsoft\\ SDK* OR *\\\\Windows\\ Kit* OR *\\\\Windows\\ Resource\\ Kit\\\\*))))) OR (process.executable:*\\\\rc.exe AND (NOT (process.executable:(*\\\\Microsoft\\ Visual\\ Studio* OR *\\\\Microsoft\\ SDK* OR *\\\\Windows\\ Kit* OR *\\\\Windows\\ Resource\\ Kit\\\\* OR *\\\\Microsoft.NET\\\\*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2016/03/10/beyond-good-ol-run-key-part-36/", "https://countuponsecurity.com/2017/06/07/threat-hunting-in-the-enterprise-with-appcompatprocessor/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
