{"description": "Detects execution of ftp.exe script execution with the \"-s\" flag and any child processes ran by ftp.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "026fbf8a-1bfc-0fbf-b06f-c162eaaecdd6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "LOLBIN Execution Of The FTP.EXE Binary", "query": "(process.parent.executable.text:*\\\\ftp.exe OR ((process.executable.text:*\\\\ftp.exe OR winlog.event_data.OriginalFileName:\"ftp.exe\") AND process.command_line.text:*\\-s\\:*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ftp/"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
