{"description": "Adversaries may stop services or processes in order to conduct Data Destruction or Data Encrypted for Impact on the data stores of services like Exchange, SQL Server...etc.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "77f378d1-5a42-81d7-4135-fd1976da59e7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable Important Scheduled Task", "query": "(process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\/Change* AND process.command_line.text:*\\/TN* AND process.command_line.text:*\\/disable* AND process.command_line.text:(*Microsoft\\\\Windows\\\\SystemRestore\\\\SR* OR *Microsoft\\\\Windows\\\\Windows\\ Defender\\\\* OR *Microsoft\\\\Windows\\\\BitLocker* OR *Microsoft\\\\Windows\\\\WindowsBackup\\\\* OR *Microsoft\\\\Windows\\\\WindowsUpdate\\\\* OR *Microsoft\\\\Windows\\\\UpdateOrchestrator\\\\* OR *Windows\\\\ExploitGuard*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1489"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1489", "name": "Service Stop", "reference": "https://attack.mitre.org/techniques/T1489"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-8---windows---disable-the-sr-scheduled-task", "https://twitter.com/MichalKoczwara/status/1553634816016498688", "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
