{"description": "Detects the execution of a signed binary dropped by Kaspersky Lab Products Remover (kavremover) which can be abused as a LOLBIN to execute arbitrary commands and binaries.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d047726b-c71c-4048-a99b-2e2f50dc107d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Kavremover Dropped Binary LOLBIN Usage", "query": "(process.command_line.text:*\\ run\\ run\\-cmd\\ * AND (NOT (process.parent.executable.text:(*\\\\kavremover.exe OR *\\\\cleanapi.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1127"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}]}], "version": 1, "references": ["https://nasbench.medium.com/lolbined-using-kaspersky-endpoint-security-kes-installer-to-execute-arbitrary-commands-1c999f1b7fea"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
