{"description": "Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords", "author": ["Tim Rauch", "Janantha Marasinghe"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "42c998a7-da05-c478-f547-f08da2f75ac3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft IIS Service Account Password Dumped", "query": "((((process.executable.text:*\\\\appcmd.exe) OR (OriginalFilename:\"appcmd.exe\")) AND process.command_line.text:*list\\ *) AND ((process.command_line.text:(*\\ \\/config* OR *\\ \\/xml*)) OR ((process.command_line.text:(*\\ \\/@t* OR *\\ \\/text* OR *\\ \\/show*) AND process.command_line.text:(*\\:\\\\** OR *password*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html", "https://twitter.com/0gtweet/status/1588815661085917186?cxt=HHwWhIDUyaDbzYwsAAAA", "https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
