{"description": "Launch 64-bit shellcode from a debugger script file using cdb.exe.", "enabled": false, "false_positives": ["Legitimate use of debugging tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "24b8a848-0a0b-0cdd-3baf-ff8c28db8e06", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Possible App Whitelisting Bypass via WinDbg/CDB as a Shellcode Runner", "query": "(process.executable:*\\\\cdb.exe AND process.command_line:*\\-cf*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1106", "T1127", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Cdb.yml", "http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html"], "timestamp_override": "event.ingested", "author": ["Beyu Denis", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
