{"description": "The Devtoolslauncher.exe executes other binary", "enabled": false, "false_positives": ["Legitimate use of devtoolslauncher.exe by legitimate user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "35ad131f-7201-dcfb-c39b-7f8a3703b58d", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Devtoolslauncher.exe Executes Specified Binary", "query": "(process.executable:*\\\\devtoolslauncher.exe AND process.command_line:*LaunchForDeploy*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Devtoolslauncher.yml", "https://twitter.com/_felamos/status/1179811992841797632"], "timestamp_override": "event.ingested", "author": ["Beyu Denis", "oscd.community (rule)", "@_felamos (idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
