{"description": "Detects usage of attrib with \"+s\" option to set suspcious script or executable as system files to hide them from users and make them unable to delete with simple rights. The rule limit the search to sepcific extensions and directories to avoid FP's", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "efec536f-72e8-4656-8960-5e85d091345b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Set Suspicious Files as System Files Using Attrib", "query": "((process.executable:*\\\\attrib.exe AND process.command_line:*\\ \\+s* AND process.command_line:(*\\ %* OR *\\\\Users\\\\Public\\\\* OR *\\\\AppData\\\\Local\\\\* OR *\\\\ProgramData\\\\* OR *\\\\Downloads\\\\* OR *\\\\Windows\\\\Temp\\\\*) AND process.command_line:(*.bat* OR *.ps1* OR *.vbe* OR *.vbs* OR *.exe*)) AND (NOT (process.command_line:*\\\\Windows\\\\TEMP\\\\* AND process.command_line:*.exe*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4", "https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
