{"description": "Detects MSHTA.EXE spwaned by SVCHOST as seen in LethalHTA and described in report", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9abda233-c3ec-30fa-1a0b-a63161e04d94", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSHTA Spwaned by SVCHOST", "query": "(process.parent.executable:*\\\\svchost.exe AND process.executable:*\\\\mshta.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://codewhitesec.blogspot.com/2018/07/lethalhta.html"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
