{"description": "Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services.\nAdversaries may use flaws in the permissions for registry to redirect from the originally specified executable to one that they control, in order to launch their own code at Service start.\nWindows stores local service configuration information in the Registry under HKLM\\SYSTEM\\CurrentControlSet\\Services\n", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6c5c6eb2-4ec0-9375-cff7-481f548e13ae", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Changing Existing Service ImagePath Value Via Reg.EXE", "query": "(process.executable.text:*\\\\reg.exe AND process.command_line.text:*add\\ * AND process.command_line.text:*SYSTEM\\\\CurrentControlSet\\\\Services\\\\* AND process.command_line.text:*\\ ImagePath\\ * AND process.command_line.text:(*\\ \\/d\\ * OR *\\ \\-d\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-2---service-imagepath-change-with-regexe"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
