{"description": "Detects when 'DllRegisterServer' is called in the commandline and the image is not rundll32. This could that the 'rundll32' utility has been renamed in order to avoid detection", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bbf026a2-f152-36f0-9e2a-9bf2ae50d13a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DllRegisterServer Call From Non Rundll32", "query": "(process.command_line.text:*DllRegisterServer* AND (NOT (process.executable.text:*\\\\rundll32.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20", "https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
