{"description": "Detects msdt.exe executed by a suspicious parent as seen in CVE-2022-30190", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3e150bb2-2fcc-8fc0-04ec-02c5deca3208", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSDT Executed with Suspicious Parent", "query": "(process.parent.executable:(*\\\\powershell.exe OR *\\\\cmd.exe OR *\\\\mshta.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\wsl.exe) AND (process.executable:*\\\\msdt.exe OR winlog.event_data.OriginalFileName:\"msdt.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/nao_sec/status/1530196847679401984", "https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/"], "timestamp_override": "event.ingested", "author": ["Nextron Systems"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
