{"description": "Detects the malicious use of a control panel item", "author": ["Kyaw Min Thein", "Furkan Caliskan (@caliskanfurkan_)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0ba863e6-def5-4e50-9cea-4dd8c7dc46a4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Control Panel Items", "query": "(event.category:process AND (((((process.executable:/.*\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Rr][Ee][Gg]\\.[Ee][Xx][Ee]/)) AND (process.command_line.text:\"*add*\" AND process.command_line:/.*[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Cc][Pp][Ll][Ss].*/))) OR ((process.command_line:/.*\\.[Cc][Pp][Ll]/ AND (NOT ((process.command_line:(/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\%[Ss][Yy][Ss][Tt][Ee][Mm]\\%.*/ OR /.*\\|[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\|.*/)) OR (process.command_line:/.*[Rr][Ee][Gg][Ss][Vv][Rr]32\\ .*/ AND process.command_line:/.*\\ \\/[Ss]\\ .*/ AND process.command_line:/.*[Ii][Gg][Ff][Xx][Cc][Pp][Ll]\\.[Cc][Pp][Ll].*/)))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
