{"description": "Detects usage of the \"msedge.exe\" binary as a LOLBIN to download arbitrary file via the CLI", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Software that uses MsEdge to download components in the background (see ParentImage, ParentCommandLine)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "94771a71-ba41-4b6e-a757-b531372eaab6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Arbitrary File Download Via MSEdge.EXE", "query": "(((process.executable.text:\"*\\\\msedge.exe\") OR (winlog.event_data.OriginalFileName:\"msedge.exe\")) AND process.command_line.text:(\"*.exe\\ http*\" OR \"*msedge\\ http*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/mrd0x/status/1478116126005641220", "https://lolbas-project.github.io/lolbas/Binaries/Msedge/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
