{"description": "Detects a suspicious command line execution that includes an URL and AppData string in the command line parameters as used by several droppers (js/vbs > powershell)", "enabled": false, "false_positives": ["High"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0fa560aa-ba56-9d24-d7af-32a6f89530dc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Command Line Execution with Suspicious URL and AppData Strings", "query": "(process.executable:*\\\\cmd.exe AND process.command_line:*http* AND process.command_line:*\\:\\/\\/* AND process.command_line:*%AppData%*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059", "T1059", "T1105"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.hybrid-analysis.com/sample/3a1f01206684410dbe8f1900bbeaaa543adfcd07368ba646b499fa5274b9edf6?environmentId=100", "https://www.hybrid-analysis.com/sample/f16c729aad5c74f19784a24257236a8bbe27f7cdc4a89806031ec7f1bebbd475?environmentId=100"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
