{"description": "Detects a suspicious Microsoft certutil execution with sub commands like 'decode' sub command, which is sometimes used to decode malicious code", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f01daeae-a3d1-a72c-cc94-7fe46ea8ceb7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Certutil Command Usage", "query": "(process.command_line.text:(*\\ \\-decode\\ * OR *\\ \\-decodehex\\ * OR *\\ \\-urlcache\\ * OR *\\ \\-verifyctl\\ * OR *\\ \\-encode\\ * OR *\\ \\/decode\\ * OR *\\ \\/decodehex\\ * OR *\\ \\/urlcache\\ * OR *\\ \\/verifyctl\\ * OR *\\ \\/encode\\ *) OR (process.executable.text:*\\\\certutil.exe AND process.command_line.text:*ping*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1105", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://twitter.com/JohnLaTwC/status/835149808817991680", "https://blogs.technet.microsoft.com/pki/2006/11/30/basic-crl-checking-with-certutil/", "https://www.trustedsec.com/2017/07/new-tool-release-nps_payload/", "https://twitter.com/egre55/status/1087685529016193025", "https://lolbas-project.github.io/lolbas/Binaries/Certutil/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "juju4", "keepwatch"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
