{"description": "Detect suspicious parent processes of well-known Windows processes", "enabled": false, "false_positives": ["Some security products seem to spawn these"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "96036718-71cc-4027-a538-d1587e0006a7", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Windows Processes Suspicious Parent Directory", "query": "(process.executable:(*\\\\svchost.exe OR *\\\\taskhost.exe OR *\\\\lsm.exe OR *\\\\lsass.exe OR *\\\\services.exe OR *\\\\lsaiso.exe OR *\\\\csrss.exe OR *\\\\wininit.exe OR *\\\\winlogon.exe) AND (NOT ((process.parent.executable:(*\\\\SavService.exe OR *\\\\ngen.exe) OR process.parent.executable:(*\\\\System32\\\\* OR *\\\\SysWOW64\\\\*)) OR (process.parent.executable:(*\\\\Windows\\ Defender\\\\* OR *\\\\Microsoft\\ Security\\ Client\\\\*) AND process.parent.executable:*\\\\MsMpEng.exe) OR (NOT _exists_:process.parent.executable OR process.parent.executable:\"\\-\"))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1036", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2", "https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/", "https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf", "https://attack.mitre.org/techniques/T1036/"], "timestamp_override": "event.ingested", "author": ["vburov"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
