{"description": "Detects suspicious aged finger.exe tool execution often used in malware attacks nowadays", "enabled": false, "false_positives": ["Admin activity (unclear what they do nowadays with finger.exe)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "af491bca-e752-4b44-9c86-df5680533dbc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Finger.exe Suspicious Invocation", "query": "process.executable:*\\\\finger.exe", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/bigmacjpg/status/1349727699863011328?s=12", "https://app.any.run/tasks/40115012-a919-4208-bfed-41e82cb3dadf/", "http://hyp3rlinx.altervista.org/advisories/Windows_TCPIP_Finger_Command_C2_Channel_and_Bypassing_Security_Software.txt"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "omkar72", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
