{"description": "Detects LOLBINs executing from an abnormal drive such as a mounted ISO.", "author": ["Christopher Peacock '@securepeacock'", "SCYTHE '@scythe_io'"], "enabled": false, "false_positives": ["Rare false positives could occur on servers with multiple drives."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0401d718-57b5-9064-3c25-f770efdbe345", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "LOLBIN From Abnormal Drive", "query": "(process.executable.text:(*\\\\rundll32.exe OR *\\\\calc.exe OR *\\\\mshta.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\regsvr32.exe OR *\\\\installutil.exe OR *\\\\cmstp.exe) AND (NOT ((((process.working_directory.text:*C\\:\\\\*) OR (process.working_directory.text:\"\"))) OR (NOT _exists_:process.working_directory.text))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2021/12/13/diavol-ransomware/", "https://www.scythe.io/library/threat-emulation-qakbot"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
