{"description": "Adversaries can abuse of C:\\Windows\\System32\\gatherNetworkInfo.vbs script along with cscript.exe to gather information about the target", "author": ["blueteamer8699"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "25744b04-a37c-ff63-dad5-c63793a365bd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "GatherNetworkInfo.vbs Script Usage", "query": "(process.command_line.text:*cscript.exe* AND process.command_line.text:*gatherNetworkInfo.vbs*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059", "T1615"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1615", "name": "Group Policy Discovery", "reference": "https://attack.mitre.org/techniques/T1615"}]}], "version": 1, "references": ["https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
