{"description": "Detects the export of the target Registry key to a file.", "enabled": false, "false_positives": ["Legitimate export of keys"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f0e53e89-8d22-46ea-9db5-9d4796ee2f8a", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Exports Registry Key To a File", "query": "((process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/E\\ * OR *\\ \\-E\\ *)) AND (NOT ((process.command_line:(*hklm* OR *hkey_local_machine*)) AND (process.command_line:(*\\\\system OR *\\\\sam OR *\\\\security)))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1012"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Regedit/", "https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"], "timestamp_override": "event.ingested", "author": ["Oddvar Moe", "Sander Wiebing", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
