{"description": "Detects usage of the \"wusa.exe\" (Windows Update Standalone Installer) utility to extract cab using the \"/extract\" argument from suspicious paths", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e4b9f7e7-4502-f889-f69c-cb5512f226ee", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Wusa Extracting Cab Files From Suspicious Paths", "query": "(process.executable.text:*\\\\wusa.exe AND process.command_line.text:*\\/extract\\:* AND process.command_line.text:(*C\\:\\\\Users\\\\Public\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Appdata\\\\Local\\\\Temp\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\PerfLogs\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html", "https://www.echotrail.io/insights/search/wusa.exe/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
