{"description": "Detects a suspicious curl process start the adds a file to a web request", "enabled": false, "false_positives": ["Scripts created by developers and admins"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7e8e4b63-1cb1-32ec-3e6e-dc33299f19f0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Curl File Upload", "query": "(process.executable:*\\\\curl.exe AND process.command_line:(*\\ \\-F\\ * OR *\\ \\-T\\ * OR *\\ \\-\\-upload\\-file\\ * OR *\\ \\-d\\ * OR *\\ \\-\\-data\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105", "T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://twitter.com/d1r4c/status/1279042657508081664", "https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1105/T1105.md#atomic-test-19---curl-upload-file", "https://curl.se/docs/manpage.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
