{"description": "Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd1aea75-bde1-993c-af11-180f8e4e192c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Wlrmdr Lolbin Use as Laucher", "query": "((process.executable:*\\\\wlrmdr.exe AND process.command_line:*\\-s\\ * AND process.command_line:*\\-f\\ * AND process.command_line:*\\-t\\ * AND process.command_line:*\\-m\\ * AND process.command_line:*\\-a\\ * AND process.command_line:*\\-u\\ *) AND (NOT (process.parent.executable:\"C\\:\\\\Windows\\\\System32\\\\winlogon.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
