{"description": "Detects the execution of certutil with certain flags that allow the utility to download files from direct IPs.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "13e6fe51-d478-4c7e-b0f2-6da9b400a829", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious File Downloaded From Direct IP Via Certutil.EXE", "query": "((((process.executable.text:\"*\\\\certutil.exe\") OR (winlog.event_data.OriginalFileName:\"CertUtil.exe\")) AND process.command_line.text:(\"*urlcache\\ *\" OR \"*verifyctl\\ *\") AND process.command_line.text:(\"*\\:\\/\\/1*\" OR \"*\\:\\/\\/2*\" OR \"*\\:\\/\\/3*\" OR \"*\\:\\/\\/4*\" OR \"*\\:\\/\\/5*\" OR \"*\\:\\/\\/6*\" OR \"*\\:\\/\\/7*\" OR \"*\\:\\/\\/8*\" OR \"*\\:\\/\\/9*\")) AND (NOT process.command_line.text:\"*\\:\\/\\/7\\-*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil", "https://forensicitguy.github.io/agenttesla-vba-certutil-download/", "https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/", "https://twitter.com/egre55/status/1087685529016193025", "https://lolbas-project.github.io/lolbas/Binaries/Certutil/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
