{"description":"Detects suspicious parent processes that should not have any children or should only have a single possible child program Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cbec226f-63d9-4eca-9f52-dfb6652f24df","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Process Parents","query":"(process.parent.executable:(*\\\\notepad.exe OR *\\\\calc.exe OR *\\\\minesweeper.exe OR *\\\\winver.exe OR *\\\\bitsadmin.exe) OR (process.parent.executable:(*\\\\csrss.exe OR *\\\\certutil.exe OR *\\\\schtasks.exe OR *\\\\eventvwr.exe) AND (NOT (process.executable:(*\\\\WerFault.exe OR *\\\\wermgr.exe OR *\\\\conhost.exe OR *\\\\mmc.exe)))))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
