{"description": "Attempts to detect system changes made by Blue Mockingbird", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c3198a27-23a0-4c2c-af19-e5328d49680e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Blue Mockingbird", "query": "((process.executable:*\\\\cmd.exe AND process.command_line:*sc\\ config* AND process.command_line:*wercplsupporte.dll*) OR (process.executable:*\\\\wmic.exe AND process.command_line:*COR_PROFILER))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://redcanary.com/blog/blue-mockingbird-cryptominer/"], "timestamp_override": "event.ingested", "author": ["Trent Liffick (@tliffick)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
