{"description": "Detects suspicious sub processes started by the Manage Engine ServiceDesk Plus Java web service process", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Legitimate sub processes started by Manage Engine ServiceDesk Pro"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f28eadb5-314f-80ff-daa1-c261302e6156", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Manage Engine Java Suspicious Sub Process", "query": "(process.parent.executable.text:*\\\\ManageEngine\\\\ServiceDesk\\\\* AND process.parent.executable.text:*\\\\java.exe* AND process.executable.text:(*\\\\powershell.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\pwsh.exe OR *\\\\schtasks.exe OR *\\\\certutil.exe OR *\\\\whoami.exe OR *\\\\bitsadmin.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\scrcons.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\forfiles.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe OR *\\\\curl.exe OR *\\\\notepad.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.horizon3.ai/manageengine-cve-2022-47966-technical-deep-dive/", "https://github.com/horizon3ai/CVE-2022-47966/blob/3a51c6b72ebbd87392babd955a8fbeaee2090b35/CVE-2022-47966.py", "https://blog.viettelcybersecurity.com/saml-show-stopper/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
