{"description":"Detects rundll32.exe executing from an abnormal drive such as a mounted ISO. Author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Rare false positives could occur on servers with multiple drives."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d4ca7c59-e9e4-42d8-bf57-91a776efcb87","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Rundll32 From Abnormal Drive","query":"(process.executable:*\\\\rundll32.exe AND (NOT ((process.working_directory:*C\\:\\\\* OR process.working_directory:\"\") OR (NOT _exists_:process.working_directory))))","meta":{"from":"1m"},"severity":"medium","tags":["T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
