{"description":"Tools to Capture Network Packets on the windows 10 with October 2018 Update or later. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f956c7c1-0f60-4bc5-b7d7-b39ab3c08908","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Use of PktMon.exe","query":"(process.executable:*PktMon.exe OR winlog.event_data.OriginalFileName:\"PktMon.exe\")","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1040"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1040","name":"Network Sniffing","reference":"https://attack.mitre.org/techniques/T1040"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
