{"description": "Detects the execution of \"Ldifde.exe\" with the import flag \"-i\". The can be abused to include HTTP-based arguments which will allow the arbitrary download of files from a remote server.\n", "author": ["@gott_cyber"], "enabled": false, "false_positives": ["Since the content of the files are unknown, false positives are expected"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6f535e01-ca1f-40be-ab8d-45b19c0c8b7f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Import LDAP Data Interchange Format File Via Ldifde.EXE", "query": "(((process.executable.text:\"*\\\\ldifde.exe\") OR (winlog.event_data.OriginalFileName:\"ldifde.exe\")) AND (process.command_line.text:\"*\\-i*\" AND process.command_line.text:\"*\\-f*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1105", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/0gtweet/status/1564968845726580736", "https://strontic.github.io/xcyclopedia/library/ldifde.exe-979DE101F5059CEC1D2C56967CA2BAC0.html", "https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
