{"description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image based detection", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Software Installers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use NTFS Short Name in Image", "query": "((process.executable:(/.*\\~1\\.[Bb][Aa][Tt].*/ OR /.*\\~1\\.[Dd][Ll][Ll].*/ OR /.*\\~1\\.[Ee][Xx][Ee].*/ OR /.*\\~1\\.[Hh][Tt][Aa].*/ OR /.*\\~1\\.[Jj][Ss].*/ OR /.*\\~1\\.[Mm][Ss][Ii].*/ OR /.*\\~1\\.[Pp][Ss]1.*/ OR /.*\\~1\\.[Tt][Mm][Pp].*/ OR /.*\\~1\\.[Vv][Bb][Ee].*/ OR /.*\\~1\\.[Vv][Bb][Ss].*/ OR /.*\\~2\\.[Bb][Aa][Tt].*/ OR /.*\\~2\\.[Dd][Ll][Ll].*/ OR /.*\\~2\\.[Ee][Xx][Ee].*/ OR /.*\\~2\\.[Hh][Tt][Aa].*/ OR /.*\\~2\\.[Jj][Ss].*/ OR /.*\\~2\\.[Mm][Ss][Ii].*/ OR /.*\\~2\\.[Pp][Ss]1.*/ OR /.*\\~2\\.[Tt][Mm][Pp].*/ OR /.*\\~2\\.[Vv][Bb][Ee].*/ OR /.*\\~2\\.[Vv][Bb][Ss].*/) AND (NOT process.parent.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.parent.executable:/.*\\\\\\\\[Ww][Ee][Bb][Ee][Xx]\\\\\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (process.parent.executable:/.*\\\\\\\\[Tt][Hh][Oo][Rr]\\\\\\\\[Tt][Hh][Oo][Rr]64\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa]\\~1\\\\\\\\[Ww][Ii][Nn][Zz][Ii][Pp]\\\\\\\\[Ww][Zz][Pp][Rr][Ee][Ll]\\~1\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Vv][Cc][Rr][Ee][Dd][Ii]\\~1\\.[Ee][Xx][Ee]/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN", "https://twitter.com/jonasLyk/status/1555914501802921984"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
