{"description": "Detects the usage of \"reg.exe\" to add Defender folder exclusions. Qbot has been seen using this technique to add exlcusions for folders within AppData and ProgramData.", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "48917adc-a28e-4f5d-b729-11e75da8941f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Windows Defender Folder Exclusion Added Via Reg.EXE", "query": "(process.executable.text:\"*\\\\reg.exe\" AND process.command_line.text:(\"*SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions\\\\Paths*\" OR \"*SOFTWARE\\\\Microsoft\\\\Microsoft\\ Antimalware\\\\Exclusions\\\\Paths*\") AND process.command_line.text:\"*ADD\\ *\" AND process.command_line.text:\"*\\/t\\ *\" AND process.command_line.text:\"*REG_DWORD\\ *\" AND process.command_line.text:\"*\\/v\\ *\" AND process.command_line.text:\"*\\/d\\ *\" AND process.command_line.text:\"*0*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/", "https://redcanary.com/threat-detection-report/threats/qbot/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
