{"description": "Detects suspicious ways to download files or content using PowerShell", "enabled": false, "false_positives": ["Scripts or tools that download files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f3fe0ff2-72c8-21d0-2cb3-bbb18e5ca776", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Web Download", "query": "process.command_line:(*.DownloadString\\(* OR *.DownloadFile\\(*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/main/Download-Cradles.cmd"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
