{"description": "Detects different hacktools used for relay attacks on Windows for privilege escalation", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate files with these rare hacktool names"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5589ab4f-a767-433c-961d-c91f3f704db1", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Potential SMB Relay Attack Tool Execution", "query": "(((process.executable.text:(\"*PetitPotam*\" OR \"*RottenPotato*\" OR \"*HotPotato*\" OR \"*JuicyPotato*\" OR \"*\\\\just_dce_*\" OR \"*Juicy\\ Potato*\" OR \"*\\\\temp\\\\rot.exe*\" OR \"*\\\\Potato.exe*\" OR \"*\\\\SpoolSample.exe*\" OR \"*\\\\Responder.exe*\" OR \"*\\\\smbrelayx*\" OR \"*\\\\ntlmrelayx*\" OR \"*\\\\LocalPotato*\")) OR (process.command_line.text:(\"*Invoke\\-Tater*\" OR \"*\\ smbrelay*\" OR \"*\\ ntlmrelay*\" OR \"*cme\\ smb\\ *\" OR \"*\\ \\/ntlm\\:NTLMhash\\ *\" OR \"*Invoke\\-PetitPotam*\" OR \"*.exe\\ \\-t\\ \\*\\ \\-p\\ *\")) OR ((process.command_line.text:\"*.exe\\ \\-c\\ \\\"\\{*\" AND process.command_line.text:\"*\\}\\\"\\ \\-z\"))) AND (NOT process.executable.text:(\"*HotPotatoes6*\" OR \"*HotPotatoes7*\" OR \"*HotPotatoes\\ *\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1557"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/", "https://pentestlab.blog/2017/04/13/hot-potato/", "https://github.com/ohpe/juicy-potato", "https://hunter2.gitbook.io/darthsidious/other/war-stories/domain-admin-in-30-minutes", "https://hunter2.gitbook.io/darthsidious/execution/responder-with-ntlm-relay-and-empire", "https://www.localpotato.com/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
