{"description": "Detects Request to amsiInitFailed that can be used to disable AMSI Scanning", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "87bad272-2e63-5890-3768-96043fbe7c45", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell AMSI Bypass via .NET Reflection", "query": "process.command_line.text:(*System.Management.Automation.AmsiUtils* OR *amsiInitFailed*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/mattifestation/status/735261176745988096", "https://www.hybrid-analysis.com/sample/0ced17419e01663a0cd836c9c2eb925e3031ffb5b18ccf35f4dea5d586d0203e?environmentId=120"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
