{"description": "Detects the execution of the PurpleSharp adversary simulation tool", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ff23ffbc-3378-435e-992f-0624dcf93ab4", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "PurpleSharp Indicator", "query": "((process.executable.text:*\\\\purplesharp*) OR (winlog.event_data.OriginalFileName:\"PurpleSharp.exe\") OR (process.command_line.text:(*xyz123456.exe* OR *PurpleSharp*)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Resource Development", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1587", "name": "Develop Capabilities", "reference": "https://attack.mitre.org/techniques/T1587"}]}], "version": 1, "references": ["https://github.com/mvelazc0/PurpleSharp"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
