{"description": "Detects the execution of a renamed office binaries", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0b0cd537-fc77-4e6e-a973-e53495c1083d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed Office Binary Execution", "query": "(((winlog.event_data.OriginalFileName:(\"Excel.exe\" OR \"MSACCESS.EXE\" OR \"OneNote.exe\" OR \"POWERPNT.EXE\" OR \"WinWord.exe\")) OR (winlog.event_data.Description:(\"Microsoft Access\" OR \"Microsoft Excel\" OR \"Microsoft OneNote\" OR \"Microsoft PowerPoint\" OR \"Microsoft Word\"))) AND (NOT (process.executable.text:(*\\\\EXCEL.exe OR *\\\\MSACCESS.exe OR *\\\\ONENOTE.EXE OR *\\\\POWERPNT.EXE OR *\\\\WINWORD.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://infosec.exchange/@sbousseaden/109542254124022664"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
