{"description": "Detects encoded base64 MZ header in the commandline", "enabled": false, "false_positives": ["Unlikley"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c638a439-bfc9-5976-26fe-d4dd6c108400", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Base64 MZ Header In CommandLine", "query": "process.command_line:(*TVqQAAMAAAAEAAAA* OR *TVpQAAIAAAAEAA8A* OR *TVqAAAEAAAAEABAA* OR *TVoAAAAAAAAAAAAA* OR *TVpTAQEAAAAEAAAA*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
