{"description": "Detects suspicious process that use escape characters", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c12a4e67-e207-f7b7-9901-d33d1e3d1b45", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious Commandline Escape", "query": "process.command_line:(*h\\^t\\^t\\^p* OR *h\\\"t\\\"t\\\"p*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://twitter.com/vysecurity/status/885545634958385153", "https://twitter.com/Hexacorn/status/885553465417756673", "https://twitter.com/Hexacorn/status/885570278637678592", "https://www.fireeye.com/blog/threat-research/2017/06/obfuscation-in-the-wild.html", "http://www.windowsinspired.com/understanding-the-command-line-string-and-arguments-received-by-a-windows-program/"], "timestamp_override": "event.ingested", "author": ["juju4"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
