{"description": "Detects specific process parameters as used by ACTINIUM scheduled task persistence creation.", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e1118a8f-82f5-44b3-bb6b-8a284e5df602", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Scheduled Task WScript VBScript", "query": "(process.command_line:*schtasks* AND process.command_line:*create* AND process.command_line:*wscript* AND process.command_line:*e\\:vbscript*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations"], "timestamp_override": "event.ingested", "author": ["Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
