{"description": "Detects the use of the PowerShell \"Set-Service\" cmdlet to change the startup type of a service to \"disabled\" or \"manual\"", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives may occur with troubleshooting scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "62b20d44-1546-4e61-afce-8e175eb9473c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Service StartupType Change Via PowerShell Set-Service", "query": "(((process.executable.text:\"*\\\\powershell.exe\") OR (winlog.event_data.OriginalFileName:\"PowerShell.EXE\")) AND (process.command_line.text:\"*Set\\-Service*\" AND process.command_line.text:\"*\\-StartupType*\" AND process.command_line.text:(\"*Disabled*\" OR \"*Manual*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
