{"description": "Detects usage of an encoded/obfuscated version of an IP address (hex, octal, etc.) via command line", "author": ["Nasreddine Bencherchali (Nextron Systems)", "X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56d19cb4-6414-4769-9644-1ed35ffbb148", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Obfuscated IP Via CLI", "query": "(event.category:process AND (process.executable:(/.*\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Rr][Pp]\\.[Ee][Xx][Ee]/) AND ((process.command_line:(/.*\\ 0[Xx].*/ OR /.*\\/\\/0[Xx].*/ OR /.*\\.0[Xx].*/ OR /.*\\.00[Xx].*/)) OR ((process.command_line:/.*[Hh][Tt][Tt][Pp]\\:\\/\\/\\%.*/ AND process.command_line:/.*\\%2[Ee].*/)) OR ((((process.command_line:/https?://[0-9]{1,3}\\.[0-9]{1,3}\\.0[0-9]{3,4}/)) OR ((process.command_line:/https?://[0-9]{1,3}\\.0[0-9]{3,7}/)) OR ((process.command_line:/https?://0[0-9]{3,11}/)) OR ((process.command_line:/https?://(0[0-9]{1,11}\\.){3}0[0-9]{1,11}/)) OR ((process.command_line:/https?://0[0-9]{1,11}/)) OR ((process.command_line:/ [0-7]{7,13}/)))))) AND (NOT (process.command_line:/https?://((25[0-5]|(2[0-4]|1\\d|[1-9])?\\d)(\\.|\\b)){4}/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://h.43z.one/ipconverter/", "https://twitter.com/Yasser_Elsnbary/status/1553804135354564608"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
