{"description": "Detects uncommon \"userinit.exe\" child processes, which could be a sign of uncommon shells or login scripts used for persistence.", "author": ["Tom Ueltschi (@c_APT_ure)", "Tim Shelton"], "enabled": false, "false_positives": ["Legitimate logon scripts or custom shells may trigger false positives. Apply additional filters accordingly."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0a98a10c-685d-4ab0-bddc-b6bdd1d48458", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Uncommon Userinit Child Process", "query": "((process.parent.executable:/.*\\\\\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ AND (NOT process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.command_line:(/.*[Nn][Ee][Tt][Ll][Oo][Gg][Oo][Nn]\\.[Bb][Aa][Tt].*/ OR /.*[Uu][Ss][Rr][Ll][Oo][Gg][Oo][Nn]\\.[Cc][Mm][Dd].*/)) OR (process.command_line:/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Pp][Rr][Oo][Qq][Uu][Oo][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\[Pp][Rr][Oo][Qq][Uu][Oo][Tt][Aa]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ii][Cc][Aa][Ss][Tt]\\.[Ee][Xx][Ee]/) OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1037"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1037", "name": "Boot or Logon Initialization Scripts", "reference": "https://attack.mitre.org/techniques/T1037"}]}], "version": 1, "references": ["https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html", "https://learn.microsoft.com/en-us/windows-server/administration/server-core/server-core-sconfig#powershell-is-the-default-shell-on-server-core"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
