{"description": "Detects an executable in the users directory started from one of the Microsoft Office suite applications (Word, Excel, PowerPoint, Publisher, Visio)", "author": ["Jason Lynch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "aa3a6f94-890e-4e22-b634-ffdfd54792cc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Binary In User Directory Spawned From Office Application", "query": "((process.parent.executable.text:(\"*\\\\WINWORD.EXE\" OR \"*\\\\EXCEL.EXE\" OR \"*\\\\POWERPNT.exe\" OR \"*\\\\MSPUB.exe\" OR \"*\\\\VISIO.exe\" OR \"*\\\\MSACCESS.exe\" OR \"*\\\\EQNEDT32.exe\") AND process.executable.text:\"C\\:\\\\users\\\\*\" AND process.executable.text:\"*.exe\") AND (NOT process.executable.text:\"*\\\\Teams.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://blog.morphisec.com/fin7-not-finished-morphisec-spots-new-campaign", "https://www.virustotal.com/gui/file/23160972c6ae07f740800fa28e421a81d7c0ca5d5cab95bc082b4a986fbac57"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
