{"description": "Detects wmiprvse spawning processes", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d21374ff-f574-44a7-9998-4a8c8bf33d7d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WmiPrvSE Spawned A Process", "query": "(process.parent.executable.text:*\\\\WmiPrvSe.exe AND (NOT ((((LogonId:(\"0x3e7\" OR \"null\")) OR (user.name:(*AUTHORI* OR *AUTORI*)) OR (process.executable.text:(*\\\\WmiPrvSE.exe OR *\\\\WerFault.exe)))) OR (NOT _exists_:LogonId))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
