{"description":"Excel called wmic to finally proxy execute regsvr32 with the payload. An attacker wanted to break suspicious parent-child chain (Office app spawns LOLBin).But we have command-line in the event which allow us to \"restore\" this suspicious parent-child chain and detect it. Monitor process creation with \"wmic process call create\" and LOLBins in command-line with parent Office application processes. Author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9d1c72f5-43f0-4da5-9320-648cf2099dd0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Excel Proxy Executing Regsvr32 With Payload","query":"((process.executable:*\\\\wbem\\\\WMIC.exe OR process.command_line:*wmic\\ * OR winlog.event_data.OriginalFileName:\"wmic.exe\" OR winlog.event_data.Description:\"WMI\\ Commandline\\ Utility\") AND process.command_line:(*regsvr32* OR *rundll32* OR *msiexec* OR *mshta* OR *verclsid*) AND process.parent.executable:(*winword.exe OR *excel.exe OR *powerpnt.exe) AND process.command_line:*process* AND process.command_line:*create* AND process.command_line:*call*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1047","T1204","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"},{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
