{"description": "Detects diagcab leveraging the \"ms-msdt\" handler or the \"msdt.exe\" binary to execute arbitrary commands as seen in CVE-2022-30190", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "602a822b-c345-283c-f8aa-a25167e369a6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execute Arbitrary Commands Using MSDT.EXE", "query": "((process.executable:*\\\\msdt.exe OR winlog.event_data.OriginalFileName:\"msdt.exe\") AND (process.command_line:*\\/cab* AND process.command_line:*.diagcab*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://github.com/GossiTheDog/ThreatHunting/blob/master/AdvancedHuntingQueries/DogWalk-DiagCab"], "timestamp_override": "event.ingested", "author": ["GossiTheDog (rule)", "frack113 (sigma version)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
