{"description": "Detects suspicious way to dump the kernel on Windows systems using dtrace.exe, which is available on Windows systems since Windows 10 19H1", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ee289478-1d6b-99ff-eb40-40241d61e533", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Kernel Dump Using Dtrace", "query": "((process.executable:*\\\\dtrace.exe AND process.command_line:*lkd\\(0\\)*) OR (process.command_line:*syscall\\:\\:\\:return* AND process.command_line:*lkd\\(*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/0gtweet/status/1474899714290208777?s=12", "https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/dtrace"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
