{"description": "Detect usage of the \"driverquery\" utility to perform reconnaissance on installed drivers", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9fc3072c-dc8f-4bf7-b231-18950000fadd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Recon Activity Using DriverQuery.EXE", "query": "(((process.executable.text:*driverquery.exe) OR (winlog.event_data.OriginalFileName:\"drvqry.exe\")) AND ((process.parent.executable.text:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\mshta.exe)) OR (process.parent.executable.text:(*\\\\AppData\\\\Local\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/", "https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/", "https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
