{"description": "Detects usage of the built-in PowerShell cmdlet \"Enable-WindowsOptionalFeature\" used as a Deployment Image Servicing and Management tool.\nSimilar to DISM.exe, this cmdlet is used to enumerate, install, uninstall, configure, and update features and packages in Windows images\n", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c740d4cf-a1e9-41de-bb16-8a46a4f57918", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Suspicious Windows Feature Enabled - ProcCreation", "query": "(process.command_line.text:*Enable\\-WindowsOptionalFeature* AND process.command_line.text:*\\-Online* AND process.command_line.text:*\\-FeatureName* AND process.command_line.text:(*TelnetServer* OR *Internet\\-Explorer\\-Optional\\-amd64* OR *TFTP* OR *SMB1Protocol* OR *Client\\-ProjFS* OR *Microsoft\\-Windows\\-Subsystem\\-Linux*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/powershell/module/dism/enable-windowsoptionalfeature?view=windowsserver2022-ps", "https://learn.microsoft.com/en-us/windows/win32/projfs/enabling-windows-projected-file-system", "https://learn.microsoft.com/en-us/windows/wsl/install-on-server"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
