{"description": "Detects the use of CoercedPotato, a tool for privilege escalation", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e8d34729-86a4-4140-adfd-0a29c2106307", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - CoercedPotato Execution", "query": "(event.category:process AND ((process.executable:/.*\\\\[Cc][Oo][Ee][Rr][Cc][Ee][Dd][Pp][Oo][Tt][Aa][Tt][Oo]\\.[Ee][Xx][Ee]/) OR (process.command_line:/.*\\ \\-\\-[Ee][Xx][Pp][Ll][Oo][Ii][Tt][Ii][Dd]\\ .*/) OR (winlog.event_data.Imphash:(a75d7669db6b2e107a44c4057ff7f7d6 OR f91624350e2c678c5dcbe5e1f24e22c9 OR 14c81850a079a87e83d50ca41c709a15)) OR (winlog.event_data.Hashes:(/[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Aa]75[Dd]7669[Dd][Bb]6[Bb]2[Ee]107[Aa]44[Cc]4057[Ff][Ff]7[Ff]7[Dd]6/ OR /[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=[Ff]91624350[Ee]2[Cc]678[Cc]5[Dd][Cc][Bb][Ee]5[Ee]1[Ff]24[Ee]22[Cc]9/ OR /[Ii][Mm][Pp][Hh][Aa][Ss][Hh]\\=14[Cc]81850[Aa]079[Aa]87[Ee]83[Dd]50[Cc][Aa]41[Cc]709[Aa]15/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://github.com/hackvens/CoercedPotato", "https://blog.hackvens.fr/articles/CoercedPotato.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
