{"description": "Detects clearing or configuration of eventlogs using wevtutil, powershell and wmic. Might be used by ransomwares during the attack (seen by NotPetya and others).", "enabled": false, "false_positives": ["Admin activity", "Scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cc36992a-4671-4f21-a91d-6c2b72a2edf5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Eventlog Clear or Configuration Using Wevtutil", "query": "((process.executable:*\\\\wevtutil.exe AND process.command_line:(*clear\\-log* OR *\\ cl\\ * OR *set\\-log* OR *\\ sl\\ *)) OR (process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:(*Clear\\-EventLog* OR *Remove\\-EventLog* OR *Limit\\-EventLog*)) OR (process.executable:*\\\\wmic.exe AND process.command_line:*\\ ClearEventLog\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.001/T1070.001.md", "https://eqllib.readthedocs.io/en/latest/analytics/5b223758-07d6-4100-9e11-238cfdd0fe97.html"], "timestamp_override": "event.ingested", "author": ["Ecco", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
