{"description": "Detects the use of the Dinject PowerShell cradle based on the specific flags", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d78b5d61-187d-44b6-bf02-93486a80de5a", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "HackTool - DInjector PowerShell Cradle Execution", "query": "(process.command_line.text:\"*\\ \\/am51*\" AND process.command_line.text:\"*\\ \\/password*\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://github.com/snovvcrash/DInjector"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
