{"description": "Detects using WorkFolders.exe to execute an arbitrary control.exe", "enabled": false, "false_positives": ["Legitimate usage of the uncommon Windows Work Folders feature."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "53cdfbca-d767-2849-cf6f-c44acd429530", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution via WorkFolders.exe", "query": "((process.executable:*\\\\control.exe AND process.parent.executable:*\\\\WorkFolders.exe) AND (NOT (process.executable:\"C\\:\\\\Windows\\\\System32\\\\control.exe\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/elliotkillick/status/1449812843772227588"], "timestamp_override": "event.ingested", "author": ["Maxime Thiebaut (@0xThiebaut)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
