{"description": "Detect child processes of automatically elevated instances of Microsoft Connection Manager Profile Installer (cmstp.exe).", "enabled": false, "false_positives": ["Legitimate use of cmstp.exe utility by legitimate user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e66779cc-383e-4224-a3a4-267eeb585c40", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Bypass UAC via CMSTP", "query": "((process.executable:*\\\\cmstp.exe OR winlog.event_data.OriginalFileName:\"CMSTP.EXE\") AND process.command_line:(*\\/s* OR *\\/au*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1218", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}, {"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1191/T1191.md"], "timestamp_override": "event.ingested", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
