{"description": "Detects usage of the \"FromBase64String\" function in the commandline which is used to decode a base64 encoded string", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Administrative script libraries"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e32d4572-9826-4738-b651-95fa63747e8a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Base64 Encoded PowerShell Command Detected", "query": "process.command_line.text:*\\:\\:FromBase64String\\(*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059", "T1140"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}, {"id": "T1140", "name": "Deobfuscate/Decode Files or Information", "reference": "https://attack.mitre.org/techniques/T1140"}]}], "version": 1, "references": ["https://gist.github.com/Neo23x0/6af876ee72b51676c82a2db8d2cd3639"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
