{"description":"An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilities Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Command line parameter combinations that contain all included strings"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"93ea7176-bd67-5890-6093-6a8d6b195efc","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Compress Data and Lock With Password for Exfiltration With 7-ZIP","query":"(process.command_line:(*7z.exe* OR *7za.exe*) AND process.command_line:*\\ \\-p* AND process.command_line:(*\\ a\\ * OR *\\ u\\ *))","meta":{"from":"1m"},"severity":"medium","tags":["T1560"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0009","reference":"https://attack.mitre.org/tactics/TA0009","name":"Collection"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1560","name":"Archive Collected Data","reference":"https://attack.mitre.org/techniques/T1560"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
