{"description": "Detects the execution of the hacktool SharPersist - used to deploy various different kinds of persistence mechanisms", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "26488ad0-f9fd-4536-876f-52fea846a2e4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - SharPersist Execution", "query": "((((process.executable.text:\"*\\\\SharPersist.exe\") OR (Product:\"SharPersist\"))) OR (process.command_line.text:(\"*\\ \\-t\\ schtask\\ \\-c\\ *\" OR \"*\\ \\-t\\ startupfolder\\ \\-c\\ *\")) OR ((process.command_line.text:\"*\\ \\-t\\ reg\\ \\-c\\ *\" AND process.command_line.text:\"*\\ \\-m\\ add*\")) OR ((process.command_line.text:\"*\\ \\-t\\ service\\ \\-c\\ *\" AND process.command_line.text:\"*\\ \\-m\\ add*\")) OR ((process.command_line.text:\"*\\ \\-t\\ schtask\\ \\-c\\ *\" AND process.command_line.text:\"*\\ \\-m\\ add*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.mandiant.com/resources/blog/sharpersist-windows-persistence-toolkit", "https://github.com/mandiant/SharPersist"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
