{"description": "Detects specific process parameters as used by Mustang Panda droppers", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ad2bab79-5648-4491-12a2-67664b80ed23", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Mustang Panda Dropper", "query": "(process.command_line:(*Temp\\\\wtask.exe\\ \\/create* OR *%windir\\:\\~\\-3,1%%PUBLIC\\:\\~\\-9,1%* OR *\\/tn\\ \\\"Security\\ Script\\ * OR *%windir\\:\\~\\-1,1%*) OR (process.command_line:*\\/E\\:vbscript* AND process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*.txt* AND process.command_line:*\\/F*) OR process.executable:*Temp\\\\winwsh.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://app.any.run/tasks/7ca5661d-a67b-43ec-98c1-dd7a8103c256/", "https://app.any.run/tasks/b12cccf3-1c22-4e28-9d3e-c7a6062f3914/", "https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
