{"description": "Detects when attackers use \"sc.exe\" to delete AV services from the system in order to avoid detection", "enabled": false, "false_positives": ["Legitimate software deleting using the same method of deletion (Add it to a filter if you find cases as such)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7fd4bb39-12d0-45ab-bb36-cebabc73dc7b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Execution of Sc to Delete AV Services", "query": "((process.executable.text:*\\\\sc.exe OR winlog.event_data.OriginalFileName:\"sc.exe\") AND process.command_line.text:*\\ delete\\ * AND process.command_line.text:(*AvgAdminServer* OR *AVG\\ Antivirus* OR *MBEndpointAgent* OR *MBAMService* OR *MBCloudEA* OR *avgAdminClient* OR *SAVService* OR *SAVAdminService* OR *Sophos\\ AutoUpdate\\ Service* OR *Sophos\\ Clean\\ Service* OR *Sophos\\ Device\\ Control\\ Service* OR *Sophos\\ File\\ Scanner\\ Service* OR *Sophos\\ Health\\ Service* OR *Sophos\\ MCS\\ Agent* OR *Sophos\\ MCS\\ Client* OR *SntpService* OR *swc_service* OR *swi_service* OR *Sophos\\ UI* OR *swi_update* OR *Sophos\\ Web\\ Control\\ Service* OR *Sophos\\ System\\ Protection\\ Service* OR *Sophos\\ Safestore\\ Service* OR *hmpalertsvc* OR *RpcEptMapper* OR *Sophos\\ Endpoint\\ Defense\\ Service* OR *SophosFIM* OR *swi_filter* OR *FirebirdGuardianDefaultInstance* OR *FirebirdServerDefaultInstance* OR *WRSVC* OR *ekrn* OR *ekrnEpsw* OR *klim6* OR *AVP18.0.0* OR *KLIF* OR *klpd* OR *klflt* OR *klbackupdisk* OR *klbackupflt* OR *klkbdflt* OR *klmouflt* OR *klhk* OR *KSDE1.0.0* OR *kltap* OR *ScSecSvc* OR *Core\\ Mail\\ Protection* OR *Core\\ Scanning\\ Server* OR *Core\\ Scanning\\ ServerEx* OR *Online\\ Protection\\ System* OR *RepairService* OR *Core\\ Browsing\\ Protection* OR *Quick\\ Update\\ Service* OR *McAfeeFramework* OR *macmnsvc* OR *masvc* OR *mfemms* OR *mfevtp* OR *TmFilter* OR *TMLWCSService* OR *tmusa* OR *TmPreFilter* OR *TMSmartRelayService* OR *TMiCRCScanService* OR *VSApiNt* OR *TmCCSF* OR *tmlisten* OR *TmProxy* OR *ntrtscan* OR *ofcservice* OR *TmPfw* OR *PccNTUpd* OR *PandaAetherAgent* OR *PSUAService* OR *NanoServiceMain* OR *EPIntegrationService* OR *EPProtectedService* OR *EPRedline* OR *EPSecurityService* OR *EPUpdateService*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
