{"description": "An attacker may execute an application as a SCR File using rundll32.exe desk.cpl,InstallScreenSaver", "author": ["Christopher Peacock @securepeacock", "SCYTHE @scythe_io", "TactiKoolSec"], "enabled": false, "false_positives": ["Legitimate installation of a new screensaver"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "15bd98ea-55f4-4d37-b09a-e7caa0fa2221", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rundll32 InstallScreenSaver Execution", "query": "(((process.executable.text:*\\\\rundll32.exe) OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND process.command_line.text:*InstallScreenSaver*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Libraries/Desk/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
