{"description": "Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "af77cf95-c469-471c-b6a0-946c685c4798", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Proxy Execution via Wuauclt", "query": "(((process.executable:*wuauclt* OR winlog.event_data.OriginalFileName:\"wuauclt.exe\") AND (process.command_line:*UpdateDeploymentProvider* AND process.command_line:*.dll* AND process.command_line:*RunHandlerComServer*)) AND (NOT (process.command_line:(*\\ \\/UpdateDeploymentProvider\\ UpdateDeploymentProvider.dll\\ * OR *\\ wuaueng.dll\\ *))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://dtm.uk/wuauclt/", "https://blog.malwarebytes.com/threat-intelligence/2022/01/north-koreas-lazarus-apt-leverages-windows-update-client-github-in-latest-campaign/"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
