{"description": "Detects command lines that indicate unwanted modifications to registry keys that disable important Internet Explorer security features", "enabled": false, "false_positives": ["Unknown, maybe some security software installer disables these features temporarily"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fb50eb7a-5ab1-43ae-bcc9-091818cb8424", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disabled IE Security Features", "query": "((process.command_line:*\\ \\-name\\ IEHarden\\ * AND process.command_line:*\\ \\-value\\ 0\\ *) OR (process.command_line:*\\ \\-name\\ DEPOff\\ * AND process.command_line:*\\ \\-value\\ 1\\ *) OR (process.command_line:*\\ \\-name\\ DisableFirstRunCustomize\\ * AND process.command_line:*\\ \\-value\\ 2\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
