{"description": "Detects the execution of regini.exe which can be used to modify registry keys, the changes are imported from one or more text files.", "author": ["Eli Salem", "Sander Wiebing", "oscd.community"], "enabled": false, "false_positives": ["Legitimate modification of keys"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "97b2994a-1df4-57e2-3533-fd984aef3147", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Registry Modification Via Regini.EXE", "query": "(((process.executable.text:*\\\\regini.exe) OR (winlog.event_data.OriginalFileName:\"REGINI.EXE\")) AND (NOT (process.command_line.text:/:[^ \\\\]/)))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Regini/", "https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
