{"description": "Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "deb9b646-a508-44ee-b7c9-d8965921c6b6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Powershell Token Obfuscation - Process Creation", "query": "(((process.command_line.text:/\\/ OR process.command_line.text:/w/ OR process.command_line.text:/+/ OR process.command_line.text:/\\/ OR process.command_line.text:/`/ OR process.command_line.text:/(/ OR process.command_line.text:/\\/ OR process.command_line.text:/w/ OR process.command_line.text:/+/ OR process.command_line.text:/|/ OR process.command_line.text:/-/ OR process.command_line.text:/|/ OR process.command_line.text:/./ OR process.command_line.text:/)/ OR process.command_line.text:/\\/ OR process.command_line.text:/`/ OR process.command_line.text:/[/ OR process.command_line.text:/\\/ OR process.command_line.text:/w/ OR process.command_line.text:/+/ OR process.command_line.text:/|/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/]/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/\"/ OR process.command_line.text:/(/ OR process.command_line.text:/{/ OR process.command_line.text:/\\/ OR process.command_line.text:/d/ OR process.command_line.text:/}/ OR process.command_line.text:/)/ OR process.command_line.text:/+/ OR process.command_line.text:/\\/ OR process.command_line.text:/\"/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/-/ OR process.command_line.text:/f/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/{/ OR process.command_line.text:/(/ OR process.command_line.text:/(/ OR process.command_line.text:/e/ OR process.command_line.text:/|/ OR process.command_line.text:/n/ OR process.command_line.text:/|/ OR process.command_line.text:/v/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/`/ OR process.command_line.text:/(/ OR process.command_line.text:/e/ OR process.command_line.text:/|/ OR process.command_line.text:/n/ OR process.command_line.text:/|/ OR process.command_line.text:/v/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/)/ OR process.command_line.text:/+/ OR process.command_line.text:/:/ OR process.command_line.text:/p/ OR process.command_line.text:/a/ OR process.command_line.text:/t/ OR process.command_line.text:/h/ OR process.command_line.text:/}/ OR process.command_line.text:/|/ OR process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/{/ OR process.command_line.text:/(/ OR process.command_line.text:/(/ OR process.command_line.text:/e/ OR process.command_line.text:/|/ OR process.command_line.text:/n/ OR process.command_line.text:/|/ OR process.command_line.text:/v/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/`/ OR process.command_line.text:/(/ OR process.command_line.text:/e/ OR process.command_line.text:/|/ OR process.command_line.text:/n/ OR process.command_line.text:/|/ OR process.command_line.text:/v/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/)/ OR process.command_line.text:/+/ OR process.command_line.text:/:/ OR process.command_line.text:/(/ OR process.command_line.text:/(/ OR process.command_line.text:/p/ OR process.command_line.text:/|/ OR process.command_line.text:/a/ OR process.command_line.text:/|/ OR process.command_line.text:/t/ OR process.command_line.text:/|/ OR process.command_line.text:/h/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/`/ OR process.command_line.text:/(/ OR process.command_line.text:/p/ OR process.command_line.text:/|/ OR process.command_line.text:/a/ OR process.command_line.text:/|/ OR process.command_line.text:/t/ OR process.command_line.text:/|/ OR process.command_line.text:/h/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/)/ OR process.command_line.text:/+/ OR process.command_line.text:/}/ OR process.command_line.text:/|/ OR process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/{/ OR process.command_line.text:/e/ OR process.command_line.text:/n/ OR process.command_line.text:/v/ OR process.command_line.text:/:/ OR process.command_line.text:/(/ OR process.command_line.text:/(/ OR process.command_line.text:/p/ OR process.command_line.text:/|/ OR process.command_line.text:/a/ OR process.command_line.text:/|/ OR process.command_line.text:/t/ OR process.command_line.text:/|/ OR process.command_line.text:/h/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/`/ OR process.command_line.text:/(/ OR process.command_line.text:/p/ OR process.command_line.text:/|/ OR process.command_line.text:/a/ OR process.command_line.text:/|/ OR process.command_line.text:/t/ OR process.command_line.text:/|/ OR process.command_line.text:/h/ OR process.command_line.text:/)/ OR process.command_line.text:/*/ OR process.command_line.text:/)/ OR process.command_line.text:/+/ OR process.command_line.text:/}/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/danielbohannon/Invoke-Obfuscation"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
