{"description": "Detects when a program changes the default file association of any extension to an executable", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "98ec2c1b-7ff6-789a-98da-406cb219802e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Change Default File Association To Executable", "query": "((process.command_line:*cmd* AND process.command_line:*\\ \\/c\\ * AND process.command_line:*assoc\\ * AND process.command_line:*exefile*) AND (NOT (process.command_line:*.exe\\=exefile*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/assoc"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
