{"description": "Detects usage of the \"TcpClient\" class. Which can be abused to establish remote connections and reverse-shells. As seen used by the Nishang \"Invoke-PowerShellTcpOneLine\" reverse shell and other.", "author": ["FPT.EagleEye", "wagga", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["In rare administrative cases, this function might be used to check network connectivity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "edc2f8ae-2412-4dfd-b9d5-0c57727e70be", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Powershell ReverseShell Connection", "query": "(((winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\")) OR (process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\"))) AND (process.command_line.text:\"*\\ Net.Sockets.TCPClient*\" AND process.command_line.text:\"*.GetStream\\(*\" AND process.command_line.text:\"*.Write\\(*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/", "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/", "https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Shells/Invoke-PowerShellTcpOneLine.ps1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
