{"description": "Windows Test Authoring and Execution Framework (TAEF) framework allows you to run automation by executing tests files written on different languages (C, C#, Microsoft COM Scripting interfaces). Adversaries may execute malicious code (such as WSC file with VBScript, dll and so on) directly by running te.exe", "enabled": false, "false_positives": ["It's not an uncommon to use te.exe directly to execute legal TAEF tests"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c03fb4fd-c985-19f0-577e-9fc9fdf9f22e", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Malicious Windows Script Components File Execution by TAEF Detection", "query": "(process.executable:*\\\\te.exe OR process.parent.executable:*\\\\te.exe OR winlog.event_data.OriginalFileName:\"\\\\te.exe\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Te.yml", "https://twitter.com/pabraeken/status/993298228840992768", "https://docs.microsoft.com/en-us/windows-hardware/drivers/taef/"], "timestamp_override": "event.ingested", "author": ["Agro (@agro_sev) oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
