{"description": "7-Zip through 21.07 on Windows allows privilege escalation (CVE-2022-29072) and command execution when a file with the .7z extension is dragged to the Help>Contents area. This is caused by misconfiguration of 7z.dll and a heap overflow. The command runs in a child process under the 7zFM.exe process.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9a4ccd1a-3526-4d99-b980-9f9c5d3a6ee3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious 7zip Subprocess", "query": "((process.executable:*\\\\cmd.exe AND process.parent.executable:*\\\\7zFM.exe) AND (NOT ((process.command_line:*\\ \\/c\\ *) OR (NOT _exists_:process.command_line))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/kagancapar/CVE-2022-29072", "https://twitter.com/kagancapar/status/1515219358234161153"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
