{"description": "Detects creation or execution of UserInitMprLogonScript persistence method", "enabled": false, "false_positives": ["Exclude legitimate logon scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0a98a10c-685d-4ab0-bddc-b6bdd1d48458", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Logon Scripts (UserInitMprLogonScript)", "query": "((process.parent.executable:*\\\\userinit.exe AND (NOT ((process.executable:(*explorer.exe OR *\\\\proquota.exe)) OR (process.command_line:(*netlogon*.bat* OR *UsrLogon.cmd* OR *C\\:\\\\WINDOWS\\\\Explorer.EXE*)) OR (process.executable:*\\\\Citrix\\\\System32\\\\icast.exe)))) OR process.command_line:*UserInitMprLogonScript*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1037"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1037", "name": "Boot or Logon Initialization Scripts", "reference": "https://attack.mitre.org/techniques/T1037"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1037/"], "timestamp_override": "event.ingested", "author": ["Tom Ueltschi (@c_APT_ure)", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
