{"description": "Detects Netsh command execution that whitelists a program located in a suspicious location in the Windows Firewall", "author": ["Sander Wiebing", "Jonhnathan Ribeiro", "Daniil Yugoslavskiy", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a35f5a72-f347-4e36-8895-9869b0d5fc6d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Program Location Whitelisted In Firewall Via Netsh.EXE", "query": "(((process.executable.text:\"*\\\\netsh.exe\") OR (winlog.event_data.OriginalFileName:\"netsh.exe\")) AND (((process.command_line.text:\"*firewall*\" AND process.command_line.text:\"*add*\" AND process.command_line.text:\"*allowedprogram*\")) OR ((process.command_line.text:\"*advfirewall*\" AND process.command_line.text:\"*firewall*\" AND process.command_line.text:\"*add*\" AND process.command_line.text:\"*rule*\" AND process.command_line.text:\"*action\\=allow*\" AND process.command_line.text:\"*program\\=*\"))) AND process.command_line.text:(\"*%Public%\\\\*\" OR \"*%TEMP%*\" OR \"*%TMP%*\" OR \"*\\:\\\\$Recycle.bin\\\\*\" OR \"*\\:\\\\RECYCLER\\\\*\" OR \"*\\:\\\\SystemVolumeInformation\\\\*\" OR \"*\\:\\\\Temp\\\\*\" OR \"*\\:\\\\Users\\\\Default\\\\*\" OR \"*\\:\\\\Users\\\\Desktop\\\\*\" OR \"*\\:\\\\Users\\\\Public\\\\*\" OR \"*\\:\\\\Windows\\\\addins\\\\*\" OR \"*\\:\\\\Windows\\\\cursors\\\\*\" OR \"*\\:\\\\Windows\\\\debug\\\\*\" OR \"*\\:\\\\Windows\\\\drivers\\\\*\" OR \"*\\:\\\\Windows\\\\fonts\\\\*\" OR \"*\\:\\\\Windows\\\\help\\\\*\" OR \"*\\:\\\\Windows\\\\system32\\\\tasks\\\\*\" OR \"*\\:\\\\Windows\\\\Tasks\\\\*\" OR \"*\\:\\\\Windows\\\\Temp\\\\*\" OR \"*\\\\Downloads\\\\*\" OR \"*\\\\Local\\ Settings\\\\Temporary\\ Internet\\ Files\\\\*\" OR \"*\\\\Temporary\\ Internet\\ Files\\\\Content.Outlook\\\\*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.virusradar.com/en/Win32_Kasidet.AD/description", "https://www.hybrid-analysis.com/sample/07e789f4f2f3259e7559fdccb36e96814c2dbff872a21e1fa03de9ee377d581f?environmentId=100"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
