{"description": "Extract data from cab file and hide it in an alternate data stream", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "45a74bef-5042-1415-483b-c6aa9bb9b870", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Extrac32 Alternate Data Stream Execution", "query": "(process.command_line.text:*extrac32.exe* AND process.command_line.text:*.cab* AND (process.command_line.text:/:/ OR process.command_line.text:/[/ OR process.command_line.text:/^/ OR process.command_line.text:/\\/ OR process.command_line.text:/\\/ OR process.command_line.text:/]/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Extrac32/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
