{"description": "Detects the usage of \"hh.exe\" to execute \".chm\" files.", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Dan Beavin)", "oscd.community"], "enabled": false, "false_positives": ["False positives are expected with legitimate \".CHM\""], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "68c8acb4-1b60-4890-8e82-3ddf7a6dba84", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "HH.EXE Execution", "query": "(((winlog.event_data.OriginalFileName:\"HH.exe\") OR (process.executable.text:\"*\\\\hh.exe\")) AND process.command_line.text:\"*.chm*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.001/T1218.001.md", "https://eqllib.readthedocs.io/en/latest/analytics/b25aa548-7937-11e9-8f5c-d46d6d62a49e.html", "https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
