{"description": "Detects the use of NirCmd tool for command execution as SYSTEM user", "enabled": false, "false_positives": ["Legitimate use by administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d9047477-0359-48c9-b8c7-792cedcdc9c4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NirCmd Tool Execution As LOCAL SYSTEM", "query": "process.command_line:*\\ runassystem\\ *", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://www.nirsoft.net/utils/nircmd.html", "https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/", "https://www.nirsoft.net/utils/nircmd2.html#using"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali @nas_bench"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
