{"description": "Detects the use of SDelete to erase a file not the free space", "enabled": false, "false_positives": ["System administrator usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dc4e889e-0630-75da-c5cd-bddd26e0f678", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Sysinternals SDelete Delete File", "query": "(winlog.event_data.OriginalFileName:\"sdelete.exe\" AND (NOT (process.command_line.text:(*\\ \\-h* OR *\\ \\-c* OR *\\ \\-z* OR *\\ \\/\\?*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1485"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1485", "name": "Data Destruction", "reference": "https://attack.mitre.org/techniques/T1485"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
