{"description": "Detects the execution of certutil with either the \"decode\" or \"decodehex\" flags to decode base64 or hex encoded files. This can be abused by attackers to decode an encoded payload before execution", "author": ["Florian Roth (Nextron Systems)", "Jonhnathan Ribeiro", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cc9cbe82-7bc0-4ef5-bc23-bbfb83947be7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File Decoded From Base64/Hex Via Certutil.EXE", "query": "(((process.executable.text:\"*\\\\certutil.exe\") OR (winlog.event_data.OriginalFileName:\"CertUtil.exe\")) AND process.command_line.text:(\"*\\-decode\\ *\" OR \"*\\/decode\\ *\" OR \"*\\-decodehex\\ *\" OR \"*\\/decodehex\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil", "https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/", "https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/", "https://twitter.com/JohnLaTwC/status/835149808817991680", "https://learn.microsoft.com/en-us/archive/blogs/pki/basic-crl-checking-with-certutil", "https://lolbas-project.github.io/lolbas/Binaries/Certutil/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
