{"description": "Detects when a user installs certificates by using CertOC.exe to loads the target DLL file.", "author": ["Austin Songer @austinsonger"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "242301bc-f92f-4476-8718-78004a6efd9f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DLL Loaded via CertOC.EXE", "query": "(((process.executable.text:\"*\\\\certoc.exe\") OR (winlog.event_data.OriginalFileName:\"CertOC.exe\")) AND process.command_line.text:(\"*\\ \\-LoadDLL\\ *\" OR \"*\\ \\/LoadDLL\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/sblmsrsn/status/1445758411803480072?s=20", "https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-fe98e74189873d6df72a15df2eaa0315c59ba9cdaca93ecd68afc4ea09194ef2", "https://lolbas-project.github.io/lolbas/Binaries/Certoc/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
