{"description": "Detects execution of wab.exe (Windows Contacts) from non default locations as seen with bumblebee activity", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "513e8e8b-7abe-f258-d733-3d8ff0687899", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Wab Execution From Non Default Location", "query": "(process.executable.text:*\\\\wab.exe AND (NOT (process.executable.text:(C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Program\\ Files\\\\Windows\\ Mail\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Windows\\ Mail\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
