{"description": "Detects commandline containing reference to files ending with a \".\". This scheme has been seen used by raspberry-robin", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a35c97c8-d9c4-4c89-a3e7-533dc0bcb73a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Raspberry Robin Dot Ending File", "query": "(process.command_line.text:/\\.[a-zA-Z0-9]{1,6}\\.[ |\"|']{0,1}/ AND (NOT (process.command_line.text:/\\.[a-zA-Z0-9]{1,6}\\.[a-zA-Z0-9]{1}/)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
