{"description": "Detects suspicious parent process for cmd.exe", "author": ["Tim Rauch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4b991083-3d0e-44ce-8fc4-b254025d8d4b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Unusual Parent Process For Cmd.EXE", "query": "(process.executable.text:\"*\\\\cmd.exe\" AND process.parent.executable.text:(\"*\\\\csrss.exe\" OR \"*\\\\ctfmon.exe\" OR \"*\\\\dllhost.exe\" OR \"*\\\\epad.exe\" OR \"*\\\\FlashPlayerUpdateService.exe\" OR \"*\\\\GoogleUpdate.exe\" OR \"*\\\\jucheck.exe\" OR \"*\\\\jusched.exe\" OR \"*\\\\LogonUI.exe\" OR \"*\\\\lsass.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\SearchIndexer.exe\" OR \"*\\\\SearchProtocolHost.exe\" OR \"*\\\\SIHClient.exe\" OR \"*\\\\sihost.exe\" OR \"*\\\\slui.exe\" OR \"*\\\\spoolsv.exe\" OR \"*\\\\sppsvc.exe\" OR \"*\\\\taskhostw.exe\" OR \"*\\\\unsecapp.exe\" OR \"*\\\\WerFault.exe\" OR \"*\\\\wergmgr.exe\" OR \"*\\\\wlanext.exe\" OR \"*\\\\WUDFHost.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/unusual-parent-process-for-cmd.exe.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
