{"description": "Deletes the Windows systemstatebackup using wbadmin.exe.\nThis technique is used by numerous ransomware families.\nThis may only be successful on server platforms that have Windows Backup enabled.\n", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "89f75308-5b1b-4390-b2d8-d6b2340efaf8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SystemStateBackup Deleted Using Wbadmin.EXE", "query": "(((process.executable.text:\"*\\\\wbadmin.exe\") OR (winlog.event_data.OriginalFileName:\"WBADMIN.EXE\")) AND (process.command_line.text:\"*delete\\ *\" AND process.command_line.text:\"*systemstatebackup\\ *\" AND process.command_line.text:\"*\\-keepVersions\\:0*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
