{"description": "Detects manual service execution (start) via system utilities.", "enabled": false, "false_positives": ["Legitimate administrator or user executes a service for legitimate reasons."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c2af6980-e157-5d52-c122-c12c0b8fafd0", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Service Execution", "query": "(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*\\ start\\ *)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1569.002/T1569.002.md"], "timestamp_override": "event.ingested", "author": ["Timur Zinniatullin", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
