{"description": "Adversaries can abuse of C:\\Windows\\System32\\gatherNetworkInfo.vbs script along with cscript.exe to gather information about the target", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "575dce0c-8139-4e30-9295-1ee75969f7fe", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "GatherNetworkInfo.vbs Script Usage", "query": "(process.command_line:*cscript.exe* AND process.command_line:*gatherNetworkInfo.vbs*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs"], "timestamp_override": "event.ingested", "author": ["blueteamer8699"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
