{"description": "Detects the creation of a schtasks that potentially executes a payload stored in the Windows Registry using PowerShell.", "author": ["X__Junior (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "86588b36-c6d3-465f-9cee-8f9093e07798", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Scheduled Task Executing Payload from Registry", "query": "((((process.executable:/.*\\\\\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/)) AND process.command_line:/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee].*/ AND process.command_line:(/.*[Gg][Ee][Tt]\\-[Ii][Tt][Ee][Mm][Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy].*/ OR /.*\\ [Gg][Pp]\\ .*/) AND process.command_line:(/.*[Hh][Kk][Cc][Uu]\\:.*/ OR /.*[Hh][Kk][Ll][Mm]\\:.*/ OR /.*[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\:\\:.*/ OR /.*[Hh][Kk][Ee][Yy]_.*/)) AND (NOT process.command_line.text:(*FromBase64String* OR *encodedcommand*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
