{"description":"Detects base64 encoded PowerShell code that modifies Windows Defender Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Possible Admin Activity","Other Cmdlets that may use the same parameters"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"35ab83d1-7fb7-5d53-a6ce-68c63055c597","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Powershell Defender Base64 MpPreference","query":"process.command_line:(*QWRkLU1wUHJlZmVyZW5jZS* OR *FkZC1NcFByZWZlcmVuY2Ug* OR *BZGQtTXBQcmVmZXJlbmNlI* OR *U2V0LU1wUHJlZmVyZW5jZS* OR *NldC1NcFByZWZlcmVuY2Ug* OR *TZXQtTXBQcmVmZXJlbmNlI* OR *YWRkLW1wcHJlZmVyZW5jZS* OR *FkZC1tcHByZWZlcmVuY2Ug* OR *hZGQtbXBwcmVmZXJlbmNlI* OR *c2V0LW1wcHJlZmVyZW5jZS* OR *NldC1tcHByZWZlcmVuY2Ug* OR *zZXQtbXBwcmVmZXJlbmNlI*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
