{"description": "Detects the execution of certutil with certain flags that allow the utility to download files from file-sharing websites.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "42a5f1e7-9603-4f6d-97ae-3f37d130d794", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious File Downloaded From File-Sharing Website Via Certutil.EXE", "query": "(((process.executable.text:\"*\\\\certutil.exe\") OR (winlog.event_data.OriginalFileName:\"CertUtil.exe\")) AND process.command_line.text:(\"*urlcache\\ *\" OR \"*verifyctl\\ *\") AND process.command_line.text:(\"*.ghostbin.co\\/*\" OR \"*.hastebin.com*\" OR \"*.paste.ee*\" OR \"*anonfiles.com*\" OR \"*cdn.discordapp.com\\/attachments\\/*\" OR \"*ddns.net*\" OR \"*gist.githubusercontent.com*\" OR \"*mediafire.com*\" OR \"*mega.nz*\" OR \"*paste.ee*\" OR \"*pastebin.com*\" OR \"*pastebin.pl*\" OR \"*pastetext.net*\" OR \"*privatlab.com*\" OR \"*privatlab.net*\" OR \"*raw.githubusercontent.com*\" OR \"*send.exploit.in*\" OR \"*sendspace.com*\" OR \"*storage.googleapis.com*\" OR \"*transfer.sh*\" OR \"*ufile.io*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil", "https://forensicitguy.github.io/agenttesla-vba-certutil-download/", "https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/", "https://twitter.com/egre55/status/1087685529016193025", "https://lolbas-project.github.io/lolbas/Binaries/Certutil/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
