{"description": "Attackers can use print.exe for remote file copy", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3556c11b-9e10-b329-b89a-56d7039a1b4c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Abusing Print Executable", "query": "((process.executable:*\\\\print.exe AND process.command_line:print* AND process.command_line:*\\/D* AND process.command_line:*.exe*) AND (NOT (process.command_line:*print.exe*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Print/", "https://twitter.com/Oddvarmoe/status/985518877076541440"], "timestamp_override": "event.ingested", "author": ["Furkan CALISKAN", "@caliskanfurkan_", "@oscd_initiative"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
