{"description": "Detects potentially suspicious child processes of a ClickOnce deployment application", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "67bc0e75-c0a9-4cfc-8754-84a505b63c04", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Child Process Of ClickOnce Application", "query": "(process.parent.executable.text:\"*\\\\AppData\\\\Local\\\\Apps\\\\2.0\\\\*\" AND process.executable.text:(\"*\\\\calc.exe\" OR \"*\\\\cmd.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\explorer.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\net.exe\" OR \"*\\\\net1.exe\" OR \"*\\\\nltest.exe\" OR \"*\\\\notepad.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\reg.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\schtasks.exe\" OR \"*\\\\werfault.exe\" OR \"*\\\\wscript.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
