{"description": "Detects MMC20.Application Lateral Movement; specifically looks for the spawning of the parent MMC.exe with a command line of \"-Embedding\" as a child of svchost.exe", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9829339c-b457-64e4-5f4a-b502b20b5b49", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MMC20 Lateral Movement", "query": "(process.parent.executable:*\\\\svchost.exe AND process.executable:*\\\\mmc.exe AND process.command_line:*\\-Embedding*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1021"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/", "https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view?usp=sharing"], "timestamp_override": "event.ingested", "author": ["@2xxeformyshirt (Security Risk Advisors) - rule; Teymur Kheirkhabarov (idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
