{"description": "Detects command that type the content of ntdll.dll to a different file or a pipe in order to evade AV / EDR detection", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Ntdll Pipe Redirection", "query": "process.command_line:(*type\\ %windir%\\\\system32\\\\ntdll.dll* OR *type\\ %systemroot%\\\\system32\\\\ntdll.dll* OR *type\\ c\\:\\\\windows\\\\system32\\\\ntdll.dll* OR *\\\\ntdll.dll\\ >\\ \\\\\\\\.\\\\pipe\\\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.x86matthew.com/view_post?id=ntdll_pipe"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
