{"description": "Detects command that type the content of ntdll.dll to a different file or a pipe in order to evade AV / EDR detection. As seen being used in the POC NtdllPipe", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bbc865e4-7fcd-45a6-8ff1-95ced28ec5b2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NtdllPipe Like Activity Execution", "query": "process.command_line.text:(\"*type\\ %windir%\\\\system32\\\\ntdll.dll*\" OR \"*type\\ %systemroot%\\\\system32\\\\ntdll.dll*\" OR \"*type\\ c\\:\\\\windows\\\\system32\\\\ntdll.dll*\" OR \"*\\\\ntdll.dll\\ >\\ \\\\\\\\.\\\\pipe\\\\*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://web.archive.org/web/20220306121156/https://www.x86matthew.com/view_post?id=ntdll_pipe"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
