{"description": "Looks for changes to registry to disable any write-protect property for storage devices. This could be a precursor to a ransomware attack and has been an observed technique used by cypherpunk group.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c103b1fd-a515-e535-1ca5-1bb6659c8bd8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Write Protect For Storage Disabled", "query": "(process.command_line:*reg\\ add* AND process.command_line:*hklm\\\\system\\\\currentcontrolset\\\\control* AND process.command_line:*write\\ protection* AND process.command_line:*0* AND process.command_line:(*storage* OR *storagedevicepolicies*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Sreeman"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
