{"description": "Detects a suspicious process pattern found in CVE-2021-40444 exploitation", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "894397c6-da03-425c-a589-3d09e7d1f750", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CVE-2021-40444 Process Pattern", "query": "((process.executable:*\\\\control.exe AND process.parent.executable:(*\\\\winword.exe OR *\\\\powerpnt.exe OR *\\\\excel.exe)) AND (NOT (process.command_line:(*\\\\control.exe\\ input.dll OR *\\\\control.exe\\\"\\ input.dll))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444", "https://twitter.com/neonprimetime/status/1435584010202255375", "https://www.joesandbox.com/analysis/476188/1/iochtml"], "timestamp_override": "event.ingested", "author": ["@neonprimetime", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
