{"description": "Adversaries may search the Registry on compromised systems for insecurely stored credentials.\nThe Windows Registry stores configuration information that can be used by the system or other programs.\nAdversaries may query the Registry looking for credentials and passwords that have been stored for use by other programs or services\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Enumeration for Credentials in Registry", "query": "((process.executable:*\\\\reg.exe AND process.command_line:*\\ query\\ * AND process.command_line:*\\/t\\ * AND process.command_line:*REG_SZ* AND process.command_line:*\\/s*) AND ((process.command_line:*\\/f\\ * AND process.command_line:*HKLM*) OR (process.command_line:*\\/f\\ * AND process.command_line:*HKCU*) OR process.command_line:*HKCU\\\\Software\\\\SimonTatham\\\\PuTTY\\\\Sessions*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1552.002/T1552.002.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
