{"description": "Detects suspicious process related to rundll32 based on command line that invokes inline VBScript as seen being used by UNC2452", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6097e924-cb90-3333-7aad-e2f061ea8011", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Rundll32 Invoking Inline VBScript", "query": "(process.command_line:*rundll32.exe* AND process.command_line:*Execute* AND process.command_line:*RegRead* AND process.command_line:*window.close*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
