{"description": "Detects KrbRelayUp used to perform a universal no-fix local privilege escalation in Windows domain environments where LDAP signing is not enforced", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "12827a56-61a4-476a-a9cb-f3068f191073", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - KrbRelayUp Execution", "query": "((((process.executable.text:\"*\\\\KrbRelayUp.exe\") OR (winlog.event_data.OriginalFileName:\"KrbRelayUp.exe\"))) OR ((process.command_line.text:\"*\\ relay\\ *\" AND process.command_line.text:\"*\\ \\-Domain\\ *\" AND process.command_line.text:\"*\\ \\-ComputerName\\ *\")) OR ((process.command_line.text:\"*\\ krbscm\\ *\" AND process.command_line.text:\"*\\ \\-sc\\ *\")) OR ((process.command_line.text:\"*\\ spawn\\ *\" AND process.command_line.text:\"*\\ \\-d\\ *\" AND process.command_line.text:\"*\\ \\-cn\\ *\" AND process.command_line.text:\"*\\ \\-cp\\ *\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Lateral Movement", "T1550", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://github.com/Dec0ne/KrbRelayUp"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
