{"description": "Detects Winword process loading custmom dlls via the '/l' switch.\nWinword can be abused as a LOLBIN to download arbitary file or load arbitary DLLs.\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cb2effdb-45b9-3936-c18b-3066c462558c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Winword LOLBIN Usage", "query": "((process.executable.text:*\\\\WINWORD.exe OR winlog.event_data.OriginalFileName:\"WinWord.exe\") AND process.command_line.text:(*\\/l\\ * OR *.dll* OR *http\\:\\/\\/* OR *https\\:\\/\\/*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/", "https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali", "Victor Sergeev", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
