{"description": "Detects execution of Windows Defender \"OfflineScannerShell.exe\" from its non standard directory.\nThe \"OfflineScannerShell.exe\" binary is vulnerable to DLL side loading and will load any DLL named \"mpclient.dll\" from the current working directory.\n", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "02b18447-ea83-4b1b-8805-714a8a34546a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Mpclient.DLL Sideloading Via OfflineScannerShell.EXE Execution", "query": "(((process.executable:/.*\\\\[Oo][Ff][Ff][Ll][Ii][Nn][Ee][Ss][Cc][Aa][Nn][Nn][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Oo][Ff][Ff][Ll][Ii][Nn][Ee][Ss][Cc][Aa][Nn][Nn][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/)) AND (NOT ((process.working_directory:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Oo][Ff][Ff][Ll][Ii][Nn][Ee]\\\\/) OR (process.working_directory.text:) OR (NOT _exists_:process.working_directory.text))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
