{"description": "Detects when an admin share is mounted using net.exe", "author": ["oscd.community", "Teymur Kheirkhabarov @HeirhabarovT", "Zach Stanford @svch0st", "wagga"], "enabled": false, "false_positives": ["Administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3abd6094-7027-475f-9630-8ab9be7b9725", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Admin Share Mount Via Net.EXE", "query": "(((process.executable.text:(\"*\\\\net.exe\" OR \"*\\\\net1.exe\")) OR (winlog.event_data.OriginalFileName:(\"net.exe\" OR \"net1.exe\"))) AND (process.command_line.text:\"*\\ use\\ *\" AND process.command_line.text:\"*\\ \\\\\\\\\\*\\\\\\*$*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
