{"description": "Detects process creation with a renamed BrowserCore.exe (used to extract Azure tokens)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8a4519e8-e64a-40b6-ae85-ba8ad2177559", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Process Creation with Renamed BrowserCore.exe", "query": "(winlog.event_data.OriginalFileName:\"BrowserCore.exe\" AND (NOT ((process.executable:*\\\\BrowserCore.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1036", "T1528"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/mariuszbit/status/1531631015139102720"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
