{"description": "Detects suspicious mshta process patterns", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b177ca03-5270-1322-3b4e-281b120e5bcf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious MSHTA Process Patterns", "query": "(process.executable:*\\\\mshta.exe AND (((process.parent.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe) OR process.command_line:(*\\\\AppData\\\\Local* OR *C\\:\\\\Windows\\\\Temp* OR *C\\:\\\\Users\\\\Public*)) OR (NOT (process.executable:(*C\\:\\\\Windows\\\\System32* OR *C\\:\\\\Windows\\\\SysWOW64*)))) OR (NOT (process.command_line:(*.htm* OR *.hta*) AND process.command_line:(*mshta.exe OR *mshta)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://en.wikipedia.org/wiki/HTML_Application", "https://www.echotrail.io/insights/search/mshta.exe", "https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
