{"description": "Detects Chafer activity attributed to OilRig as reported in Nyotron report in March 2018", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ce6e34ca-966d-41c9-8d93-5b06c8b97a06", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Chafer Activity", "query": "((process.command_line:*\\\\Service.exe* AND process.command_line:(*i OR *u)) OR (process.command_line:*\\\\microsoft\\\\Taskbar\\\\autoit3.exe OR process.command_line:C\\:\\\\wsc.exe*) OR (process.executable:*\\\\Windows\\\\Temp\\\\DB\\\\* AND process.executable:*.exe) OR (process.command_line:*\\\\nslookup.exe* AND process.command_line:*\\-q\\=TXT* AND process.parent.executable:*\\\\Autoit*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1053", "T1071", "T1112", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Markus Neis", "Jonhnathan Ribeiro", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
