{"description": "Detects launch of the PSEXESVC service, which means that this system was the target of a psexec remote execution", "author": ["Thomas Patzke", "Romaissa Adjailia", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate administrative tasks"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fdfcbd78-48f1-4a4b-90ac-d82241e368c5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PsExec Service Execution", "query": "((process.executable.text:\"C:\\Windows\\PSEXESVC.exe\") OR (winlog.event_data.OriginalFileName:\"psexesvc.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec", "https://www.youtube.com/watch?v=ro2QuZTIMBM"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
