{"description": "Detects the PowerShell command lines with reversed strings", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b6b49cd1-34d6-4ead-b1bf-176e9edba9a4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Cmdline", "query": "((process.executable:*\\\\powershell.exe AND process.command_line:(*hctac* OR *kearb* OR *dnammoc* OR *ekovn* OR *eliFd* OR *rahc* OR *etirw* OR *golon* OR *tninon* OR *eddih* OR *tpircS* OR *ssecorp* OR *llehsrewop* OR *esnopser* OR *daolnwod* OR *tneilCbeW* OR *tneilc* OR *ptth* OR *elifotevas* OR *46esab* OR *htaPpmeTteG* OR *tcejbO* OR *maerts* OR *hcaerof* OR *ekovni* OR *retupmoc*)) AND (NOT ((process.command_line:*\\-EncodedCommand*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://2019.offzone.moscow/ru/report/hunting-for-powershell-abuses/", "https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=66"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov (idea)", "Vasiliy Burov (rule)", "oscd.community", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
