{"description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5ce97677-3375-e1d0-870b-3e917eed3788", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Automated Collection Command Prompt", "query": "(process.command_line:(*.doc* OR *.docx* OR *.xls* OR *.xlsx* OR *.ppt* OR *.pptx* OR *.rtf* OR *.pdf* OR *.txt*) AND ((process.command_line:*dir\\ * AND process.command_line:*\\ \\/b\\ * AND process.command_line:*\\ \\/s\\ *) OR (winlog.event_data.OriginalFileName:\"FINDSTR.EXE\" AND process.command_line:(*\\ \\/e\\ * OR *\\ \\/si\\ *))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1119", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1119", "name": "Automated Collection", "reference": "https://attack.mitre.org/techniques/T1119"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1119/T1119.md", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1552.001/T1552.001.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
