{"description": "Detects Windows command lines that miss a space before or after the /c flag when running a command using the cmd.exe.\nThis could be a sign of obfuscation of a fat finger problem (typo by the developer).\n", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a16980c2-0c56-4de0-9a79-17971979efdd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Cmd.EXE Missing Space Characters Execution Anomaly", "query": "(((process.command_line.text:(\"*cmd.exe\\/c*\" OR \"*\\\\cmd\\/c*\" OR \"*\\\"cmd\\/c*\" OR \"*cmd.exe\\/k*\" OR \"*\\\\cmd\\/k*\" OR \"*\\\"cmd\\/k*\" OR \"*cmd.exe\\/r*\" OR \"*\\\\cmd\\/r*\" OR \"*\\\"cmd\\/r*\")) OR (process.command_line.text:(\"*\\/cwhoami*\" OR \"*\\/cpowershell*\" OR \"*\\/cschtasks*\" OR \"*\\/cbitsadmin*\" OR \"*\\/ccertutil*\" OR \"*\\/kwhoami*\" OR \"*\\/kpowershell*\" OR \"*\\/kschtasks*\" OR \"*\\/kbitsadmin*\" OR \"*\\/kcertutil*\")) OR (process.command_line.text:(\"*cmd.exe\\ \\/c*\" OR \"*cmd\\ \\/c*\" OR \"*cmd.exe\\ \\/k*\" OR \"*cmd\\ \\/k*\" OR \"*cmd.exe\\ \\/r*\" OR \"*cmd\\ \\/r*\"))) AND (NOT ((process.command_line.text:(\"*cmd.exe\\ \\/c\\ *\" OR \"*cmd\\ \\/c\\ *\" OR \"*cmd.exe\\ \\/k\\ *\" OR \"*cmd\\ \\/k\\ *\" OR \"*cmd.exe\\ \\/r\\ *\" OR \"*cmd\\ \\/r\\ *\")) OR (((process.command_line.text:\"*AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\resources\\\\app\\\\node_modules*\") OR (process.command_line.text:\"*cmd.exe\\/c\\ .\") OR (process.command_line.text:\"cmd.exe /c\"))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://twitter.com/cyb3rops/status/1562072617552678912", "https://ss64.com/nt/cmd.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
