{"description": "Detects suspicious launch of the PSEXESVC service on this system and a sub process run as LOCAL_SYSTEM (-s), which means that someone remotely started a command on this system running it with highest privileges and not only the privileges of the login user account (e.g. the administrator account)", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Users that debug Microsoft Intune issues using the commands mentioned in the official documentation; see https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7c0dcd3d-acf8-4f71-9570-f448b0034f94", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PsExec Service Child Process Execution as LOCAL SYSTEM", "query": "(process.parent.executable.text:\"C:\\Windows\\PSEXESVC.exe\" AND user.name:(*AUTHORI* OR *AUTORI*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
