{"description": "Detects the presence of the \"u202+E\" character, which causes a terminal, browser, or operating system to render text in a right-to-left sequence.\nThis is used as an obfuscation and masquerading techniques.\n", "author": ["Micah Babinski", "@micahbabinski"], "enabled": false, "false_positives": ["Commandlines that contains scriptures such as arabic or hebrew might make use of this character"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ad691d92-15f2-4181-9aa4-723c74f9ddc3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Defense Evasion Via Right-to-Left Override", "query": "process.command_line.text:\"*\u202e*\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://redcanary.com/blog/right-to-left-override/", "https://www.malwarebytes.com/blog/news/2014/01/the-rtlo-method", "https://unicode-explorer.com/c/202E"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
