{"description": "Detects the use of HandleKatz, a tool that demonstrates the usage of cloned handles to Lsass in order to create an obfuscated memory dump of the same", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ca621ba5-54ab-4035-9942-d378e6fcde3c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - HandleKatz LSASS Dumper Execution", "query": "(((process.executable.text:\"*\\\\loader.exe\" AND process.command_line.text:\"*\\-\\-pid\\:*\")) OR (((winlog.event_data.Imphash:(\"38d9e015591bbfd4929e0d0f47fa0055\" OR \"0e2216679ca6e1094d63322e3412d650\")) OR (winlog.event_data.Hashes:(\"IMPHASH=38D9E015591BBFD4929E0D0F47FA0055\" OR \"IMPHASH=0E2216679CA6E1094D63322E3412D650\")))) OR ((process.command_line.text:\"*\\-\\-pid\\:*\" AND process.command_line.text:\"*\\-\\-outfile\\:*\" AND process.command_line.text:(\"*.dmp*\" OR \"*lsass*\" OR \"*.obf*\" OR \"*dump*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/codewhitesec/HandleKatz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
