{"description": "Execution of plink to perform data exfiltration and tunneling", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f38ce0b9-5e97-4b47-a211-7dc8d8b871da", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential RDP Tunneling Via SSH Plink", "query": "(((process.executable.text:*\\\\plink.exe AND process.command_line.text:*\\:127.0.0.1\\:3389*)) OR ((process.executable.text:*\\\\plink.exe AND process.command_line.text:*\\:3389* AND process.command_line.text:(*\\ \\-P\\ 443* OR *\\ \\-P\\ 22*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1572"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
