{"description": "Detects a suspicious program execution in a web service root folder (filter out false positives)", "enabled": false, "false_positives": ["Various applications", "Tools that include ping or nslookup command invocations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "35efb964-e6a5-47ad-bbcd-19661854018d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Execution in Webserver Root Folder", "query": "(process.executable:(*\\\\wwwroot\\\\* OR *\\\\wmpub\\\\* OR *\\\\htdocs\\\\*) AND (NOT (process.executable:(*bin\\\\* OR *\\\\Tools\\\\* OR *\\\\SMSComponent\\\\*) AND process.parent.executable:*\\\\services.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
