{"description": "Detects a Powershell process that contains download commands in its command line string", "author": ["Florian Roth", "oscd.community", "Jonhnathan Ribeiro"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3b6ab547-8ec2-4991-b9d2-2b06702a48d7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Download Pattern", "query": "(((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND (process.command_line.text:*new\\-object* AND process.command_line.text:*net.webclient\\).* AND process.command_line.text:*download* AND process.command_line.text:(*string\\(* OR *file\\(*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
