{"description": "Detects specific process characteristics of Winnti Pipemon malware reported by ESET", "enabled": false, "false_positives": ["Legitimate setups that use similar flags"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "73d70463-75c9-4258-92c6-17500fe972f2", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Winnti Pipemon Characteristics", "query": "(process.command_line:*setup0.exe\\ \\-p* OR (process.command_line:*setup.exe* AND process.command_line:(*\\-x\\:0 OR *\\-x\\:1 OR *\\-x\\:2)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
