{"description": "Detects the execution of rundll32 with a command line that doesn't contain a .dll file", "author": ["Tim Shelton", "Florian Roth (Nextron Systems)", "Yassine Oukessou (fix + fp)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c3a99af4-35a9-4668-879e-c09aeb4f2bdf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rundll32 Execution Without DLL File", "query": "(event.category:process AND ((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/)) AND (NOT ((NOT _exists_:process.command_line.text) OR (((process.command_line:/.*\\.[Dd][Ll][Ll].*/) OR (process.command_line.text:\"\"))) OR (process.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Nn][Ee][Tt][Cc][Pp][Ll]\\.[Cc][Pp][Ll]\\,[Cc][Ll][Ee][Aa][Rr][Mm][Yy][Tt][Rr][Aa][Cc][Kk][Ss][Bb][Yy][Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/) OR ((process.parent.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\.[Cc][Pp][Ll].*/)) OR ((process.parent.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\ \\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg].*/)) OR ((process.parent.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\ \\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg].*/)) OR ((process.parent.executable:/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*\\ [Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ss][Pp][Ll][Uu][Nn][Kk][Uu][Nn][Ii][Vv][Ee][Rr][Ss][Aa][Ll][Ff][Oo][Rr][Ww][Aa][Rr][Dd][Ee][Rr]\\\\.*/)) OR (process.command_line:/.*\\ \\-[Ll][Oo][Cc][Aa][Ll][Ss][Ee][Rr][Vv][Ee][Rr]\\ .*/) OR (((process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]\\\"\\ \\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Cc][Aa][Ff][Ee][Ee]\\\\[Mm][Ss][Cc]\\\\[Mm][Cc][Mm][Ss][Cc][Ii][Nn][Ss]\\.[Dd][Ll][Ll]\\\"\\,[Dd][Ll][Ll][Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ff][Uu][Nn][Cc][Tt][Ii][Oo][Nn]\\ .*/) OR (process.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]\\\"\\ \\/[Uu][Nn][Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\ \\/[Ll][Oo][Nn][Gg][Pp][Aa][Tt][Hh]\\ \\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Cc][Aa][Ff][Ee][Ee]\\\\[Mm][Ss][Cc]\\\\[Mm][Ss][Cc][Rr][Ee][Mm]\\.[Ii][Nn][Ff].*/))) OR ((process.parent.executable:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND process.parent.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\\\\\{.*/ AND process.parent.executable:/.*\\\\[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/)) OR ((process.command_line:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Mm][Ss][Ii].*/ AND process.command_line:/.*\\.[Tt][Mm][Pp].*/ AND process.command_line.text:\"*zzzzInvokeManagedCustomActionOutOfProc*\" AND process.command_line:(/.*[Aa][Vv][Ii][Rr][Aa]\\.[Oo][Ee]\\.[Ss][Ee][Tt][Uu][Pp].*/ OR /.*[Ff][Ii][Nn][Dd][Oo][Ll][Dd][Jj][Ee][Tt][Bb][Rr][Aa][Ii][Nn][Ss][Pp][Rr][Oo][Dd][Uu][Cc][Tt].*/))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1481630810495139841?s=12"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
