{"description": "Detects suspicious child process creations of VMware Tools process which may indicate persistence setup", "author": ["bohops", "Bhabesh Raj"], "enabled": false, "false_positives": ["Legitimate use by VM administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5687f942-867b-4578-ade7-1e341c46e99a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "VMToolsd Suspicious Child Process", "query": "((process.parent.executable.text:\"*\\\\vmtoolsd.exe\" AND ((process.executable.text:(\"*\\\\cmd.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\wscript.exe\")) OR (winlog.event_data.OriginalFileName:(\"Cmd.Exe\" OR \"cscript.exe\" OR \"MSHTA.EXE\" OR \"PowerShell.EXE\" OR \"pwsh.dll\" OR \"REGSVR32.EXE\" OR \"RUNDLL32.EXE\" OR \"wscript.exe\")))) AND (NOT (((process.executable.text:\"*\\\\cmd.exe\" AND process.command_line.text:(\"*\\\\VMware\\\\VMware\\ Tools\\\\poweron\\-vm\\-default.bat*\" OR \"*\\\\VMware\\\\VMware\\ Tools\\\\poweroff\\-vm\\-default.bat*\" OR \"*\\\\VMware\\\\VMware\\ Tools\\\\resume\\-vm\\-default.bat*\" OR \"*\\\\VMware\\\\VMware\\ Tools\\\\suspend\\-vm\\-default.bat*\"))) OR ((process.executable.text:\"*\\\\cmd.exe\" AND process.command_line.text:\"\")) OR ((process.executable.text:\"*\\\\cmd.exe\" AND NOT _exists_:process.command_line.text)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/", "https://user-images.githubusercontent.com/61026070/136518004-b68cce7d-f9b8-4e9a-9b7b-53b1568a9a94.png"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
