{"description": "AdFind continues to be seen across majority of breaches. It is used to domain trust discovery to plan out subsequent steps in the attack chain.", "enabled": false, "false_positives": ["Legitimate admin activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9a132afa-654e-11eb-ae93-0242ac130002", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AdFind Usage Detection", "query": "process.command_line.text:(*domainlist* OR *trustdmp* OR *dcmodes* OR *adinfo* OR *\\ dclist\\ * OR *computer_pwdnotreqd* OR *objectcategory\\=* OR *\\-subnets\\ \\-f* OR *name\\=\\\"Domain\\ Admins\\\"* OR *\\-sc\\ u\\:* OR *domainncs* OR *dompol* OR *\\ oudmp\\ * OR *subnetdmp* OR *gpodmp* OR *fspdmp* OR *users_noexpire* OR *computers_active* OR *computers_pwdnotreqd*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1018", "T1069", "T1087", "T1482"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1018", "name": "Remote System Discovery", "reference": "https://attack.mitre.org/techniques/T1018"}, {"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}, {"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}, {"id": "T1482", "name": "Domain Trust Discovery", "reference": "https://attack.mitre.org/techniques/T1482"}]}], "version": 1, "references": ["https://thedfirreport.com/2020/05/08/adfind-recon/", "https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/", "https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/", "https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx", "https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md"], "timestamp_override": "event.ingested", "author": ["Janantha Marasinghe (https://github.com/blueteam0ps)", "FPT.EagleEye Team", "omkar72", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
