{"description": "Detects shell spawned from Java host process, which could be a sign of exploitation (e.g. log4j exploitation)", "enabled": false, "false_positives": ["Legitimate calls to system binaries", "Company specific internal usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7448d59c-fa74-1be8-769d-2c5d756c2490", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Shells Spawned by Java", "query": "((process.parent.executable.text:*\\\\java.exe AND process.executable.text:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe)) AND (NOT (process.parent.executable.text:*build* AND process.command_line.text:*build*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Andreas Hunkeler (@Karneades)", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
