{"description": "Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter ' -ma ' and ' -accepteula' in a single step. This way we're also able to catch cases in which the attacker has renamed the procdump executable.", "enabled": false, "false_positives": ["Another tool that uses the command line switches of Procdump", "Legitimate use of procdump by a developer or administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "03795938-1387-481b-9f4c-3f6241e604fe", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Use of Procdump", "query": "(process.command_line:*\\ \\-ma\\ * AND process.command_line:*\\ \\-accepteula\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["Internal Research"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
