{"description": "Detects use of Cobalt Strike commands accidentally entered in the CMD shell", "author": ["_pete_0", "TheDFIRReport"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "647c7b9e-d784-4fda-b9a0-45c565a7b729", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Operator Bloopers Cobalt Strike Commands", "query": "(((winlog.event_data.OriginalFileName:\"Cmd.Exe\") OR (process.executable.text:\"*\\\\cmd.exe\")) AND (process.command_line.text:(\"cmd\\ *\" OR \"cmd.exe*\" OR \"c\\:\\\\windows\\\\system32\\\\cmd.exe*\") AND process.command_line.text:(\"*psinject*\" OR \"*spawnas*\" OR \"*make_token*\" OR \"*remote\\-exec*\" OR \"*rev2self*\" OR \"*dcsync*\" OR \"*logonpasswords*\" OR \"*execute\\-assembly*\" OR \"*getsystem*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf", "https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/", "https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
