{"description": "Detects suspicious msiexec process starts with web addresses as parameter", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0b834688-7a39-0721-365c-ebe58f7dbf71", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "MsiExec Web Install", "query": "(process.command_line:*\\ msiexec* AND process.command_line:*\\:\\/\\/*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1105", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
