{"description": "Detects suspicious ways to download files or content using PowerShell", "enabled": false, "false_positives": ["Scripts or tools that download files and execute them"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "85b0b087-eddf-4a2b-b033-d771fa2b9775", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Web Download and Execution", "query": "(process.command_line:(*.DownloadString\\(* OR *.DownloadFile\\(*) AND process.command_line:(*IEX\\(* OR *IEX\\ \\(* OR *I`EX* OR *IE`X* OR *I`E`X* OR *\\ |\\ IEX* OR *|IEX\\ * OR *Invoke\\-Execution* OR *;iex\\ $*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/main/Download-Cradles.cmd"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
