{"description": "Detects RunDLL32.exe spawmning explorer.exe as child, which is very uncommon, often observes Gamarue spawning the explorer.exe process in an unusual way", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "32d5a53d-1747-7fbb-cfc3-885be1e4aee8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RunDLL32 Spawmning Explorer", "query": "(process.parent.executable:*\\\\rundll32.exe AND process.executable:*\\\\explorer.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://redcanary.com/blog/intelligence-insights-november-2021/"], "timestamp_override": "event.ingested", "author": ["elhoim"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
