{"description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image based detection", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Software Installers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use NTFS Short Name in Image", "query": "((process.executable.text:(\"*\\~1.bat*\" OR \"*\\~1.dll*\" OR \"*\\~1.exe*\" OR \"*\\~1.hta*\" OR \"*\\~1.js*\" OR \"*\\~1.msi*\" OR \"*\\~1.ps1*\" OR \"*\\~1.tmp*\" OR \"*\\~1.vbe*\" OR \"*\\~1.vbs*\" OR \"*\\~2.bat*\" OR \"*\\~2.dll*\" OR \"*\\~2.exe*\" OR \"*\\~2.hta*\" OR \"*\\~2.js*\" OR \"*\\~2.msi*\" OR \"*\\~2.ps1*\" OR \"*\\~2.tmp*\" OR \"*\\~2.vbe*\" OR \"*\\~2.vbs*\") AND (NOT process.parent.executable.text:\"C:\\Windows\\explorer.exe\")) AND (NOT ((process.parent.executable.text:\"*\\\\WebEx\\\\WebexHost.exe\") OR (process.parent.executable.text:\"*\\\\thor\\\\thor64.exe\") OR (process.executable.text:\"C:\\PROGRA~1\\WinZip\\WZPREL~1.EXE\") OR (process.executable.text:\"*\\\\VCREDI\\~1.EXE\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN", "https://twitter.com/jonasLyk/status/1555914501802921984"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
