{"description": "Detects suspicious inline VBScript keywords as used by UNC2452", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "acfad308-dc49-6fad-1a44-c41bbc6b8ef3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious VBScript UN2452 Pattern", "query": "((process.command_line:*Execute* AND process.command_line:*CreateObject* AND process.command_line:*RegRead* AND process.command_line:*window.close* AND process.command_line:*\\\\Microsoft\\\\Windows\\\\CurrentVersion*) AND (NOT (process.command_line:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
