{"description": "Detects usage of the \"Import-Module\" cmdlet to load the \"Microsoft.ActiveDirectory.Management.dl\" DLL. Which is often used by attackers to perform AD enumeration.", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate use of the library for administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "48832de7-3af5-952a-987b-3e138119ce94", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Active Directory Enumeration Using AD Module - ProcCreation", "query": "(((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:(*Import\\-Module\\ * OR *ipmo\\ *) AND process.command_line.text:*Microsoft.ActiveDirectory.Management.dll*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/samratashok/ADModule", "https://twitter.com/cyb3rops/status/1617108657166061568?s=20", "https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/active-directory-enumeration-with-ad-module-without-rsat-or-admin-privileges"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
