{"description": "Detects commands that temporarily turn off Volume Snapshots", "enabled": false, "false_positives": ["Legitimate administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc17c1fa-dfca-30d4-f8f4-c4668c3a82e6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disabled Volume Snapshots", "query": "(process.command_line.text:*reg* AND process.command_line.text:*\\ add\\ * AND process.command_line.text:*\\\\Services\\\\VSS\\\\Diag* AND process.command_line.text:*\\/d\\ Disabled*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/0gtweet/status/1354766164166115331"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
