{"description": "Detects potentially suspicious CommandLine of electron apps (teams, discord, slack, etc.). This could be a sign of abuse to proxy execution through a signed binary.", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage for debugging purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "378a05d8-963c-46c9-bcce-13c7657eac99", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Electron Application CommandLine", "query": "(event.category:process AND process.executable:(/.*\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Oo][Dd][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Ii][Tt][Hh][Uu][Bb][Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Kk][Ee][Yy][Bb][Aa][Ss][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ll][Aa][Cc][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/) AND process.command_line:(/.*\\-\\-[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\-[Ss][Uu][Bb][Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\-[Pp][Aa][Tt][Hh].*/ OR /.*\\-\\-[Gg][Pp][Uu]\\-[Ll][Aa][Uu][Nn][Cc][Hh][Ee][Rr].*/ OR /.*\\-\\-[Rr][Ee][Nn][Dd][Ee][Rr][Ee][Rr]\\-[Cc][Mm][Dd]\\-[Pp][Rr][Ee][Ff][Ii][Xx].*/ OR /.*\\-\\-[Uu][Tt][Ii][Ll][Ii][Tt][Yy]\\-[Cc][Mm][Dd]\\-[Pp][Rr][Ee][Ff][Ii][Xx].*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://positive.security/blog/ms-officecmd-rce", "https://lolbas-project.github.io/lolbas/Binaries/Teams/", "https://lolbas-project.github.io/lolbas/Binaries/Msedge/", "https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/", "https://medium.com/@MalFuzzer/one-electron-to-rule-them-all-dc2e9b263daf", "https://chromium.googlesource.com/chromium/chromium/+/master/content/public/common/content_switches.cc"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
