{"description": "Threat actors performed dumping of SAM, SECURITY and SYSTEM registry hives using DelegateExecute key", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dd3ee8cc-f751-41c9-ba53-5a32ed47e563", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Reg Add Open Command", "query": "(process.command_line:*reg* AND ((process.command_line:*add* AND process.command_line:*hkcu\\\\software\\\\classes\\\\ms\\-settings\\\\shell\\\\open\\\\command* AND process.command_line:*\\/ve\\ * AND process.command_line:*\\/d*) OR (process.command_line:*add* AND process.command_line:*hkcu\\\\software\\\\classes\\\\ms\\-settings\\\\shell\\\\open\\\\command* AND process.command_line:*\\/v* AND process.command_line:*DelegateExecute*) OR (process.command_line:*delete* AND process.command_line:*hkcu\\\\software\\\\classes\\\\ms\\-settings*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/12/13/diavol-ransomware/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
