{"description": "The FSharp Interpreters, FsiAnyCpu.exe and FSi.exe, can be used for AWL bypass and is listed in Microsoft recommended block rules.", "enabled": false, "false_positives": ["Legitimate use by a software developer."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b96b2031-7c17-4473-afe7-a30ce714db29", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of FSharp Interpreters", "query": "(process.executable:*\\\\fsianycpu.exe OR winlog.event_data.OriginalFileName:\"fsianycpu.exe\" OR process.executable:*\\\\fsi.exe OR winlog.event_data.OriginalFileName:\"fsi.exe\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules", "https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/", "https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/", "https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/"], "timestamp_override": "event.ingested", "author": ["Christopher Peacock @SecurePeacock", "SCYTHE @scythe_io"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
