{"description": "Detects execution of the Notepad++ updater in a suspicious directory, which is often used in DLL side-loading attacks", "enabled": false, "false_positives": ["Execution of tools named GUP.exe and located in folders different than Notepad++\\updater"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0a4f6091-223b-41f6-8743-f322ec84930b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious GUP Usage", "query": "(process.executable:*\\\\GUP.exe AND (NOT (process.executable:(*\\\\Users\\\\*\\\\AppData\\\\Local\\\\Notepad\\+\\+\\\\updater\\\\GUP.exe OR *\\\\Users\\\\*\\\\AppData\\\\Roaming\\\\Notepad\\+\\+\\\\updater\\\\GUP.exe OR *\\\\Program\\ Files\\\\Notepad\\+\\+\\\\updater\\\\GUP.exe OR *\\\\Program\\ Files\\ \\(x86\\)\\\\Notepad\\+\\+\\\\updater\\\\GUP.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
