{"description": "Execution of a renamed version of the Plink binary", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1c12727d-02bf-45ff-a9f3-d49806a3cf43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution Of Renamed Plink Binary", "query": "((winlog.event_data.OriginalFileName:\"Plink\" OR (process.command_line.text:*\\ \\-l\\ forward* AND process.command_line.text:*\\ \\-P\\ * AND process.command_line.text:*\\ \\-R\\ *)) AND (NOT (process.executable.text:*\\\\plink.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/", "https://the.earth.li/~sgtatham/putty/0.58/htmldoc/Chapter7.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
