{"description": "Detects execution of \"findstr\" as a child process of potentially suspicious parent command lines. This is often the case when \"findstr\" is used to filter out the results of certain reconnaissance commands such as \"tasklist\" or \"ipconfig /all\"", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ccb5742c-c248-4982-8c5c-5571b9275ad3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Findstr.EXE Execution", "query": "(((process.executable:/.*\\\\\\\\[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Ff][Ii][Nn][Dd][Ss][Tt][Rr]\\.[Ee][Xx][Ee]/)) AND process.parent.command_line:(/.*[Ii][Pp][Cc][Oo][Nn][Ff][Ii][Gg]\\ .*/ OR *tasklist*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1057"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1057", "name": "Process Discovery", "reference": "https://attack.mitre.org/techniques/T1057"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/02cb591f75064ffe1e0df9ac3ed5972a2e491c97/atomics/T1057/T1057.md#atomic-test-6---discover-specific-process---tasklist"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
