{"description": "Detects when GfxDownloadWrapper.exe downloads file from non standard URL", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "eee00933-a761-4cd0-be70-c42fe91731e7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "GfxDownloadWrapper.exe Downloads File from Suspicious URL", "query": "((process.executable:*\\\\GfxDownloadWrapper.exe AND (NOT (process.command_line:*gameplayapi.intel.com*))) AND (NOT (process.parent.executable:*\\\\GfxDownloadWrapper.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/GfxDownloadWrapper.yml"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
