{"description": "Detects the stopping of a Windows service", "author": ["Jakob Weinzettl", "oscd.community", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["There are many legitimate reasons to stop a service. This rule isn't looking for any suspicious behaviour in particular. Filter legitimate activity accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c49c5062-0966-4170-9efd-9968c913a6cf", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Stop Windows Service Via PowerShell Stop-Service", "query": "(((winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\")) OR (process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\"))) AND process.command_line.text:\"*Stop\\-Service\\ *\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1489"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1489", "name": "Service Stop", "reference": "https://attack.mitre.org/techniques/T1489"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
