{"description": "Detects the execution of Radmin which can be abused by an adversary to remotely control Windows machines", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5817e76f-4804-41e6-8f1d-5fa0b3ecae2d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - Radmin Viewer Utility Execution", "query": "((winlog.event_data.Description:\"Radmin Viewer\") OR (Product:\"Radmin Viewer\") OR (winlog.event_data.OriginalFileName:\"Radmin.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1072"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1072", "name": "Software Deployment Tools", "reference": "https://attack.mitre.org/techniques/T1072"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1072", "name": "Software Deployment Tools", "reference": "https://attack.mitre.org/techniques/T1072"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1072/T1072.md", "https://www.radmin.fr/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
