{"description": "Detects usage of bitsadmin downloading a file", "author": ["Michael Haag", "FPT.EagleEye"], "enabled": false, "false_positives": ["Some legitimate apps use this, but limited."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d059842b-6b9d-4ed1-b5c3-5b89143c6ede", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File Download Via Bitsadmin", "query": "(((process.executable.text:\"*\\\\bitsadmin.exe\") OR (winlog.event_data.OriginalFileName:\"bitsadmin.exe\")) AND ((process.command_line.text:\"*\\ \\/transfer\\ *\") OR ((process.command_line.text:(\"*\\ \\/create\\ *\" OR \"*\\ \\/addfile\\ *\") AND process.command_line.text:\"*http*\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
