{"description": "Detects the execution of a renamed binary often used by attackers or malware leveraging new Sysmon OriginalFileName datapoint.", "author": ["Matthew Green - @mgreen27", "Ecco", "James Pemberton / @4A616D6573", "oscd.community (improvements)", "Andreas Hunkeler (@Karneades)"], "enabled": false, "false_positives": ["Custom applications use renamed binaries adding slight change to binary name. Typically this is easy to spot and add to whitelist", "PsExec installed via Windows Store doesn't contain original filename field (False negative)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "36480ae1-a1cb-4eaa-a0d6-29801d7e9142", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Defense Evasion Via Binary Rename", "query": "(winlog.event_data.OriginalFileName:(\"Cmd.Exe\" OR \"CONHOST.EXE\" OR \"7z.exe\" OR \"WinRAR.exe\" OR \"wevtutil.exe\" OR \"net.exe\" OR \"net1.exe\" OR \"netsh.exe\" OR \"InstallUtil.exe\") AND (NOT process.executable.text:(*\\\\cmd.exe OR *\\\\conhost.exe OR *\\\\7z.exe OR *\\\\WinRAR.exe OR *\\\\wevtutil.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\netsh.exe OR *\\\\InstallUtil.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html", "https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
