{"description": "Detects uninstallation or termination of security products using the WMIC utility", "enabled": false, "false_positives": ["Legitimate administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b08b736e-acdf-200b-5ff6-a53d5c69b0a6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Wmic Uninstall Security Product", "query": "(process.command_line.text:*wmic* AND ((process.command_line.text:*product\\ where\\ * AND process.command_line.text:*call\\ uninstall* AND process.command_line.text:*\\/nointeractive*) OR (process.command_line.text:*caption\\ like\\ * AND process.command_line.text:(*call\\ delete* OR *call\\ terminate*))) AND process.command_line.text:(*Antivirus* OR *AVG\\ * OR *Crowdstrike\\ Sensor* OR *DLP\\ Endpoint* OR *Endpoint\\ Detection* OR *Endpoint\\ Protection* OR *Endpoint\\ Security* OR *Endpoint\\ Sensor* OR *ESET\\ File\\ Security* OR *Malwarebytes* OR *McAfee\\ Agent* OR *Microsoft\\ Security\\ Client* OR *Threat\\ Protection* OR *VirusScan* OR *Webroot\\ SecureAnywhere* OR *Windows\\ Defender* OR *CarbonBlack* OR *Carbon\\ Black* OR *Cb\\ Defense\\ Sensor\\ 64\\-bit* OR *Dell\\ Threat\\ Defense* OR *Cylance\\ * OR *LogRhythm\\ System\\ Monitor\\ Service* OR *Sophos\\ Anti\\-Virus* OR *Sophos\\ AutoUpdate* OR *Sophos\\ Management\\ Console* OR *Sophos\\ Management\\ Database* OR *Sophos\\ Credential\\ Store* OR *Sophos\\ Update\\ Manager* OR *Sophos\\ Management\\ Server* OR *Sophos\\ Remote\\ Management\\ System* OR *%Sophos%* OR *%carbon%* OR *%cylance%* OR *%eset%* OR *%symantec%*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/cglyer/status/1355171195654709249", "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions", "https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
