{"description": "Detects execution of the AgentExecutor.exe binary. Which can be abused as a LOLBIN to execute powershell scripts with the ExecutionPolicy \"Bypass\" or any binary named \"powershell.exe\" located in the path provided by 6th postiional argument", "author": ["Nasreddine Bencherchali", "memory-shards"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c0b40568-b1e9-4b03-8d6c-b096da6da9ab", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious AgentExecutor PowerShell Execution", "query": "((((process.executable.text:*\\\\AgentExecutor.exe) OR (winlog.event_data.OriginalFileName:\"AgentExecutor.exe\")) AND process.command_line.text:(*\\ \\-powershell* OR *\\ \\-remediationScript*)) AND (NOT (process.command_line.text:(*C\\:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\* OR *C\\:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/lefterispan/status/1286259016436514816", "https://lolbas-project.github.io/lolbas/OtherMSBinaries/Agentexecutor/", "https://docs.microsoft.com/en-us/mem/intune/apps/intune-management-extension", "https://twitter.com/jseerden/status/1247985304667066373/photo/1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
