{"description": "Detects a Windows program executable started from a suspicious folder", "author": ["Florian Roth", "Patrick Bareiss", "Anton Kutepov", "oscd.community", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Exotic software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "648b6836-1fa2-5d13-a642-d91fa40615ae", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "System File Execution Location Anomaly", "query": "(process.executable.text:(*\\\\svchost.exe OR *\\\\rundll32.exe OR *\\\\services.exe OR *\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\pwsh.exe OR *\\\\regsvr32.exe OR *\\\\spoolsv.exe OR *\\\\lsass.exe OR *\\\\smss.exe OR *\\\\csrss.exe OR *\\\\conhost.exe OR *\\\\wininit.exe OR *\\\\lsm.exe OR *\\\\winlogon.exe OR *\\\\explorer.exe OR *\\\\taskhost.exe OR *\\\\Taskmgr.exe OR *\\\\sihost.exe OR *\\\\RuntimeBroker.exe OR *\\\\smartscreen.exe OR *\\\\dllhost.exe OR *\\\\audiodg.exe OR *\\\\wlanext.exe OR *\\\\dashost.exe OR *\\\\schtasks.exe OR *\\\\cscript.exe OR *\\\\wscript.exe OR *\\\\wsl.exe OR *\\\\bitsadmin.exe OR *\\\\atbroker.exe OR *\\\\bcdedit.exe OR *\\\\certutil.exe OR *\\\\certreq.exe OR *\\\\cmstp.exe OR *\\\\consent.exe OR *\\\\defrag.exe OR *\\\\dism.exe OR *\\\\dllhst3g.exe OR *\\\\eventvwr.exe OR *\\\\msiexec.exe OR *\\\\runonce.exe OR *\\\\winver.exe OR *\\\\logonui.exe OR *\\\\userinit.exe OR *\\\\dwm.exe OR *\\\\LsaIso.exe OR *\\\\ntoskrnl.exe OR *\\\\wsmprovhost.exe OR *\\\\dfrgui.exe) AND (NOT ((((process.executable.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\*)) OR (process.executable.text:*\\\\SystemRoot\\\\System32\\\\*) OR (process.executable.text:(\"C:\\Windows\\explorer.exe\" OR \"C:\\Program Files\\PowerShell\\7\\pwsh.exe\")))) OR ((process.executable.text:C\\:\\\\Program\\ Files\\\\WindowsApps\\\\MicrosoftCorporationII.WindowsSubsystemForLinux* AND process.executable.text:*\\\\wsl.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/GelosSnake/status/934900723426439170", "https://asec.ahnlab.com/en/39828/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
