{"description": "Detects when when a mounted share is removed. Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation", "author": ["oscd.community", "@redcanary", "Zach Stanford @svch0st"], "enabled": false, "false_positives": ["Administrators or Power users may remove their shares via cmd line"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cb7c4a03-2871-43c0-9bbb-18bbdb079896", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Unmount Share Via Net.EXE", "query": "(((process.executable.text:(\"*\\\\net.exe\" OR \"*\\\\net1.exe\")) OR (winlog.event_data.OriginalFileName:(\"net.exe\" OR \"net1.exe\"))) AND (process.command_line.text:\"*share*\" AND process.command_line.text:\"*\\/delete*\"))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
