{"description": "One way Qbot steals sensitive information is by extracting browser data from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe", "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6a69f62d-ce75-4b57-8dce-6351eb55b362", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Esentutl Steals Browser Information", "query": "((process.executable.text:*\\\\esentutl.exe OR winlog.event_data.OriginalFileName:\"esentutl.exe\") AND process.command_line.text:(*\\/r* OR *\\-r*) AND process.command_line.text:*\\\\Windows\\\\WebCache*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1005"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1005", "name": "Data from Local System", "reference": "https://attack.mitre.org/techniques/T1005"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/", "https://redcanary.com/threat-detection-report/threats/qbot/", "https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
