{"description": "Detects the Installation of a Exchange Transport Agent", "enabled": false, "false_positives": ["Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator for this."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6be9502c-e9aa-0d4d-3979-01ebb51220a6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "MSExchange Transport Agent Installation", "query": "process.command_line.text:*Install\\-TransportAgent*", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://twitter.com/blueteamsec1/status/1401290874202382336?s=20"], "timestamp_override": "event.ingested", "author": ["Tobias Michalski"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
