{"description": "Detect use of TruffleSnout.exe", "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c0728679-223d-a96f-fe13-71d72a75ad5f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Launch TruffleSnout Executable", "query": "(winlog.event_data.OriginalFileName:\"TruffleSnout.exe\" OR process.executable.text:*\\\\TruffleSnout.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1482"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1482", "name": "Domain Trust Discovery", "reference": "https://attack.mitre.org/techniques/T1482"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md", "https://github.com/dsnezhkov/TruffleSnout"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
