{"description": "Detects the creation of a scheduled task using the \"-XML\" flag with a file without the '.xml' extension. This behavior could be indicative of potential defense evasion attempt during persistence", "author": ["Swachchhanda Shrawan Poudel", "Elastic (idea)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Scheduled Task Creation via Masqueraded XML File", "query": "(((((process.executable.text:\"*\\\\schtasks.exe\") OR (winlog.event_data.OriginalFileName:\"schtasks.exe\")) AND process.command_line.text:(\"*\\/create*\" OR \"*\\-create*\") AND process.command_line.text:(\"*\\/xml*\" OR \"*\\-xml*\")) AND (NOT ((process.command_line.text:\"*.xml*\") OR (IntegrityLevel:\"System\") OR ((process.parent.executable.text:\"*\\\\rundll32.exe\" AND process.parent.command_line.text:\"*\\:\\\\WINDOWS\\\\Installer\\\\MSI*\" AND process.parent.command_line.text:\"*.tmp,zzzzInvokeManagedCustomActionOutOfProc*\"))))) AND (NOT process.parent.executable.text:(\"*\\:\\\\ProgramData\\\\OEM\\\\UpgradeTool\\\\CareCenter_\\*\\\\BUnzip\\\\Setup_msi.exe\" OR \"*\\:\\\\Program\\ Files\\\\Axis\\ Communications\\\\AXIS\\ Camera\\ Station\\\\SetupActions.exe\" OR \"*\\:\\\\Program\\ Files\\\\Axis\\ Communications\\\\AXIS\\ Device\\ Manager\\\\AdmSetupActions.exe\" OR \"*\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Zemana\\\\AntiMalware\\\\AntiMalware.exe\" OR \"*\\:\\\\Program\\ Files\\\\Dell\\\\SupportAssist\\\\pcdrcui.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/win32/taskschd/daily-trigger-example--xml-", "https://github.com/elastic/protections-artifacts/blob/084067123d3328a823b1c3fdde305b694275c794/behavior/rules/persistence_suspicious_scheduled_task_creation_via_masqueraded_xml_file.toml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
