{"description": "Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' calls", "author": ["pH-T (Nextron Systems)", "Harjot Singh", "@cyb3rjy0t"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6385697e-9f1b-40bd-8817-f4a91f40508e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Base64 Encoded Invoke Keyword", "query": "(((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:\"*\\ \\-e*\" AND process.command_line.text:(\"*SQBuAHYAbwBrAGUALQ*\" OR \"*kAbgB2AG8AawBlAC0A*\" OR \"*JAG4AdgBvAGsAZQAtA*\" OR \"*SW52b2tlL*\" OR \"*ludm9rZS*\" OR \"*JbnZva2Ut*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
