{"description": "Detects a whoami.exe executed by LOCAL SYSTEM. This may be a sign of a successful local privilege escalation.", "enabled": false, "false_positives": ["Possible name overlap with NT AUHTORITY substring to cover all languages"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f331fd13-c398-43c3-5483-999fb8b2ff06", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Run Whoami as SYSTEM", "query": "(user.name:(*AUTHORI* OR *AUTORI*) AND process.executable:*\\\\whoami.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1033"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1033", "name": "System Owner/User Discovery", "reference": "https://attack.mitre.org/techniques/T1033"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
