{"description": "Detects the execution of \"ldifde.exe\" in order to export organizational Active Directory structure.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4f7a6757-ff79-46db-9687-66501a02d9ec", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Active Directory Structure Export Via Ldifde.EXE", "query": "((((process.executable.text:\"*\\\\ldifde.exe\") OR (winlog.event_data.OriginalFileName:\"ldifde.exe\")) AND process.command_line.text:\"*\\-f*\") AND (NOT process.command_line.text:\"*\\ \\-i*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit", "https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html", "https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
