{"description": "Detects audio capture via PowerShell Cmdlet.", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate audio capture by legitimate user."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "932fb0d8-692b-4b0f-a26e-5643a50fe7d6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Audio Capture via PowerShell", "query": "process.command_line.text:(\"*WindowsAudioDevice\\-Powershell\\-Cmdlet*\" OR \"*Toggle\\-AudioDevice*\" OR \"*Get\\-AudioDevice\\ *\" OR \"*Set\\-AudioDevice\\ *\" OR \"*Write\\-AudioDevice\\ *\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1123"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1123", "name": "Audio Capture", "reference": "https://attack.mitre.org/techniques/T1123"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1123/T1123.md", "https://eqllib.readthedocs.io/en/latest/analytics/ab7a6ef4-0983-4275-a4f1-5c6bd3c31c23.html", "https://github.com/frgnca/AudioDeviceCmdlets"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
