{"description": "Detects the creation of a symbolic link between \"cmd.exe\" and the accessibility on-screen keyboard binary (osk.exe) using \"mklink\". This technique provides an elevated command prompt to the user from the login screen without the need to log in.", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f73ec748-0584-1896-dd04-9998612255d6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Privilege Escalation Using Symlink Between Osk and Cmd", "query": "(((process.executable.text:*\\\\cmd.exe) OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND (process.command_line.text:*mklink* AND process.command_line.text:*\\\\osk.exe* AND process.command_line.text:*\\\\cmd.exe*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1546"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1546.008/T1546.008.md", "https://ss64.com/nt/mklink.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
