{"description": "Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.", "enabled": false, "false_positives": ["App-V clients"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fbd7c32d-db2a-4418-b92c-566eb8911133", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "SyncAppvPublishingServer Execute Arbitrary PowerShell Code", "query": "(process.executable:*\\\\SyncAppvPublishingServer.exe AND process.command_line:*\\\"n;\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md", "https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
