{"description": "Detects shell spawn from Java host process, which could a maintenance task or some kind of exploitation (e.g. log4j exploitation)", "enabled": false, "false_positives": ["Legitimate calls to system binaries", "Company specific internal usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Shells Spawn by Java", "query": "((process.parent.executable:*\\\\java.exe AND process.executable:*\\\\cmd.exe) AND (NOT (process.parent.executable:*build* AND process.command_line:*build*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
