{"description": "Detects Stracciatella which executes a Powershell runspace from within C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled based on PE metadata characteristics.", "author": ["pH-T (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7a4d9232-92fc-404d-8ce1-4c92e7caf539", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Stracciatella Execution", "query": "((process.executable.text:\"*\\\\Stracciatella.exe\") OR (winlog.event_data.OriginalFileName:\"Stracciatella.exe\") OR (winlog.event_data.Description:\"Stracciatella\") OR (winlog.event_data.Hashes:(*SHA256\\=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956* OR *SHA256\\=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a*)) OR (sha256:(\"9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956\" OR \"fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/mgeeky/Stracciatella"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
