{"description": "Detects a suspicious curl process start on Windows and outputs the requested document to a local file", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bdd97c33-6005-b44a-8841-5762daf05012", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Curl Usage on Windows", "query": "(((process.executable.text:*\\\\curl.exe OR Product:\"The\\ curl\\ executable\") AND (process.command_line.text:(*\\\\AppData\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Temp\\\\* OR *%AppData%* OR *%Temp%* OR *%tmp%* OR *%Public%* OR *\\\\Desktop\\\\*) OR process.command_line.text:(*.jpg OR *.jpeg OR *.png OR *.gif OR *.tmp OR *.temp OR *.txt) OR process.command_line.text:(*\\ \\-O* OR *\\-\\-remote\\-name* OR *\\-\\-output*))) AND (NOT ((process.parent.executable.text:\"C\\:\\\\Program\\ Files\\\\Git\\\\usr\\\\bin\\\\sh.exe\" AND process.parent.command_line.text:*git\\-update\\-git\\-for\\-windows* AND process.parent.command_line.text:*\\-\\-quiet\\ \\-\\-gui* AND process.executable.text:\"C\\:\\\\Program\\ Files\\\\Git\\\\mingw64\\\\bin\\\\curl.exe\" AND process.command_line.text:*\\-\\-silent\\ \\-\\-show\\-error\\ \\-\\-output\\ * AND process.command_line.text:*gfw\\-httpget\\-*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/max_mal_/status/1542461200797163522", "https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464", "https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt", "https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali (updated)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
