{"description": "Detects execution of a renamed autohotkey.exe binary based on PE metadata fields", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "53786ef2-4067-dbd4-548d-cf65c1f9ed70", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Renamed AutoHotkey.EXE Execution", "query": "(((Product:*AutoHotkey*) OR (winlog.event_data.Description:*AutoHotkey*) OR (winlog.event_data.OriginalFileName:(\"AutoHotkey.exe\" OR \"AutoHotkey.rc\"))) AND (NOT ((process.executable.text:(*\\\\AutoHotkey.exe OR *\\\\AutoHotkey32.exe OR *\\\\AutoHotkey32_UIA.exe OR *\\\\AutoHotkey64.exe OR *\\\\AutoHotkey64_UIA.exe OR *\\\\AutoHotkeyA32.exe OR *\\\\AutoHotkeyA32_UIA.exe OR *\\\\AutoHotkeyU32.exe OR *\\\\AutoHotkeyU32_UIA.exe OR *\\\\AutoHotkeyU64.exe OR *\\\\AutoHotkeyU64_UIA.exe)) OR (process.executable.text:*\\\\AutoHotkey*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.autohotkey.com/download/", "https://thedfirreport.com/2023/02/06/collect-exfiltrate-sleep-repeat/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
