{"description": "Threat actors can use auditpol binary to change audit policy configuration to impair detection capability. This can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor.", "enabled": false, "false_positives": ["Admin activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9dd37f1e-0fdf-a178-36d5-39738085214b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Auditpol Usage", "query": "(process.executable.text:*\\\\auditpol.exe AND process.command_line.text:(*disable* OR *clear* OR *remove* OR *restore*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/"], "timestamp_override": "event.ingested", "author": ["Janantha Marasinghe (https://github.com/blueteam0ps)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
