{"description": "Detects port forwarding activity via SSH.exe", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Administrative activity using a remote port forwarding to a local port"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "327f48c1-a6db-4eb8-875a-f6981f1b0183", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Port Forwarding Activity Via SSH.EXE", "query": "(event.category:process AND process.executable:/.*\\\\[Ss][Ss][Hh]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\-[Rr]\\ .*/ OR /.*\\ \\/[Rr]\\ .*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1021", "T1021", "T1572"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}, {"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
