{"description": "Detects the use of Rundll32 to launch an NSIS module that serves as the main stealer capability of Rhadamanthys infostealer, as observed in reports and samples in early 2023", "author": ["TropChaud"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5cdbc2e8-86dd-43df-9a1a-200d4745fba5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rhadamanthys Stealer Module Launch via Rundll32", "query": "(((winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\") OR (process.executable.text:*\\\\rundll32.exe)) AND process.command_line.text:*nsis_uns* AND process.command_line.text:*PrintUIEntry*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://elis531989.medium.com/dancing-with-shellcodes-analyzing-rhadamanthys-stealer-3c4986966a88", "https://blog.cyble.com/2023/01/12/rhadamanthys-new-stealer-spreading-through-google-ads/", "https://www.joesandbox.com/analysis/790122/0/html", "https://twitter.com/anfam17/status/1607477672057208835"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
