{"description": "Checks whether the image specified in a process creation event doesn't refer to an .exe file (caused by process ghosting or other unorthodox methods to start a process)", "author": ["Max Altgelt (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c09dad97-1c78-4f71-b127-7edb2b8e491a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution of Suspicious File Type Extension", "query": "(((NOT process.executable:(/.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Tt][Mm][Pp]/ OR /.*\\.[Ss][Cc][Rr]/)) AND (NOT ((process.executable.text:(System OR Registry OR MemCompression OR vmmem)) OR (process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\\\\\[Mm][Ss][Ii].*/) OR (process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss][Tt][Oo][Rr][Ee]\\\\\\\\[Ff][Ii][Ll][Ee][Rr][Ee][Pp][Oo][Ss][Ii][Tt][Oo][Rr][Yy]\\\\\\\\.*/) OR ((process.executable:/[Cc]\\:\\\\\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\.[Mm][Ss][Ii]\\\\\\\\.*/ AND process.executable:(/.*\\.[Rr][Bb][Ff]/ OR /.*\\.[Rr][Bb][Ss]/))) OR ((process.parent.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/ AND process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\[Hh][Ee][Ll][Pp][Ee][Rr]\\\\\\\\.*/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\\\\\.*/) AND process.executable:/.*\\.[Cc][Oo][Mm]/)) OR (process.executable:/[Cc]\\:\\\\\\\\$[Ee][Xx][Tt][Ee][Nn][Dd]\\\\\\\\$[Dd][Ee][Ll][Ee][Tt][Ee][Dd]\\\\\\\\.*/)))) AND (NOT ((process.executable:(/\\-/ OR )) OR (NOT _exists_:process.executable.text) OR (process.parent.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\\\\\[Aa][Vv][Ii][Rr][Aa]\\\\\\\\.*/) OR ((process.executable:/.*[Nn][Vv][Ii][Dd][Ii][Aa]\\\\\\\\[Nn][Vv][Bb][Aa][Cc][Kk][Ee][Nn][Dd]\\\\\\\\.*/ AND process.executable:/.*\\.[Dd][Aa][Tt]/)) OR (process.executable:/.*\\\\\\\\[Ww][Ii][Nn][Ss][Cc][Pp]\\.[Cc][Oo][Mm]/) OR (process.executable:/.*[Cc]\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\.*/ AND process.executable:/.*\\.[Tt][Mm][Pp].*/ AND process.executable.text:*CodeSetup*) OR (process.executable:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\\\\\\\[Ss][Oo][Ff][Ff][Ii][Cc][Ee]\\.[Bb][Ii][Nn]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ee][Mm][Cc]\\ [Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ee][Rr]\\\\\\\\[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\\\\\\\[Gg][Ss][Tt]\\\\\\\\[Aa][Pp][Aa][Cc][Hh][Ee]\\\\\\\\[Cc][Gg][Ii]\\-[Bb][Ii][Nn]\\\\\\\\[Uu][Pp][Dd][Aa][Tt][Ee]_[Jj][Nn][Ll][Pp]\\.[Cc][Gg][Ii]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ee][Mm][Cc]\\ [Nn][Ee][Tt][Ww][Oo][Rr][Kk][Ee][Rr]\\\\\\\\[Mm][Aa][Nn][Aa][Gg][Ee][Mm][Ee][Nn][Tt]\\\\\\\\[Gg][Ss][Tt]\\\\\\\\[Aa][Pp][Aa][Cc][Hh][Ee]\\\\\\\\[Cc][Gg][Ii]\\-[Bb][Ii][Nn]\\\\\\\\[Uu][Pp][Dd][Aa][Tt][Ee]_[Jj][Nn][Ll][Pp]\\.[Cc][Gg][Ii]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ww][Ii][Nn][Pp][Aa][Kk][Pp][Rr][Oo]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ww][Ii][Nn][Pp][Aa][Kk][Pp][Rr][Oo]\\\\\\\\.*/) AND process.executable:/.*\\.[Nn][Gg][Nn]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Yy][Qq]\\\\\\\\[Ss][Ee][Rr][Vv][Ee][Rr]\\\\\\\\[Pp][Cc][Ll][Tt][Oo][Oo][Ll]\\.[Dd][Ll][Ll]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Yy][Qq]\\\\\\\\[Ss][Ee][Rr][Vv][Ee][Rr]\\\\\\\\[Pp][Cc][Ll][Tt][Oo][Oo][Ll]\\.[Dd][Ll][Ll]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Vv][Ii][Ss][Uu][Aa][Ll]\\ [Ss][Tt][Uu][Dd][Ii][Oo].*/) AND process.executable:/.*\\.[Cc][Oo][Mm]/)) OR (process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Ll][Oo][Cc][Aa][Ll][Ss][Tt][Aa][Tt][Ee]\\\\\\\\[Rr][Oo][Oo][Tt][Ff][Ss]\\\\\\\\.*/) OR (process.executable:/.*\\\\\\\\[Ll][Zz][Mm][Aa]_[Ee][Xx][Ee]/) OR ((process.parent.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/ AND process.parent.executable:/.*\\\\\\\\[Tt][Bb][Tt]_[Dd][Oo][Cc][Kk]_[Ff][Ii][Rr][Mm][Ww][Aa][Rr][Ee]\\\\\\\\[Gg][Ee][Tt][Dd][Oo][Cc][Kk][Vv][Ee][Rr]32[Ww]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Tt][Oo][Bb][Ee][Dd][Ee][Ll][Ee][Tt][Ee][Dd]\\\\\\\\.*/) OR ((process.parent.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Uu][Uu][Ss]\\\\\\\\[Aa][Mm][Dd]64\\\\\\\\[Mm][Oo][Uu][Ss][Oo][Cc][Oo][Rr][Ee][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\\\\\$[Ee][Xx][Tt][Ee][Nn][Dd]\\\\\\\\$[Dd][Ee][Ll][Ee][Tt][Ee][Dd]\\\\\\\\.*/ AND process.command_line:/.*[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc]2[Rr][Cc][Ll][Ii][Ee][Nn][Tt]\\.[Ee][Xx][Ee].*/ AND process.command_line:/.*\\/[Uu][Pp][Dd][Aa][Tt][Ee]\\ [Uu][Pp][Dd][Aa][Tt][Ee][Oo][Rr][Cc][Hh][Ee][Ss][Tt][Rr][Aa][Tt][Oo][Rr]\\ [Dd][Ii][Ss][Pp][Ll][Aa][Yy][Ll][Ee][Vv][Ee][Ll]\\=[Ff][Aa][Ll][Ss][Ee].*/)) OR ((process.parent.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:/.*[Cc][Oo][Mm]\\.[Dd][Oo][Cc][Kk][Ee][Rr]\\.[Ss][Ee][Rr][Vv][Ii][Cc][Ee]/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://pentestlaboratories.com/2021/12/08/process-ghosting/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
