{"description": "Detect use of PDQ Deploy remote admin tool", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f67cfb9-99aa-b8af-7ac7-078b94681a64", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PDQ Deploy Remote Adminstartion Tool Execution", "query": "((winlog.event_data.Description:\"PDQ Deploy Console\") OR (Product:\"PDQ Deploy\") OR (Company:\"PDQ.com\") OR (winlog.event_data.OriginalFileName:\"PDQDeployConsole.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1072"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1072", "name": "Software Deployment Tools", "reference": "https://attack.mitre.org/techniques/T1072"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1072", "name": "Software Deployment Tools", "reference": "https://attack.mitre.org/techniques/T1072"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1072/T1072.md", "https://www.pdq.com/pdq-deploy/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
