{"description": "Detects potential psexec command that initiate execution on a remote systems via common commandline flags used by the utility", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ea011323-7045-460b-b2d7-0f7442ea6b38", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential PsExec Remote Execution", "query": "(process.command_line.text:\"*accepteula*\" AND process.command_line.text:\"*\\ \\-u\\ *\" AND process.command_line.text:\"*\\ \\-p\\ *\" AND process.command_line.text:\"*\\ \\\\\\\\*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Resource Development", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1587", "name": "Develop Capabilities", "reference": "https://attack.mitre.org/techniques/T1587"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec", "https://www.poweradmin.com/paexec/", "https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
