{"description": "Deployment Image Servicing and Management tool. DISM is used to enumerate, install, uninstall, configure, and update features and packages in Windows images", "enabled": false, "false_positives": ["Legitim script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "43e32da2-fdd0-4156-90de-50dfd62636f9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Dism Remove Online Package", "query": "((process.executable:*\\\\DismHost.exe AND process.parent.command_line:*\\/online* AND process.parent.command_line:*\\/Disable\\-Feature* AND process.parent.command_line:*\\/FeatureName\\:* AND process.parent.command_line:*\\/Remove*) OR (process.executable:*\\\\Dism.exe AND process.command_line:*\\/online* AND process.command_line:*\\/Disable\\-Feature* AND process.command_line:*\\/FeatureName\\:* AND process.command_line:*\\/Remove*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-26---disable-windows-defender-with-dism"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
