{"description": "Detects execution of \"Tpmvscmgr.exe\" to create a new virtual smart card.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage by an administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c633622e-cab9-4eaa-bb13-66a1d68b3e47", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Virtual Smart Card Created Via TpmVscMgr.EXE", "query": "(process.executable:/.*\\\\\\\\[Tt][Pp][Mm][Vv][Ss][Cc][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.OriginalFileName:/[Tt][Pp][Mm][Vv][Ss][Cc][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ AND process.command_line.text:*create*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/security/identity-protection/virtual-smart-cards/virtual-smart-card-tpmvscmgr"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
