{"description": "Detects execution of rundll32 where the DLL being called is stored in an Alternate Data Stream (ADS).", "author": ["Harjot Singh", "'@cyb3rjy0t'"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8e95c8fc-3a99-1284-9213-3a3f2392429e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Rundll32 Execution With DLL Stored In ADS", "query": "(((process.executable.text:*\\\\rundll32.exe) OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND (process.command_line.text:/[Rr][Uu][Nn][Dd][Ll][Ll]32(\\.[Ee][Xx][Ee])? \\S+?\\w:\\S+?:/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Rundll32"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
