{"description": "Detects the use of a Visual Studio bundled tool named DumpMinitool.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "eb5d5cde-52b2-6a43-fc39-6d4a9dcb721c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DumpMinitool Usage", "query": "(process.executable:*\\\\DumpMinitool.exe OR OriginalName:\"DumpMinitool.exe\" OR (process.command_line:*\\ \\-\\-processId\\ * AND process.command_line:*\\ \\-\\-dumpType\\ Full*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1511415432888131586?s=20&t=DvVrzeZ1OcGiWowbhPV8Lg", "https://twitter.com/mrd0x/status/1511489821247684615"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
