{"description": "Detects usage of bitsadmin downloading a file to uncommon target folder", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6e30c82f-a9f8-4aab-b79c-7c12bce6f248", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File Download Via Bitsadmin To An Uncommon Target Folder", "query": "(((process.executable.text:\"*\\\\bitsadmin.exe\") OR (winlog.event_data.OriginalFileName:\"bitsadmin.exe\")) AND process.command_line.text:(\"*\\ \\/transfer\\ *\" OR \"*\\ \\/create\\ *\" OR \"*\\ \\/addfile\\ *\") AND process.command_line.text:(\"*%AppData%*\" OR \"*%temp%*\" OR \"*%tmp%*\" OR \"*\\\\AppData\\\\Local\\\\*\" OR \"*C\\:\\\\Windows\\\\Temp\\\\*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/", "https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
