{"description": "Detects wmiexec/dcomexec/atexec/smbexec from Impacket framework", "author": ["Ecco", "oscd.community", "Jonhnathan Ribeiro", "Tim Rauch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2df17053-9998-3ac5-ddeb-6f5fb4e75492", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Impacket Lateral Movement Activity", "query": "(((process.parent.executable.text:(*\\\\wmiprvse.exe OR *\\\\mmc.exe OR *\\\\explorer.exe OR *\\\\services.exe) AND process.command_line.text:*cmd.exe* AND process.command_line.text:*\\/Q* AND process.command_line.text:*\\/c* AND process.command_line.text:*\\\\\\\\127.0.0.1\\\\* AND process.command_line.text:*&1*)) OR ((process.parent.command_line.text:(*svchost.exe\\ \\-k\\ netsvcs* OR *taskeng.exe*) AND process.command_line.text:*cmd.exe* AND process.command_line.text:*\\/C* AND process.command_line.text:*Windows\\\\Temp\\\\* AND process.command_line.text:*&1*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/wmiexec.py", "https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/atexec.py", "https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/smbexec.py", "https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/dcomexec.py", "https://www.elastic.co/guide/en/security/current/suspicious-cmd-execution-via-wmi.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
