{"description": "Detects suspicious execution of rundll32, with specific calls to some DLLs with known LOLBIN functionalities", "author": ["juju4", "Jonhnathan Ribeiro", "oscd.community", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e593cf51-88db-4ee1-b920-37e89012a3c9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Rundll32 Activity", "query": "((((process.command_line.text:\"*javascript\\:*\" AND process.command_line.text:\"*.RegisterXLL*\")) OR ((process.command_line.text:\"*url.dll*\" AND process.command_line.text:\"*OpenURL*\")) OR ((process.command_line.text:\"*url.dll*\" AND process.command_line.text:\"*OpenURLA*\")) OR ((process.command_line.text:\"*url.dll*\" AND process.command_line.text:\"*FileProtocolHandler*\")) OR ((process.command_line.text:\"*zipfldr.dll*\" AND process.command_line.text:\"*RouteTheCall*\")) OR ((process.command_line.text:\"*shell32.dll*\" AND process.command_line.text:\"*Control_RunDLL*\")) OR ((process.command_line.text:\"*shell32.dll*\" AND process.command_line.text:\"*ShellExec_RunDLL*\")) OR ((process.command_line.text:\"*mshtml.dll*\" AND process.command_line.text:\"*PrintHTML*\")) OR ((process.command_line.text:\"*advpack.dll*\" AND process.command_line.text:\"*LaunchINFSection*\")) OR ((process.command_line.text:\"*advpack.dll*\" AND process.command_line.text:\"*RegisterOCX*\")) OR ((process.command_line.text:\"*ieadvpack.dll*\" AND process.command_line.text:\"*LaunchINFSection*\")) OR ((process.command_line.text:\"*ieadvpack.dll*\" AND process.command_line.text:\"*RegisterOCX*\")) OR ((process.command_line.text:\"*ieframe.dll*\" AND process.command_line.text:\"*OpenURL*\")) OR ((process.command_line.text:\"*shdocvw.dll*\" AND process.command_line.text:\"*OpenURL*\")) OR ((process.command_line.text:\"*syssetup.dll*\" AND process.command_line.text:\"*SetupInfObjectInstallAction*\")) OR ((process.command_line.text:\"*setupapi.dll*\" AND process.command_line.text:\"*InstallHinfSection*\")) OR ((process.command_line.text:\"*pcwutl.dll*\" AND process.command_line.text:\"*LaunchApplication*\")) OR ((process.command_line.text:\"*dfshim.dll*\" AND process.command_line.text:\"*ShOpenVerbApplication*\")) OR ((process.command_line.text:\"*dfshim.dll*\" AND process.command_line.text:\"*ShOpenVerbShortcut*\")) OR ((process.command_line.text:\"*scrobj.dll*\" AND process.command_line.text:\"*GenerateTypeLib*\" AND process.command_line.text:\"*http*\")) OR ((process.command_line.text:\"*shimgvw.dll*\" AND process.command_line.text:\"*ImageView_Fullscreen*\" AND process.command_line.text:\"*http*\")) OR ((process.command_line.text:\"*comsvcs.dll*\" AND process.command_line.text:\"*MiniDump*\"))) AND (NOT ((process.command_line.text:\"*shell32.dll,Control_RunDLL\\ desk.cpl,screensaver,@screensaver*\") OR ((process.parent.executable.text:\"C:\\Windows\\System32\\control.exe\" AND process.parent.command_line.text:\"*.cpl*\" AND process.command_line.text:\"*Shell32.dll*\" AND process.command_line.text:\"*Control_RunDLL*\" AND process.command_line.text:\"*.cpl*\")) OR ((process.parent.executable.text:\"C:\\Windows\\System32\\control.exe\" AND process.command_line.text:\"\\\"C\\:\\\\Windows\\\\system32\\\\rundll32.exe\\\"\\ Shell32.dll,Control_RunDLL\\ \\\"C\\:\\\\Windows\\\\System32\\\\*\" AND process.command_line.text:\"*.cpl\\\",\")))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2017/05/01/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline/", "https://twitter.com/Hexacorn/status/885258886428725250", "https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52", "https://twitter.com/nas_bench/status/1433344116071583746", "https://twitter.com/eral4m/status/1479106975967240209", "https://twitter.com/eral4m/status/1479080793003671557"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
