{"description": "Detects the execution of certutil with certain flags that allow the utility to download files from file-sharing websites.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "42a5f1e7-9603-4f6d-97ae-3f37d130d794", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious File Downloaded From File-Sharing Website Via Certutil.EXE", "query": "(event.category:process AND ((process.executable:/.*\\\\[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Cc][Ee][Rr][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*[Uu][Rr][Ll][Cc][Aa][Cc][Hh][Ee]\\ .*/ OR /.*[Vv][Ee][Rr][Ii][Ff][Yy][Cc][Tt][Ll]\\ .*/) AND process.command_line:(/.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*[Dd][Ll]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo].*/ OR /.*[Gg][Oo][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Pp][Ll].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Tt][Ee][Xx][Tt]\\.[Nn][Ee][Tt].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Nn][Ee][Tt].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/ OR /.*[Ss][Ee][Nn][Dd][Ss][Pp][Aa][Cc][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Jj][Ss][Hh][Aa][Rr][Ee]\\.[Ii][Oo].*/ OR /.*[Tt][Ee][Mm][Pp]\\.[Ss][Hh].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil", "https://forensicitguy.github.io/agenttesla-vba-certutil-download/", "https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/", "https://twitter.com/egre55/status/1087685529016193025", "https://lolbas-project.github.io/lolbas/Binaries/Certutil/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
