{"description":"Detects different hacktools used for relay attacks on Windows for privilege escalation Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate files with these rare hacktool names"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"79898aff-6a2c-c184-2319-d8f0ecdf4614","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"SMB Relay Attack Tools","query":"((process.executable:(*PetitPotam* OR *RottenPotato* OR *HotPotato* OR *JuicyPotato* OR *\\\\just_dce_* OR *Juicy\\ Potato* OR *\\\\temp\\\\rot.exe* OR *\\\\Potato.exe* OR *\\\\SpoolSample.exe* OR *\\\\Responder.exe* OR *\\\\smbrelayx* OR *\\\\ntlmrelayx*) OR process.command_line:(*Invoke\\-Tater* OR *\\ smbrelay* OR *\\ ntlmrelay* OR *cme\\ smb\\ * OR *\\ \\/ntlm\\:NTLMhash\\ * OR *Invoke\\-PetitPotam*)) AND (NOT ((process.executable:(*HotPotatoes6* OR *HotPotatoes\\ 6* OR *HotPotatoes7* OR *HotPotatoes\\ 7* OR *HotPotatoes\\ Help* OR *HotPotatoes\\ Tutorial*)))))","meta":{"from":"1m"},"severity":"critical","tags":["T1557"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
