{"description": "Detects the use of Pingback backdoor that creates ICMP tunnel for C2 as described in the trustwave report", "enabled": false, "false_positives": ["Very unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "49f208eb-37f6-fee6-f6d2-ee5b86e04797", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Pingback Backdoor", "query": "(process.parent.executable:*updata.exe AND process.command_line:*config* AND process.command_line:*msdtc* AND process.command_line:*start* AND process.command_line:*auto*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel", "https://app.any.run/tasks/4a54c651-b70b-4b72-84d7-f34d301d6406"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
