{"description": "Detects various anomalies in relation to regsvr32.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "23dc8f9c-7bb6-d844-f632-e6c3a4095e02", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Regsvr32 Anomaly", "query": "(((process.executable:*\\\\regsvr32.exe AND process.command_line:*\\\\Temp\\\\*) OR (process.executable:*\\\\regsvr32.exe AND process.parent.executable:*\\\\powershell.exe) OR (process.executable:*\\\\regsvr32.exe AND process.parent.executable:*\\\\cmd.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:*\\/i\\:* AND process.command_line:*http* AND process.command_line:*scrobj.dll) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:*\\/i\\:* AND process.command_line:*ftp* AND process.command_line:*scrobj.dll) OR (process.executable:*\\\\wscript.exe AND process.parent.executable:*\\\\regsvr32.exe) OR (process.executable:*\\\\EXCEL.EXE AND process.command_line:*..\\\\..\\\\..\\\\Windows\\\\System32\\\\regsvr32.exe\\ *) OR (process.parent.executable:*\\\\mshta.exe AND process.executable:*\\\\regsvr32.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:(*\\\\AppData\\\\Local* OR *C\\:\\\\Users\\\\Public*)) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:(*.jpg OR *.jpeg OR *.png OR *.gif OR *.bin OR *.tmp OR *.temp OR *.txt))) AND (NOT (process.command_line:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://subt0x10.blogspot.de/2017/04/bypass-application-whitelisting-script.html", "https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
