{"description": "Detects execution of regsvr32 where the DLL is located in a highly suspicious locations", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "327ff235-94eb-4f06-b9de-aaee571324be", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Regsvr32 Execution From Highly Suspicious Location", "query": "((((process.executable.text:\"*\\\\regsvr32.exe\") OR (winlog.event_data.OriginalFileName:\"REGSVR32.EXE\")) AND ((process.command_line.text:(\"*\\:\\\\PerfLogs\\\\*\" OR \"*\\:\\\\Temp\\\\*\" OR \"*\\\\Windows\\\\Registration\\\\CRMLog*\" OR \"*\\\\Windows\\\\System32\\\\com\\\\dmp\\\\*\" OR \"*\\\\Windows\\\\System32\\\\FxsTmp\\\\*\" OR \"*\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\*\" OR \"*\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\*\" OR \"*\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\*\" OR \"*\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\*\" OR \"*\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\*\" OR \"*\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*\" OR \"*\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\*\" OR \"*\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\*\" OR \"*\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\*\" OR \"*\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\*\" OR \"*\\\\Windows\\\\Tasks\\\\*\" OR \"*\\\\Windows\\\\Tracing\\\\*\")) OR ((process.command_line.text:(\"*\\ \\\"C\\:\\\\*\" OR \"*\\ C\\:\\\\*\" OR \"*\\ 'C\\:\\\\*\" OR \"*D\\:\\\\*\") AND (NOT process.command_line.text:(\"*C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*\" OR \"*C\\:\\\\Program\\ Files\\\\*\" OR \"*C\\:\\\\ProgramData\\\\*\" OR \"*C\\:\\\\Users\\\\*\" OR \"*\\ C\\:\\\\Windows\\\\*\" OR \"*\\ \\\"C\\:\\\\Windows\\\\*\" OR \"*\\ 'C\\:\\\\Windows\\\\*\")))))) AND (NOT ((process.command_line.text:\"\") OR (NOT _exists_:process.command_line.text))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
