{"description": "By replacing the sticky keys executable with the local admins CMD executable, an attacker is able to access a privileged windows console session without authenticating to the system.\nWhen the sticky keys are \"activated\" the privilleged shell is launched.\n", "author": ["Sreeman"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1070db9a-3e5d-412e-8e7b-7183b616e1b3", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Persistence Via Sticky Key Backdoor", "query": "(process.command_line.text:\"*copy\\ *\" AND process.command_line.text:\"*\\/y\\ *\" AND process.command_line.text:\"*C\\:\\\\windows\\\\system32\\\\cmd.exe\\ C\\:\\\\windows\\\\system32\\\\sethc.exe*\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2017/03/apt29_domain_frontin.html", "https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf", "https://learn.microsoft.com/en-us/archive/blogs/jonathantrull/detecting-sticky-key-backdoors"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
