{"description": "Detects command that is used to disable or delete Windows eventlog via logman Windows utility", "enabled": false, "false_positives": ["Legitimate deactivation by administrative staff", "Installer tools that disable services, e.g. before log collection agent installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5f8be944-de24-cb19-584f-39c925d5ee0b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable or Delete Windows Eventlog", "query": "(process.command_line:*logman\\ * AND process.command_line:(*stop\\ * OR *delete\\ *) AND process.command_line:*EventLog\\-System*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/0gtweet/status/1359039665232306183?s=21", "https://ss64.com/nt/logman.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
