{"description": "Detects a specific process creation patterns as seen used by UNC2452 and provided by Microsoft as Microsoft Defender ATP queries", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9be34ad0-b6a7-4fbd-91cf-fc7ec1047f5f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "UNC2452 Process Creation Patterns", "query": "((((process.command_line:*7z.exe\\ a\\ \\-v500m\\ \\-mx9\\ \\-r0\\ \\-p* OR (process.parent.command_line:*wscript.exe* AND process.parent.command_line:*.vbs* AND process.command_line:*rundll32.exe* AND process.command_line:*C\\:\\\\Windows* AND process.command_line:*.dll,Tk_*)) OR (process.parent.executable:*\\\\rundll32.exe AND process.parent.command_line:*C\\:\\\\Windows* AND process.command_line:*cmd.exe\\ \\/C\\ *)) OR (process.command_line:*rundll32\\ c\\:\\\\windows\\\\* AND process.command_line:*.dll\\ *)) OR ((process.parent.executable:*\\\\rundll32.exe AND process.executable:*\\\\dllhost.exe) AND (NOT (process.command_line:(\"\\ \" OR \"\")))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
