{"description": "Detects rundll32 execution where the DLL is located on a remote location (share)", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5cdb711b-5740-4fb2-ba88-f7945027afac", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Rundll32 UNC Path Execution", "query": "((process.executable.text:*\\\\rundll32.exe OR winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\" OR process.command_line.text:*rundll32*) AND process.command_line.text:*\\ \\\\\\\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1021", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.cybereason.com/blog/rundll32-the-infamous-proxy-for-executing-malicious-code"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
