{"description": "Detects suspicious process related to rundll32 based on arguments", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0da5289e-617d-115a-9d91-f99b6f4ceb0c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Rundll32 Activity", "query": "(((process.command_line:*javascript\\:* AND process.command_line:*.RegisterXLL*) OR (process.command_line:*url.dll* AND process.command_line:*OpenURL*) OR (process.command_line:*url.dll* AND process.command_line:*OpenURLA*) OR (process.command_line:*url.dll* AND process.command_line:*FileProtocolHandler*) OR (process.command_line:*zipfldr.dll* AND process.command_line:*RouteTheCall*) OR (process.command_line:*shell32.dll* AND process.command_line:*Control_RunDLL*) OR (process.command_line:*shell32.dll* AND process.command_line:*ShellExec_RunDLL*) OR (process.command_line:*mshtml.dll* AND process.command_line:*PrintHTML*) OR (process.command_line:*advpack.dll* AND process.command_line:*LaunchINFSection*) OR (process.command_line:*advpack.dll* AND process.command_line:*RegisterOCX*) OR (process.command_line:*ieadvpack.dll* AND process.command_line:*LaunchINFSection*) OR (process.command_line:*ieadvpack.dll* AND process.command_line:*RegisterOCX*) OR (process.command_line:*ieframe.dll* AND process.command_line:*OpenURL*) OR (process.command_line:*shdocvw.dll* AND process.command_line:*OpenURL*) OR (process.command_line:*syssetup.dll* AND process.command_line:*SetupInfObjectInstallAction*) OR (process.command_line:*setupapi.dll* AND process.command_line:*InstallHinfSection*) OR (process.command_line:*pcwutl.dll* AND process.command_line:*LaunchApplication*) OR (process.command_line:*dfshim.dll* AND process.command_line:*ShOpenVerbApplication*) OR (process.command_line:*dfshim.dll* AND process.command_line:*ShOpenVerbShortcut*)) AND (NOT (process.command_line:*shell32.dll,Control_RunDLL\\ desk.cpl,screensaver,@screensaver*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["http://www.hexacorn.com/blog/2017/05/01/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline/", "https://twitter.com/Hexacorn/status/885258886428725250", "https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52", "https://twitter.com/nas_bench/status/1433344116071583746"], "timestamp_override": "event.ingested", "author": ["juju4", "Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
