{"description": "Detects when an internet hosted webdav share is mounted using the \"net.exe\" utility", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7e6237fe-3ddb-438f-9381-9bf9de5af8d0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Internet Hosted WebDav Share Mount Via Net.EXE", "query": "(((process.executable:(/.*\\\\\\\\[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.OriginalFileName:(/[Nn][Ee][Tt]\\.[Ee][Xx][Ee]/ OR /[Nn][Ee][Tt]1\\.[Ee][Xx][Ee]/))) AND (process.command_line:/.*\\ [Uu][Ss][Ee]\\ .*/ AND process.command_line:/.*\\ [Hh][Tt][Tt][Pp].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
