{"description": "Detects using Rpcping.exe to send a RPC test connection to the target server (-s) and force the NTLM hash to be sent in the process.", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "94508117-8f24-1375-a25e-6ad5ef4f7a40", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Capture Credentials with Rpcping.exe", "query": "((process.executable:*\\\\rpcping.exe AND process.command_line:(*\\-s* OR *\\/s*)) AND ((process.command_line:*\\-u* AND process.command_line:*NTLM*) OR (process.command_line:*\\/u* AND process.command_line:*NTLM*) OR (process.command_line:*\\-t* AND process.command_line:*ncacn_np*) OR (process.command_line:*\\/t* AND process.command_line:*ncacn_np*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Rpcping/", "https://twitter.com/vysecurity/status/974806438316072960", "https://twitter.com/vysecurity/status/873181705024266241", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)"], "timestamp_override": "event.ingested", "author": ["Julia Fomina", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
