{"description": "Detecting DNS tunnel activity for Muddywater actor", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "36222790-0d43-4fe8-86e4-674b27809543", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "DNS Tunnel Technique from MuddyWater", "query": "(process.executable:*\\\\powershell.exe AND process.parent.executable:*\\\\excel.exe AND process.command_line:*DataExchange.dll*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1071"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.virustotal.com/gui/file/5ad401c3a568bd87dd13f8a9ddc4e450ece61cd9ce4d1b23f68ce0b1f3c190b7/", "https://www.vmray.com/analyses/5ad401c3a568/report/overview.html"], "timestamp_override": "event.ingested", "author": ["@caliskanfurkan_"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
