{"description": "Detects a suspicious curl process start on Windows and outputs the requested document to a local file", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e218595b-bbe7-4ee5-8a96-f32a24ad3468", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Curl.EXE Download", "query": "((((process.executable.text:\"*\\\\curl.exe\") OR (Product:\"The curl executable\")) AND ((process.command_line.text:(\"*%AppData%*\" OR \"*%Public%*\" OR \"*%Temp%*\" OR \"*%tmp%*\" OR \"*\\\\AppData\\\\*\" OR \"*\\\\Desktop\\\\*\" OR \"*\\\\Temp\\\\*\" OR \"*\\\\Users\\\\Public\\\\*\" OR \"*C\\:\\\\PerfLogs\\\\*\" OR \"*C\\:\\\\ProgramData\\\\*\" OR \"*C\\:\\\\Windows\\\\Temp\\\\*\")) OR (process.command_line.text:(\"*.dll\" OR \"*.gif\" OR \"*.jpeg\" OR \"*.jpg\" OR \"*.png\" OR \"*.temp\" OR \"*.tmp\" OR \"*.txt\" OR \"*.vbe\" OR \"*.vbs\")))) AND (NOT (process.parent.executable.text:\"C:\\Program Files\\Git\\usr\\bin\\sh.exe\" AND process.executable.text:\"C:\\Program Files\\Git\\mingw64\\bin\\curl.exe\" AND process.command_line.text:\"*\\-\\-silent\\ \\-\\-show\\-error\\ \\-\\-output\\ *\" AND process.command_line.text:\"*gfw\\-httpget\\-*\" AND process.command_line.text:\"*AppData*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/max_mal_/status/1542461200797163522", "https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464", "https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt", "https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/", "https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1105/T1105.md#atomic-test-18---curl-download-file"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
