{"description": "Detects suspicious shell spawn from Java utility keytool process (e.g. adselfservice plus exploitation)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "90fb5e62-ca1f-4e22-b42e-cc521874c938", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Shells Spawn by Java Utility Keytool", "query": "(process.parent.executable:*\\\\keytool.exe AND process.executable:(*\\\\cmd.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\powershell.exe OR *\\\\schtasks.exe OR *\\\\certutil.exe OR *\\\\whoami.exe OR *\\\\bitsadmin.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\scrcons.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/intelligence-insights-december-2021", "https://www.synacktiv.com/en/publications/how-to-exploit-cve-2021-40539-on-manageengine-adselfservice-plus.html"], "timestamp_override": "event.ingested", "author": ["Andreas Hunkeler (@Karneades)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
