{"description": "Detects different process creation events as described in Malwarebytes's threat report on Lazarus group activity", "enabled": false, "false_positives": ["Should not be any false positives"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f1742b73-b427-2161-f145-7c0ecf553041", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Lazarus Activity", "query": "((process.command_line.text:*mshta* AND process.command_line.text:*.zip*) OR (process.parent.executable.text:\"C\\:\\\\Windows\\\\System32\\\\wbem\\\\wmiprvse.exe\" AND process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\mshta.exe\") OR (process.parent.executable.text:*\\:\\\\Users\\\\Public\\\\* AND process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\rundll32.exe\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://blog.malwarebytes.com/malwarebytes-news/2021/04/lazarus-apt-conceals-malicious-code-within-bmp-file-to-drop-its-rat/"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
