{"description": "Detects suspicious process related to rasdial.exe", "enabled": false, "false_positives": ["False positives depend on scripts and administrative tools used in the monitored environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6bba49bf-7f8c-47d6-a1bb-6b4dece4640e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious RASdial Activity", "query": "process.executable:*rasdial.exe", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://twitter.com/subTee/status/891298217907830785"], "timestamp_override": "event.ingested", "author": ["juju4"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
