{"description": "Detects all variations of obfuscated powershell IEX invocation code generated by Invoke-Obfuscation framework from the following code block", "author": ["Daniel Bohannon (@Mandiant/@FireEye)", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "74a1868e-8ec6-c103-52e4-cc19c7d38e15", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Invoke-Obfuscation Obfuscated IEX Invocation", "query": "(((process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/P/ OR process.command_line.text:/S/ OR process.command_line.text:/H/ OR process.command_line.text:/o/ OR process.command_line.text:/m/ OR process.command_line.text:/e/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/d/ OR process.command_line.text:/{/ OR process.command_line.text:/1/ OR process.command_line.text:/,/ OR process.command_line.text:/3/ OR process.command_line.text:/}/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/]/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/+/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/P/ OR process.command_line.text:/S/ OR process.command_line.text:/H/ OR process.command_line.text:/o/ OR process.command_line.text:/m/ OR process.command_line.text:/e/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/S/ OR process.command_line.text:/h/ OR process.command_line.text:/e/ OR process.command_line.text:/l/ OR process.command_line.text:/l/ OR process.command_line.text:/I/ OR process.command_line.text:/d/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/d/ OR process.command_line.text:/{/ OR process.command_line.text:/1/ OR process.command_line.text:/,/ OR process.command_line.text:/3/ OR process.command_line.text:/}/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/]/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/+/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/S/ OR process.command_line.text:/h/ OR process.command_line.text:/e/ OR process.command_line.text:/l/ OR process.command_line.text:/l/ OR process.command_line.text:/I/ OR process.command_line.text:/d/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/e/ OR process.command_line.text:/n/ OR process.command_line.text:/v/ OR process.command_line.text:/:/ OR process.command_line.text:/P/ OR process.command_line.text:/u/ OR process.command_line.text:/b/ OR process.command_line.text:/l/ OR process.command_line.text:/i/ OR process.command_line.text:/c/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/d/ OR process.command_line.text:/{/ OR process.command_line.text:/1/ OR process.command_line.text:/,/ OR process.command_line.text:/3/ OR process.command_line.text:/}/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/]/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/+/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/e/ OR process.command_line.text:/n/ OR process.command_line.text:/v/ OR process.command_line.text:/:/ OR process.command_line.text:/P/ OR process.command_line.text:/u/ OR process.command_line.text:/b/ OR process.command_line.text:/l/ OR process.command_line.text:/i/ OR process.command_line.text:/c/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/e/ OR process.command_line.text:/n/ OR process.command_line.text:/v/ OR process.command_line.text:/:/ OR process.command_line.text:/C/ OR process.command_line.text:/o/ OR process.command_line.text:/m/ OR process.command_line.text:/S/ OR process.command_line.text:/p/ OR process.command_line.text:/e/ OR process.command_line.text:/c/ OR process.command_line.text:/\\/ OR process.command_line.text:/[/ OR process.command_line.text:/(/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/d/ OR process.command_line.text:/{/ OR process.command_line.text:/1/ OR process.command_line.text:/,/ OR process.command_line.text:/3/ OR process.command_line.text:/}/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/,/ OR process.command_line.text:/)/ OR process.command_line.text:/{/ OR process.command_line.text:/2/ OR process.command_line.text:/}/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/*/ OR process.command_line.text:/m/ OR process.command_line.text:/d/ OR process.command_line.text:/r/ OR process.command_line.text:/\\/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/W/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/)/ OR process.command_line.text:/\\/ OR process.command_line.text:/./ OR process.command_line.text:/N/ OR process.command_line.text:/a/ OR process.command_line.text:/m/ OR process.command_line.text:/e/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/V/ OR process.command_line.text:/e/ OR process.command_line.text:/r/ OR process.command_line.text:/b/ OR process.command_line.text:/o/ OR process.command_line.text:/s/ OR process.command_line.text:/e/ OR process.command_line.text:/P/ OR process.command_line.text:/r/ OR process.command_line.text:/e/ OR process.command_line.text:/f/ OR process.command_line.text:/e/ OR process.command_line.text:/r/ OR process.command_line.text:/e/ OR process.command_line.text:/n/ OR process.command_line.text:/c/ OR process.command_line.text:/e/ OR process.command_line.text:/\\/ OR process.command_line.text:/./ OR process.command_line.text:/T/ OR process.command_line.text:/o/ OR process.command_line.text:/S/ OR process.command_line.text:/t/ OR process.command_line.text:/r/ OR process.command_line.text:/i/ OR process.command_line.text:/n/ OR process.command_line.text:/g/ OR process.command_line.text:/\\/ OR process.command_line.text:/(/)) OR ((process.command_line.text:/\\/ OR process.command_line.text:/[/ OR process.command_line.text:/S/ OR process.command_line.text:/t/ OR process.command_line.text:/r/ OR process.command_line.text:/i/ OR process.command_line.text:/n/ OR process.command_line.text:/g/ OR process.command_line.text:/\\/ OR process.command_line.text:/]/ OR process.command_line.text:/\\/ OR process.command_line.text:/s/ OR process.command_line.text:/*/ OR process.command_line.text:/\\/ OR process.command_line.text:/$/ OR process.command_line.text:/V/ OR process.command_line.text:/e/ OR process.command_line.text:/r/ OR process.command_line.text:/b/ OR process.command_line.text:/o/ OR process.command_line.text:/s/ OR process.command_line.text:/e/ OR process.command_line.text:/P/ OR process.command_line.text:/r/ OR process.command_line.text:/e/ OR process.command_line.text:/f/ OR process.command_line.text:/e/ OR process.command_line.text:/r/ OR process.command_line.text:/e/ OR process.command_line.text:/n/ OR process.command_line.text:/c/ OR process.command_line.text:/e/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
