{"description": "Download and compress a remote file and store it in a cab file on local machine.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "185d7418-f250-42d0-b72e-0c8b70661e93", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Diantz Download and Compress Into a CAB File", "query": "(process.command_line:*diantz.exe* AND process.command_line:*\\ \\\\\\* AND process.command_line:*.cab*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Diantz/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
