{"description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection", "enabled": false, "false_positives": ["Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ebae6656-ad22-cd7d-7bee-7bb89066f054", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use NTFS Short Name in Command Line", "query": "(process.command_line.text:(*\\~1.exe* OR *\\~1.bat* OR *\\~1.msi* OR *\\~1.vbe* OR *\\~1.vbs* OR *\\~1.dll* OR *\\~1.ps1* OR *\\~1.js* OR *\\~1.hta* OR *\\~2.exe* OR *\\~2.bat* OR *\\~2.msi* OR *\\~2.vbe* OR *\\~2.vbs* OR *\\~2.dll* OR *\\~2.ps1* OR *\\~2.js* OR *\\~2.hta*) AND (NOT (process.parent.executable.text:*\\\\WebEx\\\\WebexHost.exe)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN", "https://twitter.com/jonasLyk/status/1555914501802921984"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
