{"description": "Detects the execution of an Office application that points to a document that is located in a trusted location. Attackers often used this to avoid macro security and execute their malicious code.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f99abdf0-6283-4e71-bd2b-b5c048a94743", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious Office Document Executed From Trusted Location", "query": "((process.parent.executable:(/.*\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Dd][Oo][Pp][Uu][Ss]\\.[Ee][Xx][Ee]/) AND ((process.executable:(/.*\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.OriginalFileName:(/[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/))) AND process.command_line:(/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Tt][Ee][Mm][Pp][Ll][Aa][Tt][Ee][Ss].*/ OR /.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Oo][Rr][Dd]\\\\\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\\\\\.*/ OR /.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\ \\([Xx]86\\)\\\\\\\\[Rr][Oo][Oo][Tt]\\\\\\\\[Tt][Ee][Mm][Pp][Ll][Aa][Tt][Ee][Ss]\\\\\\\\.*/ OR /.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\ \\([Xx]86\\)\\\\\\\\[Tt][Ee][Mm][Pp][Ll][Aa][Tt][Ee][Ss]\\\\\\\\.*/ OR /.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\[Rr][Oo][Oo][Tt]\\\\\\\\[Tt][Ee][Mm][Pp][Ll][Aa][Tt][Ee][Ss]\\\\\\\\.*/ OR /.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\[Tt][Ee][Mm][Pp][Ll][Aa][Tt][Ee][Ss]\\\\\\\\.*/)) AND (NOT process.command_line:(/.*\\.[Dd][Oo][Tt][Xx]/ OR /.*\\.[Xx][Ll][Tt][Xx]/ OR /.*\\.[Pp][Oo][Tt][Xx]/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["Internal Research", "https://twitter.com/Max_Mal_/status/1633863678909874176", "https://techcommunity.microsoft.com/t5/microsoft-365-blog/new-security-hardening-policies-for-trusted-documents/ba-p/3023465", "https://twitter.com/_JohnHammond/status/1588155401752788994"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
