{"description": "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilities", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ba703080-9820-bbf2-1b9e-3e4308731b81", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Compress Data and Lock With Password for Exfiltration With WINZIP", "query": "(process.command_line:(*winzip.exe* OR *winzip64.exe*) AND process.command_line:*\\-s\\\"* AND process.command_line:(*\\ \\-min\\ * OR *\\ \\-a\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1560"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1560", "name": "Archive Collected Data", "reference": "https://attack.mitre.org/techniques/T1560"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
