{"description": "F-Secure C3 produces DLLs with a default exported StartNodeRelay function.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b18c9d4c-fac9-4708-bd06-dd5bfacf200f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "F-Secure C3 Load by Rundll32", "query": "(process.command_line:*rundll32.exe* AND process.command_line:*.dll* AND process.command_line:*StartNodeRelay*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/FSecureLABS/C3/blob/master/Src/NodeRelayDll/NodeRelayDll.cpp#L12"], "timestamp_override": "event.ingested", "author": ["Alfie Champion (ajpc500)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
