{"description": "Detects the use of the RunXCmd tool to execute commands with System or TrustedInstaller accounts", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use by administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "93199800-b52a-4dec-b762-75212c196542", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - RunXCmd Execution", "query": "(process.command_line.text:(\"*\\ \\/account\\=system\\ *\" OR \"*\\ \\/account\\=ti\\ *\") AND process.command_line.text:\"*\\/exec\\=*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://www.d7xtech.com/free-software/runx/", "https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
