{"description": "Detects process patterns found in Cobalt Strike beacon activity (see reference for more details) and also cases in which a China Chopper like webshell is used to run whoami", "enabled": false, "false_positives": ["Other programs that cause these patterns (please report)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ea0b4d74-9082-6fc3-23ba-3ba9a1c68759", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CobaltStrike Process Patterns", "query": "(((process.command_line.text:*\\\\cmd.exe\\ \\/C\\ whoami* AND process.parent.executable.text:C\\:\\\\Temp*) OR (process.command_line.text:(*cmd.exe\\ \\/c\\ echo* OR *>\\ \\\\\\\\.\\\\pipe* OR *\\\\whoami.exe*) AND process.parent.executable.text:*\\\\dllhost.exe) OR (process.executable.text:*\\\\cmd.exe AND process.parent.executable.text:*\\\\runonce.exe AND process.parent.command_line.text:*\\\\runonce.exe)) OR ((process.command_line.text:*conhost.exe\\ 0xffffffff\\ \\-ForceV1* AND process.parent.command_line.text:(*\\/C\\ whoami* OR *cmd.exe\\ \\/C\\ echo* OR *\\ >\\ \\\\\\\\.\\\\pipe*)) AND (NOT (process.parent.command_line.text:(*C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Internet\\ Download\\ Manager\\\\IDMMsgHost.exe* OR *chrome\\-extension\\:\\/\\/*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://hausec.com/2021/07/26/cobalt-strike-and-tradecraft/", "https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
