{"description": "Detects RDP Session Hijacking on Windows systems", "author": ["@juju4"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ca044c1f-f61a-51aa-e5ef-9f8ab1331296", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential RDP Session Hijacking Activity", "query": "(((process.executable.text:*\\\\tscon.exe) OR (winlog.event_data.OriginalFileName:\"tscon.exe\")) AND IntegrityLevel:\"SYSTEM\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Moti_B/status/909449115477659651"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
