{"description": "The \"VSIISExeLauncher.exe\" binary part of the Visual Studio/VS Code can be used to execute arbitrary binaries", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "18749301-f1c5-4efc-a4c3-276ff1f5b6f8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of VSIISExeLauncher.exe", "query": "((process.executable:*\\\\VSIISExeLauncher.exe OR winlog.event_data.OriginalFileName:\"VSIISExeLauncher.exe\") AND process.command_line:(*\\ \\-p\\ * OR *\\ \\-a\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1127"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/VSIISExeLauncher/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
