{"description": "Detects the execution of whoami.exe with the /group command line flag to show group membership for the current user, account type, security identifiers (SID), and attributes.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bd8b828d-0dca-48e1-8a63-8a58ecf2644f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Group Membership Reconnaissance Via Whoami.EXE", "query": "(((process.executable.text:\"*\\\\whoami.exe\") OR (winlog.event_data.OriginalFileName:\"whoami.exe\")) AND process.command_line.text:(\"*\\ \\/groups*\" OR \"*\\ \\-groups*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1033"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1033", "name": "System Owner/User Discovery", "reference": "https://attack.mitre.org/techniques/T1033"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
