{"description": "Detects suspicious usage of the ShellExec_RunDLL function to launch other commands as seen in the the raspberry-robin attack", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "943c2299-58e1-0c56-4327-531eaae91483", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Usage Of ShellExec_RunDLL", "query": "(process.command_line.text:*ShellExec_RunDLL* AND process.command_line.text:(*regsvr32* OR *msiexec* OR *\\\\Users\\\\Public\\\\* OR *odbcconf* OR *\\\\Desktop\\\\* OR *\\\\Temp\\\\* OR *Invoke\\-* OR *iex* OR *comspec*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/raspberry-robin/", "https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/", "https://github.com/SigmaHQ/sigma/issues/1009"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
