{"description": "Detects process activity patterns as seen being used by Sliver C2 framework implants", "author": ["Nasreddine Bencherchali (Nextron Systems)", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "42333b2c-b425-441c-b70e-99404a17170f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "HackTool - Sliver C2 Implant Activity Pattern", "query": "process.command_line.text:\"*\\-NoExit\\ \\-Command\\ \\[Console\\]\\:\\:OutputEncoding\\=\\[Text.UTF8Encoding\\]\\:\\:UTF8*\"", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/implant/sliver/shell/shell_windows.go#L36", "https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
