{"description": "Detects the use of SharpEvtHook, a tool to tamper with Windows event logs", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a74067ec-6fe0-6244-3758-1e4971be5449", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SharpEvtMute EvtMuteHook Load", "query": "(process.executable.text:*\\\\SharpEvtMute.exe OR winlog.event_data.Description:\"SharpEvtMute\" OR process.command_line.text:(*\\-\\-Filter\\ \\\"rule\\ * OR *\\-\\-Encoded\\ \\-\\-Filter\\ \\\\\\\"*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/bats3c/EvtMute"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
