{"description": "Detects PsExec service installation and execution events (service and Sysmon)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PsExec Tool Execution", "query": "(process.executable:*\\\\PSEXESVC.exe AND user.name:NT\\ AUTHORITY\\\\SYSTEM*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://www.jpcert.or.jp/english/pub/sr/ir_research.html", "https://jpcertcc.github.io/ToolAnalysisResultSheet"], "timestamp_override": "event.ingested", "author": ["Thomas Patzke"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
