{"description": "Detects suspicious use of XORDump process memory dumping utility", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Another tool that uses the command line switches of XORdump"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ae302670-2dac-1eb0-0df8-a8a183a5be23", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - XORDump Execution", "query": "((process.executable.text:*\\\\xordump.exe) OR (process.command_line.text:(*\\ \\-process\\ lsass.exe\\ * OR *\\ \\-m\\ comsvcs\\ * OR *\\ \\-m\\ dbghelp\\ * OR *\\ \\-m\\ dbgcore\\ *)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://github.com/audibleblink/xordump"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
