{"description": "Detects suspicious process patterns found in logs when CrackMapExec is used", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f26307d8-14cd-47e3-a26b-4b4769f24af6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CrackMapExec Process Patterns", "query": "((process.command_line:*cmd.exe\\ \\/c\\ * AND process.command_line:*tasklist\\ \\/fi\\ * AND process.command_line:*Imagename\\ eq\\ lsass.exe* AND user.name:(*NT\\ AUTHO* OR *NT\\ AUTO*)) OR (process.command_line:*do\\ rundll32.exe\\ C\\:\\\\windows\\\\System32\\\\comsvcs.dll,\\ MiniDump* AND process.command_line:*\\\\Windows\\\\Temp\\\\* AND process.command_line:*\\ full* AND process.command_line:*%%B*) OR (process.command_line:*tasklist\\ \\/v\\ \\/fo\\ csv* AND process.command_line:*findstr\\ \\/i\\ \\\"lsass\\\"*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
