{"description": "Detects the use of various web request with commandline tools or Windows PowerShell command,methods (including aliases)", "enabled": false, "false_positives": ["Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Suspicious Use Of Web Request in CommandLine", "query": "process.command_line:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ * OR *Net.WebClient* OR *Start\\-BitsTransfer*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/", "https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell"], "timestamp_override": "event.ingested", "author": ["James Pemberton / @4A616D6573"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
