{"description": "Detects shell32.dll executing a DLL in a suspicious directory", "author": ["Christian Burkard (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "32b96012-7892-429e-b26c-ac2bf46066ff", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Shell32 DLL Execution in Suspicious Directory", "query": "(((process.executable.text:\"*\\\\rundll32.exe\") OR (winlog.event_data.OriginalFileName:\"RUNDLL32.EXE\")) AND (process.command_line.text:\"*shell32.dll*\" AND process.command_line.text:\"*Control_RunDLL*\" AND process.command_line.text:(\"*%AppData%*\" OR \"*%LocalAppData%*\" OR \"*%Temp%*\" OR \"*%tmp%*\" OR \"*\\\\AppData\\\\*\" OR \"*\\\\Temp\\\\*\" OR \"*\\\\Users\\\\Public\\\\*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.group-ib.com/resources/threat-research/red-curl-2.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
