{"description": "Detects a suspicious IIS module registration as described in Microsoft threat report on IIS backdoors", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "113c1786-d2a7-6c7c-1b4e-e42ad47d610d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious IIS Module Registration", "query": "(process.parent.executable.text:*\\\\w3wp.exe AND (process.command_line.text:*appcmd.exe\\ add\\ module* OR (process.command_line.text:*\\ system.enterpriseservices.internal.publish* AND process.executable.text:*\\\\powershell.exe) OR process.command_line.text:*\\ \\\\gacutil.exe\\ \\/I*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)", "Microsoft (idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
