{"description": "Detects unknown program using commandline flags usually used by tools such as PsExec and PAExec to start programs with SYSTEM Privileges", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Weird admins that rename their tools", "Software companies that bundle PsExec/PAExec with their software and rename it, so that it is less embarrassing"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "207b0396-3689-42d9-8399-4222658efc99", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Privilege Escalation To LOCAL SYSTEM", "query": "(process.command_line.text:(\"*\\ \\-s\\ cmd*\" OR \"*\\ \\/s\\ cmd*\" OR \"*\\ \\-s\\ \\-i\\ cmd*\" OR \"*\\ \\/s\\ \\/i\\ cmd*\" OR \"*\\ \\/s\\ \\-i\\ cmd*\" OR \"*\\ \\-s\\ \\/i\\ cmd*\" OR \"*\\ \\-i\\ \\-s\\ cmd*\" OR \"*\\ \\/i\\ \\/s\\ cmd*\" OR \"*\\ \\-i\\ \\/s\\ cmd*\" OR \"*\\ \\/i\\ \\-s\\ cmd*\" OR \"*\\ \\-s\\ pwsh*\" OR \"*\\ \\/s\\ pwsh*\" OR \"*\\ \\-s\\ \\-i\\ pwsh*\" OR \"*\\ \\/s\\ \\/i\\ pwsh*\" OR \"*\\ \\/s\\ \\-i\\ pwsh*\" OR \"*\\ \\-s\\ \\/i\\ pwsh*\" OR \"*\\ \\-i\\ \\-s\\ pwsh*\" OR \"*\\ \\/i\\ \\/s\\ pwsh*\" OR \"*\\ \\-i\\ \\/s\\ pwsh*\" OR \"*\\ \\/i\\ \\-s\\ pwsh*\" OR \"*\\ \\-s\\ powershell*\" OR \"*\\ \\/s\\ powershell*\" OR \"*\\ \\-s\\ \\-i\\ powershell*\" OR \"*\\ \\/s\\ \\/i\\ powershell*\" OR \"*\\ \\/s\\ \\-i\\ powershell*\" OR \"*\\ \\-s\\ \\/i\\ powershell*\" OR \"*\\ \\-i\\ \\-s\\ powershell*\" OR \"*\\ \\/i\\ \\/s\\ powershell*\" OR \"*\\ \\-i\\ \\/s\\ powershell*\" OR \"*\\ \\/i\\ \\-s\\ powershell*\") AND (NOT process.command_line.text:(\"*paexec*\" OR \"*PsExec*\" OR \"*accepteula*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Resource Development", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1587", "name": "Develop Capabilities", "reference": "https://attack.mitre.org/techniques/T1587"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/sysinternals/downloads/psexec", "https://www.poweradmin.com/paexec/", "https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
