{"description": "Detects Request to \"amsiInitFailed\" that can be used to disable AMSI Scanning", "author": ["Markus Neis", "@Kostastsale"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "30edb182-aa75-42c0-b0a9-e998bb29067c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential AMSI Bypass Via .NET Reflection", "query": "((process.command_line.text:(\"*System.Management.Automation.AmsiUtils*\" OR \"*amsiInitFailed*\")) OR ((process.command_line.text:\"*\\[Ref\\].Assembly.GetType*\" AND process.command_line.text:\"*SetValue\\($null,$true\\)*\" AND process.command_line.text:\"*NonPublic,Static*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://s3cur3th1ssh1t.github.io/Bypass_AMSI_by_manual_modification/", "https://www.mdsec.co.uk/2018/06/exploring-powershell-amsi-and-logging-evasion/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
