{"description": "Detects usage of \"PresentationHost\" which is a utility that runs \".xbap\" (Browser Applications) files. It can be abused to run malicious \".xbap\" files any bypass AWL", "enabled": false, "false_positives": ["Legitimate \".xbap\" being executed via \"PresentationHost\""], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d22e2925-cfd8-463f-96f6-89cec9d9bc5f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Application Whitelisting Bypass via PresentationHost.exe", "query": "(((process.executable:*\\\\presentationhost.exe OR winlog.event_data.OriginalFileName:\"PresentationHost.exe\") AND process.command_line:*.xbap*) AND (NOT (process.command_line:(*C\\:\\\\Windows\\\\* OR *C\\:\\\\Program\\ Files*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Presentationhost/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
