{"description": "Detects potential RDP connection via Mstsc using a local \".rdp\" file located in suspicious locations.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Likelihood is related to how often the paths are used in the environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6e22722b-dfb1-4508-a911-49ac840b40f8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Mstsc.EXE Execution With Local RDP File", "query": "(((process.executable.text:\"*\\\\mstsc.exe\") OR (winlog.event_data.OriginalFileName:\"mstsc.exe\")) AND process.command_line.text:(\"*.rdp\" OR \"*.rdp\\\"\") AND process.command_line.text:(\"*\\:\\\\Users\\\\Public\\\\*\" OR \"*\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color*\" OR \"*\\:\\\\Windows\\\\System32\\\\Tasks_Migrated\\ *\" OR \"*\\:\\\\Windows\\\\Tasks\\\\*\" OR \"*\\:\\\\Windows\\\\Temp\\\\*\" OR \"*\\:\\\\Windows\\\\Tracing\\\\*\" OR \"*\\\\AppData\\\\Local\\\\Temp\\\\*\" OR \"*\\\\Downloads\\\\*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/", "https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
