{"description": "Detects netsh commands that configure a port forwarding of port 3389 used for RDP", "enabled": false, "false_positives": ["Legitimate administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "782d6f3e-4c5d-4b8c-92a3-1d05fed72e63", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Netsh RDP Port Forwarding", "query": "(process.executable:*\\\\netsh.exe AND process.command_line:*i* AND process.command_line:*\\ p* AND process.command_line:*\\=3389* AND process.command_line:*\\ c*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Lateral Movement", "T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
