{"description": "Detects usage of Gpg4win to decrypt files", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "037dcd71-33a8-4392-bb01-293c94663e5a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File Decryption Using Gpg4win", "query": "(event.category:process AND ((process.executable:(/.*\\\\[Gg][Pp][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Pp][Gg]2\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.Description:/[Gg][Nn][Uu][Pp][Gg]\u2019[Ss]\\ [Oo][Pp][Ee][Nn][Pp][Gg][Pp]\\ [Tt][Oo][Oo][Ll]/)) AND (process.command_line:/.*\\ \\-[Dd]\\ .*/ AND process.command_line.text:*passphrase*))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html", "https://www.gpg4win.de/documentation.html", "https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
