{"description": "Detects suspicious parent processes that should not have any children or should only have a single possible child program", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "62d36208-441f-f940-ca41-7d672c055167", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Process Parents", "query": "(process.parent.executable:(*\\\\minesweeper.exe OR *\\\\winver.exe OR *\\\\bitsadmin.exe) OR (process.parent.executable:(*\\\\csrss.exe OR *\\\\certutil.exe OR *\\\\schtasks.exe OR *\\\\eventvwr.exe OR *\\\\calc.exe OR *\\\\notepad.exe) AND (NOT ((process.executable:(*\\\\WerFault.exe OR *\\\\wermgr.exe OR *\\\\conhost.exe OR *\\\\mmc.exe OR *\\\\win32calc.exe OR *\\\\notepad.exe)) OR (NOT _exists_:process.executable)))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/x86matthew/status/1505476263464607744?s=12", "https://svch0st.medium.com/stats-from-hunting-cobalt-strike-beacons-c17e56255f9b"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
