{"description": "Detects the execution of WMIC in order to get a list of firewall and antivirus products", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "15434e33-5027-4914-88d5-3d4145ec25a9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Product Reconnaissance Via Wmic.EXE", "query": "(((process.executable.text:\"*\\\\wmic.exe\") OR (winlog.event_data.OriginalFileName:\"wmic.exe\")) AND process.command_line.text:\"*Product*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://thedfirreport.com/2023/03/06/2022-year-in-review/", "https://www.yeahhub.com/list-installed-programs-version-path-windows/", "https://learn.microsoft.com/en-us/answers/questions/253555/software-list-inventory-wmic-product"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
