{"description": "Detects the execution GMER tool based on image and hash fields.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9082ff1f-88ab-4678-a3cc-5bcff99fc74d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - GMER Rootkit Detector and Remover Execution", "query": "((process.executable.text:\"*\\\\gmer.exe\") OR (winlog.event_data.Hashes:(*MD5\\=E9DC058440D321AA17D0600B3CA0AB04* OR *SHA1\\=539C228B6B332F5AA523E5CE358C16647D8BBE57* OR *SHA256\\=E8A3E804A96C716A3E9B69195DB6FFB0D33E2433AF871E4D4E1EAB3097237173*)) OR (md5:\"e9dc058440d321aa17d0600b3ca0ab04\") OR (sha1:\"539c228b6b332f5aa523e5ce358c16647d8bbe57\") OR (sha256:\"e8a3e804a96c716a3e9b69195db6ffb0d33e2433af871e4d4e1eab3097237173\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://www.gmer.net/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
