{"description": "Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network", "enabled": false, "false_positives": ["Legitimate ncat use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e31033fc-33f0-4020-9a16-faf9b31cbf08", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Ncat Execution", "query": "(process.executable:(*\\\\ncat.exe OR *\\\\netcat.exe) OR process.command_line:(*\\ \\-lvp\\ * OR *\\ \\-lvnp* OR *\\ \\-l\\ \\-v\\ \\-p\\ * OR *\\ \\-lv\\ \\-p\\ * OR *\\ \\-l\\ \\-\\-proxy\\-type\\ http\\ * OR *\\ \\-\\-exec\\ cmd.exe\\ * OR *\\ \\-vnl\\ \\-\\-exec\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1095"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://nmap.org/ncat/", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md"], "timestamp_override": "event.ingested", "author": ["frack113", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
