{"description": "Detect usage of the \"sqlite\" binary to query databases in Chromium-based browsers for potential data stealing.", "author": ["TropChaud"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5b244b3e-56f3-6871-ac20-db9cc8b29c05", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SQLite Chromium Profile Data DB Access", "query": "(((Product:\"SQLite\") OR (process.executable.text:(*\\\\sqlite.exe OR *\\\\sqlite3.exe))) AND process.command_line.text:(*\\\\User\\ Data\\\\* OR *\\\\Opera\\ Software\\\\* OR *\\\\ChromiumViewer\\\\*) AND process.command_line.text:(*Login\\ Data* OR *Cookies* OR *Web\\ Data* OR *History* OR *Bookmarks*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1005", "T1539", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1539", "name": "Steal Web Session Cookie", "reference": "https://attack.mitre.org/techniques/T1539"}, {"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1005", "name": "Data from Local System", "reference": "https://attack.mitre.org/techniques/T1005"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/84d9edaaaa2c5511144521b0e4af726d1c7276ce/atomics/T1539/T1539.md#atomic-test-2---steal-chrome-cookies-windows", "https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
