{"description": "Detects potential abuse of the provisioning registry key for indirect command execution through \"Provlaunch.exe\".", "author": ["Nasreddine Bencherchali (Nextron Systems)", "Swachchhanda Shrawan Poudel"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Provisioning Registry Key Abuse For Binary Proxy Execution", "query": "(event.category:process AND process.command_line:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Pp][Rr][Oo][Vv][Ii][Ss][Ii][Oo][Nn][Ii][Nn][Gg]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd][Ss]\\\\.*/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/", "https://twitter.com/0gtweet/status/1674399582162153472"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
