{"description": "Detects command line parameters or strings often used by crypto miners", "enabled": false, "false_positives": ["Legitimate use of crypto miners", "Some build frameworks"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bea86f20-a7d9-0534-1f8b-c95a6229ee20", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Crypto Mining Indicators", "query": "(process.command_line.text:(*\\ \\-\\-cpu\\-priority\\=* OR *\\-\\-donate\\-level\\=0* OR *\\ \\-o\\ pool.* OR *\\ \\-\\-nicehash* OR *\\ \\-\\-algo\\=rx\\/0\\ * OR *stratum\\+tcp\\:\\/\\/* OR *stratum\\+udp\\:\\/\\/* OR *LS1kb25hdGUtbGV2ZWw9* OR *0tZG9uYXRlLWxldmVsP* OR *tLWRvbmF0ZS1sZXZlbD* OR *c3RyYXR1bSt0Y3A6Ly* OR *N0cmF0dW0rdGNwOi8v* OR *zdHJhdHVtK3RjcDovL* OR *c3RyYXR1bSt1ZHA6Ly* OR *N0cmF0dW0rdWRwOi8v* OR *zdHJhdHVtK3VkcDovL*) AND (NOT (process.command_line.text:(*\\ pool.c\\ * OR *\\ pool.o\\ * OR *gcc\\ \\-*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1496"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1496", "name": "Resource Hijacking", "reference": "https://attack.mitre.org/techniques/T1496"}]}], "version": 1, "references": ["https://www.poolwatch.io/coin/monero"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
