{"description": "Detects Crassus, a Windows privilege escalation discovery tool, based on PE metadata characteristics.", "author": ["pH-T (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2c32b543-1058-4808-91c6-5b31b8bed6c5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - Crassus Execution", "query": "((process.executable.text:\"*\\\\Crassus.exe\") OR (winlog.event_data.OriginalFileName:\"Crassus.exe\") OR (winlog.event_data.Description:*Crassus*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1590"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/vu-ls/Crassus"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
