{"description": "Detects using register-cimprovider.exe to execute arbitrary dll file.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f15a27a0-0de0-5e3a-7e0f-3d4aab41a118", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DLL Execution Via Register-cimprovider.exe", "query": "(process.executable:*\\\\register\\-cimprovider.exe AND process.command_line:*\\-path* AND process.command_line:*dll*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://twitter.com/PhilipTsukerman/status/992021361106268161", "https://github.com/api0cradle/LOLBAS/blob/master/OSBinaries/Register-cimprovider.md"], "timestamp_override": "event.ingested", "author": ["Ivan Dyachkov", "Yulia Fomina", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
