{"description": "Detects possible payload obfuscation via the commandline", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a77c1610-fc73-4019-8e29-0f51efc04a51", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Dosfuscation Activity", "query": "process.command_line.text:(\"*\\^\\^*\" OR \"*\\^|\\^*\" OR \"*,;,*\" OR \"*;;;;*\" OR \"*;;\\ ;;*\" OR \"*\\(,\\(,*\" OR \"*%COMSPEC\\:\\~*\" OR \"*\\ c\\^m\\^d*\" OR \"*\\^c\\^m\\^d*\" OR \"*\\ c\\^md*\" OR \"*\\ cm\\^d*\" OR \"*\\^cm\\^d*\" OR \"*\\ s\\^et\\ *\" OR \"*\\ s\\^e\\^t\\ *\" OR \"*\\ se\\^t\\ *\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf", "https://github.com/danielbohannon/Invoke-DOSfuscation"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
