{"description": "Detects piping the password to an anydesk instance via CMD and the '--set-password' flag", "enabled": false, "false_positives": ["Legitimate piping of the password to anydesk", "Some FP could occure with similar tools that uses the same command line '--set-password'"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b1377339-fda6-477a-b455-ac0923f9ec2c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AnyDesk Inline Piped Password", "query": "(process.command_line.text:*\\/c* AND process.command_line.text:*echo\\ * AND process.command_line.text:*\\ \\-\\-set\\-password*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
