{"description": "Detects Schtask creations that point to a folder references in environment variables or often used by malware", "enabled": false, "false_positives": ["Benign scheduled tasks creations or executions that happen often during software installations", "Software that uses the AppData folder and scheduled tasks to update the software in the AppData folders"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e2d07820-b12a-6a9e-fd30-f5f00efdf428", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicius Schtasks From Env Var Folder", "query": "(((process.executable:*\\\\schtasks.exe AND process.command_line:*\\ \\/create\\ * AND process.command_line:(*%AppData%* OR *\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\Roaming\\\\* OR *%Public%* OR *\\\\Users\\\\Public* OR *C\\:\\\\Windows\\\\Temp* OR *C\\:\\\\Perflogs*)) OR (process.parent.command_line:*\\\\svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ Schedule AND process.command_line:(*%Public%* OR *\\\\Users\\\\Public* OR *C\\:\\\\Windows\\\\Temp* OR *C\\:\\\\Perflogs*))) AND (NOT ((process.command_line:*update_task.xml* OR process.parent.command_line:*unattended.ini*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/", "https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
