{"description": "Detects a code page switch in command line or batch scripts to a rare language", "author": ["Florian Roth (Nextron Systems)", "Jonhnathan Ribeiro", "oscd.community"], "enabled": false, "false_positives": ["Administrative activity (adjust code pages according to your organization's region)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c7942406-33dd-4377-a564-0f62db0593a3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious CodePage Switch Via CHCP", "query": "(process.executable.text:\"*\\\\chcp.com\" AND process.command_line.text:(\"*\\ 936\" OR \"*\\ 1258\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers", "https://twitter.com/cglyer/status/1183756892952248325"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
