{"description": "Detects Access to Domain Group Policies stored in SYSVOL", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a14ae08d-9ed7-eecf-2585-bce4b63efa85", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious SYSVOL Domain Group Policy Access", "query": "(process.command_line:*\\\\SYSVOL\\\\* AND process.command_line:*\\\\policies\\\\*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://adsecurity.org/?p=2288", "https://www.hybrid-analysis.com/sample/f2943f5e45befa52fb12748ca7171d30096e1d4fc3c365561497c618341299d5?environmentId=100"], "timestamp_override": "event.ingested", "author": ["Markus Neis", "Jonhnathan Ribeiro", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
