{"description":"Attackers may leverage fsutil to enumerated connected drives. Author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Certain software or administrative tasks may trigger false positivies."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"616e0c53-56b3-e3c7-0cb9-0bc378790c4c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Fsutil Drive Enumeration","query":"((process.executable:*\\\\fsutil.exe OR winlog.event_data.OriginalFileName:\"fsutil.exe\") AND process.command_line:*drives*)","meta":{"from":"1m"},"severity":"low","tags":["T1120"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
