{"description": "Detects the execution of the hacktool Rubeus via PE information of command line parameters", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7ec2c172-dceb-4c10-92c9-87c1881b7e18", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "HackTool - Rubeus Execution", "query": "((process.executable.text:\"*\\\\Rubeus.exe\") OR (winlog.event_data.OriginalFileName:\"Rubeus.exe\") OR (winlog.event_data.Description:\"Rubeus\") OR (process.command_line.text:(\"*asreproast\\ *\" OR \"*dump\\ \\/service\\:krbtgt\\ *\" OR \"*dump\\ \\/luid\\:0x*\" OR \"*kerberoast\\ *\" OR \"*createnetonly\\ \\/program\\:*\" OR \"*ptt\\ \\/ticket\\:*\" OR \"*\\/impersonateuser\\:*\" OR \"*renew\\ \\/ticket\\:*\" OR \"*asktgt\\ \\/user\\:*\" OR \"*harvest\\ \\/interval\\:*\" OR \"*s4u\\ \\/user\\:*\" OR \"*s4u\\ \\/ticket\\:*\" OR \"*hash\\ \\/password\\:*\" OR \"*golden\\ \\/aes256\\:*\" OR \"*silver\\ \\/user\\:*\")))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "Lateral Movement", "T1003", "T1550", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://blog.harmj0y.net/redteaming/from-kekeo-to-rubeus", "https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html", "https://github.com/GhostPack/Rubeus"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
