{"description": "Detects uses of the SysInternals Procdump utility in which procdump or its output get renamed or a dump file is moved ot copied to a different name", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Cases in which procdump just gets copied to a different directory without any renaming"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f7c26536-173b-c31b-ffdf-50602f45882e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Procdump Evasion", "query": "((process.command_line.text:(*copy\\ procdump* OR *move\\ procdump*)) OR ((process.command_line.text:*copy\\ * AND process.command_line.text:*.dmp\\ * AND process.command_line.text:(*2.dmp* OR *lsass* OR *out.dmp*))) OR (process.command_line.text:(*copy\\ lsass.exe_* OR *move\\ lsass.exe_*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1480785527901204481"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
