{"description":"Detects reg command lines that disable certain important features of Microsoft Defender Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"452bce90-6fb0-43cc-97a5-affc283139b3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Registry Defender Tampering","query":"(process.executable:*\\\\reg.exe AND process.command_line:(*SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\* OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\*) AND process.command_line:*\\ add\\ * AND process.command_line:*\\ \\/d\\ 0*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
