{"description": "Detects piping the password to an anydesk instance via CMD and the '--set-password' flag.", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate piping of the password to anydesk", "Some FP could occure with similar tools that uses the same command line '--set-password'"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ffa2fcbc-cc3b-71a2-b5a9-d55f8ffe79e9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AnyDesk Piped Password Via CLI", "query": "(process.command_line.text:*\\/c\\ * AND process.command_line.text:*echo\\ * AND process.command_line.text:*.exe\\ \\-\\-set\\-password*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
