{"description": "Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems", "enabled": false, "false_positives": ["Administrator, hotline ask to user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40c8941d-3d3d-9cd7-8737-ade72b777496", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Suspicious Network Command", "query": "process.command_line:(*ipconfig\\ \\/all* OR *netsh\\ interface\\ show\\ interface* OR *arp\\ \\-a* OR *nbtstat\\ \\-n* OR *net\\ config* OR *route\\ print*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1016"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1016", "name": "System Network Configuration Discovery", "reference": "https://attack.mitre.org/techniques/T1016"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md#atomic-test-1---system-network-configuration-discovery-on-windows"], "timestamp_override": "event.ingested", "author": ["frack113", "Christopher Peacock '@securepeacock'", "SCYTHE '@scythe_io'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
