{"description": "Detects usage of winget to add a new insecure (http) download source.\nWinget will not allow the addition of insecure sources, hence this could indicate potential suspicious activity (or typos)\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives might occur if the users are unaware of such control checks"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Add Insecure Download Source To Winget", "query": "(((process.executable.text:\"*\\\\winget.exe\") OR (winlog.event_data.OriginalFileName:\"winget.exe\")) AND (process.command_line.text:\"*source\\ *\" AND process.command_line.text:\"*add\\ *\" AND process.command_line.text:\"*http\\:\\/\\/*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/package-manager/winget/source", "https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
