{"description": "Detects unusual parent or children of the wab.exe (Windows Contacts) process as seen being used with bumblebee activity", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c4069b9b-0fff-a987-6735-870189a92379", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Wab.Exe Unusual Parent Or Child Processes", "query": "((process.parent.executable.text:(*\\\\WmiPrvSE.exe OR *\\\\svchost.exe OR *\\\\dllhost.exe) AND process.executable.text:*\\\\wab.exe) OR process.parent.executable.text:*\\\\wab.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
