{"description": "Adversaries may establish persistence by executing malicious content triggered by user inactivity.\nScreensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension\n", "enabled": false, "false_positives": ["GPO"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bcfc4586-0aa5-336b-4d6d-17d5acbf9fae", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious ScreenSave Change by Reg.exe", "query": "(process.executable:*\\\\reg.exe AND process.command_line:(*HKEY_CURRENT_USER\\\\Control\\ Panel\\\\Desktop* OR *HKCU\\\\Control\\ Panel\\\\Desktop*) AND process.command_line:*\\/t\\ REG_SZ* AND process.command_line:*\\/f* AND ((process.command_line:*\\/v\\ ScreenSaveActive* AND process.command_line:*\\/d\\ 1*) OR (process.command_line:*\\/v\\ ScreenSaveTimeout* AND process.command_line:*\\/d\\ *) OR (process.command_line:*\\/v\\ ScreenSaverIsSecure* AND process.command_line:*\\/d\\ 0*) OR (process.command_line:*\\/v\\ SCRNSAVE.EXE* AND process.command_line:*\\/d\\ * AND process.command_line:*.scr*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.002/T1546.002.md", "https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
