{"description": "Detect use of sqlite binary to query the Firefox cookies.sqlite database and steal the cookie data contained within it", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4833155a-4053-4c9c-a997-777fcea0baa7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SQLite Firefox Cookie DB Access", "query": "(((Product:\"SQLite\") OR (process.executable.text:(*\\\\sqlite.exe OR *\\\\sqlite3.exe))) AND process.command_line.text:*cookies.sqlite*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1539"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1539", "name": "Steal Web Session Cookie", "reference": "https://attack.mitre.org/techniques/T1539"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1539/T1539.md#atomic-test-1---steal-firefox-cookies-windows"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
