{"description": "Detects persitence via netsh helper", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56321594-9087-49d9-bf10-524fe8479452", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Netsh DLL Persistence", "query": "(process.executable:*\\\\netsh.exe AND process.command_line:*add* AND process.command_line:*helper*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.007/T1546.007.md", "https://attack.mitre.org/software/S0108/"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
