{"description": "Detects usage of the wevtutil utility to perform reconnaissance", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitmate usage of the utility by administrators to query the event log"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4acaf9f9-9864-8b30-a30c-de2bc34ca089", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Recon Activity Using Wevtutil", "query": "(process.executable.text:*\\\\wevtutil.exe AND process.command_line.text:(*\\ qe\\ * OR *\\ query\\-events\\ *) AND process.command_line.text:(*Microsoft\\-Windows\\-TerminalServices\\-LocalSessionManager\\/Operational* OR *Microsoft\\-Windows\\-Terminal\\-Services\\-RemoteConnectionManager\\/Operational* OR *Security*))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
