{"description": "Detects potential evasion or obfuscation attempts using bogus path traversal via the commandline", "author": ["Christian Burkard (Nextron Systems)"], "enabled": false, "false_positives": ["Google Drive", "Citrix"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1327381e-6ab0-4f38-b583-4c1b8346a56b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Command Line Path Traversal Evasion Attempt", "query": "((((process.executable.text:\"*\\\\Windows\\\\*\" AND process.command_line.text:(\"*\\\\..\\\\Windows\\\\*\" OR \"*\\\\..\\\\System32\\\\*\" OR \"*\\\\..\\\\..\\\\*\"))) OR (process.command_line.text:\"*.exe\\\\..\\\\*\")) AND (NOT ((process.command_line.text:\"*\\\\Google\\\\Drive\\\\googledrivesync.exe\\\\..\\\\*\") OR (process.command_line.text:\"*\\\\Citrix\\\\Virtual\\ Smart\\ Card\\\\Citrix.Authentication.VirtualSmartcard.Launcher.exe\\\\..\\\\*\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/hexacorn/status/1448037865435320323", "https://twitter.com/Gal_B1t/status/1062971006078345217"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
