{"description":"Detects Pandemic Windows Implant Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9fefd33c-339d-4495-9cba-b96ca006f512","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Pandemic Registry Key","query":"process.command_line:*loaddll\\ \\-a\\ *","meta":{"from":"1m"},"severity":"critical","tags":["Lateral Movement","T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
