{"description": "Detects suspicious Splwow64.exe process without any command line parameters", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1f1a8509-2cbb-44f5-8751-8e1571518ce2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Splwow64 Without Params", "query": "(process.executable:*\\\\splwow64.exe AND process.command_line:*splwow64.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://twitter.com/sbousseaden/status/1429401053229891590?s=12"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
