{"description": "Detects the use of the WMI command-line (WMIC) utility to identify and display various system information,\nincluding OS, CPU, GPU, and disk drive names; memory capacity; display resolution; and baseboard, BIOS,\nand GPU driver products/versions.\nSome of these commands were used by Aurora Stealer in late 2022/early 2023.\n", "author": ["TropChaud"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9d5a1274-922a-49d0-87f3-8c653483b909", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential System Information Discovery Via Wmic.EXE", "query": "(((winlog.event_data.Description:\"WMI Commandline Utility\") OR (winlog.event_data.OriginalFileName:\"wmic.exe\") OR (process.executable.text:\"*\\\\WMIC.exe\")) AND process.command_line.text:(\"*baseboard\\ get\\ product*\" OR \"*baseboard\\ get\\ version*\" OR \"*bios\\ get\\ SMBIOSBIOSVersion*\" OR \"*cpu\\ get\\ name*\" OR \"*DISKDRIVE\\ get\\ Caption*\" OR \"*LOGICALDISK\\ get\\ Name,Size,FreeSpace*\" OR \"*MEMPHYSICAL\\ get\\ MaxCapacity*\" OR \"*OS\\ get\\ Caption,OSArchitecture,Version*\" OR \"*path\\ win32_VideoController\\ get\\ DriverVersion*\" OR \"*path\\ win32_VideoController\\ get\\ name*\" OR \"*path\\ win32_VideoController\\ get\\ VideoModeDescription*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1082"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1082", "name": "System Information Discovery", "reference": "https://attack.mitre.org/techniques/T1082"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/a2ccd19c37d0278b4ffa8583add3cf52060a5418/atomics/T1082/T1082.md#atomic-test-25---system-information-discovery-with-wmic", "https://nwgat.ninja/getting-system-information-with-wmic-on-windows/", "https://blog.sekoia.io/aurora-a-rising-stealer-flying-under-the-radar", "https://blog.cyble.com/2023/01/18/aurora-a-stealer-using-shapeshifting-tactics/", "https://app.any.run/tasks/a6aa0057-82ec-451f-8f99-55650ca537da/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
