{"description": "Detects suspicious child process creations of VMware Tools process which may indicate persistence setup", "author": ["bohops", "Bhabesh Raj"], "enabled": false, "false_positives": ["Legitimate use by VM administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5687f942-867b-4578-ade7-1e341c46e99a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "VMToolsd Suspicious Child Process", "query": "((process.parent.executable:/.*\\\\\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/ AND ((process.executable:(/.*\\\\\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.OriginalFileName:(/[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ OR /[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ OR /[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/)))) AND (NOT (((process.executable:/.*\\\\\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Oo][Nn]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/ OR /.*\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Oo][Ff][Ff]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/ OR /.*\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\\\\\[Rr][Ee][Ss][Uu][Mm][Ee]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/ OR /.*\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\\\\\[Ss][Uu][Ss][Pp][Ee][Nn][Dd]\\-[Vv][Mm]\\-[Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\.[Bb][Aa][Tt].*/))) OR ((process.executable:/.*\\\\\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line.text:)) OR ((process.executable:/.*\\\\\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND NOT _exists_:process.command_line.text)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/", "https://user-images.githubusercontent.com/61026070/136518004-b68cce7d-f9b8-4e9a-9b7b-53b1568a9a94.png"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
