{"description": "Detects calls to base64 encoded WMI class such as \"Win32_Shadowcopy\", \"\"...etc.", "author": ["Christian Burkard", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "88f3c9e6-6023-5dfe-fcfe-3f95c98366e1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Base64 Encoded WMI Classes", "query": "(((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND ((process.command_line.text:(*VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQ* OR *cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkA* OR *XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5A* OR *V2luMzJfU2hhZG93Y29we* OR *dpbjMyX1NoYWRvd2NvcH* OR *XaW4zMl9TaGFkb3djb3B5*)) OR (process.command_line.text:(*VwBpAG4AMwAyAF8AUwBjAGgAZQBkAHUAbABlAGQASgBvAGIA* OR *cAaQBuADMAMgBfAFMAYwBoAGUAZAB1AGwAZQBkAEoAbwBiA* OR *XAGkAbgAzADIAXwBTAGMAaABlAGQAdQBsAGUAZABKAG8AYg* OR *V2luMzJfU2NoZWR1bGVkSm9i* OR *dpbjMyX1NjaGVkdWxlZEpvY* OR *XaW4zMl9TY2hlZHVsZWRKb2*)) OR (process.command_line.text:(*VwBpAG4AMwAyAF8AUAByAG8AYwBlAHMAcw* OR *cAaQBuADMAMgBfAFAAcgBvAGMAZQBzAHMA* OR *XAGkAbgAzADIAXwBQAHIAbwBjAGUAcwBzA* OR *V2luMzJfUHJvY2Vzc* OR *dpbjMyX1Byb2Nlc3* OR *XaW4zMl9Qcm9jZXNz*)) OR (process.command_line.text:(*VwBpAG4AMwAyAF8AVQBzAGUAcgBBAGMAYwBvAHUAbgB0A* OR *cAaQBuADMAMgBfAFUAcwBlAHIAQQBjAGMAbwB1AG4AdA* OR *XAGkAbgAzADIAXwBVAHMAZQByAEEAYwBjAG8AdQBuAHQA* OR *V2luMzJfVXNlckFjY291bn* OR *dpbjMyX1VzZXJBY2NvdW50* OR *XaW4zMl9Vc2VyQWNjb3Vud*)) OR (process.command_line.text:(*VwBpAG4AMwAyAF8ATABvAGcAZwBlAGQATwBuAFUAcwBlAHIA* OR *cAaQBuADMAMgBfAEwAbwBnAGcAZQBkAE8AbgBVAHMAZQByA* OR *XAGkAbgAzADIAXwBMAG8AZwBnAGUAZABPAG4AVQBzAGUAcg* OR *V2luMzJfTG9nZ2VkT25Vc2Vy* OR *dpbjMyX0xvZ2dlZE9uVXNlc* OR *XaW4zMl9Mb2dnZWRPblVzZX*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
