{"description": "Detects Possible usage of Windows Subsystem for Linux (WSL) binary as a LOLBIN to execute arbitrary linux and windows commands", "author": ["oscd.community", "Zach Stanford @svch0st", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Automation and orchestration scripts may use this method execute scripts etc", "Legitimate use by Windows to kill processes opened via WSL (example VsCode WSL server)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dec44ca7-61ad-493c-bfd7-8819c5faa09b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Arbitrary Command Execution Using WSL", "query": "((((process.executable.text:*\\\\wsl.exe) OR (winlog.event_data.OriginalFileName:\"wsl.exe\")) AND process.command_line.text:(*\\ \\-e\\ * OR *\\ \\-\\-exec* OR *\\ \\-\\-system* OR *\\ \\-\\-shell\\-type\\ * OR *\\ \\/mnt\\/c* OR *\\ \\-\\-user\\ root* OR *\\ \\-u\\ root*)) AND (NOT (process.parent.executable.text:*\\\\cmd.exe AND process.command_line.text:*\\ \\-d\\ * AND process.command_line.text:*\\ \\-e\\ kill\\ *)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/", "https://twitter.com/nas_bench/status/1535431474429808642"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
