{"description": "In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate tool \"Mouse Lock\" as being used for both credential access and collection in security incidents.", "enabled": false, "false_positives": ["Legitimate uses of Mouse Lock software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c9192ad9-75e5-43eb-8647-82a0a5b493e3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Mouse Lock Credential Gathering", "query": "(Product:*Mouse\\ Lock* OR Company:*Misc314* OR process.command_line:*Mouse\\ Lock_*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1056"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}], "version": 1, "references": ["https://github.com/klsecservices/Publications/blob/master/Incident-Response-Analyst-Report-2020.pdf", "https://sourceforge.net/projects/mouselock/"], "timestamp_override": "event.ingested", "author": ["Cian Heasley"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
