{"description": "Detects the execution of DeviceCredentialDeployment to hide a process from view", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b8b1b304-a60f-4999-9a6e-c547bde03ffd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DeviceCredentialDeployment Execution", "query": "process.executable.text:*\\\\DeviceCredentialDeployment.exe", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/pull/147"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
