{"description": "Detects file download using curl.exe", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56454143-524f-49fb-b1c6-3fb8b1ad41fb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious File Download From File Sharing Domain Via Curl.EXE", "query": "(((process.executable.text:\"*\\\\curl.exe\") OR (winlog.event_data.OriginalFileName:\"curl.exe\")) AND (((process.command_line:/://[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}/)) OR (process.command_line.text:(\"*anonfiles.com*\" OR \"*cdn.discordapp.com\\/attachments\\/*\" OR \"*ddns.net*\" OR \"*ghostbin.co\\/*\" OR \"*gist.githubusercontent.com*\" OR \"*hastebin.com*\" OR \"*mediafire.com*\" OR \"*mega.nz*\" OR \"*paste.ee*\" OR \"*pastebin.com*\" OR \"*pastebin.pl*\" OR \"*pastetext.net*\" OR \"*privatlab.com*\" OR \"*privatlab.net*\" OR \"*raw.githubusercontent.com*\" OR \"*send.exploit.in*\" OR \"*sendspace.com*\" OR \"*storage.googleapis.com*\" OR \"*temp.sh*\" OR \"*transfer.sh*\" OR \"*ufile.io*\"))) AND process.command_line.text:\"*http*\" AND process.command_line.text:(\"*\\ \\-O*\" OR \"*\\-\\-remote\\-name*\" OR \"*\\-\\-output*\") AND process.command_line.text:(\"*.ps1\" OR \"*.ps1'\" OR \"*.ps1\\\"\" OR \"*.bat\" OR \"*.bat'\" OR \"*.bat\\\"\" OR \"*.exe\" OR \"*.exe'\" OR \"*.exe\\\"\" OR \"*.vbs\" OR \"*.vbs'\" OR \"*.vbs\\\"\" OR \"*.vbe\" OR \"*.vbe'\" OR \"*.vbe\\\"\" OR \"*.hta\" OR \"*.hta'\" OR \"*.hta\\\"\" OR \"*.dll\" OR \"*.dll'\" OR \"*.dll\\\"\" OR \"*.psm1\" OR \"*.psm1'\" OR \"*.psm1\\\"\"))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://labs.withsecure.com/publications/fin7-target-veeam-servers", "https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
