{"description": "Detects the use of NSudo tool for command execution", "enabled": false, "false_positives": ["Legitimate use by administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e4b529e3-b756-977a-3e5d-256615928896", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NSudo Tool Execution", "query": "((process.executable:(*\\\\NSudo.exe OR *\\\\NSudoLC.exe OR *\\\\NSudoLG.exe) OR winlog.event_data.OriginalFileName:(\"NSudo.exe\" OR \"NSudoLC.exe\" OR \"NSudoLG.exe\")) AND process.command_line:(*\\-U\\:S\\ * OR *\\-U\\:T\\ * OR *\\-U\\:E\\ * OR *\\-P\\:E\\ * OR *\\-M\\:S\\ * OR *\\-M\\:H\\ * OR *\\-U\\=S\\ * OR *\\-U\\=T\\ * OR *\\-U\\=E\\ * OR *\\-P\\=E\\ * OR *\\-M\\=S\\ * OR *\\-M\\=H\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://nsudo.m2team.org/en-us/", "https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
