{"description": "Detects python spawning a pretty tty", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "480e7e51-e797-47e3-8d72-ebfce65b6d8d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Python Spawning Pretty TTY on Windows", "query": "(process.executable:(*python.exe OR *python3.exe OR *python2.exe) AND ((process.command_line:*import\\ pty* AND process.command_line:*.spawn\\(*) OR process.command_line:*from\\ pty\\ import\\ spawn*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/"], "timestamp_override": "event.ingested", "author": ["Nextron Systems"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
