{"description": "Detects the export of a crital Registry key to a file.", "enabled": false, "false_positives": ["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "82880171-b475-4201-b811-e9c826cd5eaa", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Exports Critical Registry Keys To a File", "query": "(process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/E\\ * OR *\\ \\-E\\ *) AND process.command_line:(*hklm* OR *hkey_local_machine*) AND process.command_line:(*\\\\system OR *\\\\sam OR *\\\\security))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1012"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Regedit/", "https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"], "timestamp_override": "event.ingested", "author": ["Oddvar Moe", "Sander Wiebing", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
