{"description": "Detects a suspicious execution from an uncommon folder", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f2138e97-9771-ed9b-0cdc-ebd13ad82280", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution from Suspicious Folder", "query": "((process.executable:(*\\\\$Recycle.bin\\\\* OR *\\\\config\\\\systemprofile\\\\* OR *\\\\Intel\\\\Logs\\\\* OR *\\\\RSA\\\\MachineKeys\\\\* OR *\\\\Users\\\\All\\ Users\\\\* OR *\\\\Users\\\\Default\\\\* OR *\\\\Users\\\\NetworkService\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\addins\\\\* OR *\\\\Windows\\\\debug\\\\* OR *\\\\Windows\\\\Fonts\\\\* OR *\\\\Windows\\\\Help\\\\* OR *\\\\Windows\\\\IME\\\\* OR *\\\\Windows\\\\Media\\\\* OR *\\\\Windows\\\\repair\\\\* OR *\\\\Windows\\\\security\\\\* OR *\\\\Windows\\\\System32\\\\Tasks\\\\* OR *\\\\Windows\\\\Tasks\\\\*) OR process.executable:C\\:\\\\Perflogs\\\\*) AND (NOT (process.executable:C\\:\\\\Users\\\\Public\\\\IBM\\\\ClientSolutions\\\\Start_Programs\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://github.com/mbevilacqua/appcompatprocessor/blob/master/AppCompatSearch.txt", "https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses", "https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/", "https://github.com/ThreatHuntingProject/ThreatHunting/blob/master/hunts/suspicious_process_creation_via_windows_event_logs.md"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
