{"description": "Detects ADDInternals Cmdlet execution. A tool for administering Azure AD and Office 365. Which can be abused by threat actors to attack Azure AD or Office 365.", "author": ["Austin Songer (@austinsonger)", "Nasreddine Bencherchali (update)"], "enabled": false, "false_positives": ["Legitimate use of the library for administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c86500e9-a645-4680-98d7-f882c70c1ea3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AADInternals PowerShell Cmdlets Execution - ProccessCreation", "query": "(((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.Exe\" OR \"pwsh.dll\"))) AND process.command_line.text:(*Add\\-AADInt* OR *ConvertTo\\-AADInt* OR *Disable\\-AADInt* OR *Enable\\-AADInt* OR *Export\\-AADInt* OR *Get\\-AADInt* OR *Grant\\-AADInt* OR *Install\\-AADInt* OR *Invoke\\-AADInt* OR *Join\\-AADInt* OR *New\\-AADInt* OR *Open\\-AADInt* OR *Read\\-AADInt* OR *Register\\-AADInt* OR *Remove\\-AADInt* OR *Restore\\-AADInt* OR *Search\\-AADInt* OR *Send\\-AADInt* OR *Set\\-AADInt* OR *Start\\-AADInt* OR *Update\\-AADInt*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://o365blog.com/aadinternals/", "https://github.com/Gerenios/AADInternals"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
