{"description": "Well-known DNS Exfiltration tools execution", "enabled": false, "false_positives": ["Legitimate usage of iodine or dnscat2 \u2014 DNS Exfiltration tools (unlikely)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5be79405-639e-b18f-5e16-460b9cd16d29", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DNS Exfiltration and Tunneling Tools Execution", "query": "(process.executable:*\\\\iodine.exe OR process.executable:*\\\\dnscat2*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1048", "T1071", "T1132"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
