{"description": "Detects process command line patterns and locations used by REvil group in Kaseya incident (can also match on other malware)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "75b83a33-f652-e7eb-375a-b6e0b89b5d10", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "REvil Kaseya Incident Malware Patterns", "query": "(process.command_line:(*C\\:\\\\Windows\\\\cert.exe* OR *del\\ \\/q\\ \\/f\\ c\\:\\\\kworking\\\\agent.crt* OR *Kaseya\\ VSA\\ Agent\\ Hot\\-fix* OR *\\\\AppData\\\\Local\\\\Temp\\\\MsMpEng.exe* OR *rmdir\\ \\/s\\ \\/q\\ %SystemDrive%\\\\inetpub\\\\logs* OR *del\\ \\/s\\ \\/q\\ \\/f\\ %SystemDrive%\\\\*.log* OR *c\\:\\\\kworking1\\\\agent.exe* OR *c\\:\\\\kworking1\\\\agent.crt*) OR process.executable:(\"C\\:\\\\Windows\\\\MsMpEng.exe\" OR \"C\\:\\\\Windows\\\\cert.exe\" OR \"C\\:\\\\kworking\\\\agent.exe\" OR \"C\\:\\\\kworking1\\\\agent.exe\") OR (process.command_line:*del\\ \\/s\\ \\/q\\ \\/f* AND process.command_line:*WebPages\\\\Errors\\\\webErrorLog.txt*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://community.sophos.com/b/security-blog/posts/active-ransomware-attack-on-kaseya-customers", "https://www.joesandbox.com/analysis/443736/0/html", "https://doublepulsar.com/kaseya-supply-chain-attack-delivers-mass-ransomware-event-to-us-companies-76e4ec6ec64b", "https://therecord.media/revil-ransomware-executes-supply-chain-attack-via-malicious-kaseya-update/", "https://blog.truesec.com/2021/07/04/kaseya-supply-chain-attack-targeting-msps-to-deliver-revil-ransomware/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
