{"description": "Detects the pattern of UAC Bypass using ICMLuaUtil Elevated COM interface", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "49f2f17b-b4c8-4172-a68b-d5bf95d05130", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "UAC Bypass via ICMLuaUtil", "query": "((process.executable.text:*\\\\dllhost.exe AND process.parent.command_line.text:(\"\\/Processid\\:\\{3E5FC7F9\\-9A51\\-4367\\-9063\\-A120244FBEC7\\}\" OR \"\\/Processid\\:\\{D2E7041B\\-2927\\-42FB\\-8E9F\\-7CE93B6DC937\\}\")) AND (NOT (process.executable.text:*\\\\WerFault.exe OR winlog.event_data.OriginalFileName:\"WerFault.exe\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/uac-bypass-via-icmluautil-elevated-com-interface.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
