{"description": "Detect indirect command execution via Program Compatibility Assistant pcwrun.exe", "enabled": false, "false_positives": ["Need to use extra processing with 'unique_count' / 'filter' to focus on outliers as opposed to commonly seen artifacts", "Legit usage of scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b97cd4b1-30b8-4a9d-bd72-6293928d52bc", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Indirect Command Execution By Program Compatibility Wizard", "query": "process.parent.executable:*\\\\pcwrun.exe", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/pabraeken/status/991335019833708544", "https://lolbas-project.github.io/lolbas/Binaries/Pcwrun/"], "timestamp_override": "event.ingested", "author": ["A. Sungurov ", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
