{"description": "Detects when a share is mounted using the \"net.exe\" utility", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate activity by administrators and scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f117933c-980c-4f78-b384-e3d838111165", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Windows Share Mounted Via Net.EXE", "query": "(process.executable.text:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line.text:(*\\ use\\ * OR *\\ \\\\\\\\*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
