{"description": "Detects the execution of a renamed \"CURL.exe\" binary based on the PE metadata fields", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7530cd3d-7671-43e3-b209-976966f6ea48", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Renamed CURL.EXE Execution", "query": "(event.category:process AND ((winlog.event_data.OriginalFileName:/[Cc][Uu][Rr][Ll]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.Description:/[Tt][Hh][Ee]\\ [Cc][Uu][Rr][Ll]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Aa][Bb][Ll][Ee]/)) AND (NOT process.executable:/.*\\\\[Cc][Uu][Rr][Ll].*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1059", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://twitter.com/Kostastsale/status/1700965142828290260"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
