{"description":"Detects command that type the content of ntdll.dll to a different file or a pipe in order to evade AV / EDR detection Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e7dd463f-167b-b4e6-d3be-e345124dd1e7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Ntdll Pipe Redirection","query":"process.command_line:(*type\\ %windir%\\\\system32\\\\ntdll.dll* OR *type\\ %systemroot%\\\\system32\\\\ntdll.dll* OR *type\\ c\\:\\\\windows\\\\system32\\\\ntdll.dll* OR *\\\\ntdll.dll\\ >\\ \\\\\\\\.\\\\pipe\\\\\\*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
