{"description": "Detects usage of bitsadmin downloading a file to a suspicious target folder", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2ddef153-167b-4e89-86b6-757a9e65dcac", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Download Via Bitsadmin To A Suspicious Target Folder", "query": "(((process.executable:/.*\\\\\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:(/.*\\:\\\\\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss].*/ OR /.*\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\.*/ OR /.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/ OR /.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\\\\\.*/ OR /.*\\\\\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\\\\\.*/ OR /.*%[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]%.*/ OR /.*%[Pp][Uu][Bb][Ll][Ii][Cc]%.*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/", "https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
