{"description": "Detects a suspicious DLL loading from AppData Local path as described in BlueMashroom report", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bd70d3f8-e60e-4d25-89f0-0b5a9cff20e0", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "BlueMashroom DLL Load", "query": "((process.command_line:*\\\\AppData\\\\Local\\\\* AND (process.command_line:*\\\\regsvr32* OR process.command_line:*,DllEntry*)) AND (NOT ((process.command_line:*AppData\\\\Local\\\\Microsoft\\\\TeamsMeetingAddin\\\\* OR process.command_line:(*\\\\x86\\\\Microsoft.Teams.AddinLoader.dll OR *\\\\x86\\\\Microsoft.Teams.AddinLoader.dll\\\" OR *\\\\x64\\\\Microsoft.Teams.AddinLoader.dll OR *\\\\x64\\\\Microsoft.Teams.AddinLoader.dll\\\")))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.virusbulletin.com/conference/vb2019/abstracts/apt-cases-exploiting-vulnerabilities-region-specific-software"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
