{"description": "Detects suspicious sub processes spawned by PowerShell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dd0b2728-4ff1-ffac-e60f-04a0cf0c4568", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PowerShell Sub Processes", "query": "((process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\powershell_ise.exe) AND process.executable:(*\\\\sh.exe OR *\\\\bash.exe OR *\\\\schtasks.exe OR *\\\\certutil.exe OR *\\\\bitsadmin.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\scrcons.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe)) AND (NOT (process.parent.command_line:*\\\\Program\\ Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\* AND process.command_line:*\\\\Program\\ Files\\\\Amazon\\\\WorkspacesConfig\\\\Scripts\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/ankit_anubhav/status/1518835408502620162"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
