{"description": "Detects creation of a new service via \"sc\" command or the powershell \"new-service\" cmdlet with suspicious binary paths", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious New Service Creation", "query": "(((process.executable.text:*\\\\sc.exe AND process.command_line.text:*create* AND process.command_line.text:*binPath\\=*) OR (process.command_line.text:*New\\-Service* AND process.command_line.text:*\\-BinaryPathName*)) AND process.command_line.text:(*powershell* OR *mshta* OR *wscript* OR *cscript* OR *svchost* OR *dllhost* OR *cmd\\ * OR *cmd.exe\\ \\/c* OR *cmd.exe\\ \\/k* OR *rundll32* OR *C\\:\\\\Users\\\\Public* OR *\\\\Downloads\\\\* OR *\\\\Desktop\\\\* OR *\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\AppData\\\\Local\\\\Temp*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md", "https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
