{"description": "Detects execution of javascript code using \"mshta.exe\".", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "67f113fa-e23d-4271-befa-30113b3e08b1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious JavaScript Execution Via Mshta.EXE", "query": "(((process.executable.text:*\\\\mshta.exe) OR (winlog.event_data.OriginalFileName:\"MSHTA.EXE\")) AND process.command_line.text:*javascript*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://eqllib.readthedocs.io/en/latest/analytics/6bc283c4-21f2-4aed-a05c-a9a3ffa95dd4.html", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.005/T1218.005.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
