{"description": "Detects the use of WinAPI Functions via the commandline as seen used by threat actors via the tool winapiexec", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7812aff2-a87f-70c2-9430-1f2288f4f310", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential WinAPI Access Via CommandLine", "query": "process.command_line.text:(*\\ WaitForSingleObject\\ * OR *\\ QueueUserApc\\ * OR *\\ RtlCreateUserThread\\ * OR *\\ OpenProcess\\ * OR *\\ VirtualAlloc\\ * OR *\\ VirtualFree\\ * OR *\\ WriteProcessMemory\\ * OR *\\ CreateUserThread\\ * OR *\\ CloseHandle\\ * OR *\\ GetDelegateForFunctionPointer\\ * OR *\\ CreateThread\\ * OR *\\ memcpy\\ * OR *\\ LoadLibrary\\ * OR *\\ GetModuleHandle\\ * OR *\\ GetProcAddress\\ * OR *\\ VirtualProtect\\ * OR *\\ FreeLibrary\\ * OR *\\ ReadProcessMemory\\ * OR *\\ CreateRemoteThread\\ * OR *\\ AdjustTokenPrivileges\\ * OR *\\ WriteInt32\\ * OR *\\ OpenThreadToken\\ * OR *\\ PtrToString\\ * OR *\\ FreeHGlobal\\ * OR *\\ ZeroFreeGlobalAllocUnicode\\ * OR *\\ OpenProcessToken\\ * OR *\\ GetTokenInformation\\ * OR *\\ SetThreadToken\\ * OR *\\ ImpersonateLoggedOnUser\\ * OR *\\ RevertToSelf\\ * OR *\\ GetLogonSessionData\\ * OR *\\ CreateProcessWithToken\\ * OR *\\ DuplicateTokenEx\\ * OR *\\ OpenWindowStation\\ * OR *\\ OpenDesktop\\ * OR *\\ MiniDumpWriteDump\\ * OR *\\ AddSecurityPackage\\ * OR *\\ EnumerateSecurityPackages\\ * OR *\\ GetProcessHandle\\ * OR *\\ DangerousGetHandle\\ * OR *\\ kernel32\\ * OR *\\ Advapi32\\ * OR *\\ msvcrt\\ * OR *\\ ntdll\\ * OR *\\ user32\\ * OR *\\ secur32\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["https://twitter.com/m417z/status/1566674631788007425"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
