{"description": "Detect download by BITS jobs via PowerShell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f67dbfce-93bc-440d-86ad-a95ae8858c90", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Bitsadmin Job via PowerShell", "query": "(process.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line:*Start\\-BitsTransfer*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://eqllib.readthedocs.io/en/latest/analytics/ec5180c9-721a-460f-bddc-27539a284273.html", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md"], "timestamp_override": "event.ingested", "author": ["Endgame", "JHasenbusch (ported to sigma for oscd.community)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
