{"description": "Detects a curl process start on Windows, which indicates a file download from a remote location or a simple web request to a remote server", "enabled": false, "false_positives": ["Scripts created by developers and admins", "Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bbeaed61-1990-4773-bf57-b81dbad7db2d", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Curl Usage on Windows", "query": "(process.executable:*\\\\curl.exe OR Product:\"The\\ curl\\ executable\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
