{"description": "Detects a suspicious script execution in temporary folders or folders accessible by environment variables", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1228c958-e64e-4e71-92ad-7d429f4138ba", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Script Interpreter Execution From Suspicious Folder", "query": "(((process.executable:(/.*\\\\\\\\[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/)) OR (process.command_line:(/.*\\ \\-[Ee][Pp]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ .*/ OR /.*\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy]\\ [Bb][Yy][Pp][Aa][Ss][Ss]\\ .*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\/[Ee]\\:[Jj][Aa][Vv][Aa][Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/ OR /.*\\/[Ee]\\:[Jj][Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/ OR /.*\\/[Ee]\\:[Vv][Bb][Ss][Cc][Rr][Ii][Pp][Tt]\\ .*/)) OR (winlog.event_data.OriginalFileName:(/[Cc][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/ OR /[Mm][Ss][Hh][Tt][Aa]\\.[Ee][Xx][Ee]/ OR /[Ww][Ss][Cc][Rr][Ii][Pp][Tt]\\.[Ee][Xx][Ee]/))) AND ((process.command_line:(/.*\\:\\\\\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\\\\\.*/ OR /.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\\\\\[Tt][Ee][Mm][Pp].*/ OR /.*\\\\\\\\[Tt][Ee][Mm][Pp][Oo][Rr][Aa][Rr][Yy]\\ [Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt].*/ OR /.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Tt][Ee][Mm][Pp].*/)) OR ((process.command_line:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND process.command_line:/.*\\\\\\\\[Ff][Aa][Vv][Oo][Rr][Ii][Tt][Ee][Ss]\\\\\\\\.*/)) OR ((process.command_line:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND process.command_line:/.*\\\\\\\\[Ff][Aa][Vv][Oo][Uu][Rr][Ii][Tt][Ee][Ss]\\\\\\\\.*/)) OR ((process.command_line:/.*\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND process.command_line:/.*\\\\\\\\[Cc][Oo][Nn][Tt][Aa][Cc][Tt][Ss]\\\\\\\\.*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/shuckworm-russia-ukraine-military", "https://learn.microsoft.com/en-us/windows/win32/shell/csidl"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
