{"description": "Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.", "author": ["Nasreddine Bencherchali (Nextron Systems)", "@ROxPinTeddy"], "enabled": false, "false_positives": ["Legitimate administrative use"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3ac2ef85-ed1a-4629-be04-14a6bbbc2305", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PUA - Advanced IP Scanner Execution", "query": "((((process.executable.text:*\\\\advanced_ip_scanner*) OR (winlog.event_data.OriginalFileName:*advanced_ip_scanner*) OR (winlog.event_data.Description:*Advanced\\ IP\\ Scanner*))) OR ((process.command_line.text:*\\/portable* AND process.command_line.text:*\\/lng*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1046", "T1135"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1046", "name": "Network Service Discovery", "reference": "https://attack.mitre.org/techniques/T1046"}, {"id": "T1135", "name": "Network Share Discovery", "reference": "https://attack.mitre.org/techniques/T1135"}]}], "version": 1, "references": ["https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/", "https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html", "https://labs.f-secure.com/blog/prelude-to-ransomware-systembc", "https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf", "https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer", "https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20IP%20Scanner"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
