{"description": "Accesschk is an access and privilege audit tool developed by SysInternal and often being used by attacker to verify privileges", "enabled": false, "false_positives": ["System administrator Usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c625d754-6a3d-4f65-9c9a-536aea960d37", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Accesschk Usage To Check Privileges", "query": "((Product:*AccessChk OR winlog.event_data.Description:*Reports\\ effective\\ permissions* OR process.executable.text:(*\\\\accesschk.exe OR *\\\\accesschk64.exe) OR winlog.event_data.OriginalFileName:\"accesschk.exe\") AND process.command_line.text:(*uwcqv\\ * OR *kwsu\\ * OR *qwsu\\ * OR *uwdqs\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1069"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1069", "name": "Permission Groups Discovery", "reference": "https://attack.mitre.org/techniques/T1069"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment?slide=43", "https://www.youtube.com/watch?v=JGs-aKf2OtU&ab_channel=OFFZONEMOSCOW", "https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat", "https://github.com/gladiatx0r/Powerless/blob/04f553bbc0c65baf4e57344deff84e3f016e6b51/Powerless.bat"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov (idea)", "Mangatas Tondang (rule)", "oscd.community", "Nasreddine Bencherchali (modified)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
