{"description": "Detects the execution of Xwizard tool from the non-default directory which can be used to sideload a custom xwizards.dll", "enabled": false, "false_positives": ["Windows installed on non-C drive"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Xwizard DLL Sideloading", "query": "(process.executable:*\\\\xwizard.exe AND (NOT (process.executable:C\\:\\\\Windows\\\\System32\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Xwizard/", "http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
