{"description": "Detects the use of tools created by a well-known hacktool producer named Cube0x0, which includes his handle in all binaries as company information in the PE headers (SharpPrintNightmare, KrbRelay, SharpMapExec etc.)", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc1e3011-3b9a-f4e8-fa48-e8323f2ee68b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Hacktool by Cube0x0", "query": "Company:\"Cube0x0\"", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/cube0x0", "https://www.virustotal.com/gui/search/metadata%253ACube0x0/files"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
