{"description": "Detects processes leveraging the \"ms-msdt\" handler or the \"msdt.exe\" binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability", "author": ["Nasreddine Bencherchali (rule)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c5c2ce82-36c6-2445-854b-307e66625645", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Arbitrary Command Execution Using MSDT.EXE", "query": "(((process.executable.text:*\\\\msdt.exe) OR (winlog.event_data.OriginalFileName:\"msdt.exe\")) AND ((process.command_line.text:*IT_BrowseForFile\\=*) OR ((process.command_line.text:*\\ PCWDiagnostic* AND process.command_line.text:(*\\ \\/af\\ * OR *\\ \\-af\\ *)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://twitter.com/nao_sec/status/1530196847679401984", "https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/", "https://twitter.com/_JohnHammond/status/1531672601067675648"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
