{"description": "Detects the execution of PowerShell with a specific flag sequence that is used by the Wmiexec script", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "022eaba8-f0bf-4dd9-9217-4604b0bb3bb0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Wmiexec Default Powershell Command", "query": "process.command_line.text:\"*\\-NoP\\ \\-NoL\\ \\-sta\\ \\-NonI\\ \\-W\\ Hidden\\ \\-Exec\\ Bypass\\ \\-Enc*\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Lateral Movement"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/fortra/impacket/blob/f4b848fa27654ca95bc0f4c73dbba8b9c2c9f30a/examples/wmiexec.py"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
