{"description": "Detects a suspicious child process of Script Event Consumer (scrcons.exe).", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c5fdff1c-cb96-c2e6-f067-47b991af321f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Script Event Consumer Spawning Process", "query": "(process.parent.executable:*\\\\scrcons.exe AND process.executable:(*\\\\svchost.exe OR *\\\\dllhost.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\schtasks.exe OR *\\\\regsvr32.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\msiexec.exe OR *\\\\msbuild.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://redcanary.com/blog/child-processes/", "https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-analytics-alert-reference/cortex-xdr-analytics-alert-reference/scrcons-exe-rare-child-process.html"], "timestamp_override": "event.ingested", "author": ["Sittikorn S"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
