{"description": "Detects execution of msdt.exe using the \"cab\" flag which could indicates suspicious diagcab files with embedded answer files leveraging CVE-2022-30190", "author": ["Nasreddine Bencherchali (Nextron Systems)", "GossiTheDog", "frack113"], "enabled": false, "false_positives": ["Legitimate usage of \".diagcab\" files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dc4576d4-7467-424f-9eee-fd2b02855fe0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Cabinet File Execution Via Msdt.EXE", "query": "(((process.executable.text:\"*\\\\msdt.exe\") OR (winlog.event_data.OriginalFileName:\"msdt.exe\")) AND process.command_line.text:(\"*\\ \\/cab\\ *\" OR \"*\\ \\-cab\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://twitter.com/nas_bench/status/1537896324837781506", "https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab", "https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-9015912909545e72ed42cbac4d1e96295e8964579c406d23fd9c47a8091576a0", "https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
