{"description": "Detects the execution of the LOLBIN gpscript, which executes logon or startup scripts configured in Group Policy", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate uses of logon scripts distributed via group policy"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1e59c230-6670-45bf-83b0-98903780607e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Gpscript Execution", "query": "((((process.executable.text:\"*\\\\gpscript.exe\") OR (winlog.event_data.OriginalFileName:\"GPSCRIPT.EXE\")) AND process.command_line.text:(\"*\\ \\/logon*\" OR \"*\\ \\/startup*\")) AND (NOT process.parent.command_line.text:\"C:\\windows\\system32\\svchost.exe -k netsvcs -p -s gpsvc\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://oddvar.moe/2018/04/27/gpscript-exe-another-lolbin-to-the-list/", "https://lolbas-project.github.io/lolbas/Binaries/Gpscript/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
