{"description": "Detects execution of Microsoft Defender's CLI process (MpCmdRun.exe) from the non-default directory which may be an attempt to sideload arbitary DLL", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f6549649-83ad-2604-26cb-f3fdf9824c6c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "DLL Sideloading by Microsoft Defender", "query": "(process.executable.text:*\\\\MpCmdRun.exe AND (NOT (process.executable.text:(C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\* OR C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* OR C\\:\\\\Windows\\\\winsxs\\\\x86_security\\-malware\\-windows\\-defender_* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Security\\ Client\\\\MpCmdRun.exe*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
