{"description": "Detects usage of cmdkey to add generic credentials. As an example, this has to be used before connecting to an RDP session via command line interface.", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage for administration purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b1ec66c6-f4d1-4b5c-96dd-af28ccae7727", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Generic Credentials Added Via Cmdkey.EXE", "query": "(((process.executable.text:\"*\\\\cmdkey.exe\") OR (winlog.event_data.OriginalFileName:\"cmdkey.exe\")) AND (process.command_line.text:\"*\\ \\/g*\" AND process.command_line.text:\"*\\ \\/u*\" AND process.command_line.text:\"*\\ \\/p*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
