{"description": "Detects a windows service to be stopped", "author": ["Jakob Weinzettl", "oscd.community", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Administrator shutting down the service due to upgrade or removal purposes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bfff7f1a-907c-bcbd-8d05-9c1a4ad6d9a8", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Stop Windows Service", "query": "((((((winlog.event_data.OriginalFileName:(\"sc.exe\" OR \"net.exe\" OR \"net1.exe\")) OR (process.executable.text:(*\\\\sc.exe OR *\\\\net.exe OR *\\\\net1.exe))) AND process.command_line.text:*\\ stop\\ *) AND (NOT (process.command_line.text:(\"sc  stop KSCWebConsoleMessageQueue\" OR \"sc  stop LGHUBUpdaterService\") AND user.name:(*AUTHORI* OR *AUTORI*))))) OR ((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line.text:*Stop\\-Service\\ *)))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1489"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1489", "name": "Service Stop", "reference": "https://attack.mitre.org/techniques/T1489"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
