{"description": "Detects suspicious base64 encoded and obfuscated \"LOAD\" keyword used in .NET \"reflection.assembly\"", "author": ["pH-T (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9c0295ce-d60d-40bd-bd74-84673b7592b1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Encoded And Obfuscated Reflection Assembly Load Function Call", "query": "process.command_line.text:(\"*OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ*\" OR \"*oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA*\" OR \"*6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA*\" OR \"*OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ*\" OR \"*oAOgAoACIATABvACIAKwAiAGEAZAAiACkA*\" OR \"*6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA*\" OR \"*OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ*\" OR \"*oAOgAoACIATABvAGEAIgArACIAZAAiACkA*\" OR \"*6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA*\" OR \"*OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ*\" OR \"*oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA*\" OR \"*6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA*\" OR \"*OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ*\" OR \"*oAOgAoACcATABvACcAKwAnAGEAZAAnACkA*\" OR \"*6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA*\" OR \"*OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ*\" OR \"*oAOgAoACcATABvAGEAJwArACcAZAAnACkA*\" OR \"*6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar", "https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/", "https://learn.microsoft.com/en-us/dotnet/api/system.appdomain.load?view=net-7.0"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
