{"description": "Detects the use of Replace.exe which can be used to replace file with another file", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9292293b-8496-4715-9db6-37028dcda4b3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Replace.exe Usage", "query": "(process.executable:*\\\\replace.exe AND process.command_line:(*\\/a* OR *\\-a*))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Replace/", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/replace"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
