{"description": "Detects browsers starting with the remote debugging flags. Which is a technique often used to perform browser injection attacks", "author": ["pH-T", "Nasreddine Bencherchali (update)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b3d34dc5-2efd-4ae3-845f-8ec14921f449", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Browser Started with Remote Debugging", "query": "((process.command_line.text:*\\ \\-\\-remote\\-debugging\\-*) OR ((process.executable.text:*\\\\firefox.exe AND process.command_line.text:*\\ \\-start\\-debugger\\-server*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1185"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://yoroi.company/wp-content/uploads/2022/05/EternityGroup_report_compressed.pdf", "https://www.mdsec.co.uk/2022/10/analysing-lastpass-part-1/", "https://github.com/defaultnamehere/cookie_crimes/", "https://github.com/wunderwuzzi23/firefox-cookiemonster"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
