{"description": "Detects PowerShell commands that decrypt an \".LNK\" \"file to drop the next stage of the malware.", "author": ["X__Junior (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "434c08ba-8406-4d15-8b24-782cb071a691", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Execution With Potential Decryption Capabilities", "query": "(process.executable:(/.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/) AND winlog.event_data.OriginalFileName:(/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/) AND process.command_line:(/.*[Gg][Ee][Tt]\\-[Cc][Hh][Ii][Ll][Dd][Ii][Tt][Ee][Mm]\\ .*/ OR /.*[Dd][Ii][Rr]\\ .*/ OR /.*[Gg][Cc][Ii]\\ .*/ OR /.*[Ll][Ss]\\ .*/) AND process.command_line:(/.*[Gg][Ee][Tt]\\-[Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\ .*/ OR /.*[Gg][Cc]\\ .*/ OR /.*[Cc][Aa][Tt]\\ .*/ OR /.*[Tt][Yy][Pp][Ee]\\ .*/) AND process.command_line:/.*\\ \\^|\\ .*/ AND process.command_line:/.*\\\\\\\\\\*\\.[Ll][Nn][Kk].*/ AND process.command_line:/.*\\-[Rr][Ee][Cc][Uu][Rr][Ss][Ee].*/ AND process.command_line:/.*\\-[Ss][Kk][Ii][Pp]\\ .*/)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://research.checkpoint.com/2023/chinese-threat-actors-targeting-europe-in-smugx-campaign/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
