{"description": "Detects the execution of a system command via the ScreenConnect RMM service.", "author": ["Ali Alwashali"], "enabled": false, "false_positives": ["Legitimate use of ScreenConnect. Disable this rule if ScreenConnect is heavily used."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b1f73849-6329-4069-bc8f-78a604bb8b23", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remote Access Tool - ScreenConnect Remote Command Execution", "query": "(event.category:process AND process.parent.executable:/.*\\\\[Ss][Cc][Rr][Ee][Ee][Nn][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\.[Cc][Ll][Ii][Ee][Nn][Tt][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ AND ((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)) AND process.command_line:/.*\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Cc][Rr][Ee][Ee][Nn][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\\\.*/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/SigmaHQ/sigma/pull/4467"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
