{"description": "Detects a suspicious copy command to or from an Admin share or remote", "author": ["Florian Roth", "oscd.community", "Teymur Kheirkhabarov @HeirhabarovT", "Zach Stanford @svch0st", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Administrative scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e879123f-abbf-cb7f-98b9-4d15ccdea86b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Copy from Admin Share", "query": "((process.command_line.text:*\\\\\\\\* AND process.command_line.text:*$*) AND ((((((process.executable.text:(*\\\\robocopy.exe OR *\\\\xcopy.exe)) OR (winlog.event_data.OriginalFileName:(\"robocopy.exe\" OR \"XCOPY.EXE\")))) OR ((((process.executable.text:*\\\\cmd.exe) OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND process.command_line.text:*copy*)))) OR ((((process.executable.text:(*\\\\powershell.exe* OR *\\\\pwsh.exe*)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:(*copy\\-item* OR *copy* OR *cpi\\ * OR *\\ cp\\ * OR *move* OR *move\\-item* OR *\\ mi\\ * OR *\\ mv\\ *)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1039", "T1048"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1039", "name": "Data from Network Shared Drive", "reference": "https://attack.mitre.org/techniques/T1039"}]}, {"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1211636381086339073", "https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view", "https://www.elastic.co/guide/en/security/current/remote-file-copy-to-a-hidden-share.html", "https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
