{"description": "Detects the execution of DLL side-loading malware used by threat group Emissary Panda aka APT27", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "af7e2878-2ac1-6898-5546-c209857573b3", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Emissary Panda Malware SLLauncher", "query": "(process.parent.executable:*\\\\sllauncher.exe AND process.executable:*\\\\svchost.exe)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://app.any.run/tasks/579e7587-f09d-4aae-8b07-472833262965", "https://twitter.com/cyb3rops/status/1168863899531132929"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
