{"description": "Detects process creation events that use the Sysnative folder (common for CobaltStrike spawns)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bf933ec7-a834-5c5f-02f3-23a10faeec87", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Process Creation Using Sysnative Folder", "query": "process.command_line.text:C\\:\\\\Windows\\\\Sysnative\\\\*", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1055"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
