{"description": "Detects rundll32.exe executing from an abnormal drive such as a mounted ISO.", "enabled": false, "false_positives": ["Rare false positives could occur on servers with multiple drives."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c134e29a-f9cb-e1cd-1b94-3ee3bdb7ed07", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rundll32 From Abnormal Drive", "query": "(process.executable:*\\\\rundll32.exe AND (NOT ((process.working_directory:*C\\:\\\\* OR process.working_directory:\"\") OR (NOT _exists_:process.working_directory))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2021/12/13/diavol-ransomware/"], "timestamp_override": "event.ingested", "author": ["Christopher Peacock '@securepeacock'", "SCYTHE '@scythe_io'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
