{"description": "Detects defence evasion attempt via odbcconf.exe execution to load DLL", "enabled": false, "false_positives": ["Legitimate use of odbcconf.exe by legitimate user"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "65d2be45-8600-4042-b4c0-577a1ff8a60e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Application Whitelisting Bypass via DLL Loaded by odbcconf.exe", "query": "((process.executable:*\\\\odbcconf.exe AND process.command_line:(*\\-f* OR *regsvr*)) OR (process.parent.executable:*\\\\odbcconf.exe AND process.executable:*\\\\rundll32.exe))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Odbcconf.yml", "https://twitter.com/Hexacorn/status/1187143326673330176"], "timestamp_override": "event.ingested", "author": ["Kirill Kiryanov", "Beyu Denis", "Daniil Yugoslavskiy", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
