{"description": "Execution of well known tools for data exfiltration and tunneling", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6d5ac3d1-5c56-8ea0-3cef-9b12382ca288", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Plink Usage RDP Tunneling", "query": "(process.executable.text:*\\\\plink.exe AND (process.command_line.text:*\\:127.0.0.1\\:3389* OR (process.command_line.text:*\\:3389* AND process.command_line.text:(*\\ \\-P\\ 443* OR *\\ \\-P\\ 22*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1572"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
