{"description":"Detects execution of renamed paexec via imphash and executable product string Author: Jason Lynch. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown imphashes"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"81d8db8f-9d5e-feba-614f-f5c6db0b18b3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Execution of Renamed PaExec","query":"((Product:*PAExec* AND (winlog.event_data.Imphash:(\"11D40A7B7876288F919AB819CC2D9802\" OR \"6444f8a34e99b8f7d9647de66aabe516\" OR \"dfd6aa3f7b2b1035b76b718f1ddc689f\" OR \"1a6cca4d5460b1710a12dea39e4a592c\") OR winlog.event_data.Hashes:(*11D40A7B7876288F919AB819CC2D9802* OR *6444f8a34e99b8f7d9647de66aabe516* OR *dfd6aa3f7b2b1035b76b718f1ddc689f* OR *1a6cca4d5460b1710a12dea39e4a592c*))) AND (NOT (process.executable:*paexec*)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
