{"description": "Detects reg command lines that disables PPL on the LSA process", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "025c502a-6a31-3f16-571a-af32a9f45a34", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Registry Disabling LSASS PPL", "query": "(process.executable:*\\\\reg.exe AND process.command_line:*SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa* AND process.command_line:*\\ add\\ * AND process.command_line:*\\ \\/d\\ 0* AND process.command_line:*\\ \\/v\\ RunAsPPL\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
