{"description": "Detects usage of attrib.exe to hide files from users.", "enabled": false, "false_positives": ["igfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe and igfxCUIService.exe is the parent of the cmd.exe)", "msiexec.exe hiding desktop.ini"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4281cb20-2994-4580-aa63-c8b86d019934", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Hiding Files with Attrib.exe", "query": "((process.executable:*\\\\attrib.exe AND process.command_line:*\\ \\+h\\ *) AND (NOT ((process.command_line:*\\\\desktop.ini\\ * OR (process.parent.executable:*\\\\cmd.exe AND process.command_line:\\+R\\ \\+H\\ \\+S\\ \\+A\\ \\\\*.cui AND process.parent.command_line:C\\:\\\\WINDOWS\\\\system32\\\\*.bat)))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Sami Ruohonen"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
