{"description": "Detects the export of a crital Registry key to a file.", "author": ["Oddvar Moe", "Sander Wiebing", "oscd.community"], "enabled": false, "false_positives": ["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cfa298bd-60cb-5940-8359-5f38870ca929", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Exports Critical Registry Keys To a File", "query": "(((process.executable.text:*\\\\regedit.exe) OR (winlog.event_data.OriginalFileName:\"REGEDIT.EXE\")) AND process.command_line.text:(*\\ \\/E\\ * OR *\\ \\-E\\ *) AND process.command_line.text:(*hklm* OR *hkey_local_machine*) AND process.command_line.text:(*\\\\system OR *\\\\sam OR *\\\\security))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1012"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Regedit/", "https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
