{"description":"Detects artefacts associated with activity group GALLIUM - Microsoft Threat Intelligence Center indicators released in December 2019. Author: Tim Burrell. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9c9922a6-9f4d-fbee-ef04-62096d71475a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"GALLIUM Artefacts","query":"(sha1:\"e570585edc69f9074cb5e8a790708336bd45ca0f\" AND (NOT (process.executable:(*\\:\\\\Program\\ Files\\(x86\\)\\\\* OR *\\:\\\\Program\\ Files\\\\*))))","meta":{"from":"1m"},"severity":"high","tags":["Credential Access","T1071","T1212"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1212","name":"Exploitation for Credential Access","reference":"https://attack.mitre.org/techniques/T1212"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
