{"description": "Detects suspicious LOLBIN AccCheckConsole execution with parameters as used to load an arbitrary DLL", "enabled": false, "false_positives": ["Legitimate use of the UI Accessibility Checker"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0f6da907-5854-4be6-859a-e9958747b0aa", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious LOLBIN AccCheckConsole", "query": "(process.executable:*\\\\AccCheckConsole.exe AND process.command_line:*\\ \\-window\\ * AND process.command_line:*.dll*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://gist.github.com/bohops/2444129419c8acf837aedda5f0e7f340", "https://twitter.com/bohops/status/1477717351017680899?s=12"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
