{"description": "Detects a suspicious certreq execution taken from the LOLBAS examples, which can be abused to download (small) files", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "eb7c5d76-defa-4a7b-adc7-41571e28fd07", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Certreq Command to Download", "query": "((process.executable:*\\\\certreq.exe OR winlog.event_data.OriginalFileName:\"CertReq.exe\") AND (process.command_line:*\\ \\-Post\\ * AND process.command_line:*\\ \\-config\\ * AND process.command_line:*\\ http* AND process.command_line:*\\ C\\:\\\\windows\\\\win.ini\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Certreq/"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
