{"description": "Detect the use of Windows Defender to download payloads", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "46123129-1024-423e-9fae-43af4a0fa9a5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Defender Download Activity", "query": "((process.command_line:*MpCmdRun.exe* OR winlog.event_data.Description:\"Microsoft\\ Malware\\ Protection\\ Command\\ Line\\ Utility\") AND (process.command_line:*DownloadFile* AND process.command_line:*url*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1105", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/djmtshepana/status/1301608169496612866", "https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/"], "timestamp_override": "event.ingested", "author": ["Matthew Matchen"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
