{"description": "This rule detects the execution of Run Once task as configured in the registry", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "198effb6-6c98-4d0c-9ea3-451fa143c45c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Run Once Task Execution as Configured in Registry", "query": "((process.executable:*\\\\runonce.exe OR winlog.event_data.Description:\"Run\\ Once\\ Wrapper\") AND process.command_line:*\\ \\/AlternateShellStartup*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/pabraeken/status/990717080805789697", "https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runonce.yml"], "timestamp_override": "event.ingested", "author": ["Avneet Singh @v3t0_", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
