{"description": "Download or Copy file with Extrac32", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "aa8e035d-7be4-48d3-a944-102aec04400d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Extrac32 Execution", "query": "(process.command_line:*extrac32.exe* AND process.command_line:*.cab* AND process.command_line:(*\\/C* OR *\\/Y* OR *\\ \\\\\\*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Extrac32/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
