{"description": "Detects usage of \"appcmd\" to create new global URL rewrite rules. This behaviour has been observed being used by threat actors to add new rules so they can access their webshells.", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate usage of appcmd to add new URL rewrite rules"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e7ce14dc-1a18-9a18-8612-041045ba45de", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious IIS URL GlobalRules Rewrite Via AppCmd", "query": "(((process.executable.text:*\\\\appcmd.exe) OR (winlog.event_data.OriginalFileName:\"appcmd.exe\")) AND (process.command_line.text:*set* AND process.command_line.text:*config* AND process.command_line.text:*section\\:system.webServer\\/rewrite\\/globalRules* AND process.command_line.text:*commit\\:*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/malmoeb/status/1616702107242971144", "https://learn.microsoft.com/en-us/answers/questions/739120/how-to-add-re-write-global-rule-with-action-type-r"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
