{"description": "Detects service principal name (SPN) enumeration used for Kerberoasting", "author": ["Markus Neis", "keepwatch"], "enabled": false, "false_positives": ["Administration activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1eeed653-dbc8-4187-ad0c-eeebb20e6599", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential SPN Enumeration Via Setspn.EXE", "query": "(event.category:process AND ((process.executable:/.*\\\\[Ss][Ee][Tt][Ss][Pp][Nn]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Ss][Ee][Tt][Ss][Pp][Nn]\\.[Ee][Xx][Ee]/) OR ((winlog.event_data.Description:/.*[Qq][Uu][Ee][Rr][Yy]\\ [Oo][Rr]\\ [Rr][Ee][Ss][Ee][Tt]\\ [Tt][Hh][Ee]\\ [Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr].*/ AND winlog.event_data.Description:/.*[Ss][Pp][Nn]\\ [Aa][Tt][Tt][Rr][Ii][Bb][Uu][Tt][Ee].*/))) AND process.command_line:(/.*\\ \\-[Qq]\\ .*/ OR /.*\\ \\/[Qq]\\ .*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://web.archive.org/web/20200329173843/https://p16.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation", "https://www.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation/?edition=2019"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
