{"description": "Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "09fe8dc5-dbc5-90dc-e52f-0700623cd7c8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Wlrmdr Lolbin Use as Launcher", "query": "((process.executable.text:*\\\\wlrmdr.exe AND process.command_line.text:*\\-s\\ * AND process.command_line.text:*\\-f\\ * AND process.command_line.text:*\\-t\\ * AND process.command_line.text:*\\-m\\ * AND process.command_line.text:*\\-a\\ * AND process.command_line.text:*\\-u\\ *) AND (NOT ((process.parent.executable.text:\"C\\:\\\\Windows\\\\System32\\\\winlogon.exe\") OR (process.parent.executable.text:\"\\-\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
