{"description": "The psr.exe captures desktop screenshots and saves them on the local machine", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d05e05f0-174d-4549-3b7b-5113d2d61d92", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Psr.exe Capture Screenshots", "query": "(process.executable:*\\\\Psr.exe AND process.command_line:*\\/start*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1113"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1113", "name": "Screen Capture", "reference": "https://attack.mitre.org/techniques/T1113"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Psr.yml", "https://www.sans.org/summit-archives/file/summit-archive-1493861893.pdf", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1113/T1113.md"], "timestamp_override": "event.ingested", "author": ["Beyu Denis", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
