{"description": "Detects exeuctable names or flags used by Htran or Htran-like tools (e.g. NATBypass)", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f5e3b62f-e577-4e59-931e-0a15b2b94e1e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Htran/NATBypass Execution", "query": "((process.executable.text:(\"*\\\\htran.exe\" OR \"*\\\\lcx.exe\")) OR (process.command_line.text:(\"*.exe\\ \\-tran\\ *\" OR \"*.exe\\ \\-slave\\ *\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/HiwinCN/HTran", "https://github.com/cw1997/NATBypass"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
