{"description": "Detects specific process characteristics of Snatch ransomware word document droppers", "enabled": false, "false_positives": ["Scripts that shutdown the system immediately and reboot them in safe mode are unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5325945e-f1f0-406e-97b8-65104d393fff", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Snatch Ransomware", "query": "process.command_line:(*shutdown\\ \\/r\\ \\/f\\ \\/t\\ 00* OR *net\\ stop\\ SuperBackupMan*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
