{"description": "Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Zip A Folder With PowerShell For Staging In Temp", "query": "(process.command_line:*Compress\\-Archive\\ * AND process.command_line:*\\ \\-Path\\ * AND process.command_line:*\\ \\-DestinationPath\\ * AND process.command_line:*$env\\:TEMP\\\\*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1074"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1074", "name": "Data Staged", "reference": "https://attack.mitre.org/techniques/T1074"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1074.001/T1074.001.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
