{"description": "A sigma rule detecting an unidetefied attacker who used phishing emails to target high profile orgs on November 2018. The Actor shares some TTPs with YYTRIUM/APT29 campaign in 2016.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d77e1d8a-ad72-c00b-c2e0-a9288e04e164", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Unidentified Attacker November 2018", "query": "(process.command_line:*cyzfc.dat,* AND process.command_line:*PointFunctionCall)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/DrunkBinary/status/1063075530180886529"], "timestamp_override": "event.ingested", "author": ["@41thexplorer", "Microsoft Defender ATP"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
