{"description": "Detects usage of an encoded/obfuscated version of an IP address (hex, octal...) via commandline", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56d19cb4-6414-4769-9644-1ed35ffbb148", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Obfuscated IP Via CLI", "query": "(process.executable.text:(*\\\\ping.exe OR *\\\\arp.exe) AND (process.command_line.text:*\\ 0x* OR process.command_line.text:/ [0-9]{7,13}/))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://h.43z.one/ipconverter/", "https://twitter.com/Yasser_Elsnbary/status/1553804135354564608"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
