{"description": "Detects specific combinations of encoding methods in the PowerShell command lines", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f5b4f7c-663f-c76b-dac6-76783eaccc90", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Encoded PowerShell Command Line", "query": "(process.executable:*\\\\powershell.exe AND ((process.command_line:(*ToInt* OR *ToDecimal* OR *ToByte* OR *ToUint* OR *ToSingle* OR *ToSByte*) AND process.command_line:(*ToChar* OR *ToString* OR *String*)) OR (process.command_line:*join* AND (process.command_line:*char* OR process.command_line:*split*))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65"], "timestamp_override": "event.ingested", "author": ["Teymur Kheirkhabarov (idea)", "Vasiliy Burov (rule)", "oscd.community", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
