{"description": "Detects Powershell as a child of the WmiPrvSE process. Which could be a sign of lateral movement via WMI.", "author": ["Markus Neis @Karneades"], "enabled": false, "false_positives": ["AppvClient", "CCM", "WinRM"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "692f0bec-83ba-4d04-af7e-e884a96059b6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential WMI Lateral Movement WmiPrvSE Spawned PowerShell", "query": "(process.parent.executable.text:\"*\\\\WmiPrvSE.exe\" AND ((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
