{"description": "Detects Hurricane Panda Activity", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c37dcf20-14a5-9a86-5ceb-d88edc897207", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Hurricane Panda Activity", "query": "((process.command_line:*localgroup* AND process.command_line:*admin* AND process.command_line:*\\/add*) OR process.command_line:*\\\\Win64.exe*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["https://www.crowdstrike.com/blog/crowdstrike-discovers-use-64-bit-zero-day-privilege-escalation-exploit-cve-2014-4113-hurricane-panda/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
