{"description": "Detects WMI executing rundll32", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3c89a1e8-0fba-449e-8f1b-8409d6267ec8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious WMI Execution Using Rundll32", "query": "(process.command_line:*process\\ call\\ create* AND process.command_line:*rundll32*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://thedfirreport.com/2020/10/08/ryuks-return/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
