{"description": "Detects suspicious shell spawned from Java host process (e.g. log4j exploitation)", "author": ["Andreas Hunkeler (@Karneades)", "Florian Roth"], "enabled": false, "false_positives": ["Legitimate calls to system binaries", "Company specific internal usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0d34ed8b-1c12-4ff2-828c-16fc860b766d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Shells Spawned by Java", "query": "(process.parent.executable.text:*\\\\java.exe AND process.executable.text:(*\\\\sh.exe OR *\\\\bash.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\schtasks.exe OR *\\\\certutil.exe OR *\\\\whoami.exe OR *\\\\bitsadmin.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\scrcons.exe OR *\\\\regsvr32.exe OR *\\\\hh.exe OR *\\\\wmic.exe OR *\\\\mshta.exe OR *\\\\rundll32.exe OR *\\\\forfiles.exe OR *\\\\scriptrunner.exe OR *\\\\mftrace.exe OR *\\\\AppVLP.exe OR *\\\\curl.exe OR *\\\\systeminfo.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\reg.exe OR *\\\\query.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested"}
