{"description": "Detects the use of a Micorsoft signed script to execute commands", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9e2a987f-72b2-cf54-07e7-ddd6ae063d47", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CL_Mutexverifiers.ps1 Proxy Execution", "query": "(process.command_line:*\\\\CL_Mutexverifiers.ps1* AND process.command_line:*runAfterCancelProcess\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1216"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1216", "name": "System Script Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1216"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/"], "timestamp_override": "event.ingested", "author": ["oscd.community", "Natalia Shornikova", "frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
