{"description": "Detects suspicious child processes of Wscript/Cscript", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Some false positives might occur with admin or third party software scripts. Investigate and apply additional filters accordingly."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b6676963-0353-4f88-90f5-36c20d443c6a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Cscript/Wscript Suspicious Child Process", "query": "(process.parent.executable.text:(\"*\\\\wscript.exe\" OR \"*\\\\cscript.exe\") AND process.executable.text:(\"*\\\\cmd.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\") AND (((process.command_line.text:\"*mshta*\" AND process.command_line.text:\"*http*\")) OR (process.command_line.text:(\"*rundll32*\" OR \"*regsvr32*\" OR \"*msiexec*\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
