{"description": "Detects Powershell as a child of the WmiPrvSE process. Which could be a signe of remote access via WMI", "author": ["Markus Neis @Karneades"], "enabled": false, "false_positives": ["AppvClient", "CCM"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "436cb068-2d8f-9ba0-4b20-f415b0ad4d43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WmiPrvSE Spawned PowerShell", "query": "((process.parent.executable.text:*\\\\wmiprvse.exe AND ((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe)) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\")))) AND (NOT ((process.command_line.text:\"null\") OR (NOT _exists_:process.command_line.text))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
