{"description": "Detects activity observed by different researchers to be HAFNIUM group activity (or related) on Exchange servers", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f1baa5d0-f309-0712-b336-f3ed877dcb09", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Exchange Exploitation Activity", "query": "((process.command_line:*attrib* AND process.command_line:*\\ \\+h\\ * AND process.command_line:*\\ \\+s\\ * AND process.command_line:*\\ \\+r\\ * AND process.command_line:*.aspx*) OR (process.command_line:*schtasks* AND process.command_line:*VSPerfMon*) OR (process.command_line:*vssadmin\\ list\\ shadows* AND process.command_line:*Temp\\\\__output*) OR process.command_line:*%TEMP%\\\\execute.bat* OR process.executable:*Users\\\\Public\\\\opera\\\\Opera_browser.exe OR (process.executable:*Opera_browser.exe AND process.parent.executable:(*\\\\services.exe OR *\\\\svchost.exe)) OR process.executable:*\\\\ProgramData\\\\VSPerfMon\\\\* OR (process.command_line:*\\ \\-t7z\\ * AND process.command_line:*C\\:\\\\Programdata\\\\pst* AND process.command_line:*\\\\it.zip*) OR (process.executable:*\\\\makecab.exe AND process.command_line:(*Microsoft\\\\Exchange\\ Server\\\\* OR *inetpub\\\\wwwroot*)) OR process.command_line:(*\\\\Temp\\\\xx.bat* OR *Windows\\\\WwanSvcdcs* OR *Windows\\\\Temp\\\\cw.exe*) OR (process.command_line:*\\\\comsvcs.dll* AND process.command_line:*Minidump* AND process.command_line:*\\\\inetpub\\\\wwwroot*) OR (process.command_line:*dsquery* AND process.command_line:*\\ \\-uco\\ * AND process.command_line:*\\\\inetpub\\\\wwwroot*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/", "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/", "https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3", "https://twitter.com/GadixCRK/status/1369313704869834753?s=20", "https://twitter.com/BleepinComputer/status/1372218235949617161"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
