{"description": "Detects actions caused by the RedMimicry Winnti playbook a automated breach emulations utility", "author": ["Alexander Rausch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "95022b85-ff2a-49fa-939a-d7b8f56eeb9b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - RedMimicry Winnti Playbook Execution", "query": "(process.executable.text:(\"*\\\\rundll32.exe\" OR \"*\\\\cmd.exe\") AND process.command_line.text:(\"*gthread\\-3.6.dll*\" OR \"*\\\\Windows\\\\Temp\\\\tmp.bat*\" OR \"*sigcmm\\-2.4.dll*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1059", "T1106", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://redmimicry.com/posts/redmimicry-winnti/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
