{"description": "Detects uses of the rdrleakdiag.exe LOLOBIN utility to dump process memory", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c271556e-27c3-02d5-358a-d73b84321af4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RdrLeakDiag Process Dump", "query": "(process.command_line:*\\/fullmemdmp* AND (process.executable:*\\\\rdrleakdiag.exe OR (process.command_line:*\\ \\/o\\ * AND process.command_line:*\\ \\/p\\ *)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
