{"description":"Detects a suspicious output redirection to the local admins share as often found in malicious scripts or hacktool stagers Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ab9e3b40-0c85-4ba1-aede-455d226fd124","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Redirection to Local Admin Share","query":"process.command_line:(*>\\ \\\\127.0.0.1\\\\admin$* OR *>\\ \\\\localhost\\\\admin$*)","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
