{"description": "Detects scheduled task creations that have suspicious action command and folder combinations", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2a841f27-ef75-db67-f797-eedfadbb50f2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Schtasks From Suspicious Folders", "query": "(process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\ \\/create\\ * AND process.command_line.text:(*powershell* OR *cmd\\ \\/c\\ * OR *cmd\\ \\/k\\ * OR *cmd.exe\\ \\/c\\ * OR *cmd.exe\\ \\/k\\ *) AND process.command_line.text:(*C\\:\\\\ProgramData\\\\* OR *%ProgramData%*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lazarus-dream-job-chemical"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
