{"description": "Detects usage of bitsadmin downloading a file from a suspicious domain", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Some legitimate apps use this, but limited."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8518ed3d-f7c9-4601-a26c-f361a4256a0c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Download From File-Sharing Website Via Bitsadmin", "query": "(event.category:process AND ((process.executable:/.*\\\\[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.OriginalFileName:/[Bb][Ii][Tt][Ss][Aa][Dd][Mm][Ii][Nn]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\ \\/[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/ OR /.*\\ \\/[Aa][Dd][Dd][Ff][Ii][Ll][Ee]\\ .*/) AND process.command_line:(/.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*[Dd][Ll]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo].*/ OR /.*[Gg][Oo][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Pp][Ll].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Tt][Ee][Xx][Tt]\\.[Nn][Ee][Tt].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Nn][Ee][Tt].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/ OR /.*[Ss][Ee][Nn][Dd][Ss][Pp][Aa][Cc][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Jj][Ss][Hh][Aa][Rr][Ee]\\.[Ii][Oo].*/ OR /.*[Tt][Ee][Mm][Pp]\\.[Ss][Hh].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker", "https://www.cisa.gov/uscert/ncas/alerts/aa22-321a"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
