{"description": "Adversaries may collect data stored in the clipboard from users copying information within or between applications.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b1efda51-13f6-24cd-4909-0b91af33c42c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Use of CLIP", "query": "winlog.event_data.OriginalFileName:\"clip.exe\"", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1115"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1115", "name": "Clipboard Data", "reference": "https://attack.mitre.org/techniques/T1115"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/clip", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1115/T1115.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
