{"description": "Detects potential PowerShell execution from a DLL instead of the usual PowerShell process as seen used in PowerShdll", "author": ["Markus Neis", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6812a10b-60ea-420c-832f-dfcc33b646ba", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential PowerShell Execution Via DLL", "query": "(((process.executable.text:(*\\\\rundll32.exe OR *\\\\regsvcs.exe OR *\\\\InstallUtil.exe OR *\\\\regasm.exe)) OR (winlog.event_data.OriginalFileName:(\"RUNDLL32.EXE\" OR \"RegSvcs.exe\" OR \"InstallUtil.exe\" OR \"RegAsm.exe\"))) AND process.command_line.text:(*Default.GetString* OR *FromBase64String* OR *Invoke\\-Expression* OR *IEX\\ * OR *Invoke\\-Command* OR *ICM\\ * OR *DownloadString*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/p3nt4/PowerShdll/blob/62cfa172fb4e1f7f4ac00ca942685baeb88ff356/README.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
