{"description": "Detects use of an encoded/obfuscated version of an IP address (hex, octal...) in an URL combined with a download command", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc070af1-d121-b0a0-1ddd-be6bdfef179c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Obfuscated IP Download", "query": "(process.command_line.text:(*Invoke\\-WebRequest* OR *iwr\\ * OR *wget\\ * OR *curl\\ * OR *DownloadFile* OR *DownloadString*) AND (process.command_line.text:(*\\/\\/0x* OR *.0x* OR *.00x*) OR (process.command_line.text:*http\\:\\/\\/%* AND process.command_line.text:*%2e*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://h.43z.one/ipconverter/", "https://twitter.com/Yasser_Elsnbary/status/1553804135354564608"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
