{"description": "Detects execution of \"odbcconf\" with the \"-f\" flag in order to load a response file which might contain a malicious action.", "author": ["Kirill Kiryanov", "Beyu Denis", "Daniil Yugoslavskiy", "oscd.community", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["The rule is looking for any usage of response file, which might generate false positive when this function is used legitimately. Investigate the contents of the \".rsp\" file to determine if it is malicious and apply additional filters if necessary."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5f03babb-12db-4eec-8c82-7b4cb5580868", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Response File Execution Via Odbcconf.EXE", "query": "(((process.executable.text:\"*\\\\odbcconf.exe\") OR (winlog.event_data.OriginalFileName:\"odbcconf.exe\")) AND process.command_line.text:(\"*\\ \\-f\\ *\" OR \"*\\ \\/f\\ *\") AND process.command_line.text:\"*.rsp*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16", "https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/", "https://www.cybereason.com/blog/threat-analysis-report-bumblebee-loader-the-high-road-to-enterprise-domain-control", "https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
