{"description": "The \"AdPlus.exe\" binary that is part of the Windows SDK can be used as a lolbin to dump process memory and execute arbitrary commands", "enabled": false, "false_positives": ["Legitimate usage of Adplus"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2f869d59-7f6a-4931-992c-cce556ff2d53", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use of Adplus.exe", "query": "((process.executable:*\\\\adplus.exe OR winlog.event_data.OriginalFileName:\"Adplus.exe\") AND process.command_line:(*\\ \\-hang\\ * OR *\\ \\-pn\\ * OR *\\ \\-pmn\\ * OR *\\ \\-p\\ * OR *\\ \\-po\\ * OR *\\ \\-c\\ * OR *\\ \\-sc\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1003"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/OtherMSBinaries/Adplus/", "https://twitter.com/nas_bench/status/1534916659676422152", "https://twitter.com/nas_bench/status/1534915321856917506"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
