{"description": "Detects the execution of a renamed \"gpg.exe\". Often used by ransomware and loaders to decrypt/encrypt data.", "author": ["Nasreddine Bencherchali (Nextron Systems)", "frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ec0722a3-eb5c-4a56-8ab2-bf6f20708592", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Renamed Gpg.EXE Execution", "query": "(event.category:process AND winlog.event_data.OriginalFileName:/[Gg][Pp][Gg]\\.[Ee][Xx][Ee]/ AND (NOT process.executable:(/.*\\\\[Gg][Pp][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Gg][Pp][Gg]2\\.[Ee][Xx][Ee]/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1486"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1486", "name": "Data Encrypted for Impact", "reference": "https://attack.mitre.org/techniques/T1486"}]}], "version": 1, "references": ["https://securelist.com/locked-out/68960/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
