{"description": "Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection", "enabled": false, "false_positives": ["Applications could use this notation occasionally which might generate some false positives. In that case investigate the parent and child process."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5640d589-c802-4b3c-592a-0884ea8fdb0f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Use Short Name Path in Command Line", "query": "(process.command_line.text:(*\\~1\\\\* OR *\\~2\\\\*) AND (NOT (process.parent.executable.text:(\"C\\:\\\\Windows\\\\System32\\\\Dism.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\cleanmgr.exe\" OR \"C\\:\\\\Program\\ Files\\\\GPSoftware\\\\Directory\\ Opus\\\\dopus.exe\") OR process.parent.executable.text:(*\\\\WebEx\\\\WebexHost.exe OR *\\\\thor\\\\thor64.exe OR *\\\\veam.backup.shell.exe OR *\\\\winget.exe OR *\\\\Everything\\\\Everything.exe) OR process.parent.executable.text:*\\\\AppData\\\\Local\\\\Temp\\\\WinGet\\\\* OR process.command_line.text:(*\\\\appdata\\\\local\\\\webex\\\\webex64\\\\meetings\\\\wbxreport.exe* OR *C\\:\\\\Program\\ Files\\\\Git\\\\post\\-install.bat* OR *C\\:\\\\Program\\ Files\\\\Git\\\\cmd\\\\scalar.exe*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN", "https://twitter.com/frack113/status/1555830623633375232"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
