{"description": "Detects suspicious characters in the command line, which could be a sign of obfuscation", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2c0d2d7b-30d6-4d14-9751-7b9113042ab9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Characters in CommandLine", "query": "(process.command_line:(*\u02e3* OR *\u02ea* OR *\u02e2*) OR process.command_line:(*\u2215* OR *\u2044*) OR process.command_line:(*\u2015* OR *\u2014*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation"], "timestamp_override": "event.ingested", "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
