{"description": "Detects transferring files from system on a server bitstransfer Powershell cmdlets", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "14da900e-002b-2a58-cd4e-460ee3539504", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Bitstransfer via PowerShell", "query": "(process.executable.text:(*\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\pwsh.exe) AND process.command_line.text:(*Get\\-BitsTransfer* OR *Add\\-BitsFile*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/powershell/module/bitstransfer/add-bitsfile?view=windowsserver2019-ps"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
