{"description": "Detects Certipy a tool for Active Directory Certificate Services enumeration and abuse based on PE metadata characteristics and common command line arguments.", "author": ["pH-T (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6938366d-8954-4ddc-baff-c830b3ba8fcd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - Certipy Execution", "query": "((((process.executable.text:\"*\\\\Certipy.exe\") OR (winlog.event_data.OriginalFileName:\"Certipy.exe\") OR (winlog.event_data.Description:*Certipy*))) OR ((process.command_line.text:(\"*\\ auth\\ *\" OR \"*\\ find\\ *\" OR \"*\\ forge\\ *\" OR \"*\\ relay\\ *\" OR \"*\\ req\\ *\" OR \"*\\ shadow\\ *\") AND process.command_line.text:(\"*\\ \\-bloodhound*\" OR \"*\\ \\-ca\\-pfx\\ *\" OR \"*\\ \\-dc\\-ip\\ *\" OR \"*\\ \\-kirbi*\" OR \"*\\ \\-old\\-bloodhound*\" OR \"*\\ \\-pfx\\ *\" OR \"*\\ \\-target*\" OR \"*\\ \\-username\\ *\" OR \"*\\ \\-vulnerable*\" OR \"*auth\\ \\-pfx*\" OR \"*shadow\\ auto*\" OR \"*shadow\\ list*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/ly4k/Certipy"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
