{"description":"suspicious command line to remove exe or dll Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"204b17ae-4007-471b-917b-b917b315c5db","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Del in CommandLine","query":"((process.command_line:*del\\ *.exe* AND process.command_line:*\\/f\\ * AND process.command_line:*\\/q\\ *) OR (process.command_line:*del\\ *.dll* AND process.command_line:*C\\:\\\\ProgramData\\\\*))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1070"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
