{"description": "Detects a ZxShell start by the called and well-known function name", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f0b70adb-0075-43b0-9745-e82a1c608fcc", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "ZxShell Malware", "query": "(process.executable:*\\\\rundll32.exe AND process.command_line:(*zxFunction* OR *RemoteDiskXXXXX*))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1059", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.hybrid-analysis.com/sample/5d2a4cde9fa7c2fdbf39b2e2ffd23378d0c50701a3095d1e91e3cf922d7b0b16?environmentId=100"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "oscd.community", "Jonhnathan Ribeiro"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
