{"description": "Detects the creation of a schtask via PowerSploit or Empire Default Configuration.", "enabled": false, "false_positives": ["False positives are possible, depends on organisation and processes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "56c217c3-2de2-479b-990f-5c109ba8458f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Default PowerSploit and Empire Schtasks Persistence", "query": "(process.parent.executable:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Create* AND process.command_line:*\\/SC* AND process.command_line:*\\/TN* AND process.command_line:*Updater* AND process.command_line:*\\/TR* AND process.command_line:*powershell* AND process.command_line:(*ONLOGON* OR *DAILY* OR *ONIDLE* OR *Updater*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1053", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://github.com/0xdeadbeefJERKY/PowerSploit/blob/8690399ef70d2cad10213575ac67e8fa90ddf7c3/Persistence/Persistence.psm1", "https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/powershell/persistence/userland/schtasks.py"], "timestamp_override": "event.ingested", "author": ["Markus Neis", "@Karneades"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
