{"description": "Detects the execution of AdvancedRun utitlity", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "52b598d7-b920-3c50-e7ec-7b35a83235f6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious AdvancedRun Execution", "query": "(winlog.event_data.OriginalFileName:\"AdvancedRun.exe\" OR (process.command_line:*\\ \\/EXEFilename\\ * AND process.command_line:*\\ \\/Run*) OR (process.command_line:*\\ \\/WindowState\\ 0* AND process.command_line:*\\ \\/RunAs\\ * AND process.command_line:*\\ \\/CommandLine\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/splinter_code/status/1483815103279603714", "https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3", "https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/", "https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
