{"description": "Detects execution of the \"mshta\" utility with an argument containing the \"http\" keyword, which could indicate that an attacker is executing a remotely hosted malicious hta file", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b98d0db6-511d-45de-ad02-e82a98729620", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remotely Hosted HTA File Executed Via Mshta.EXE", "query": "(((process.executable.text:\"*\\\\mshta.exe\") OR (winlog.event_data.OriginalFileName:\"MSHTA.EXE\")) AND process.command_line.text:(\"*http\\:\\/\\/*\" OR \"*https\\:\\/\\/*\" OR \"*ftp\\:\\/\\/*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
