{"description": "Detects RDP session hijacking by using MSTSC shadowing", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d702c59c-ff71-416b-78fa-d56f4dfa761b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSTSC Shadowing", "query": "(process.command_line:*noconsentprompt* AND process.command_line:*shadow\\:*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1563"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1563", "name": "Remote Service Session Hijacking", "reference": "https://attack.mitre.org/techniques/T1563"}]}], "version": 1, "references": ["https://twitter.com/kmkz_security/status/1220694202301976576", "https://github.com/kmkz/Pentesting/blob/master/Post-Exploitation-Cheat-Sheet"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
