{"description": "Detects the use of 3proxy, a tiny free proxy server", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "48f96f6f-a48c-1b3b-5f29-257893aed222", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "3Proxy Usage", "query": "((process.executable.text:*\\\\3proxy.exe) OR (winlog.event_data.Description:\"3proxy - tiny proxy server\") OR (process.command_line.text:*.exe\\ \\-i127.0.0.1\\ \\-p*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1572"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/3proxy/3proxy", "https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
