{"description": "Detects executables launched outside their default directories as used by Lazarus Group (Bluenoroff)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f7f5b0b-5b16-476c-a85f-ab477f6dd24b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Lazarus Session Highjacker", "query": "(process.executable:(*\\\\msdtc.exe OR *\\\\gpvc.exe) AND (NOT (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180244/Lazarus_Under_The_Hood_PDF_final.pdf"], "timestamp_override": "event.ingested", "author": ["Trent Liffick (@tliffick)", "Bartlomiej Czyz (@bczyz1)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
