{"description": "Detects the execution of Sysinternals ADExplorer with the \"-snapshot\" flag in order to save a local copy of the active directory database.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9212f354-7775-4e28-9c9f-8f0a4544e664", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Active Directory Database Snapshot Via ADExplorer", "query": "(((process.executable.text:\"*\\\\ADExplorer.exe\") OR (winlog.event_data.OriginalFileName:\"AdExp\")) AND process.command_line.text:\"*snapshot*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
