{"description": "Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and later.", "enabled": false, "false_positives": ["Administrative scripts (installers)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "21dd6d38-2b18-4453-9404-a0fe4a0cc288", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Curl Start Combination", "query": "(process.command_line:*curl* AND process.command_line:*\\ start\\ *)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105", "T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983"], "timestamp_override": "event.ingested", "author": ["Sreeman"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
