{"description": "Detects a suspicious process spawning a Chromium based browser process with the 'load-extension' flag to start a instance with custom extensions", "author": ["Aedan Russell", "frack113", "X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "27ba3207-dd30-4812-abbf-5d20c57d474e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Chromium Browser Instance Executed With Custom Extensions", "query": "(process.parent.executable.text:(\"*\\\\cmd.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\wscript.exe\") AND process.executable.text:(\"*\\\\brave.exe\" OR \"*\\\\chrome.exe\" OR \"*\\\\msedge.exe\" OR \"*\\\\opera.exe\" OR \"*\\\\vivaldi.exe\") AND process.command_line.text:\"*\\-\\-load\\-extension\\=*\" AND process.command_line.text:\"*\\\\AppData\\\\Local\\\\*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1176"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1176", "name": "Browser Extensions", "reference": "https://attack.mitre.org/techniques/T1176"}]}], "version": 1, "references": ["https://redcanary.com/blog/chromeloader/", "https://emkc.org/s/RJjuLa", "https://www.mandiant.com/resources/blog/lnk-between-browsers"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
