{"description": "Detects usage of Dsacls to grant over permissive permissions", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate administrators granting over permissive permissions to users"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "01c42d3c-242d-4655-85b2-34f1739632f7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Over Permissive Permissions Granted Using Dsacls.EXE", "query": "(((process.executable.text:\"*\\\\dsacls.exe\") OR (winlog.event_data.OriginalFileName:\"DSACLS.EXE\")) AND process.command_line.text:\"*\\ \\/G\\ *\" AND process.command_line.text:(\"*GR*\" OR \"*GE*\" OR \"*GW*\" OR \"*GA*\" OR \"*WP*\" OR \"*WD*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://ss64.com/nt/dsacls.html", "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
