{"description": "Detects command line parameters used by Hydra password guessing hack tool", "enabled": false, "false_positives": ["Software that uses the caret encased keywords PASS and USER in its command line"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "aaafa146-074c-11eb-adc1-0242ac120002", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Hydra Password Guessing Hack Tool", "query": "(process.command_line:*\\-u\\ * AND process.command_line:*\\-p\\ * AND process.command_line:(*\\^USER\\^* OR *\\^PASS\\^*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1110", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}, {"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://github.com/vanhauser-thc/thc-hydra", "https://attack.mitre.org/techniques/T1110/001/"], "timestamp_override": "event.ingested", "author": ["Vasiliy Burov"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
