{"description": "Detects suspicious powershell download cradle using nslookup. This cradle uses nslookup to extract payloads from DNS records", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1b3b01c7-84e9-4072-86e5-fc285a41ff23", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Nslookup PowerShell Download Cradle - ProcessCreation", "query": "(((process.executable.text:*\\\\nslookup.exe*) OR (winlog.event_data.OriginalFileName:\"\\nslookup.exe\")) AND (process.parent.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line.text:(*\\ \\-q\\=txt\\ * OR *\\ \\-querytype\\=txt\\ *)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Alh4zr3d/status/1566489367232651264"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
