{"description": "Detects regsvr32 execution to download/install/register new DLLs that are hosted on Web or FTP servers.", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "867356ee-9352-41c9-a8f2-1be690d78216", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potentially Suspicious Regsvr32 HTTP/FTP Pattern", "query": "(((process.executable.text:\"*\\\\regsvr32.exe\") OR (winlog.event_data.OriginalFileName:\"REGSVR32.EXE\")) AND process.command_line.text:(\"*\\ \\/i*\" OR \"*\\ \\-i*\") AND process.command_line.text:(\"*ftp*\" OR \"*http*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1461041276514623491", "https://twitter.com/tccontre18/status/1480950986650832903", "https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
