{"description": "Detects Wscript/Cscript executing a file with an uncommon (i.e. non-script) extension", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "99b7460d-c9f1-40d7-a316-1f36f61d52ee", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Cscript/Wscript Uncommon Script Extension Execution", "query": "(((winlog.event_data.OriginalFileName:(\"wscript.exe\" OR \"cscript.exe\")) OR (process.executable.text:(\"*\\\\wscript.exe\" OR \"*\\\\cscript.exe\"))) AND process.command_line.text:(\"*.csv*\" OR \"*.dat*\" OR \"*.doc*\" OR \"*.gif*\" OR \"*.jpeg*\" OR \"*.jpg*\" OR \"*.png*\" OR \"*.ppt*\" OR \"*.txt*\" OR \"*.xls*\" OR \"*.xml*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
