{"description": "Detects usage of \"query.exe\" a system binary to exfil information such as \"sessions\" and \"processes\" for later use", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "53ef0cef-fa24-4f25-a34a-6c72dfa2e6e2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Query Usage To Exfil Data", "query": "(process.executable.text:*\\\\Windows\\\\System32\\\\query.exe AND process.command_line.text:(*session\\ >* OR *process\\ >*))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/MichalKoczwara/status/1553634816016498688"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
