{"description": "Detects execution of the SharpLDAPmonitor. Which can monitor the creation, deletion and changes to LDAP objects.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9f8fc146-1d1a-4dbf-b8fd-dfae15e08541", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "HackTool - SharpLDAPmonitor Execution", "query": "((((process.executable.text:\"*\\\\SharpLDAPmonitor.exe\") OR (winlog.event_data.OriginalFileName:\"SharpLDAPmonitor.exe\"))) OR ((process.command_line.text:\"*\\/user\\:*\" AND process.command_line.text:\"*\\/pass\\:*\" AND process.command_line.text:\"*\\/dcip\\:*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/p0dalirius/LDAPmonitor"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
