{"description": "Detects inline windows shell commands redirecting output via the \">\" symbol to a suspicious location", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate admin scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8e0bb260-d4b2-4fff-bb8d-3f82118e6892", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious CMD Shell Redirect", "query": "(((process.executable.text:*\\\\cmd.exe) OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND ((process.command_line.text:(*>\\ %USERPROFILE%\\\\* OR *>\\ %APPDATA%\\\\* OR *>\\ \\\\Users\\\\Public\\\\* OR *>\\ C\\:\\\\Users\\\\Public\\\\* OR *>\\ %TEMP%\\\\* OR *>\\ %TMP%\\\\* OR *>\\ C\\:\\\\Windows\\\\Temp\\\\* OR *>\\ C\\:\\\\Temp\\\\*)) OR ((process.command_line.text:(*\\ >\\ * OR *\\ >>\\ *) AND process.command_line.text:*C\\:\\\\Users\\\\* AND process.command_line.text:*\\\\AppData\\\\Local\\\\*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
