{"description": "Detects suspicious PowerShell scripts accessing SAM hives", "enabled": false, "false_positives": ["Some rare backup scenarios", "PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4147d63a-163a-ac3c-449c-93586a539e34", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell SAM Copy", "query": "(process.command_line:*\\\\HarddiskVolumeShadowCopy* AND process.command_line:*ystem32\\\\config\\\\sam* AND process.command_line:(*Copy\\-Item* OR *cp\\ $_.* OR *cpi\\ $_.* OR *copy\\ $_.* OR *.File\\]\\:\\:Copy\\(*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/splinter_code/status/1420546784250769408"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
