{"description": "Conti recommendation to its affiliates to use esentutl to access NTDS dumped file. Trickbot also uses this utilities to get MSEdge info via its module pwgrab.", "enabled": false, "false_positives": ["To be determined"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7df1713a-1a5b-4a4b-a071-dc83b144a101", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Esentutl Gather Credentials", "query": "(process.command_line:*esentutl* AND process.command_line:*\\ \\/p*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://twitter.com/vxunderground/status/1423336151860002816", "https://attack.mitre.org/software/S0404/", "https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/"], "timestamp_override": "event.ingested", "author": ["sam0x90"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
