{"description":"Detects modification of an existing service on a compromised host in order to execute an arbitrary payload when the service is started or killed as a method of persistence. Author: Sreeman. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6050f365-b645-c84f-3bf6-5bcb770d644f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Modification Of Existing Services For Persistence","query":"((process.command_line:*sc\\ * AND process.command_line:*config\\ * AND process.command_line:*binpath\\=*) OR (process.command_line:*sc\\ * AND process.command_line:*failure* AND process.command_line:*command\\=*) OR (process.command_line:*reg\\ * AND process.command_line:*add\\ * AND process.command_line:*FailureCommand* AND process.command_line:(*.sh* OR *.exe* OR *.dll* OR *.bin$* OR *.bat* OR *.cmd* OR *.js* OR *.msh$* OR *.reg$* OR *.scr* OR *.ps* OR *.vb* OR *.jar* OR *.pl*)) OR (process.command_line:*reg\\ * AND process.command_line:*add\\ * AND process.command_line:*ImagePath* AND process.command_line:(*.sh* OR *.exe* OR *.dll* OR *.bin$* OR *.bat* OR *.cmd* OR *.js* OR *.msh$* OR *.reg$* OR *.scr* OR *.ps* OR *.vb* OR *.jar* OR *.pl*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1543","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"},{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
