{"description": "Detects a suspicious process creation as SYSTEM user (suspicious program or command line parameter)", "enabled": false, "false_positives": ["Administrative activity", "Scripts and administrative tools used in the monitored environment", "Monitoring activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2617e7ed-adb7-40ba-b0f3-8f9945fe6c09", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious SYSTEM User Process Creation", "query": "((IntegrityLevel:\"System\" AND user.name:(*AUTHORI* OR *AUTORI*)) AND (process.executable:(*\\\\calc.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\hh.exe OR *\\\\mshta.exe OR *\\\\forfiles.exe OR *\\\\ping.exe) OR process.command_line:(*\\ \\-NoP\\ * OR *\\ \\-W\\ Hidden\\ * OR *\\ \\-decode\\ * OR *\\ \\/decode\\ * OR *\\ \\/urlcache\\ * OR *\\ \\-urlcache\\ * OR *\\ \\-e*\\ JAB* OR *\\ \\-e*\\ SUVYI* OR *\\ \\-e*\\ SQBFAFgA* OR *\\ \\-e*\\ aWV4I* OR *\\ \\-e*\\ IAB* OR *\\ \\-e*\\ PAA* OR *\\ \\-e*\\ aQBlAHgA* OR *vssadmin\\ delete\\ shadows* OR *reg\\ SAVE\\ HKLM* OR *\\ \\-ma\\ * OR *Microsoft\\\\Windows\\\\CurrentVersion\\\\Run* OR *.downloadstring\\(* OR *.downloadfile\\(* OR *\\ \\/ticket\\:* OR *dpapi\\:\\:* OR *event\\:\\:clear* OR *event\\:\\:drop* OR *id\\:\\:modify* OR *kerberos\\:\\:* OR *lsadump\\:\\:* OR *misc\\:\\:* OR *privilege\\:\\:* OR *rpc\\:\\:* OR *sekurlsa\\:\\:* OR *sid\\:\\:* OR *token\\:\\:* OR *vault\\:\\:cred* OR *vault\\:\\:list* OR *\\ p\\:\\:d\\ * OR *;iex\\(* OR *MiniDump* OR *net\\ user\\ *)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://tools.thehacker.recipes/mimikatz/modules"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)", "David ANDRE (additional keywords)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
