{"description": "Detects non-interactive PowerShell activity by looking at the \"powershell\" process with a non-user GUI process such as \"explorer.exe\" as a parent.", "author": ["Roberto Rodriguez @Cyb3rWard0g (rule)", "oscd.community (improvements)"], "enabled": false, "false_positives": ["Likely. Many admin scripts and tools leverage PowerShell in their BAT or VB scripts which may trigger this rule often. It is best to add additional filters or use this to hunt for anomalies"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f4bbd493-b796-416e-bbf2-121235348529", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Non Interactive PowerShell Process Spawned", "query": "((((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND (NOT ((process.parent.executable.text:(\"*C\\:\\\\Windows\\\\explorer.exe\" OR \"*C\\:\\\\Windows\\\\System32\\\\CompatTelRunner.exe\" OR \"*C\\:\\\\Windows\\\\SysWOW64\\\\explorer.exe\")) OR (process.parent.executable.text:\"C:\\$WINDOWS.~BT\\Sources\\SetupHost.exe\")))) AND (NOT (process.parent.executable.text:\"C\\:\\\\Users\\\\*\" AND process.parent.executable.text:\"*\\\\AppData\\\\Local\\\\Programs\\\\Microsoft\\ VS\\ Code\\\\Code.exe\" AND process.parent.command_line.text:\"*\\ \\-\\-ms\\-enable\\-electron\\-run\\-as\\-node\\ *\")))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://web.archive.org/web/20200925032237/https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
