{"description": "Detects execution of the \"cloudflared\" tool to connect back to a tunnel. This was seen used by threat actors to maintain persistence and remote access to compromised networks.", "author": ["Janantha Marasinghe", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage of Cloudflared."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9a019ffc-3580-4c9d-8d87-079f7e8d3fd4", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Cloudflared Tunnel Execution", "query": "(process.command_line.text:\"*\\ tunnel\\ *\" AND process.command_line.text:\"*\\ run\\ *\" AND process.command_line.text:(\"*\\ \\-\\-config\\ *\" OR \"*\\ \\-\\-credentials\\-contents\\ *\" OR \"*\\ \\-\\-credentials\\-file\\ *\" OR \"*\\ \\-\\-token\\ *\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1090", "T1102", "T1572"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blog.reconinfosec.com/emergence-of-akira-ransomware-group", "https://github.com/cloudflare/cloudflared", "https://developers.cloudflare.com/cloudflare-one/connections/connect-apps"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
