{"description": "The CrachMapExec pentesting framework implements a PowerShell obfuscation with some static strings detected by this rule.", "author": ["Thomas Patzke"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6f8b3439-a203-45dc-a88b-abf57ea15ccf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - CrackMapExec PowerShell Obfuscation", "query": "(((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\")) OR (winlog.event_data.OriginalFileName:(\"PowerShell.EXE\" OR \"pwsh.dll\"))) AND process.command_line.text:(\"*join\\*split*\" OR \"*\\(\\ $ShellId\\[1\\]\\+$ShellId\\[13\\]\\+'x'\\)*\" OR \"*\\(\\ $PSHome\\[\\*\\]\\+$PSHOME\\[\\*\\]\\+*\" OR \"*\\(\\ $env\\:Public\\[13\\]\\+$env\\:Public\\[5\\]\\+'x'\\)*\" OR \"*\\(\\ $env\\:ComSpec\\[4,\\*,25\\]\\-Join''\\)*\" OR \"*\\[1,3\\]\\+'x'\\-Join''\\)*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/byt3bl33d3r/CrackMapExec", "https://github.com/byt3bl33d3r/CrackMapExec/blob/0a49f75347b625e81ee6aa8c33d3970b5515ea9e/cme/helpers/powershell.py#L242"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
