{"description": "Detects a suspicious copy operation that tries to copy a program from a system (System32 or SysWOW64) directory to another on disk.\nOften used to move LOLBINs such as 'certutil' or 'desktopimgdownldr' to a different location with a different name in order to bypass detections based on locations\n", "enabled": false, "false_positives": ["Depend on scripts and administrative tools used in the monitored environment (For example an admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/)", "When cmd.exe and xcopy.exe are called directly", "When the command contains the keywords but not in the correct order"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fff9d2b7-e11c-4a69-93d3-40ef66189767", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Copy From or To System32", "query": "(((process.executable.text:*\\\\cmd.exe AND process.command_line.text:*copy\\ *) OR (process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line.text:(*copy\\-item* OR *\\ copy\\ * OR *cpi\\ * OR *\\ cp\\ *)) OR process.executable.text:(*\\\\robocopy.exe OR *\\\\xcopy.exe)) AND process.command_line.text:(*\\\\System32* OR *\\\\SysWOW64*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120", "https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Markus Neis", "Tim Shelton (HAWK.IO)", "Nasreddine Bencherchali (update)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
