{"description": "Detects, possibly, malicious unauthorized usage of bcdedit.exe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c9fbe8e9-119d-40a6-9b59-dd58a5d84429", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Possible Ransomware or Unauthorized MBR Modifications", "query": "(process.executable:*\\\\bcdedit.exe AND process.command_line:(*delete* OR *deletevalue* OR *import* OR *safeboot* OR *network*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070", "T1542"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1542", "name": "Pre-OS Boot", "reference": "https://attack.mitre.org/techniques/T1542"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}, {"id": "T1542", "name": "Pre-OS Boot", "reference": "https://attack.mitre.org/techniques/T1542"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/bcdedit--set", "https://twitter.com/malwrhunterteam/status/1372536434125512712/photo/2"], "timestamp_override": "event.ingested", "author": ["@neu5ron"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
