{"description": "Detects Microsoft Visual Studio vsls-agent.exe lolbin execution with a suspicious library load using the --agentExtensionPath parameter", "enabled": false, "false_positives": ["False positives depend on custom use of vsls-agent.exe"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "43103702-5886-11ed-9b6a-0242ac120002", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Vsls-Agent Command With AgentExtensionPath Load", "query": "((process.executable.text:*\\\\vsls\\-agent.exe AND process.command_line.text:*\\-\\-agentExtensionPath*) AND (NOT (process.command_line.text:*Microsoft.VisualStudio.LiveShare.Agent.*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/bohops/status/1583916360404729857"], "timestamp_override": "event.ingested", "author": ["bohops"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
