{"description": "Detects ScreenConnect program starts that establish a remote access to that system (not meeting, not remote support)", "enabled": false, "false_positives": ["Legitimate use by administrative staff"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "18a15f22-bab9-33c5-38f7-5a19cb228ae5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "ScreenConnect Remote Access", "query": "(process.command_line:*e\\=Access&* AND process.command_line:*y\\=Guest&* AND process.command_line:*&p\\=* AND process.command_line:*&c\\=* AND process.command_line:*&k\\=*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1133"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1133", "name": "External Remote Services", "reference": "https://attack.mitre.org/techniques/T1133"}]}], "version": 1, "references": ["https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
