{"description": "Detects use of chcp to look up the system locale value as part of host discovery", "enabled": false, "false_positives": ["During Anaconda update the 'conda.exe' process will eventually launch the command described in the detection section"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "82a8cac5-dc04-baba-014c-ed89f5289890", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CHCP CodePage Locale Lookup", "query": "((process.parent.executable.text:*\\\\cmd.exe AND process.parent.command_line.text:(*\\ \\/c\\ * OR *\\ \\/k\\ *) AND process.executable.text:*\\\\chcp.com AND process.command_line.text:(*chcp OR *chcp\\  OR *chcp\\ \\ )) AND (NOT ((GrandparentCommandLine:*\\/c\\ C\\:\\\\ProgramData\\\\Anaconda3*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1614"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1614", "name": "System Location Discovery", "reference": "https://attack.mitre.org/techniques/T1614"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/chcp"], "timestamp_override": "event.ingested", "author": ["_pete_0", "TheDFIRReport"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
