{"description": "Detects the execution of WMIC in order to get a list of firewall and antivirus products", "author": ["Michael Haag", "Florian Roth (Nextron Systems)", "juju4", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e568650b-5dcd-4658-8f34-ded0b1e13992", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Product Class Reconnaissance Via Wmic.EXE", "query": "(((process.executable.text:\"*\\\\wmic.exe\") OR (winlog.event_data.OriginalFileName:\"wmic.exe\")) AND process.command_line.text:(\"*AntiVirusProduct*\" OR \"*FirewallProduct*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://github.com/albertzsigovits/malware-notes/blob/c820c7fea76cf76a861b28ebc77e06100e20ec29/Ransomware/Maze.md", "https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
