{"description": "Detects suspicious execution of Regasm/Regsvcs utilities", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cc368ed0-2411-45dc-a222-510ace303cb2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Regasm/Regsvcs Suspicious Execution", "query": "(((((process.executable.text:(\"*\\\\Regsvcs.exe\" OR \"*\\\\Regasm.exe\")) OR (winlog.event_data.OriginalFileName:(\"RegSvcs.exe\" OR \"RegAsm.exe\"))) AND process.command_line.text:(\"*\\\\Users\\\\Public\\\\*\" OR \"*\\\\AppData\\\\Local\\\\Temp\\\\*\" OR \"*\\\\Desktop\\\\*\" OR \"*\\\\Downloads\\\\*\" OR \"*\\\\PerfLogs\\\\*\" OR \"*\\\\Windows\\\\Temp\\\\*\" OR \"*\\\\Microsoft\\\\Windows\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\*\"))) OR ((((process.executable.text:(\"*\\\\Regsvcs.exe\" OR \"*\\\\Regasm.exe\")) OR (winlog.event_data.OriginalFileName:(\"RegSvcs.exe\" OR \"RegAsm.exe\"))) AND (NOT ((process.command_line.text:\"*.dll*\") OR (process.command_line.text:(\"*\\\\Regasm.exe\\\"\" OR \"*\\\\Regasm.exe\" OR \"*\\\\Regsvcs.exe\\\"\" OR \"*\\\\Regsvcs.exe\")))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.fortiguard.com/threat-signal-report/4718?s=09", "https://lolbas-project.github.io/lolbas/Binaries/Regasm/", "https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
