{"description":"This rule detects suspicious processes with parent images located in the C:\\Users\\Public folder Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"69bd9b97-2be2-41b6-9816-fb08757a4d1a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Parent in Public Folder Suspicious Process","query":"(process.parent.executable:C\\:\\\\Users\\\\Public\\\\* AND process.command_line:(*powershell* OR *cmd.exe\\ \\/c\\ * OR *cmd\\ \\/c\\ * OR *wscript.exe* OR *cscript.exe* OR *bitsadmin* OR *certutil* OR *mshta.exe*))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
