{"description": "Detects when an attacker tries to modify an already existing scheduled tasks to run from a suspicious location\nAttackers can create a simple looking task in order to avoid detection on creation as it's often the most focused on\nInstead they modify the task after creation to include their malicious payload\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1c0e41cd-21bb-4433-9acc-4a2cd6367b9b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Modification Of Scheduled Tasks", "query": "(process.executable.text:*\\\\schtasks.exe AND process.command_line.text:*\\ \\/Change\\ * AND process.command_line.text:*\\ \\/TN\\ * AND process.command_line.text:(*\\\\AppData\\\\Local\\\\Temp* OR *\\\\AppData\\\\Roaming\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\WINDOWS\\\\Temp\\\\* OR *\\\\Desktop\\\\* OR *\\\\Downloads\\\\* OR *\\\\Temporary\\ Internet* OR *C\\:\\\\ProgramData\\\\* OR *C\\:\\\\Perflogs\\\\* OR *%ProgramData%* OR *%appdata%* OR *%comspec%* OR *%localappdata%*) AND process.command_line.text:(*regsvr32* OR *rundll32* OR *cmd\\ \\/c\\ * OR *cmd.exe\\ \\/c\\ * OR *powershell* OR *mshta* OR *wscript* OR *cscript* OR *certutil* OR *bitsadmin* OR *bash.exe* OR *bash\\ * OR *scrcons* OR *wmic\\ * OR *wmic.exe* OR *forfiles* OR *scriptrunner* OR *hh.exe* OR *hh\\ *))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["Internal Research", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
