{"description": "Detects a service binary running in a suspicious directory", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "883faa95-175a-4e22-8181-e5761aeb373c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Service Binary Directory", "query": "(process.executable:(*\\\\Users\\\\Public\\\\* OR *\\\\$Recycle.bin* OR *\\\\Users\\\\All\\ Users\\\\* OR *\\\\Users\\\\Default\\\\* OR *\\\\Users\\\\Contacts\\\\* OR *\\\\Users\\\\Searches\\\\* OR *C\\:\\\\Perflogs\\\\* OR *\\\\config\\\\systemprofile\\\\* OR *\\\\Windows\\\\Fonts\\\\* OR *\\\\Windows\\\\IME\\\\* OR *\\\\Windows\\\\addins\\\\*) AND process.parent.executable:(*\\\\services.exe OR *\\\\svchost.exe))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
