{"description": "Detects PowerShell command line contents that include a suspicious anormal casing in the Net.Webclient (e.g. nEt.WEbCliEnT) string as used in obfuscation techniques", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9a059bda-39b4-3183-cd98-04cade74c803", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Net WebClient Casing Anomalies", "query": "(process.executable:*\\\\powershell.exe AND process.command_line:(*TgBlAFQALgB3AEUAQg* OR *4AZQBUAC4AdwBFAEIA* OR *OAGUAVAAuAHcARQBCA* OR *bgBFAHQALgB3AGUAYg* OR *4ARQB0AC4AdwBlAGIA* OR *uAEUAdAAuAHcAZQBiA* OR *TgBFAHQALgB3AGUAYg* OR *OAEUAdAAuAHcAZQBiA* OR *bgBlAFQALgB3AGUAYg* OR *4AZQBUAC4AdwBlAGIA* OR *uAGUAVAAuAHcAZQBiA* OR *TgBlAFQALgB3AGUAYg* OR *OAGUAVAAuAHcAZQBiA* OR *bgBFAFQALgB3AGUAYg* OR *4ARQBUAC4AdwBlAGIA* OR *uAEUAVAAuAHcAZQBiA* OR *bgBlAHQALgBXAGUAYg* OR *4AZQB0AC4AVwBlAGIA* OR *uAGUAdAAuAFcAZQBiA* OR *bgBFAHQALgBXAGUAYg* OR *4ARQB0AC4AVwBlAGIA* OR *uAEUAdAAuAFcAZQBiA* OR *TgBFAHQALgBXAGUAYg* OR *OAEUAdAAuAFcAZQBiA* OR *bgBlAFQALgBXAGUAYg* OR *4AZQBUAC4AVwBlAGIA* OR *uAGUAVAAuAFcAZQBiA* OR *TgBlAFQALgBXAGUAYg* OR *OAGUAVAAuAFcAZQBiA* OR *bgBFAFQALgBXAGUAYg* OR *4ARQBUAC4AVwBlAGIA* OR *uAEUAVAAuAFcAZQBiA* OR *bgBlAHQALgB3AEUAYg* OR *4AZQB0AC4AdwBFAGIA* OR *uAGUAdAAuAHcARQBiA* OR *TgBlAHQALgB3AEUAYg* OR *OAGUAdAAuAHcARQBiA* OR *bgBFAHQALgB3AEUAYg* OR *4ARQB0AC4AdwBFAGIA* OR *uAEUAdAAuAHcARQBiA* OR *TgBFAHQALgB3AEUAYg* OR *OAEUAdAAuAHcARQBiA* OR *bgBlAFQALgB3AEUAYg* OR *4AZQBUAC4AdwBFAGIA* OR *uAGUAVAAuAHcARQBiA* OR *TgBlAFQALgB3AEUAYg* OR *OAGUAVAAuAHcARQBiA* OR *bgBFAFQALgB3AEUAYg* OR *4ARQBUAC4AdwBFAGIA* OR *uAEUAVAAuAHcARQBiA* OR *TgBFAFQALgB3AEUAYg* OR *OAEUAVAAuAHcARQBiA* OR *bgBlAHQALgBXAEUAYg* OR *4AZQB0AC4AVwBFAGIA* OR *uAGUAdAAuAFcARQBiA* OR *TgBlAHQALgBXAEUAYg* OR *OAGUAdAAuAFcARQBiA* OR *bgBFAHQALgBXAEUAYg* OR *4ARQB0AC4AVwBFAGIA* OR *uAEUAdAAuAFcARQBiA* OR *TgBFAHQALgBXAEUAYg* OR *OAEUAdAAuAFcARQBiA* OR *bgBlAFQALgBXAEUAYg* OR *4AZQBUAC4AVwBFAGIA* OR *uAGUAVAAuAFcARQBiA* OR *TgBlAFQALgBXAEUAYg* OR *OAGUAVAAuAFcARQBiA* OR *bgBFAFQALgBXAEUAYg* OR *4ARQBUAC4AVwBFAGIA* OR *uAEUAVAAuAFcARQBiA* OR *TgBFAFQALgBXAEUAYg* OR *OAEUAVAAuAFcARQBiA* OR *bgBlAHQALgB3AGUAQg* OR *4AZQB0AC4AdwBlAEIA* OR *uAGUAdAAuAHcAZQBCA* OR *TgBlAHQALgB3AGUAQg* OR *OAGUAdAAuAHcAZQBCA* OR *bgBFAHQALgB3AGUAQg* OR *4ARQB0AC4AdwBlAEIA* OR *uAEUAdAAuAHcAZQBCA* OR *TgBFAHQALgB3AGUAQg* OR *OAEUAdAAuAHcAZQBCA* OR *bgBlAFQALgB3AGUAQg* OR *4AZQBUAC4AdwBlAEIA* OR *uAGUAVAAuAHcAZQBCA* OR *TgBlAFQALgB3AGUAQg* OR *OAGUAVAAuAHcAZQBCA* OR *bgBFAFQALgB3AGUAQg* OR *4ARQBUAC4AdwBlAEIA* OR *uAEUAVAAuAHcAZQBCA* OR *TgBFAFQALgB3AGUAQg* OR *OAEUAVAAuAHcAZQBCA* OR *bgBlAHQALgBXAGUAQg* OR *4AZQB0AC4AVwBlAEIA* OR *uAGUAdAAuAFcAZQBCA* OR *TgBlAHQALgBXAGUAQg* OR *OAGUAdAAuAFcAZQBCA* OR *bgBFAHQALgBXAGUAQg* OR *4ARQB0AC4AVwBlAEIA* OR *uAEUAdAAuAFcAZQBCA* OR *TgBFAHQALgBXAGUAQg* OR *OAEUAdAAuAFcAZQBCA* OR *bgBlAFQALgBXAGUAQg* OR *4AZQBUAC4AVwBlAEIA* OR *uAGUAVAAuAFcAZQBCA* OR *TgBlAFQALgBXAGUAQg* OR *OAGUAVAAuAFcAZQBCA* OR *bgBFAFQALgBXAGUAQg* OR *4ARQBUAC4AVwBlAEIA* OR *uAEUAVAAuAFcAZQBCA* OR *TgBFAFQALgBXAGUAQg* OR *OAEUAVAAuAFcAZQBCA* OR *bgBlAHQALgB3AEUAQg* OR *4AZQB0AC4AdwBFAEIA* OR *uAGUAdAAuAHcARQBCA* OR *TgBlAHQALgB3AEUAQg* OR *OAGUAdAAuAHcARQBCA* OR *bgBFAHQALgB3AEUAQg* OR *4ARQB0AC4AdwBFAEIA* OR *uAEUAdAAuAHcARQBCA* OR *TgBFAHQALgB3AEUAQg* OR *OAEUAdAAuAHcARQBCA* OR *bgBlAFQALgB3AEUAQg* OR *uAGUAVAAuAHcARQBCA* OR *bgBFAFQALgB3AEUAQg* OR *4ARQBUAC4AdwBFAEIA* OR *uAEUAVAAuAHcARQBCA* OR *TgBFAFQALgB3AEUAQg* OR *OAEUAVAAuAHcARQBCA* OR *TgBlAHQALgBXAEUAQg* OR *4AZQB0AC4AVwBFAEIA* OR *OAGUAdAAuAFcARQBCA* OR *bgBFAHQALgBXAEUAQg* OR *4ARQB0AC4AVwBFAEIA* OR *uAEUAdAAuAFcARQBCA* OR *TgBFAHQALgBXAEUAQg* OR *OAEUAdAAuAFcARQBCA* OR *bgBlAFQALgBXAEUAQg* OR *4AZQBUAC4AVwBFAEIA* OR *uAGUAVAAuAFcARQBCA* OR *TgBlAFQALgBXAEUAQg* OR *OAGUAVAAuAFcARQBCA* OR *bgBFAFQALgBXAEUAQg* OR *4ARQBUAC4AVwBFAEIA* OR *uAEUAVAAuAFcARQBCA*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
