{"description": "Detects a suspicious LSASS process process clone that could be a sign of process dumping activity", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c8da0dfd-4ed0-4b68-962d-13c9c884384e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Suspicious LSASS Process Clone", "query": "(process.executable:*\\\\Windows\\\\System32\\\\lsass.exe AND process.parent.executable:*\\\\Windows\\\\System32\\\\lsass.exe)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://www.matteomalvica.com/blog/2019/12/02/win-defender-atp-cred-bypass/", "https://twitter.com/Hexacorn/status/1420053502554951689", "https://twitter.com/SBousseaden/status/1464566846594691073?s=20"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Samir Bousseaden"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
