{"description": "Detects file execution using the msdeploy.exe lolbin", "enabled": false, "false_positives": ["System administrator Usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "646bc99f-6682-4b47-a73a-17b1b64c9d34", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Execute Files with Msdeploy.exe", "query": "(process.command_line:*verb\\:sync* AND process.command_line:*\\-source\\:RunCommand* AND process.command_line:*\\-dest\\:runCommand* AND process.executable:*\\\\msdeploy.exe)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Msdeploy.yml", "https://twitter.com/pabraeken/status/995837734379032576", "https://twitter.com/pabraeken/status/999090532839313408"], "timestamp_override": "event.ingested", "author": ["Beyu Denis", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
