{"description": "This is an unusual method to download files. It starts a browser headless and downloads a file from a location. This can be used by threat actors to download files.", "author": ["Sreeman", "Florian Roth"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f6416bab-6b68-499a-427f-b04b6b287426", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Download with Headless Browser", "query": "(process.executable.text:(*\\\\msedge.exe OR *\\\\chrome.exe) AND process.command_line.text:*\\-\\-headless* AND process.command_line.text:*dump\\-dom* AND process.command_line.text:*http*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/mrd0x/status/1478234484881436672?s=12"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
