{"description": "Detects the execution of WMIC with the \"csproduct\" which is used to obtain information such as hardware models and vendor information", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3e3ceccd-6c06-48b8-b5ff-ab1d25db8c1d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Hardware Model Reconnaissance Via Wmic.EXE", "query": "(((process.executable.text:\"*\\\\wmic.exe\") OR (winlog.event_data.OriginalFileName:\"wmic.exe\")) AND process.command_line.text:\"*csproduct*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://jonconwayuk.wordpress.com/2014/01/31/wmic-csproduct-using-wmi-to-identify-make-and-model-of-hardware/", "https://www.uptycs.com/blog/kuraystealer-a-bandit-using-discord-webhooks"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
