{"description":"Detects the execution of other scripts using the Node executable packaged with Adobe Creative Cloud Author: Max Altgelt. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"989e4a29-c7bd-be73-6bf1-308694a9f06a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Node Process Executions","query":"(process.executable:*\\\\Adobe\\ Creative\\ Cloud\\ Experience\\\\libs\\\\node.exe AND (NOT (process.command_line:*Adobe\\ Creative\\ Cloud\\ Experience\\\\js*)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1059","T1127"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1127","name":"Trusted Developer Utilities Proxy Execution","reference":"https://attack.mitre.org/techniques/T1127"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
