{"description": "Detects execution of msdt.exe using the \"cab\" flag which could indicates suspicious diagcab files with embedded answer files leveraging CVE-2022-30190", "enabled": false, "false_positives": ["Legitimate usage of \".diagcab\" files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dc4576d4-7467-424f-9eee-fd2b02855fe0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "MSDT.EXE Execution With Suspicious Cab Option", "query": "((process.executable:*\\\\msdt.exe OR winlog.event_data.OriginalFileName:\"msdt.exe\") AND process.command_line:(*\\ \\/cab\\ * OR *\\ \\-cab\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/nas_bench/status/1537896324837781506"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
