{"description": "Detects clearing or configuration of eventlogs using wevtutil, powershell and wmic. Might be used by ransomwares during the attack (seen by NotPetya and others).", "author": ["Ecco", "Daniil Yugoslavskiy", "oscd.community", "D3F7A5105"], "enabled": false, "false_positives": ["Admin activity", "Scripts and administrative tools used in the monitored environment", "Maintenance activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5d092b91-ea20-56e6-4dd7-bbf8178f86de", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Eventlog Clear or Configuration Using Wevtutil", "query": "((((process.executable.text:*\\\\wevtutil.exe AND process.command_line.text:(*clear\\-log\\ * OR *\\ cl\\ * OR *set\\-log\\ * OR *\\ sl\\ * OR *lfn\\:*))) OR ((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND process.command_line.text:(*Clear\\-EventLog\\ * OR *Remove\\-EventLog\\ * OR *Limit\\-EventLog\\ * OR *Clear\\-WinEvent\\ *))) OR ((process.executable.text:*\\\\wmic.exe AND process.command_line.text:*\\ ClearEventLog\\ *))) AND (NOT ((process.parent.executable.text:(\"C:\\Windows\\SysWOW64\\msiexec.exe\" OR \"C:\\Windows\\System32\\msiexec.exe\") AND process.command_line.text:*\\ sl\\ *))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.001/T1070.001.md", "https://eqllib.readthedocs.io/en/latest/analytics/5b223758-07d6-4100-9e11-238cfdd0fe97.html", "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil", "https://gist.github.com/fovtran/ac0624983c7722e80a8f5a4babb170ee", "https://jdhnet.wordpress.com/2017/12/19/changing-the-location-of-the-windows-event-logs/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
