{"description":"This rule detect common flag combinations used by CrackMapExec in order to detect its use even if the binary has been replaced. Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3bade4c3-c4eb-92b7-ae50-8c51e2dd7b37","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CrackMapExec Command Line Flags","query":"((process.command_line:*\\ \\-M\\ pe_inject\\ * OR (process.command_line:*\\ \\-\\-local\\-auth* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-x\\ *) OR (process.command_line:*\\ \\-\\-local\\-auth* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\-H\\ 'NTHASH'*) OR (process.command_line:*\\ mssql\\ * AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\-M\\ * AND process.command_line:*\\ \\-d\\ *) OR (process.command_line:*\\ smb\\ * AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-H\\ * AND process.command_line:*\\ \\-M\\ * AND process.command_line:*\\ \\-o\\ *) OR (process.command_line:*\\ smb\\ * AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\-\\-local\\-auth*)) OR (process.command_line:*\\ \\-\\-local\\-auth* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ 10.* AND process.command_line:*\\ 192.168.* AND process.command_line:*\\/24\\ *))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
