{"description": "Detects suspicious execution of \"PDQDeployRunner\" which is part of the PDQDeploy service stack that is responsible for executing commands and packages on a remote machines", "enabled": false, "false_positives": ["Legitimate use of the PDQDeploy tool to execute these commands"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7ca18dcc-6857-f953-7138-77e2a9c8f64e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Execution Of PDQDeployRunner", "query": "(process.parent.executable:*PDQDeployRunner\\-* AND (process.executable:(*\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\rundll32.exe OR *\\\\regsvr32.exe OR *\\\\wmic.exe OR *\\\\msiexec.exe OR *\\\\mshta.exe OR *\\\\csc.exe OR *\\\\dllhost.exe OR *\\\\certutil.exe OR *\\\\scriptrunner.exe OR *\\\\bash.exe OR *\\\\wsl.exe) OR process.executable:(*C\\:\\\\Users\\\\Public\\\\* OR *C\\:\\\\ProgramData\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\AppData\\\\Local\\\\Temp*) OR process.command_line:(*iex\\ * OR *Invoke\\-* OR *DownloadString* OR *http* OR *\\ \\-enc\\ * OR *\\ \\-encodedcommand\\ * OR *FromBase64String* OR *\\ \\-decode\\ * OR *\\ \\-w\\ hidden*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/malmoeb/status/1550483085472432128"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
