{"description": "Detects execution of Remote Utilities RAT (RURAT) from an unusual location (outside of 'C:\\Program Files')", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e01fa958-6893-41d4-ae03-182477c5e77d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remote Access Tool - RURAT Execution From Unusual Location", "query": "(((process.executable.text:(\"*\\\\rutserv.exe\" OR \"*\\\\rfusclient.exe\")) OR (Product:\"Remote Utilities\")) AND (NOT process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Remote\\ Utilities*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Remote\\ Utilities*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/misbehaving-rats/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
