{"description": "Detects the import of the specified file to the registry with regedit.exe.", "enabled": false, "false_positives": ["Legitimate import of keys", "Evernote"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dfaa230e-b346-6a26-0be6-82671960005c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Imports Registry Key From a File", "query": "((process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/i\\ * OR *\\ \\/s\\ * OR *.reg*)) AND (NOT ((process.command_line:(*\\ \\/e\\ * OR *\\ \\/a\\ * OR *\\ \\/c\\ * OR *\\ \\-e\\ * OR *\\ \\-a\\ * OR *\\ \\-c\\ *)) AND (process.command_line:/:[^ \\\\\\\\]/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Regedit/", "https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f"], "timestamp_override": "event.ingested", "author": ["Oddvar Moe", "Sander Wiebing", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
