{"description": "Detects when a shell program such as the Windows command prompt or PowerShell is launched with system privileges.", "author": ["frack113", "Tim Shelton (update fp)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "178e615d-e666-498b-9630-9ed363038101", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Elevated System Shell", "query": "(event.category:process AND (((process.executable:(/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ww][Ss][Hh]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.OriginalFileName:(/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ OR /[Pp][Ww][Ss][Hh]\\.[Dd][Ll][Ll]/ OR /[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/))) AND (user.name:(*AUTHORI* OR *AUTORI*) AND LogonId:0x3e7)) AND (NOT (((process.parent.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/) AND process.executable:(/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/))) OR ((process.parent.executable:/[Cc]\\:\\\\[Mm][Aa][Nn][Aa][Gg][Ee][Ee][Nn][Gg][Ii][Nn][Ee]\\\\[Aa][Dd][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\ [Pp][Ll][Uu][Ss]\\\\[Pp][Gg][Ss][Qq][Ll]\\\\[Bb][Ii][Nn]\\\\[Pp][Oo][Ss][Tt][Gg][Rr][Ee][Ss]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)) OR ((process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Yy][Ss][Tt][Ee][Mm][Pp][Rr][Oo][Ff][Ii][Ll][Ee]\\\\[Cc][Ii][Tt][Rr][Ii][Xx]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Rr][Bb][Ii][Nn][Aa][Rr][Ii][Ee][Ss]\\\\.*/ AND process.parent.executable:/.*\\\\[Cc][Ii][Tt][Rr][Ii][Xx][Rr][Ee][Cc][Ee][Ii][Vv][Ee][Rr][Uu][Pp][Dd][Aa][Tt][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)) OR ((process.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ \\\".*/ AND process.working_directory:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\[Aa][Ss][Gg][Aa][Rr][Dd]2\\-[Aa][Gg][Ee][Nn][Tt]\\\\.*/)) OR ((process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp].*/ AND process.parent.executable:/.*\\\\[Ii][Nn][Vv][Cc][Oo][Ll]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/.*[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Dd][Ee][Ll][Ll]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\.*/ AND process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/)) OR ((process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Ss][Xx][Ss]\\\\.*/ AND process.parent.executable:/.*\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Tt][Ee][Ll][Rr][Uu][Nn][Nn][Ee][Rr]\\.[Ee][Xx][Ee]\\ \\-[Mm]\\:[Aa][Pp][Pp][Rr][Aa][Ii][Ss][Ee][Rr]\\.[Dd][Ll][Ll]\\ \\-[Ff]\\:[Dd][Oo][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Dd][Tt][Ee][Ll][Ee][Mm][Ee][Tt][Rr][Yy][Rr][Uu][Nn].*/)) OR ((process.parent.executable:/[Cc]\\:\\\\[Ii][Bb][Mm]\\\\[Ss][Pp][Ee][Cc][Tt][Rr][Uu][Mm][Pp][Rr][Oo][Tt][Ee][Cc][Tt]\\\\[Ww][Ee][Bb][Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\.*/ AND process.command_line:/.*[Cc]\\:\\\\[Ii][Bb][Mm]\\\\[Ss][Pp][Ee][Cc][Tt][Rr][Uu][Mm][Pp][Rr][Oo][Tt][Ee][Cc][Tt]\\\\[Ww][Ee][Bb][Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\.*/)) OR ((process.parent.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND process.parent.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]\\ \\-[Ee][Mm][Bb][Ee][Dd][Dd][Ii][Nn][Gg].*/ AND process.command_line:/.*\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Pp][Ss]1.*/)) OR (process.command_line:/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy]\\ [Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ee][Dd]\\ \\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Ww][Rr][Ii][Tt][Ee]\\-[Hh][Oo][Ss][Tt]\\ \\'[Ff][Ii][Nn][Aa][Ll]\\ [Rr][Ee][Ss][Uu][Ll][Tt]\\:\\ 1\\'\\;/) OR ((process.command_line:/[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy]\\ [Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ee][Dd]\\ \\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ \\$[Rr][Ee][Ss]\\ \\=\\ 0\\;.*/ AND process.command_line:/.*[Ww][Rr][Ii][Tt][Ee]\\-[Hh][Oo][Ss][Tt]\\ \\'[Ff][Ii][Nn][Aa][Ll]\\ [Rr][Ee][Ss][Uu][Ll][Tt]\\:\\'\\,\\ \\$[Rr][Ee][Ss]\\;/)) OR ((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Dd]\\ \\/[Cc]\\ [Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ii][Ll][Cc][Oo][Ll][Ll][Ee][Cc][Tt][Oo][Rr]\\.[Cc][Mm][Dd].*/)) OR ((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ [Bb][Tt][Oo][Oo][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Ll][Ii][Ss][Tt]\\ [Rr][Ee][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\_[Pp][Oo][Rr][Tt]\\ \\-\\-[Nn][Oo]\\-[Ll][Oo][Gg]/ OR /.*[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ [Bb][Tt][Oo][Oo][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\ [Ll][Ii][Ss][Tt]\\ [Gg][Ee][Nn][Ee][Rr][Aa][Ll]\\ \\-\\-[Nn][Oo]\\-[Ll][Oo][Gg]/))) OR ((process.executable:/.*\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Gg]\\.[Ee][Xx][Ee]\\ [Qq][Uu][Ee][Rr][Yy]\\ [Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee][Ii][Nn][Vv][Ee][Nn][Tt][Oo][Rr][Yy][Ll][Oo][Gg][Gg][Ii][Nn][Gg]\\ \\/[Vv]\\ [Cc][Oo][Ll][Ll][Ee][Cc][Tt][Ii][Oo][Nn][Ss][Tt][Aa][Tt][Ee]\\ \\/[Rr][Ee][Gg]\\:64.*/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]/ AND process.command_line:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Cc]\\ [Pp][Aa][Uu][Ss][Ee]/)) OR ((process.executable:/.*\\\\[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*[Pp][Oo][Ww][Ee][Rr][Ss][Hh][Ee][Ll][Ll]\\.[Ee][Xx][Ee]\\ \\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy]\\ [Rr][Ee][Ss][Tt][Rr][Ii][Cc][Tt][Ee][Dd]\\ \\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ \\$[Rr][Ee][Ss]\\ \\=\\ 0\\;.*/ AND process.command_line:/.*\\{\\ \\$[Rr][Ee][Ss]\\ \\=\\ 1\\;\\ [Bb][Rr][Ee][Aa][Kk]\\;\\ \\}\\ \\}\\ [Ww][Rr][Ii][Tt][Ee]\\-[Hh][Oo][Ss][Tt]\\ \\'[Ff][Ii][Nn][Aa][Ll]\\ [Rr][Ee][Ss][Uu][Ll][Tt]\\:\\'\\,\\ \\$[Rr][Ee][Ss]\\;/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://github.com/Wh04m1001/SysmonEoP"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
