{"description": "Detects when a program changes the default file association of any extension to an executable.\nWhen a file is opened, the default program used to open the file (also called the file association or handler) is checked. File association selections are stored in the Windows Registry and can be edited by users, administrators, or programs that have Registry access or by administrators using the built-in assoc utility. Applications can modify the file association for a given file extension to call an arbitrary program when a file with the given extension is opened.\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ae6f14e6-14de-45b0-9f44-c0986f50dc89", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Change Default File Association To Executable Via Assoc", "query": "((((process.executable.text:\"*\\\\cmd.exe\") OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND (process.command_line.text:\"*assoc\\ *\" AND process.command_line.text:\"*exefile*\")) AND (NOT process.command_line.text:\"*.exe\\=exefile*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/assoc"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
