{"description": "Identifies creation of local users via the net.exe command.", "enabled": false, "false_positives": ["Legitimate user creation.", "Better use event IDs for user creation rather than command line rules."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd219ff3-fa99-45d4-8380-a7d15116c6dc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Net.exe User Account Creation", "query": "(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:*user* AND process.command_line:*add*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://eqllib.readthedocs.io/en/latest/analytics/014c3f51-89c6-40f1-ac9c-5688f26090ab.html", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1136.001/T1136.001.md"], "timestamp_override": "event.ingested", "author": ["Endgame", "JHasenbusch (adapted to Sigma for oscd.community)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
