{"description": "Detects usage of the copy builtin cmd command to copy files with the \".dmp\"/\".dump\" extension from a remote share", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "044ba588-dff4-4918-9808-3f95e8160606", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Copy .DMP/.DUMP Files From Remote Share Via Cmd.EXE", "query": "(((process.executable.text:\"*\\\\cmd.exe\") OR (winlog.event_data.OriginalFileName:\"Cmd.Exe\")) AND (process.command_line.text:\"*copy\\ *\" AND process.command_line.text:\"*\\ \\\\\\\\*\" AND process.command_line.text:(\"*.dmp*\" OR \"*.dump*\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://thedfirreport.com/2022/09/26/bumblebee-round-two/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
