{"description": "Detects the use of \"DumpMinitool.exe\" a tool that allows the dump of process memory via the use of the \"MiniDumpWriteDump\"", "author": ["Nasreddine Bencherchali (Nextron Systems)", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "dee0a7a3-f200-4112-a99b-952196d81e42", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DumpMinitool Execution", "query": "(((process.executable.text:(\"*\\\\DumpMinitool.exe\" OR \"*\\\\DumpMinitool.x86.exe\" OR \"*\\\\DumpMinitool.arm64.exe\")) OR (winlog.event_data.OriginalFileName:(\"DumpMinitool.exe\" OR \"DumpMinitool.x86.exe\" OR \"DumpMinitool.arm64.exe\"))) AND process.command_line.text:(\"*\\ Full*\" OR \"*\\ Mini*\" OR \"*\\ WithHeap*\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1003", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://twitter.com/mrd0x/status/1511415432888131586", "https://twitter.com/mrd0x/status/1511489821247684615", "https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/", "https://gist.github.com/nasbench/6d58c3c125e2fa1b8f7a09754c1b087f"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
