{"description": "Detects suspicious scheduled task creations from a parent stored in a temporary folder", "enabled": false, "false_positives": ["Software installers that run from temporary folders and also install scheduled tasks"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9494479d-d994-40bf-a8b1-eea890237021", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Add Scheduled Task Parent", "query": "((process.executable:*schtasks.exe AND process.command_line:*\\/Create\\ * AND process.parent.executable:(*\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\Roaming\\\\* OR *\\\\Temporary\\ Internet* OR *\\\\Users\\\\Public\\\\*)) AND (NOT ((process.command_line:(*update_task.xml* OR *unattended.ini*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://app.any.run/tasks/649e7b46-9bec-4d05-98a5-dfa9a13eaae5/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
