{"description": "Detects potentially suspicious child processes of \"GoogleUpdate.exe\"", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "84b1ecf9-6eff-4004-bafb-bae5c0e251b2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious GoogleUpdate Child Process", "query": "(process.parent.executable.text:\"*\\\\GoogleUpdate.exe\" AND (NOT ((((process.executable.text:\"*\\\\Google*\") OR (process.executable.text:(\"*\\\\setup.exe\" OR \"*chrome_updater.exe\" OR \"*chrome_installer.exe\")))) OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/goofy-guineapig/NCSC-MAR-Goofy-Guineapig.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
