{"description": "Detects the use of Tor or Tor-Browser to connect to onion routing networks", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tor Client/Browser Execution", "query": "process.executable.text:(\"*\\\\tor.exe\" OR \"*\\\\Tor\\ Browser\\\\Browser\\\\firefox.exe\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1090"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
