{"description": "Detects deinstallation of security products using WMIC utility", "enabled": false, "false_positives": ["Legitimate administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "847d5ff3-8a31-4737-a970-aeae8fe21765", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Wmic Uninstall Security Product", "query": "(process.command_line:*wmic* AND process.command_line:*product\\ where\\ * AND process.command_line:*call\\ uninstall* AND process.command_line:*\\/nointeractive* AND process.command_line:(*\\ name\\=* OR *caption\\ like\\ *) AND process.command_line:(*Antivirus* OR *AVG\\ * OR *Crowdstrike\\ Sensor* OR *DLP\\ Endpoint* OR *Endpoint\\ Detection* OR *Endpoint\\ Protection* OR *Endpoint\\ Security* OR *Endpoint\\ Sensor* OR *ESET\\ File\\ Security* OR *Malwarebytes* OR *McAfee\\ Agent* OR *Microsoft\\ Security\\ Client* OR *Threat\\ Protection* OR *VirusScan* OR *Webroot\\ SecureAnywhere* OR *Windows\\ Defender* OR *CarbonBlack* OR *Carbon\\ Black* OR *Cb\\ Defense\\ Sensor\\ 64\\-bit* OR *Dell\\ Threat\\ Defense* OR *Cylance\\ * OR *LogRhythm\\ System\\ Monitor\\ Service*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/cglyer/status/1355171195654709249", "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
