{"description":"Detects suspicious ways to download files or content using PowerShell Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Scripts or tools that download files and execute them"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e3006e73-c508-efb5-a3b3-713c35a2c727","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"PowerShell Web Download and Execution","query":"(process.command_line:(*.DownloadString\\(* OR *.DownloadFile\\(*) AND process.command_line:(*IEX\\(* OR *IEX\\ \\(* OR *I`EX* OR *IE`X* OR *I`E`X* OR *\\ |\\ IEX* OR *|IEX\\ * OR *Invoke\\-Execution* OR *;iex\\ $*))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
