{"description": "Detects execution of \"Diskshadow.exe\" in script mode to execute an script with a potentially uncommon extension.\nInitial baselining of the allowed extension list is required.\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False postitve might occur with legitimate or uncommon extensions used internally. Initial baseline is required."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1dde5376-a648-492e-9e54-4241dd9b0c7f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Diskshadow Script Mode - Uncommon Script Extension Execution", "query": "(event.category:process AND (((winlog.event_data.OriginalFileName:/[Dd][Ii][Ss][Kk][Ss][Hh][Aa][Dd][Oo][Ww]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Dd][Ii][Ss][Kk][Ss][Hh][Aa][Dd][Oo][Ww]\\.[Ee][Xx][Ee]/)) AND process.command_line:(/.*\\/[Ss]\\ .*/ OR /.*\\-[Ss]\\ .*/)) AND (NOT process.command_line:/.*\\.[Tt][Xx][Tt].*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1218"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/", "https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration", "https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4", "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow", "https://www.lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf", "https://www.zscaler.com/blogs/security-research/technical-analysis-crytox-ransomware", "https://research.checkpoint.com/2022/evilplayout-attack-against-irans-state-broadcaster/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
