{"description": "Detects the usage and installation of a backdoor that uses an option to register a malicious debugger for built-in tools that are accessible in the login screen", "author": ["Florian Roth (Nextron Systems)", "@twjackomo", "Jonhnathan Ribeiro", "oscd.community"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2fdefcb3-dbda-401e-ae23-f0db027628bc", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Sticky Key Like Backdoor Execution", "query": "(process.parent.executable.text:\"*\\\\winlogon.exe\" AND process.executable.text:(\"*\\\\cmd.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\regsvr32.exe\" OR \"*\\\\rundll32.exe\" OR \"*\\\\wscript.exe\" OR \"*\\\\wt.exe\") AND process.command_line.text:(\"*sethc.exe*\" OR \"*utilman.exe*\" OR \"*osk.exe*\" OR \"*Magnify.exe*\" OR \"*Narrator.exe*\" OR \"*DisplaySwitch.exe*\"))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/archive/blogs/jonathantrull/detecting-sticky-key-backdoors"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
