{"description": "Detects the execution of a AdFind for enumeration based on it's commadline flags", "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "455b9d50-15a1-4b99-853f-8d37655a4c1b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious AdFind Enumeration", "query": "(process.command_line.text:(*lockoutduration* OR *lockoutthreshold* OR *lockoutobservationwindow* OR *maxpwdage* OR *minpwdage* OR *minpwdlength* OR *pwdhistorylength* OR *pwdproperties*) OR process.command_line.text:*\\-sc\\ admincountdmp* OR process.command_line.text:*\\-sc\\ exchaddresses*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1087"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1087", "name": "Account Discovery", "reference": "https://attack.mitre.org/techniques/T1087"}]}], "version": 1, "references": ["https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.002/T1087.002.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
