{"description": "Detects Schtask creations that point to a suspicious folder or an environment variable often used by malware", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Benign scheduled tasks creations or executions that happen often during software installations", "Software that uses the AppData folder and scheduled tasks to update the software in the AppData folders"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "81325ce1-be01-4250-944f-b4789644556f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Schtasks From Env Var Folder", "query": "((((process.executable.text:\"*\\\\schtasks.exe\" AND process.command_line.text:\"*\\ \\/create\\ *\" AND process.command_line.text:(\"*%AppData%*\" OR \"*\\\\AppData\\\\Local\\\\*\" OR \"*\\\\AppData\\\\Roaming\\\\*\" OR \"*%Public%*\" OR \"*\\\\Users\\\\Public*\" OR \"*C\\:\\\\Windows\\\\Temp*\" OR \"*C\\:\\\\Perflogs*\"))) OR ((process.parent.command_line.text:\"*\\\\svchost.exe\\ \\-k\\ netsvcs\\ \\-p\\ \\-s\\ Schedule\" AND process.command_line.text:(\"*%Public%*\" OR \"*\\\\Users\\\\Public*\" OR \"*C\\:\\\\Windows\\\\Temp*\" OR \"*C\\:\\\\Perflogs*\")))) AND (NOT ((((process.command_line.text:(\"*update_task.xml*\" OR \"*\\/Create\\ \\/TN\\ TVInstallRestore\\ \\/TR*\")) OR (process.parent.command_line.text:\"*unattended.ini*\"))) OR (process.command_line.text:\"*\\/Create\\ \\/Xml\\ \\\"C\\:\\\\Users\\\\*\" AND process.command_line.text:\"*\\\\AppData\\\\Local\\\\Temp\\\\.CR.*\" AND process.command_line.text:\"*Avira_Security_Installation.xml*\") OR ((process.command_line.text:\"*\\/Create\\ \\/F\\ \\/TN*\" AND process.command_line.text:\"*\\/Xml\\ *\" AND process.command_line.text:\"*\\\\AppData\\\\Local\\\\Temp\\\\is\\-*\" AND process.command_line.text:\"*Avira_*\" AND process.command_line.text:(\"*.tmp\\\\UpdateFallbackTask.xml*\" OR \"*.tmp\\\\WatchdogServiceControlManagerTimeout.xml*\" OR \"*.tmp\\\\SystrayAutostart.xml*\" OR \"*.tmp\\\\MaintenanceTask.xml*\"))) OR (process.command_line.text:\"*\\\\AppData\\\\Local\\\\Temp\\\\*\" AND process.command_line.text:\"*\\/Create\\ \\/TN\\ \\\"klcp_update\\\"\\ \\/XML\\ *\" AND process.command_line.text:\"*\\\\klcp_update_task.xml*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/", "https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
