{"description": "Detects a suspicious execution from an uncommon folder", "author": ["Florian Roth", "Tim Shelton"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3dfd06d2-eaf4-4532-9555-68aca59f57c4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution from Suspicious Folder", "query": "(((process.executable.text:(*\\\\$Recycle.bin\\\\* OR *\\\\config\\\\systemprofile\\\\* OR *\\\\Intel\\\\Logs\\\\* OR *\\\\RSA\\\\MachineKeys\\\\* OR *\\\\Users\\\\All\\ Users\\\\* OR *\\\\Users\\\\Default\\\\* OR *\\\\Users\\\\NetworkService\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\addins\\\\* OR *\\\\Windows\\\\debug\\\\* OR *\\\\Windows\\\\Fonts\\\\* OR *\\\\Windows\\\\Help\\\\* OR *\\\\Windows\\\\IME\\\\* OR *\\\\Windows\\\\Media\\\\* OR *\\\\Windows\\\\repair\\\\* OR *\\\\Windows\\\\security\\\\* OR *\\\\Windows\\\\System32\\\\Tasks\\\\* OR *\\\\Windows\\\\Tasks\\\\*)) OR (process.executable.text:C\\:\\\\Perflogs\\\\*)) AND (NOT ((process.executable.text:C\\:\\\\Users\\\\Public\\\\IBM\\\\ClientSolutions\\\\Start_Programs\\\\*) OR ((process.executable.text:C\\:\\\\Windows\\\\SysWOW64\\\\config\\\\systemprofile\\\\Citrix\\\\UpdaterBinaries\\\\* AND process.executable.text:*\\\\CitrixReceiverUpdater.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://github.com/mbevilacqua/appcompatprocessor/blob/6c847937c5a836e2ce2fe2b915f213c345a3c389/AppCompatSearch.txt", "https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses", "https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/", "https://github.com/ThreatHuntingProject/ThreatHunting/blob/cb22598bb70651f88e0285abc8d835757d2cb596/hunts/suspicious_process_creation_via_windows_event_logs.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
