{"description": "Detects a suspicious execution of a Microsoft HTML Help (HH.exe)", "author": ["Maxim Pavlunin"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e8a95b5e-c891-46e2-b33a-93937d3abc31", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious HH.EXE Execution", "query": "(((winlog.event_data.OriginalFileName:\"HH.exe\") OR (process.executable.text:\"*\\\\hh.exe\")) AND process.command_line.text:(\"*.application*\" OR \"*\\\\AppData\\\\Local\\\\Temp\\\\*\" OR \"*\\\\Content.Outlook\\\\*\" OR \"*\\\\Downloads\\\\*\" OR \"*\\\\Users\\\\Public\\\\*\" OR \"*\\\\Windows\\\\Temp\\\\*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Initial Access", "T1047", "T1059", "T1059", "T1059", "T1059", "T1218", "T1218", "T1218", "T1218", "T1566", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}, {"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}, {"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/", "https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-27939090904026cc396b0b629c8e4314acd6f5dac40a676edbc87f4567b47eb7", "https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/", "https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
