{"description": "Detects audio capture via PowerShell Cmdlet.", "enabled": false, "false_positives": ["Legitimate audio capture by legitimate user."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6a4911ff-5dc7-90ab-7413-1b7fbc74fcd6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Audio Capture via PowerShell", "query": "process.command_line:*WindowsAudioDevice\\-Powershell\\-Cmdlet*", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1123"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1123", "name": "Audio Capture", "reference": "https://attack.mitre.org/techniques/T1123"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1123/T1123.md", "https://eqllib.readthedocs.io/en/latest/analytics/ab7a6ef4-0983-4275-a4f1-5c6bd3c31c23.html"], "timestamp_override": "event.ingested", "author": ["E.M. Anhaus (originally from Atomic Blue Detections", "Endgame)", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
