{"description": "Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files. Rule detects when adversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses.", "author": ["Timur Zinniatullin", "oscd.community", "Swachchhanda Shrawan Poudel"], "enabled": false, "false_positives": ["WMIC.exe FP depend on scripts and administrative methods used in the monitored environment.", "Msxsl.exe is not installed by default, so unlikely.", "Static format arguments - https://petri.com/command-line-wmi-part-3"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "05c36dd6-79d6-4a9a-97da-3db20298ab2d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "XSL Script Processing", "query": "((((process.executable.text:\"*\\\\wmic.exe\" AND process.command_line.text:(\"*\\/format*\" OR \"*\\-format*\")) AND (NOT process.command_line.text:(\"*Format\\:List*\" OR \"*Format\\:htable*\" OR \"*Format\\:hform*\" OR \"*Format\\:table*\" OR \"*Format\\:mof*\" OR \"*Format\\:value*\" OR \"*Format\\:rawxml*\" OR \"*Format\\:xml*\" OR \"*Format\\:csv*\")))) OR (process.executable.text:\"*\\\\msxsl.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1220"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1220", "name": "XSL Script Processing", "reference": "https://attack.mitre.org/techniques/T1220"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
