{"description": "Detects usage of a CLSID folder name located in a suspicious location from the commandline as seen being used in IcedID", "enabled": false, "false_positives": ["Some FP is expected with some installers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7a050ee0-54eb-2d9c-0f2e-7a3476aa8919", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious CLSID Folder Name In Suspicious Locations", "query": "((process.command_line.text:(*\\\\AppData\\\\Roaming\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\*) AND process.command_line.text:*\\\\\\{* AND process.command_line.text:*\\}\\\\*) AND (NOT ((process.executable.text:*\\\\\\{* AND process.executable.text:*\\}\\\\*) OR (NOT _exists_:process.executable.text))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://twitter.com/Kostastsale/status/1565257924204986369"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
