{"description": "Detects potential RDP connection via Mstsc using a local \".rdp\" file", "author": ["Nasreddine Bencherchali (Nextron Systems)", "Christopher Peacock @securepeacock"], "enabled": false, "false_positives": ["Likely with legitimate usage of \".rdp\" files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Mstsc.EXE Execution With Local RDP File", "query": "((((process.executable.text:\"*\\\\mstsc.exe\") OR (winlog.event_data.OriginalFileName:\"mstsc.exe\")) AND process.command_line.text:(\"*.rdp\" OR \"*.rdp\\\"\")) AND (NOT (process.parent.executable.text:\"C:\\Windows\\System32\\lxss\\wslhost.exe\" AND process.command_line.text:\"*C\\:\\\\ProgramData\\\\Microsoft\\\\WSL\\\\wslg.rdp*\")))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/", "https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
