{"description": "Detects the use of NirCmd tool for command execution, which could be the result of legitimate administrative activity", "enabled": false, "false_positives": ["Legitimate use by administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4e2ed651-1906-4a59-a78a-18220fca1b22", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "NirCmd Tool Execution", "query": "((winlog.event_data.OriginalFileName:\"NirCmd.exe\" OR process.command_line:(*\\ execmd\\ * OR *.exe\\ script\\ * OR *.exe\\ shexec\\ * OR *\\ runinteractive\\ *)) OR (process.command_line:(*\\ exec\\ * OR *\\ exec2\\ *) AND process.command_line:(*\\ show\\ * OR *\\ hide\\ *)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://www.nirsoft.net/utils/nircmd.html", "https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/", "https://www.nirsoft.net/utils/nircmd2.html#using"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Nasreddine Bencherchali @nas_bench"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
