{"description": "Detects suspicious Windows Error Reporting manager (wermgr.exe) process patterns - suspicious parents / children, execution folders, command lines etc.", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5ea24eb8-aad8-4ea9-d1de-da4f6fb17d07", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious WERMGR Process Patterns", "query": "(((process.executable.text:*\\\\wermgr.exe AND (NOT (process.executable.text:(*C\\:\\\\Windows\\\\System32\\\\* OR *C\\:\\\\Windows\\\\SysWOW64\\\\*))))) OR ((process.parent.executable.text:*\\\\wermgr.exe AND process.executable.text:(*\\\\nslookup.exe OR *\\\\ipconfig.exe OR *\\\\net.exe OR *\\\\net1.exe OR *\\\\whoami.exe OR *\\\\netstat.exe OR *\\\\systeminfo.exe OR *\\\\cmd.exe OR *\\\\powershell.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html", "https://www.echotrail.io/insights/search/wermgr.exe"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
