{"description": "Detects EmpireMonkey APT reported Activity", "enabled": false, "false_positives": ["Very Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "10975088-2153-b58c-3768-78a1e7945a4a", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Empire Monkey", "query": "(process.command_line:*\\/i\\:%APPDATA%\\\\logs.txt\\ scrobj.dll AND (process.executable:*\\\\cutil.exe OR winlog.event_data.Description:\"Microsoft\\(C\\)\\ Registerserver\"))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://app.any.run/tasks/a4107649-8cb0-41af-ad75-113152d4d57b"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
