{"description": "Detects dropping of dll files in system32 that may be used to retrieve user credentials from LSASS", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d253c572-37df-e44d-8f3d-82da44318362", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Dropping Of Password Filter DLL", "query": "(process.command_line.text:*HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Lsa* AND process.command_line.text:*scecli\\\\0\\** AND process.command_line.text:*reg\\ add*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1556"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1556", "name": "Modify Authentication Process", "reference": "https://attack.mitre.org/techniques/T1556"}]}], "version": 1, "references": ["https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/", "https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter"], "timestamp_override": "event.ingested", "author": ["Sreeman"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
