{"description": "Detects potentially uncommon child processes of SndVol.exe (the Windows volume mixer)", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ba42babc-0666-4393-a4f7-ceaf5a69191e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Uncommon Child Processes Of SndVol.exe", "query": "(process.parent.executable.text:\"*\\\\SndVol.exe\" AND (NOT (process.executable.text:\"*\\\\rundll32.exe\" AND process.command_line.text:\"*\\ shell32.dll,Control_RunDLL\\ *\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Max_Mal_/status/1661322732456353792"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
