{"description": "Detects the removal of a port or application rule in the Windows Firewall configuration using netsh", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate administration activity", "Software installations and removal"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1a5fefe6-734f-452e-a07d-fc1c35bce4b2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Firewall Rule Deleted Via Netsh.EXE", "query": "((((process.executable.text:\"*\\\\netsh.exe\") OR (winlog.event_data.OriginalFileName:\"netsh.exe\")) AND (process.command_line.text:\"*firewall*\" AND process.command_line.text:\"*delete\\ *\")) AND (NOT (process.parent.executable.text:\"*\\\\Dropbox.exe\" AND process.command_line.text:\"*name\\=Dropbox*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://app.any.run/tasks/8bbd5b4c-b82d-4e6d-a3ea-d454594a37cc/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
