{"description": "Detects the usage of attrib with the \"+s\" option to set scripts or executables located in suspicious locations as system files to hide them from users and make them unable to be deleted with simple rights. The rule limits the search to specific extensions and directories to avoid FPs\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "efec536f-72e8-4656-8960-5e85d091345b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Set Suspicious Files as System Files Using Attrib.EXE", "query": "((((process.executable.text:\"*\\\\attrib.exe\") OR (winlog.event_data.OriginalFileName:\"ATTRIB.EXE\")) AND process.command_line.text:\"*\\ \\+s*\" AND process.command_line.text:(\"*\\ %*\" OR \"*\\\\Users\\\\Public\\\\*\" OR \"*\\\\AppData\\\\Local\\\\*\" OR \"*\\\\ProgramData\\\\*\" OR \"*\\\\Downloads\\\\*\" OR \"*\\\\Windows\\\\Temp\\\\*\") AND process.command_line.text:(\"*.bat*\" OR \"*.dll*\" OR \"*.exe*\" OR \"*.hta*\" OR \"*.ps1*\" OR \"*.vbe*\" OR \"*.vbs*\")) AND (NOT process.command_line.text:\"*\\\\Windows\\\\TEMP\\\\*\" AND process.command_line.text:\"*.exe*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4", "https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0", "https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
