{"description": "Detects command line parameters used by ADCSPwn, a tool to escalate privileges in an active directory network by coercing authenticate from machine accounts and relaying to the certificate service", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd8c163e-a19b-402e-bdd5-419ff5859f12", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "ADCSPwn Hack Tool", "query": "(process.command_line:*\\ \\-\\-adcs\\ * AND process.command_line:*\\ \\-\\-port\\ *)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1557"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1557", "name": "Man-in-the-Middle", "reference": "https://attack.mitre.org/techniques/T1557"}]}], "version": 1, "references": ["https://github.com/bats3c/ADCSPwn"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
