{"description": "Detects creation of local users via the net.exe command with the option \"never expire\"", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b9f0e6f5-09b4-4358-bae4-08408705bd5c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New User Created Via Net.EXE With Never Expire Option", "query": "(((process.executable.text:(\"*\\\\net.exe\" OR \"*\\\\net1.exe\")) OR (winlog.event_data.OriginalFileName:(\"net.exe\" OR \"net1.exe\"))) AND (process.command_line.text:\"*user*\" AND process.command_line.text:\"*add*\" AND process.command_line.text:\"*expires\\:never*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
