{"description": "Detects the creation or update of a scheduled task to run with \"NT AUTHORITY\\SYSTEM\" privileges", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "89ca78fd-b37c-4310-b3d3-81a023f83936", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Schtasks Creation Or Modification With SYSTEM Privileges", "query": "(event.category:process AND (process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:(/.*\\ \\/[Cc][Hh][Aa][Nn][Gg][Ee]\\ .*/ OR /.*\\ \\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ .*/) AND process.command_line:/.*\\/[Rr][Uu]\\ .*/ AND process.command_line:(/.*[Nn][Tt]\\ [Aa][Uu][Tt].*/ OR /.*\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ .*/)) AND (NOT (((process.executable:/.*\\\\[Ss][Cc][Hh][Tt][Aa][Ss][Kk][Ss]\\.[Ee][Xx][Ee]/ AND process.command_line:/.*\\/[Tt][Nn]\\ [Tt][Vv][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Rr][Ee][Ss][Tt][Oo][Rr][Ee].*/ AND process.command_line:/.*\\\\[Tt][Ee][Aa][Mm][Vv][Ii][Ee][Ww][Ee][Rr]\\_\\.[Ee][Xx][Ee].*/)) OR (process.command_line:(/.*\\/[Cc][Rr][Ee][Aa][Tt][Ee]\\ \\/[Ff]\\ \\/[Rr][Uu]\\ [Ss][Yy][Ss][Tt][Ee][Mm]\\ \\/[Ss][Cc]\\ [Ww][Ee][Ee][Kk][Ll][Yy]\\ \\/[Tt][Nn]\\ [Aa][Vv][Ii][Rr][Aa][Ss][Yy][Ss][Tt][Ee][Mm][Ss][Pp][Ee][Ee][Dd][Uu][Pp][Vv][Ee][Rr][Ii][Ff][Yy]\\ \\/[Tt][Rr]\\ .*/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Vv][Ii][Rr][Aa]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\ [Ss][Pp][Ee][Ee][Dd][Uu][Pp]\\\\[Ss][Ee][Tt][Uu][Pp]\\\\[Aa][Vv][Ii][Rr][Aa]\\_[Ss][Pp][Ee][Ee][Dd][Uu][Pp]\\_[Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee].*/ OR /.*\\/[Vv][Ee][Rr][Ii][Ff][Yy]\\ \\/[Vv][Ee][Rr][Yy][Ss][Ii][Ll][Ee][Nn][Tt]\\ \\/[Nn][Oo][Ss][Tt][Aa][Rr][Tt]\\ \\/[Nn][Oo][Dd][Oo][Tt][Nn][Ee][Tt]\\ \\/[Nn][Oo][Rr][Ee][Ss][Tt][Aa][Rr][Tt]\\\"\\ \\/[Rr][Ll]\\ [Hh][Ii][Gg][Hh][Ee][Ss][Tt].*/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
