{"description":"Detects the use of a Visual Studio bundled tool named DumpMinitool.exe Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"dee0a7a3-f200-4112-a99b-952196d81e42","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"DumpMinitool Usage","query":"(process.executable:*\\\\DumpMinitool.exe OR OriginalName:\"DumpMinitool.exe\" OR (process.command_line:*\\ \\-\\-processId\\ * AND process.command_line:*\\ \\-\\-dumpType\\ Full*))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1003","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
