{"description": "Detects successful code compilation via Visual Basic Command Line Compiler that utilizes Windows Resource to Object Converter.", "enabled": false, "false_positives": ["Utilization of this tool should not be seen in enterprise environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "23da0d68-8642-1df8-71eb-c1accdd486f6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Visual Basic Command Line Compiler Usage", "query": "(process.parent.executable:*\\\\vbc.exe AND process.executable:*\\\\cvtres.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Vbc/"], "timestamp_override": "event.ingested", "author": ["Ensar \u015eamil", "@sblmsrsn", "@oscd_initiative"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
