{"description": "Detects non-interactive PowerShell activity by looking at powershell.exe with not explorer.exe as a parent.", "enabled": false, "false_positives": ["Legitimate programs executing PowerShell scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a94ba2e5-d6d5-e062-13e4-f77fbebc7768", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Non Interactive PowerShell", "query": "(process.executable.text:*\\\\powershell.exe AND (NOT (process.parent.executable.text:(*\\\\explorer.exe OR *\\\\CompatTelRunner.exe))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g (rule)", "oscd.community (improvements)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
