{"description": "Detects the execution of regini.exe which can be used to modify registry keys, the changes are imported from one or more text files.", "enabled": false, "false_positives": ["Legitimate modification of keys"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d07094e5-fa67-7a6c-1558-34c62641104f", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Modifies the Registry From a File", "query": "(process.executable:*\\\\regini.exe AND (NOT (process.command_line:/:[^ \\\\\\\\]/)))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regini.yml", "https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f", "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini"], "timestamp_override": "event.ingested", "author": ["Eli Salem", "Sander Wiebing", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
