{"description":"This rule looks for Windows Installer service (msiexec.exe) spawned command line and/or powershell Author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Penetration test"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1e53dd56-8d83-4eb4-a43e-b790a05510aa","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Always Install Elevated MSI Spawned Cmd And Powershell","query":"(process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe) AND process.parent.executable:*\\\\Windows\\\\Installer\\\\* AND process.parent.executable:*msi* AND process.parent.executable:*tmp)","meta":{"from":"1m"},"severity":"medium","tags":["Privilege Escalation","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
