{"description":"A General detection for sdclt spawning new processes. This could be an indicator of sdclt being used for bypass UAC techniques. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6fdff597-19e4-3ab4-94a3-4c0c3ebccea9","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Sdclt Child Processes","query":"process.parent.executable:*\\\\sdclt.exe","meta":{"from":"1m"},"severity":"medium","tags":["Privilege Escalation","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
