{"description":"Adversaries can use the inbuilt expand utility to decompress cab files as seen in recent Iranian MeteorExpress attack Author: Bhabesh Raj. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["System administrator Usage"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"29214a41-02eb-4068-26f6-8f882b744b23","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Cabinet File Expansion","query":"(process.executable:*\\\\expand.exe AND process.command_line:(*.cab* OR *\\/F\\:* OR *\\-F\\:* OR *C\\:\\\\ProgramData\\\\* OR *C\\:\\\\Public\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\AppData\\\\Roaming\\\\Temp\\\\*))","meta":{"from":"1m"},"severity":"medium","tags":["T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
