{"description":"Detects suspicious Plink tunnel remote forarding to a local port Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative activity using a remote port forwarding to a local port"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"93510b8a-ff35-6197-3189-7e72ce8da7de","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Plink Remote Forwarding","query":"(winlog.event_data.Description:\"Command\\-line\\ SSH,\\ Telnet,\\ and\\ Rlogin\\ client\" AND process.command_line:*\\ \\-R\\ *)","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","T1021","T1572"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
