{"description":"Detects creation or execution of UserInitMprLogonScript persistence method Author: Tom Ueltschi (@c_APT_ure). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["exclude legitimate logon scripts","penetration tests, red teaming"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"0a98a10c-685d-4ab0-bddc-b6bdd1d48458","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Logon Scripts (UserInitMprLogonScript)","query":"(((process.parent.executable:*\\\\userinit.exe AND (NOT (process.executable:*\\\\explorer.exe))) AND (NOT (process.command_line:(*netlogon*.bat* OR *UsrLogon.cmd*)))) OR process.command_line:*UserInitMprLogonScript*)","meta":{"from":"1m"},"severity":"high","tags":["T1037"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1037","name":"Boot or Logon Initialization Scripts","reference":"https://attack.mitre.org/techniques/T1037"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
