{"description":"Threat actors can use the PsLogList utility to dump event log in order to extract admin accounts and perform account discovery. Author: Nasreddine Bencherchali @nas_bench. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Another tool that uses the command line switches of PsLogList","Legitimate use of PsLogList by an administrator"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"aae1243f-d8af-40d8-ab20-33fc6d0c55bc","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Use of PsLogList","query":"((winlog.event_data.OriginalFileName:*psloglist* OR process.executable:(*\\\\psloglist.exe OR *\\\\psloglist64.exe)) OR (process.command_line:(*\\-d* OR *\\/d* OR *\\-x* OR *\\/x* OR *\\-s* OR *\\/s*) AND process.command_line:*security* AND process.command_line:*accepteula*))","meta":{"from":"1m"},"severity":"medium","tags":["T1087","T1087","T1087"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
