{"description":"Detects Request to amsiInitFailed that can be used to disable AMSI Scanning Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Potential Admin Activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"87bad272-2e63-5890-3768-96043fbe7c45","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Powershell AMSI Bypass via .NET Reflection","query":"(process.command_line:*System.Management.Automation.AmsiUtils* AND process.command_line:*amsiInitFailed*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
