{"description":"Detects the execution of a renamed PowerShell often used by attackers or malware Author: Florian Roth, frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d178a2d7-129a-4ba4-8ee6-d6e1fecd5d20","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Renamed PowerShell","query":"((winlog.event_data.Description:(Windows\\ PowerShell* OR pwsh*) AND Company:\"Microsoft\\ Corporation\") AND (NOT (process.executable:(*\\\\powershell.exe OR *\\\\powershell_ise.exe OR *\\\\pwsh.exe))))","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
