{"description":"Detects actions that clear the local ShimCache and remove forensic evidence Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e260e543-7e04-a386-ab4d-950944c3914f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"ShimCache Flush","query":"(process.command_line:*rundll32* AND ((process.command_line:*apphelp.dll* AND process.command_line:(*ShimFlushCache* OR *#250*)) OR (process.command_line:*kernel32.dll* AND process.command_line:(*BaseFlushAppcompatCache* OR *#46*))))","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
