{"description":"Detects suspicious command line activity on Windows systems Author: Florian Roth, omkar72. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Inventory tool runs","Penetration tests","Administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d95de845-b83c-4a9a-8a6a-4fc802ebf6c0","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Reconnaissance Activity","query":"process.command_line:(\"net\\ group\\ \\\"domain\\ admins\\\"\\ \\/dom\" OR \"net\\ localgroup\\ administrators\" OR \"net\\ group\\ \\\"enterprise\\ admins\\\"\\ \\/dom\" OR \"net\\ accounts\\ \\/dom\")","meta":{"from":"1m"},"severity":"medium","tags":["T1087","T1087"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
