{"description":"Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["pentest"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"b2317cfa-4a47-4ead-b3ff-297438c0bc2d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Execution of SharpView Aka PowerView","query":"(winlog.event_data.OriginalFileName:\"SharpView.exe\" OR process.command_line:(*Get\\-DomainGPOUserLocalGroupMapping* OR *Find\\-GPOLocation* OR *Get\\-DomainGPOComputerLocalGroupMapping* OR *Find\\-GPOComputerAdmin* OR *Get\\-DomainObjectAcl* OR *Get\\-ObjectAcl* OR *Add\\-DomainObjectAcl* OR *Add\\-ObjectAcl* OR *Remove\\-DomainObjectAcl* OR *Get\\-RegLoggedOn* OR *Get\\-LoggedOnLocal* OR *Get\\-NetRDPSession* OR *Test\\-AdminAccess* OR *Invoke\\-CheckLocalAdminAccess* OR *Get\\-WMIProcess* OR *Get\\-NetProcess* OR *Get\\-WMIRegProxy* OR *Get\\-Proxy* OR *Get\\-WMIRegLastLoggedOn* OR *Get\\-LastLoggedOn* OR *Get\\-WMIRegCachedRDPConnection* OR *Get\\-CachedRDPConnection* OR *Get\\-WMIRegMountedDrive* OR *Get\\-RegistryMountedDrive* OR *Find\\-InterestingDomainAcl* OR *Invoke\\-ACLScanner* OR *Get\\-NetShare* OR *Get\\-NetLoggedon* OR *Get\\-NetLocalGroup* OR *Get\\-NetLocalGroupMember* OR *Get\\-NetSession* OR *Get\\-PathAcl* OR *ConvertFrom\\-UACValue* OR *Get\\-PrincipalContext* OR *New\\-DomainGroup* OR *New\\-DomainUser* OR *Add\\-DomainGroupMember* OR *Set\\-DomainUserPassword* OR *Invoke\\-Kerberoast* OR *Export\\-PowerViewCSV* OR *Find\\-LocalAdminAccess* OR *Find\\-DomainLocalGroupMember* OR *Find\\-DomainShare* OR *Find\\-DomainUserEvent* OR *Find\\-DomainProcess* OR *Find\\-DomainUserLocation* OR *Find\\-InterestingFile* OR *Find\\-InterestingDomainShareFile* OR *Find\\-DomainObjectPropertyOutlier* OR *TestMethod* OR *Get\\-Domain* OR *Get\\-NetDomain* OR *Get\\-DomainComputer* OR *Get\\-NetComputer* OR *Get\\-DomainController* OR *Get\\-NetDomainController* OR *Get\\-DomainFileServer* OR *Get\\-NetFileServer* OR *Convert\\-ADName* OR *Get\\-DomainObject* OR *Get\\-ADObject* OR *Get\\-DomainUser* OR *Get\\-NetUser* OR *Get\\-DomainGroup* OR *Get\\-NetGroup* OR *Get\\-DomainDFSShare* OR *Get\\-DFSshare* OR *Get\\-DomainDNSRecord* OR *Get\\-DNSRecord* OR *Get\\-DomainDNSZone* OR *Get\\-DNSZone* OR *Get\\-DomainForeignGroupMember* OR *Find\\-ForeignGroup* OR *Get\\-DomainForeignUser* OR *Find\\-ForeignUser* OR *ConvertFrom\\-SID* OR *Convert\\-SidToName* OR *Get\\-DomainGroupMember* OR *Get\\-NetGroupMember* OR *Get\\-DomainManagedSecurityGroup* OR *Find\\-ManagedSecurityGroups* OR *Get\\-DomainOU* OR *Get\\-NetOU* OR *Get\\-DomainSID* OR *Get\\-Forest* OR *Get\\-NetForest* OR *Get\\-ForestTrust* OR *Get\\-NetForestTrust* OR *Get\\-DomainTrust* OR *Get\\-NetDomainTrust* OR *Get\\-ForestDomain* OR *Get\\-NetForestDomain* OR *Get\\-DomainSite* OR *Get\\-NetSite* OR *Get\\-DomainSubnet* OR *Get\\-NetSubnet* OR *Get\\-DomainTrustMapping* OR *Invoke\\-MapDomainTrust* OR *Get\\-ForestGlobalCatalog* OR *Get\\-NetForestCatalog* OR *Get\\-DomainUserEvent* OR *Get\\-UserEvent* OR *Get\\-DomainGUIDMap* OR *Get\\-GUIDMap* OR *Resolve\\-IPAddress* OR *Get\\-IPAddress* OR *ConvertTo\\-SID* OR *Invoke\\-UserImpersonation* OR *Invoke\\-RevertToSelf* OR *Get\\-DomainSPNTicket* OR *Request\\-SPNTicket* OR *Get\\-NetComputerSiteName* OR *Get\\-SiteName* OR *Get\\-DomainGPO* OR *Get\\-NetGPO* OR *Set\\-DomainObject* OR *Set\\-ADObject* OR *Add\\-RemoteConnection* OR *Remove\\-RemoteConnection* OR *Get\\-IniContent* OR *Get\\-GptTmpl* OR *Get\\-GroupsXML* OR *Get\\-DomainPolicyData* OR *Get\\-DomainPolicy* OR *Get\\-DomainGPOLocalGroup* OR *Get\\-NetGPOGroup*))","meta":{"from":"1m"},"severity":"high","tags":["T1033","T1049","T1069","T1135","T1482"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1033","name":"System Owner/User Discovery","reference":"https://attack.mitre.org/techniques/T1033"},{"id":"T1049","name":"System Network Connections Discovery","reference":"https://attack.mitre.org/techniques/T1049"},{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"},{"id":"T1135","name":"Network Share Discovery","reference":"https://attack.mitre.org/techniques/T1135"},{"id":"T1482","name":"Domain Trust Discovery","reference":"https://attack.mitre.org/techniques/T1482"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
