{"description":"Detects suspicious powershell process starts with base64 encoded commands (e.g. Emotet) Author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, Anton Kutepov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ca2092a1-c273-4878-9b4b-0d60115bf5ea","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Encoded PowerShell Command Line","query":"(((process.command_line:*\\ \\-e* AND process.command_line:*\\ JAB* AND process.command_line:*\\ \\-w* AND process.command_line:*\\ hidden\\ *) OR (process.command_line:*\\ \\-e* AND process.command_line:(*\\ BA\\^J* OR *\\ SUVYI* OR *\\ SQBFAFgA* OR *\\ aQBlAHgA* OR *\\ aWV4I* OR *\\ IAA* OR *\\ IAB* OR *\\ UwB* OR *\\ cwB*)) OR process.command_line:*.exe\\ \\-ENCOD\\ *) AND (NOT (process.command_line:*\\ \\-ExecutionPolicy* AND process.command_line:*remotesigned\\ *)))","meta":{"from":"1m"},"severity":"high","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
