{"description":"Detects WMI script event consumers Author: Thomas Patzke. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate event consumers"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"WMI Persistence - Script Event Consumer","query":"(process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe\" AND process.parent.executable:\"C\\:\\\\Windows\\\\System32\\\\svchost.exe\")","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
