{"description":"Detects suspicious flags used by PsExec and PAExec but no usual program name in command line Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Weird admins that rename their tools","Software companies that bundle PsExec/PAExec with their software and rename it, so that it is less embarrassing"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"44464f38-cc8a-f0b4-01ef-17fd19e7c39c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"PsExec/PAExec Flags","query":"((process.command_line:(*\\ \\-s\\ cmd.exe OR *\\ \\-s\\ \\-i\\ cmd.exe) OR (process.command_line:*accepteula* AND process.command_line:*\\ \\-u\\ * AND process.command_line:*\\ \\-p\\ * AND process.command_line:*\\ \\\\\\*)) AND (NOT (process.command_line:(*paexec* OR *PsExec*))))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
