{"description":"Threat actors can use an older version of the auditpol binary available inside the NT resource kit to change audit policy configuration to impair detection capability. This can be carried out by selectively disabling/removing certain audit policies as well as restoring a custom policy owned by the threat actor. Author: Nasreddine Bencherchali @nas_bench. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c6c56ada-612b-42d1-9a29-adad3c5c2c1e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious NT Resource Kit Auditpol Usage","query":"process.command_line:(*\\/logon\\:none* OR *\\/system\\:none* OR *\\/sam\\:none* OR *\\/privilege\\:none* OR *\\/object\\:none* OR *\\/process\\:none* OR *\\/policy\\:none*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
