{"description":"Detects a code page switch in command line or batch scripts to a rare language Author: Florian Roth, Jonhnathan Ribeiro, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative activity (adjust code pages according to your organisation's region)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7fec3c84-cce3-3d04-e3f5-57016e4b26d8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Code Page Switch","query":"(process.executable:*\\\\chcp.com AND process.command_line:(*\\ 936 OR *\\ 1258))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
