{"description":"Detects process injection using the signed Windows tool Mavinject32.exe Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"17eb8e57-9983-420d-ad8a-2c4976c22eb8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"MavInject Process Injection","query":"process.command_line:*\\ \\/INJECTRUNNING\\ *","meta":{"from":"1m"},"severity":"critical","tags":["T1055","T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
