{"description":"Detects a command that clears or disables any ETW trace log which could indicate a logging evasion. Author: @neu5ron, Florian Roth, Jonhnathan Ribeiro, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a238b5d0-ce2d-4414-a676-7a531b3d13d6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Disable of ETW Trace","query":"((process.command_line:*cl* AND process.command_line:*\\/Trace*) OR (process.command_line:*clear\\-log* AND process.command_line:*\\/Trace*) OR (process.command_line:*sl* AND process.command_line:*\\/e\\:false*) OR (process.command_line:*set\\-log* AND process.command_line:*\\/e\\:false*) OR (process.command_line:*Remove\\-EtwTraceProvider* AND process.command_line:*EventLog\\-Microsoft\\-Windows\\-WMI\\-Activity\\-Trace* AND process.command_line:*\\{1418ef04\\-b0b4\\-4623\\-bf7e\\-d74ab47bbdaa\\}*) OR (process.command_line:*Set\\-EtwTraceProvider* AND process.command_line:*\\{1418ef04\\-b0b4\\-4623\\-bf7e\\-d74ab47bbdaa\\}* AND process.command_line:*EventLog\\-Microsoft\\-Windows\\-WMI\\-Activity\\-Trace* AND process.command_line:*0x11*) OR (process.command_line:*logman* AND process.command_line:*update* AND process.command_line:*trace* AND process.command_line:*\\-\\-p* AND process.command_line:*\\-ets*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1070","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"},{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
