{"description":"Detects a command used by conti to access volume shadow backups Author: Max Altgelt, Tobias Michalski. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Some rare backup scenarios"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c73124a7-3e89-44a3-bdc1-25fe4df754b1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Conti Volume Shadow Listing","query":"process.command_line:*copy\\ \\\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy*","meta":{"from":"1m"},"severity":"medium","tags":["T1490"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1490","name":"Inhibit System Recovery","reference":"https://attack.mitre.org/techniques/T1490"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
