{"description":"Detects different process creation events as described in various threat reports on Lazarus group activity Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Overlap with legitimate process activity in some cases (especially selection 3 and 4)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"24c4d154-05a4-4b99-b57d-9b977472443a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Lazarus Activity","query":"(process.command_line:(*reg.exe\\ save\\ hklm\\\\sam\\ %temp%\\\\\\~reg_sam.save* OR *1q2w3e4r@#$@#$@#$* OR *\\ \\-hp1q2w3e4\\ * OR *.dat\\ data03\\ 10000\\ \\-p\\ *) OR (process.command_line:*process\\ call\\ create* AND process.command_line:*\\ >\\ %temp%\\\\\\~*) OR (process.command_line:*netstat\\ \\-aon\\ |\\ find\\ * AND process.command_line:*\\ >\\ %temp%\\\\\\~*) OR process.command_line:*.255\\ 10\\ C\\:\\\\ProgramData\\\\*)","meta":{"from":"1m"},"severity":"critical","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
