{"description":"Detection for mshta.exe suspicious execution patterns sometimes involving file polyglotism Author: Diego Perez (@darkquassar), Markus Neis, Swisscom (Improve Rule). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cc7abbd0-762b-41e3-8a26-57ad50d2eea3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"MSHTA Suspicious Execution 01","query":"(process.executable:*\\\\mshta.exe AND process.command_line:(*vbscript* OR *.jpg* OR *.png* OR *.lnk* OR *.xls* OR *.doc* OR *.zip* OR *.dll* OR *.exe*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1059","T1140","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1140","name":"Deobfuscate/Decode Files or Information","reference":"https://attack.mitre.org/techniques/T1140"},{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
