{"description":"Detects EmpireMonkey APT reported Activity Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Very Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"10152a7b-b566-438f-a33c-390b607d1c8d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Empire Monkey","query":"(process.command_line:*\\/i\\:%APPDATA%\\\\logs.txt\\ scrobj.dll AND (process.executable:*\\\\cutil.exe OR winlog.event_data.Description:\"Microsoft\\(C\\)\\ Registerserver\"))","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
