{"description":"Detects the attempt to evade or obfuscate the executed command on the CommandLine using bogus path traversal Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Google Drive"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"60ee8624-f9a3-8551-44e2-d8d226aae808","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Command Line Path Traversal Evasion","query":"(((process.executable:*\\\\Windows\\\\* AND process.command_line:(*\\\\..\\\\Windows\\\\* OR *\\\\..\\\\System32\\\\* OR *\\\\..\\\\..\\\\*)) OR process.command_line:*.exe\\\\..\\\\*) AND (NOT (process.command_line:*\\\\Google\\\\Drive\\\\googledrivesync.exe\\\\..\\\\*)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
