{"description":"Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["administrator, hotline ask to user"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"0e4164da-94bc-450d-a7be-a4b176179f1f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious Netsh Discovery Command","query":"(process.command_line:*netsh\\ * AND process.command_line:*advfirewall\\ * AND process.command_line:*firewall\\ * AND process.command_line:*show\\ * AND process.command_line:*rule\\ * AND process.command_line:*name\\=all*)","meta":{"from":"1m"},"severity":"low","tags":["T1016"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1016","name":"System Network Configuration Discovery","reference":"https://attack.mitre.org/techniques/T1016"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
