{"description":"Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe DLL hijacking (UACMe 36) Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"be89d844-a59b-88b4-c1f4-11920e5f18e2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"UAC Bypass Using NTFS Reparse Point - Process","query":"(IntegrityLevel:(\"High\" OR \"System\") AND ((process.command_line:\\\"C\\:\\\\Windows\\\\system32\\\\wusa.exe\\\"\\ \\ \\/quiet\\ C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\Temp\\\\update.msu) OR (process.parent.command_line:\"\\\"C\\:\\\\Windows\\\\system32\\\\dism.exe\\\"\\ \\/online\\ \\/quiet\\ \\/norestart\\ \\/add\\-package\\ \\/packagepath\\:\\\"C\\:\\\\Windows\\\\system32\\\\pe386\\\"\\ \\/ignorecheck\" AND process.command_line:*C\\:\\\\Users\\\\* AND process.command_line:*\\\\AppData\\\\Local\\\\Temp\\\\* AND process.command_line:*\\\\dismhost.exe\\ \\{* AND process.executable:*\\\\DismHost.exe)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","Privilege Escalation","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
