{"description":"This rule detects DLL injection and execution via LOLBAS - Tracker.exe Author: Avneet Singh @v3t0_, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"148431ce-4b70-403d-8525-fcc2993f29ea","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"DLL Injection with Tracker.exe","query":"((process.executable:*\\\\tracker.exe OR winlog.event_data.Description:\"Tracker\") AND process.command_line:*\\ \\/d\\ * AND process.command_line:*\\ \\/c\\ *)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
