{"description":"Detects a renamed dctask64.exe used for process injection, command execution, process creation with a signed binary by ZOHO Corporation Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown yet"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"340a090b-c4e9-412e-bb36-b4b16fe96f9b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Renamed ZOHO Dctask64","query":"(winlog.event_data.Hashes:*6834B1B94E49701D77CCB3C0895E1AFD* AND (NOT (process.executable:*\\\\dctask64.exe)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1036","T1055","T1202","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"},{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"},{"id":"T1202","name":"Indirect Command Execution","reference":"https://attack.mitre.org/techniques/T1202"},{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
