{"description":"Detects wmiprvse spawning processes Author: Roberto Rodriguez @Cyb3rWard0g. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d21374ff-f574-44a7-9998-4a8c8bf33d7d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Wmiprvse Spawning Process","query":"((process.parent.executable:*\\\\WmiPrvSe.exe AND (NOT (LogonId:(\"0x3e7\" OR \"null\") OR user.name:(NT\\ AUTHORITY\\\\SYSTEM* OR AUTORITE\\ NT\\\\Sys*) OR process.executable:(*\\\\WmiPrvSE.exe OR *\\\\WerFault.exe)))) AND (NOT (NOT _exists_:LogonId)))","meta":{"from":"1m"},"severity":"high","tags":["T1047"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
