{"description":"Detects Access to Domain Group Policies stored in SYSVOL Author: Markus Neis, Jonhnathan Ribeiro, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"05f3c945-dcc8-4393-9f3d-af65077a8f86","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious SYSVOL Domain Group Policy Access","query":"(process.command_line:*\\\\SYSVOL\\\\* AND process.command_line:*\\\\policies\\\\*)","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1552"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
