{"description":"Adversaries may stop services or processes in order to conduct Data Destruction or Data Encrypted for Impact on the data stores of services like Exchange and SQL Server. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9ac94dc8-9042-493c-ba45-3b5e7c86b980","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Disable Important Scheduled Task","query":"(process.executable:*\\\\schtasks.exe AND process.command_line:*\\/Change* AND process.command_line:*\\/TN* AND process.command_line:*\\/disable* AND process.command_line:*\\\\Microsoft\\\\Windows\\\\SystemRestore\\\\SR*)","meta":{"from":"1m"},"severity":"high","tags":["T1489"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1489","name":"Service Stop","reference":"https://attack.mitre.org/techniques/T1489"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
