{"description":"AnyDesk Remote Desktop silent installation can be used by attacker to gain remote access. Author: Ján Trenčanský. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate deployment of AnyDesk"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"114e7f1c-f137-48c8-8f54-3088c24ce4b9","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"AnyDesk Silent Installation","query":"(process.command_line:*\\-\\-install* AND process.command_line:*\\-\\-start\\-with\\-win* AND process.command_line:*\\-\\-silent*)","meta":{"from":"1m"},"severity":"high","tags":["T1219"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
