{"description":"Detect an interactive AT job, which may be used as a form of privilege escalation. Author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely (at.exe deprecated as of Windows 8)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"60fc936d-2eb0-4543-8a13-911c750a1dfc","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Interactive AT Job","query":"(process.executable:*\\\\at.exe AND process.command_line:*interactive*)","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1053"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
