{"description":"Detects Executables in the Downloads folder without FileVersion,Description,Product,Company likely created with py2exe Author: Markus Neis, Sander Wiebing. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9637e8a5-7131-4f7f-bdc7-2b05d8670c43","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious File Characteristics Due to Missing Fields","query":"(winlog.event_data.Description:\"\\?\" AND (FileVersion:\"\\?\" OR Product:\"\\?\" OR Company:\"\\?\") AND process.executable:*\\\\Downloads\\\\*)","meta":{"from":"1m"},"severity":"medium","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
