{"description":"Detects using Rasautou.exe for loading arbitrary .DLL specified in -d option and executes the export specified in -p. Author: Julia Fomina, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cd3d1298-eb3b-476c-ac67-12847de55813","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"DLL Execution via Rasautou.exe","query":"((process.executable:*\\\\rasautou.exe OR winlog.event_data.OriginalFileName:\"rasdlui.exe\") AND (process.command_line:*\\-d* AND process.command_line:*\\-p*))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
