{"description":"Attackers can use findstr to hide their artifacts or search specific strings and evade defense mechanism Author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative findstr usage"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"bf6c39fc-e203-45b9-9538-05397c1b4f3f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Abusing Findstr for Defense Evasion","query":"(process.command_line:*findstr* AND ((process.command_line:*\\/V* AND process.command_line:*\\/L*) OR (process.command_line:*\\/S* AND process.command_line:*\\/I*)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
