{"description":"Detects a Windows command line executable started from MSHTA Author: Michael Haag. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Printer software / driver installations","HP software"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3f0082b9-5311-eee5-bfc2-1be68ae4124d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"MSHTA Spawning Windows Shell","query":"(process.parent.executable:*\\\\mshta.exe AND (process.executable:(*\\\\cmd.exe OR *\\\\powershell.exe OR *\\\\wscript.exe OR *\\\\cscript.exe OR *\\\\sh.exe OR *\\\\bash.exe OR *\\\\reg.exe OR *\\\\regsvr32.exe) OR process.executable:*\\\\BITSADMIN*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
