{"description":"Detects wmiexec/dcomexec/atexec/smbexec from Impacket framework Author: Ecco, oscd.community, Jonhnathan Ribeiro. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["pentesters"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8ab9019a-15a5-ac72-459f-eb66f583e466","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Impacket Lateralization Detection","query":"(process.command_line:*cmd.exe* AND process.command_line:*&1* AND ((process.parent.executable:(*\\\\wmiprvse.exe OR *\\\\mmc.exe OR *\\\\explorer.exe OR *\\\\services.exe) AND process.command_line:*\\/Q* AND process.command_line:*\\/c* AND process.command_line:*\\\\\\\\127.0.0.1\\\\*) OR (process.parent.command_line:(*svchost.exe\\ \\-k\\ netsvcs* OR *taskeng.exe*) AND process.command_line:*\\/C* AND process.command_line:*Windows\\\\Temp\\\\*)))","meta":{"from":"1m"},"severity":"critical","tags":["Lateral Movement","T1021","T1047"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"}]},{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
