{"description":"Detects a suspicious copy command that copies a system program from System32 to another directory on disk - sometimes used to use LOLBINs like certutil or desktopimgdownldr to a different location with a different name Author: Florian Roth, Markus Neis, Tim Shelton (HAWK.IO). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["False positives depend on scripts and administrative tools used in the monitored environment","Admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/","False positive when cmd.exe and xcopy.exe are called directly"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"327ea053-c225-f9d0-0e39-267253f45d8b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Copy From or To System32","query":"process.command_line:(*xcopy*\\\\System32\\\\* OR *cmd.exe*\\/c*copy*\\\\System32\\\\*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
