{"description":"Detects netsh commands that configure a port forwarding (PortProxy) Author: Florian Roth, omkar72, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration","WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"322ed9ec-fcab-4f67-9a34-e7c6aef43614","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Netsh Port Forwarding","query":"(process.executable:*\\\\netsh.exe AND ((process.command_line:*interface* AND process.command_line:*portproxy* AND process.command_line:*add* AND process.command_line:*v4tov4*) OR (process.command_line:*connectp* AND process.command_line:*listena* AND process.command_line:*c\\=*)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","Lateral Movement","T1090"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
