{"description":"A sigma rule detecting an unidetefied attacker who used phishing emails to target high profile orgs on November 2018. The Actor shares some TTPs with YYTRIUM/APT29 campaign in 2016. Author: @41thexplorer, Microsoft Defender ATP. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7453575c-a747-40b9-839b-125a0aae324b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Unidentified Attacker November 2018","query":"(process.command_line:*cyzfc.dat,* AND process.command_line:*PointFunctionCall)","meta":{"from":"1m"},"severity":"high","tags":["T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
