{"description":"Detects a suspicious child process of userinit Author: Florian Roth (rule), Samir Bousseaden (idea). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative scripts"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"b655a06a-31c0-477a-95c2-3726b83d649d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Userinit Child Process","query":"((process.parent.executable:*\\\\userinit.exe AND (NOT (process.command_line:*\\\\netlogon\\\\*))) AND (NOT (process.executable:*\\\\explorer.exe)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
