{"description":"Detects process command line patterns and locations used by REvil group in Kaseya incident (can also match on other malware) Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"75b83a33-f652-e7eb-375a-b6e0b89b5d10","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"REvil Kaseya Incident Malware Patterns","query":"(process.command_line:(*C\\:\\\\Windows\\\\cert.exe* OR *Set\\-MpPreference\\ \\-DisableRealtimeMonitoring\\ $true\\ \\-DisableIntrusionPreventionSystem\\ $true\\ \\-DisableIOAVProtection\\ $true\\ \\-DisableScriptScanning\\ $true\\ \\-EnableControlledFolderAccess\\ Disabled\\ \\-EnableNetworkProtection\\ AuditMode\\ \\-Force\\ \\-MAPSReporting\\ Disabled* OR *del\\ \\/q\\ \\/f\\ c\\:\\\\kworking\\\\agent.crt* OR *Kaseya\\ VSA\\ Agent\\ Hot\\-fix* OR *\\\\AppData\\\\Local\\\\Temp\\\\MsMpEng.exe* OR *rmdir\\ \\/s\\ \\/q\\ %SystemDrive%\\\\inetpub\\\\logs* OR *del\\ \\/s\\ \\/q\\ \\/f\\ %SystemDrive%\\\\*.log* OR *c\\:\\\\kworking1\\\\agent.exe* OR *c\\:\\\\kworking1\\\\agent.crt*) AND process.executable:(\"C\\:\\\\Windows\\\\MsMpEng.exe\" OR \"C\\:\\\\Windows\\\\cert.exe\" OR \"C\\:\\\\kworking\\\\agent.exe\" OR \"C\\:\\\\kworking1\\\\agent.exe\"))","meta":{"from":"1m"},"severity":"critical","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
