{"description":"Detects the execution of CSharp interactive console by PowerShell Author: Michael R. (@nahamike01). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Possible depending on environment. Pair with other factors such as net connections, command-line args, etc."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a9e416a8-e613-4f8b-88b8-a7d1d1af2f61","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Use of CSharp Interactive Console","query":"(process.executable:*\\\\csi.exe AND process.parent.executable:*\\\\powershell.exe AND winlog.event_data.OriginalFileName:\"csi.exe\")","meta":{"from":"1m"},"severity":"high","tags":["T1127"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
