{"description":"This rule detects execution of a PowerShell code through the sqlps.exe utility, which is included in the standard set of utilities supplied with the MSSQL Server. Script blocks are not logged in this case, so this utility helps to bypass protection mechanisms based on the analysis of these logs. Author: Agro (@agro_sev) oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Direct PS command execution through SQLPS.exe is uncommon, childprocess sqlps.exe spawned by sqlagent.exe is a legitimate action."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"0152550d-3a26-4efd-9f0e-54a0b28ae2f3","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Detection of PowerShell Execution via Sqlps.exe","query":"((process.executable:*\\\\sqlps.exe OR process.parent.executable:*\\\\sqlps.exe) OR (winlog.event_data.OriginalFileName:\"\\\\sqlps.exe\" AND (NOT (process.parent.executable:*\\\\sqlagent.exe))))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1059","T1127"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1127","name":"Trusted Developer Utilities Proxy Execution","reference":"https://attack.mitre.org/techniques/T1127"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
