{"description":"Detects rundll32 execution without parameters as observed when running Metasploit windows/smb/psexec exploit module Author: Bartlomiej Czyz, Relativity. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4b41d9c2-5ebe-1b1d-0d43-6a0cb1bf15d4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Rundll32 Without Parameters","query":"process.command_line:\"rundll32.exe\"","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","T1021","T1569","T1570"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1569","name":"System Services","reference":"https://attack.mitre.org/techniques/T1569"}]},{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"},{"id":"T1570","name":"Lateral Tool Transfer","reference":"https://attack.mitre.org/techniques/T1570"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
