{"description":"There is an option for a MS VS Just-In-Time Debugger \"vsjitdebugger.exe\" to launch specified executable and attach a debugger. This option may be used adversaries to execute malicious code by signed verified binary. The debugger is installed alongside with Microsoft Visual Studio package. Author: Agro (@agro_sev), Ensar Şamil (@sblmsrsn), oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["the process spawned by vsjitdebugger.exe is uncommon."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"15c7904e-6ad1-4a45-9b46-5fb25df37fd2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Malicious PE Execution by Microsoft Visual Studio Debugger","query":"(process.parent.executable:*\\\\vsjitdebugger.exe AND (NOT ((process.executable:*\\\\vsimmersiveactivatehelper*.exe OR process.executable:*\\\\devenv.exe))))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
