{"description":"Detect possible Sysmon driver unload Author: Kirill Kiryanov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4d7cda18-1b12-4e52-b45c-d28653210df8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Sysmon Driver Unload","query":"(process.executable:*\\\\fltmc.exe AND process.command_line:*unload* AND process.command_line:*sys*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1070","T1562","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"},{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"},{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
