{"description":"Detects clearing or configuration of eventlogs using wevtutil, powershell and wmic. Might be used by ransomwares during the attack (seen by NotPetya and others). Author: Ecco, Daniil Yugoslavskiy, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Admin activity","Scripts and administrative tools used in the monitored environment"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cc36992a-4671-4f21-a91d-6c2b72a2edf5","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Eventlog Clear or Configuration Using Wevtutil","query":"(((process.executable:*\\\\powershell.exe AND process.command_line:(*Clear\\-EventLog* OR *Remove\\-EventLog* OR *Limit\\-EventLog*)) OR (process.executable:*\\\\wmic.exe AND process.command_line:*\\ ClearEventLog\\ *)) OR (process.executable:*\\\\wevtutil.exe AND process.command_line:(*clear\\-log* OR *\\ cl\\ * OR *set\\-log* OR *\\ sl\\ *)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1070"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
