{"description":"Detects a JAVA process running with remote debugging allowing more than just localhost to connect Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8f88e3f6-2a49-48f5-a5c4-2f7eedf78710","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Java Running with Remote Debugging","query":"(process.command_line:*transport\\=dt_socket,address\\=* AND (NOT (process.command_line:*address\\=127.0.0.1* OR process.command_line:*address\\=localhost*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1203"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1203","name":"Exploitation for Client Execution","reference":"https://attack.mitre.org/techniques/T1203"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
