{"description":"lolbas Cmdl32 is use to download a payload to evade antivirus Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"f37aba28-a9e6-4045-882c-d5004043b337","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Cmdl32 Execution","query":"((process.executable:*\\\\cmdl32.exe OR winlog.event_data.OriginalFileName:\"CMDL32.EXE\") AND (process.command_line:*\\/vpn\\ * AND process.command_line:*\\/lan\\ *))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1202","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1202","name":"Indirect Command Execution","reference":"https://attack.mitre.org/techniques/T1202"},{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
