{"description":"Detects nltest commands that can be used for information discovery Author: Craig Young, oscd.community, Georg Lauenstein. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration use but user must be check out"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5cc90652-4cbd-4241-aa3b-4b462fa5a248","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Recon Activity with NLTEST","query":"(process.executable:*\\\\nltest.exe AND ((process.command_line:*\\/server* AND process.command_line:*\\/query*) OR process.command_line:(*\\/dclist\\:* OR *\\/parentdomain* OR *\\/domain_trusts* OR *\\/trusted_domains* OR *\\/user*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1016","T1482"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1016","name":"System Network Configuration Discovery","reference":"https://attack.mitre.org/techniques/T1016"},{"id":"T1482","name":"Domain Trust Discovery","reference":"https://attack.mitre.org/techniques/T1482"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
