{"description":"Detects a specific tool and export used by EquationGroup Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d465d1d8-27a2-4cca-9621-a800f37cf72e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Equation Group DLL_U Load","query":"((process.executable:*\\\\rundll32.exe AND process.command_line:*,dll_u) OR process.command_line:*\\ \\-export\\ dll_u\\ *)","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
