{"description":"Detects a specific PowerShell command line pattern used by the UNC2452 actors as mentioned in Microsoft and Symantec reports Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown, unlikely, but possible"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"b7155193-8a81-4d8f-805d-88de864ca50c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"UNC2452 PowerShell Pattern","query":"((process.command_line:*Invoke\\-WMIMethod\\ win32_process\\ \\-name\\ create\\ \\-argumentlist* AND process.command_line:*rundll32\\ c\\:\\\\windows*) OR (process.command_line:*wmic\\ \\/node\\:* AND process.command_line:*process\\ call\\ create\\ \\\"rundll32\\ c\\:\\\\windows*))","meta":{"from":"1m"},"severity":"critical","tags":["T1047","T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"},{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
