{"description":"Search for usage of reg or Powershell by non-priveleged users to modify service configuration in registry Author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8f02c935-effe-45b3-8fc9-ef8696a9e41d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Non-privileged Usage of Reg or Powershell","query":"(IntegrityLevel:\"Medium\" AND ((process.command_line:*reg* AND process.command_line:*add*) OR (process.command_line:*powershell* AND process.command_line:(*set\\-itemproperty* OR *\\ sp\\ * OR *new\\-itemproperty*))) AND (process.command_line:*ControlSet* AND process.command_line:*Services*) AND process.command_line:(*ImagePath* OR *FailureCommand* OR *ServiceDLL*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
