{"description":"Detects Service Principal Name Enumeration used for Kerberoasting Author: Markus Neis, keepwatch. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrator Activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1eeed653-dbc8-4187-ad0c-eeebb20e6599","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Possible SPN Enumeration","query":"((process.executable:*\\\\setspn.exe OR (winlog.event_data.Description:*Query\\ or\\ reset\\ the\\ computer* AND winlog.event_data.Description:*SPN\\ attribute*)) AND process.command_line:*\\-q*)","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1558"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1558","name":"Steal or Forge Kerberos Tickets","reference":"https://attack.mitre.org/techniques/T1558"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
