{"description":"Adversaries may stop services or processes in order to conduct Data Destruction or Data Encrypted for Impact on the data stores of services like Exchange and SQL Server. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"86085955-ea48-42a2-9dd3-85d4c36b167d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious Execution of Taskkill","query":"(process.executable:*\\\\taskkill.exe AND process.command_line:*\\/f* AND process.command_line:*\\/im*)","meta":{"from":"1m"},"severity":"low","tags":["T1489"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1489","name":"Service Stop","reference":"https://attack.mitre.org/techniques/T1489"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
