{"description":"Detects a certain command line flag combination used by devinit.exe lolbin to download arbitrary MSI packages on a Windows system Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"90d50722-0483-4065-8e35-57efaadd354d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"DevInit Lolbin Download","query":"(process.command_line:*\\ \\-t\\ msi\\-install\\ * AND process.command_line:*\\ \\-i\\ http*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
