{"description":"Deletes the Windows systemstatebackup using wbadmin.exe.\nThis technique is used by numerous ransomware families.\nThis may only be successful on server platforms that have Windows Backup enabled.\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"89f75308-5b1b-4390-b2d8-d6b2340efaf8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Wbadmin Delete Systemstatebackup","query":"((image:*\\\\wbadmin.exe OR process.command_line:*wbadmin*) AND (process.command_line:*delete\\ * AND process.command_line:*systemstatebackup\\ * AND process.command_line:*\\-keepVersions\\:0*))","meta":{"from":"1m"},"severity":"high","tags":["T1490"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1490","name":"Inhibit System Recovery","reference":"https://attack.mitre.org/techniques/T1490"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
