{"description":"The Devtoolslauncher.exe executes other binary Author: Beyu Denis, oscd.community (rule), @_felamos (idea). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of devtoolslauncher.exe by legitimate user"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Devtoolslauncher.exe Executes Specified Binary","query":"(process.executable:*\\\\devtoolslauncher.exe AND process.command_line:*LaunchForDeploy*)","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
