{"description":"Detect modification of services configuration (ImagePath, FailureCommand and ServiceDLL) in registry by processes with Medium integrity level Author: Teymur Kheirkhabarov. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"56384687-7154-1ff2-03e4-81abc6cd7ddf","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Possible Privilege Escalation via Service Permissions Weakness","query":"(IntegrityLevel:\"Medium\" AND process.command_line:*ControlSet* AND process.command_line:*services* AND process.command_line:(*\\\\ImagePath* OR *\\\\FailureCommand* OR *\\\\ServiceDll*))","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
