{"description":"Detects the import of a alternate datastream to the registry with regedit.exe. Author: Oddvar Moe, Sander Wiebing, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"0b80ade5-6997-4b1d-99a1-71701778ea61","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Imports Registry Key From an ADS","query":"((process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/i\\ * OR *.reg*) AND process.command_line:/:[^ \\\\\\\\]/) AND (NOT (process.command_line:(*\\ \\/e\\ * OR *\\ \\/a\\ * OR *\\ \\/c\\ *))))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
