{"description":"Detects a regsvr.exe execution that doesn't contain a DLL in the command line Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"02856d1e-752a-a39d-24f4-be6daeb4d0d4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Regsvr32 Command Line Without DLL","query":"(((process.executable:*\\\\regsvr32.exe AND (NOT (process.command_line:(*.dll* OR *.ocx* OR *.cpl* OR *.ax* OR *.bav* OR *.ppl*)))) AND (NOT (NOT _exists_:process.command_line))) AND (NOT (process.command_line:\"\")))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
