{"description":"Detect suspicious parent processes of well-known Windows processes Author: vburov. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Some security products seem to spawn these"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"96036718-71cc-4027-a538-d1587e0006a7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Windows Processes Suspicious Parent Directory","query":"(((process.executable:(*\\\\svchost.exe OR *\\\\taskhost.exe OR *\\\\lsm.exe OR *\\\\lsass.exe OR *\\\\services.exe OR *\\\\lsaiso.exe OR *\\\\csrss.exe OR *\\\\wininit.exe OR *\\\\winlogon.exe) AND (NOT (process.parent.executable:(*\\\\SavService.exe OR *\\\\ngen.exe) OR process.parent.executable:(*\\\\System32\\\\* OR *\\\\SysWOW64\\\\*)))) AND (NOT (process.parent.executable:(*\\\\Windows\\ Defender\\\\* OR *\\\\Microsoft\\ Security\\ Client\\\\*) AND process.parent.executable:*\\\\MsMpEng.exe))) AND (NOT (NOT _exists_:process.parent.executable)))","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","T1036","T1036"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"},{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
