{"description":"Detection of child processes spawned with SYSTEM privileges by parents with LOCAL SERVICE or NETWORK SERVICE accounts Author: Teymur Kheirkhabarov, Roberto Rodriguez (@Cyb3rWard0g), Open Threat Research (OTR). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"590a5f4c-6c8c-4f10-8307-89afe9453a9d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Child Process Created as System","query":"((ParentUser:(\"NT\\ AUTHORITY\\\\NETWORK\\ SERVICE\" OR \"NT\\ AUTHORITY\\\\LOCAL\\ SERVICE\" OR \"AUTORITE\\ NT\\\\\") AND user.name:(\"NT\\ AUTHORITY\\\\SYSTEM\" OR \"AUTORITE\\ NT\\\\Sys\") AND IntegrityLevel:\"System\") AND (NOT (process.executable:*\\\\rundll32.exe AND process.command_line:*DavSetCookie*)))","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1134"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1134","name":"Access Token Manipulation","reference":"https://attack.mitre.org/techniques/T1134"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
