{"description":"Detects code execution via the Windows Update client (wuauclt) Author: FPT.EagleEye Team. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"049681f0-b499-3293-7b1c-18bee00ec82b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Windows Update Client LOLBIN","query":"((process.command_line:*\\/UpdateDeploymentProvider* AND process.command_line:*\\/RunHandlerComServer* AND process.command_line:*.dll* AND process.executable:*\\\\wuauclt.exe) AND (NOT (process.command_line:(*\\ \\/ClassId\\ * OR *\\ wuaueng.dll\\ *))))","meta":{"from":"1m"},"severity":"high","tags":["T1105","T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
