{"description":"Detects suspicious powershell invocations from interpreters or unusual programs Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Microsoft Operations Manager (MOM)","Other scripts"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"95eadcb2-92e4-4ed1-9031-92547773a6db","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious PowerShell Invocation Based on Parent Process","query":"((process.parent.executable:(*\\\\wscript.exe OR *\\\\cscript.exe) AND process.executable:*\\\\powershell.exe) AND (NOT (process.working_directory:*\\\\Health\\ Service\\ State\\\\*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
