{"description":"Qbot used reg.exe to add Defender folder exceptions for folders within AppData and ProgramData. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["legitimate use"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"48917adc-a28e-4f5d-b729-11e75da8941f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Registry Defender Exclusions","query":"(process.executable:*\\\\reg.exe AND process.command_line:(*HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\Exclusions\\\\Paths\\\\* OR *HKLM\\\\SOFTWARE\\\\Microsoft\\\\Microsoft\\ Antimalware\\\\Exclusions\\\\Paths*) AND process.command_line:*ADD\\ * AND process.command_line:*\\/t\\ * AND process.command_line:*REG_DWORD\\ * AND process.command_line:*\\/v\\ * AND process.command_line:*\\/d\\ * AND process.command_line:*0*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
