{"description":"Detects a suspicious certreq execution taken from the LOLBAS examples, which can be abused to download (small) files Author: Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4480827a-9799-4232-b2c4-ccc6c4e9e12b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Certreq Command to Download","query":"(process.executable:*\\\\certreq.exe AND process.command_line:*\\ \\-Post\\ * AND process.command_line:*\\ \\-config\\ * AND process.command_line:*\\ http* AND process.command_line:*\\ C\\:\\\\windows\\\\win.ini\\ *)","meta":{"from":"1m"},"severity":"high","tags":["T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
