{"description":"Detects WMI executing suspicious commands Author: Michael Haag, Florian Roth, juju4, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["If using Splunk, we recommend | stats count by Computer,CommandLine following for easy hunting by Computer/CommandLine"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"526be59f-a573-4eea-b5f7-f0973207634d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious WMI Execution","query":"(process.executable:*\\\\wmic.exe AND ((process.command_line:*process* AND process.command_line:*call* AND process.command_line:*create\\ *) OR (process.command_line:*\\ path\\ * AND process.command_line:(*AntiVirus* OR *Firewall*) AND process.command_line:*Product* AND process.command_line:*\\ get\\ *)))","meta":{"from":"1m"},"severity":"medium","tags":["T1047"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
