{"description":"Detects command line parameters used by ADCSPwn, a tool to escalate privileges in an active directory network by coercing authenticate from machine accounts and relaying to the certificate service Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1519ec8a-413c-8554-d98d-e0b0829e6e26","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"ADCSPwn Hack Tool","query":"(process.command_line:*\\ \\-\\-adcs\\ * AND process.command_line:*\\ \\-\\-port\\ *)","meta":{"from":"1m"},"severity":"critical","tags":["Credential Access","T1557"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1557","name":"Man-in-the-Middle","reference":"https://attack.mitre.org/techniques/T1557"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
