{"description":"Use of hostname to get information Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7be5fb68-f9ef-476d-8b51-0256ebece19e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious Execution of Hostname","query":"process.executable:*\\\\HOSTNAME.EXE","meta":{"from":"1m"},"severity":"low","tags":["T1082"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
