{"description":"Detects the execution of a AdFind for Active Directory enumeration Author: FPT.EagleEye Team, omkar72, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"75df3b17-8bcc-4565-b89b-c9898acef911","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious AdFind Execution","query":"(process.command_line:(*objectcategory* OR *trustdmp* OR *dcmodes* OR *dclist* OR *computers_pwdnotreqd*) AND process.executable:*\\\\adfind.exe)","meta":{"from":"1m"},"severity":"medium","tags":["T1018","T1069","T1087","T1482"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1018","name":"Remote System Discovery","reference":"https://attack.mitre.org/techniques/T1018"},{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1482","name":"Domain Trust Discovery","reference":"https://attack.mitre.org/techniques/T1482"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
