{"description":"Identifies suspicious mshta.exe commands. Author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"67f113fa-e23d-4271-befa-30113b3e08b1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Mshta JavaScript Execution","query":"(process.executable:*\\\\mshta.exe AND process.command_line:*javascript*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
