{"description":"Detects the execution of a AdFind for enumeration Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"455b9d50-15a1-4b99-853f-8d37655a4c1b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious AdFind Enumerate","query":"(process.executable:*\\\\adfind.exe AND (process.command_line:(*lockoutduration* OR *lockoutthreshold* OR *lockoutobservationwindow* OR *maxpwdage* OR *minpwdage* OR *minpwdlength* OR *pwdhistorylength* OR *pwdproperties*) OR process.command_line:*\\-sc\\ admincountdmp* OR process.command_line:*\\-sc\\ exchaddresses*))","meta":{"from":"1m"},"severity":"medium","tags":["T1087"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
