{"description":"Detects a suspicious curl process start on Windows and outputs the requested document to a local file Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Scripts created by developers and admins","Administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"bdd97c33-6005-b44a-8841-5762daf05012","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Curl Usage on Windows","query":"((process.executable:*\\\\curl.exe OR Product:\"The\\ curl\\ executable\") AND process.command_line:*\\ \\-O\\ *)","meta":{"from":"1m"},"severity":"medium","tags":["T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
