{"description":"Detects the import of an alternate data stream with regini.exe, regini.exe can be used to modify registry keys. Author: Eli Salem, Sander Wiebing, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"77946e79-97f1-45a2-84b4-f37b5c0d8682","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Modifies the Registry From a ADS","query":"(process.executable:*\\\\regini.exe AND process.command_line:/:[^ \\\\\\\\]/)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
