{"description":"Windows Test Authoring and Execution Framework (TAEF) framework allows you to run automation by executing tests files written on different languages (C, C#, Microsoft COM Scripting interfaces). Adversaries may execute malicious code (such as WSC file with VBScript, dll and so on) directly by running te.exe Author: Agro (@agro_sev) oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["It's not an uncommon to use te.exe directly to execute legal TAEF tests"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"634b00d5-ccc3-4a06-ae3b-0ec8444dd51b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Malicious Windows Script Components File Execution by TAEF Detection","query":"(process.executable:*\\\\te.exe OR process.parent.executable:*\\\\te.exe OR winlog.event_data.OriginalFileName:\"\\\\te.exe\")","meta":{"from":"1m"},"severity":"low","tags":["T1218"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
