{"description":"Detects the registration of a debugger for a program that is available in the logon screen (sticky key backdoor). Author: Florian Roth, oscd.community, Jonhnathan Ribeiro. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Penetration Tests"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ae215552-081e-44c7-805f-be16f975c8a2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Debugger Registration Cmdline","query":"(process.command_line:*\\\\CurrentVersion\\\\Image\\ File\\ Execution\\ Options\\\\* AND process.command_line:(*sethc.exe* OR *utilman.exe* OR *osk.exe* OR *magnify.exe* OR *narrator.exe* OR *displayswitch.exe* OR *atbroker.exe*))","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
