{"description":"Detects the execution of regini.exe which can be used to modify registry keys, the changes are imported from one or more text files. Author: Eli Salem, Sander Wiebing, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate modification of keys"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5f60740a-f57b-4e76-82a1-15b6ff2cb134","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Modifies the Registry From a File","query":"(process.executable:*\\\\regini.exe AND (NOT (process.command_line:/:[^ \\\\\\\\]/)))","meta":{"from":"1m"},"severity":"low","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
