{"description":"Detects execution of Net.exe, whether suspicious or benign. Author: Michael Haag, Mark Woan (improvements), James Pemberton / @4A616D6573 / oscd.community (improvements). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Will need to be tuned. If using Splunk, I recommend | stats count by Computer,CommandLine following the search for easy hunting by computer/CommandLine."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"183e7ea8-ac4b-4c23-9aec-b3dac4e401ac","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Net.exe Execution","query":"(process.executable:(*\\\\net.exe OR *\\\\net1.exe) AND process.command_line:(*\\ group* OR *\\ localgroup* OR *\\ user* OR *\\ view* OR *\\ share* OR *\\ accounts* OR *\\ stop\\ * OR *\\ start*))","meta":{"from":"1m"},"severity":"low","tags":["Lateral Movement","T1007","T1018","T1021","T1049","T1069","T1069","T1087","T1087","T1135","T1201"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1007","name":"System Service Discovery","reference":"https://attack.mitre.org/techniques/T1007"},{"id":"T1018","name":"Remote System Discovery","reference":"https://attack.mitre.org/techniques/T1018"},{"id":"T1049","name":"System Network Connections Discovery","reference":"https://attack.mitre.org/techniques/T1049"},{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"},{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087"},{"id":"T1135","name":"Network Share Discovery","reference":"https://attack.mitre.org/techniques/T1135"},{"id":"T1201","name":"Password Policy Discovery","reference":"https://attack.mitre.org/techniques/T1201"}]},{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
