{"description":"Detects the import of the specified file to the registry with regedit.exe. Author: Oddvar Moe, Sander Wiebing, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate import of keys"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"73bba97f-a82d-42ce-b315-9182e76c57b1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Imports Registry Key From a File","query":"(((process.executable:*\\\\regedit.exe AND process.command_line:(*\\ \\/i\\ * OR *.reg*)) AND (NOT (process.command_line:(*\\ \\/e\\ * OR *\\ \\/a\\ * OR *\\ \\/c\\ *)))) AND (NOT (process.command_line:/:[^ \\\\\\\\]/)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1112"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
