{"description":"Detects the Nishang Invoke-PowerShellTcpOneLine reverse shell Author: FPT.EagleEye, wagga. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrative might use this function for checking network connectivity"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a9d61224-c01e-4f5a-5ca5-b7b044e22060","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Powershell Reverse Shell Connection","query":"(process.executable:*\\\\powershell.exe AND process.command_line:*new\\-object\\ system.net.sockets.tcpclient*)","meta":{"from":"1m"},"severity":"high","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
