{"description":"Uses the .NET InstallUtil.exe application in order to execute image without log Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3a741a83-edc8-b870-5035-f59ba3a0ab1b","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Execution of InstallUtil Without Log","query":"(process.executable:*\\\\InstallUtil.exe AND process.executable:*Microsoft.NET\\\\Framework* AND process.command_line:*\\/logfile\\=\\ * AND process.command_line:*\\/LogToConsole\\=false*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
