{"description":"Detects a suspicious Microsoft desktopimgdownldr execution with parameters used to download files from the Internet Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["False positives depend on scripts and administrative tools used in the monitored environment"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d643d211-2870-e094-7255-cd81ca9bf5f5","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Desktopimgdownldr Command","query":"((process.command_line:*\\ \\/lockscreenurl\\:* AND (NOT (process.command_line:(*.jpg* OR *.jpeg* OR *.png*)))) OR (process.command_line:*reg\\ delete* AND process.command_line:*\\\\PersonalizationCSP*))","meta":{"from":"1m"},"severity":"high","tags":["T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
