{"description":"Detects suspicious aged finger.exe tool execution often used in malware attacks nowadays Author: Florian Roth, omkar72, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Admin activity (unclear what they do nowadays with finger.exe)"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"af491bca-e752-4b44-9c86-df5680533dbc","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Finger.exe Suspicious Invocation","query":"process.executable:*\\\\finger.exe","meta":{"from":"1m"},"severity":"high","tags":["T1105"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
