{"description":"The OpenWith.exe executes other binary Author: Beyu Denis, oscd.community (rule), @harr0ey (idea). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of OpenWith.exe by legitimate user"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"cec8e918-30f7-4e2d-9bfa-a59cc97ae60f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"OpenWith.exe Executes Specified Binary","query":"(process.executable:*\\\\OpenWith.exe AND process.command_line:*\\/c*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
