{"description":"Detects suspicious command line arguments of common data compression tools Author: Florian Roth, Samir Bousseaden. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"89d4442d-ee83-c359-55f2-3ddce627aefb","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious Compression Tool Parameters","query":"((winlog.event_data.OriginalFileName:(7z*.exe OR *rar.exe OR *Command*Line*RAR*) AND process.command_line:(*\\ \\-p* OR *\\ \\-ta* OR *\\ \\-tb* OR *\\ \\-sdel* OR *\\ \\-dw* OR *\\ \\-hp*)) AND (NOT (process.parent.executable:C\\:\\\\Program*)))","meta":{"from":"1m"},"severity":"high","tags":["T1560"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0009","reference":"https://attack.mitre.org/tactics/TA0009","name":"Collection"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1560","name":"Archive Collected Data","reference":"https://attack.mitre.org/techniques/T1560"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
