{"description":"Detects modification of an existing service on a compromised host in order to execute an arbitrary payload when the service is started or killed as a method of persistence. Author: Sreeman. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"38879043-7e1e-47a9-8d46-6bec88e201df","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Modification Of Existing Services For Persistence","query":"(process.command_line:/(?i)sc config.*binpath=.*/ OR process.command_line:/(?i)sc failure.*command=.*/ OR process.command_line:/(?i).*reg add.*(FailureCommand|ImagePath).*(\\.sh|\\.exe|\\.dll|\\.bin$|\\.bat|\\.cmd|\\.js|\\.msh$|\\.reg$|\\.scr|\\.ps|\\.vb|\\.jar|\\.pl).*/)","meta":{"from":"1m"},"severity":"medium","tags":["T1543","T1574"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"},{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
