{"description":"Detects a Powershell process that contains download commands in its command line string Author: Florian Roth, oscd.community, Jonhnathan Ribeiro. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3b6ab547-8ec2-4991-b9d2-2b06702a48d7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"PowerShell Download from URL","query":"(process.executable:*\\\\powershell.exe AND process.command_line:*new\\-object* AND process.command_line:*net.webclient\\).* AND process.command_line:*download* AND process.command_line:(*string\\(* OR *file\\(*))","meta":{"from":"1m"},"severity":"medium","tags":["T1059"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
