{"description":"Detects activity that could be related to Baby Shark malware Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2b30fa36-3a18-402f-a22d-bf4ce2189f35","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Baby Shark Activity","query":"process.command_line:(\"reg\\ query\\ \\\"HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Terminal\\ Server\\ Client\\\\Default\\\"\" OR powershell.exe\\ mshta.exe\\ http* OR \"cmd.exe\\ \\/c\\ taskkill\\ \\/im\\ cmd.exe\")","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1012","T1059","T1059","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"},{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]},{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1012","name":"Query Registry","reference":"https://attack.mitre.org/techniques/T1012"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
