{"description":"Detects the export of a crital Registry key to a file. Author: Oddvar Moe, Sander Wiebing, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Dumping hives for legitimate purpouse i.e. backup or forensic investigation"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"82880171-b475-4201-b811-e9c826cd5eaa","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Exports Critical Registry Keys To a File","query":"(process.executable:*\\\\regedit.exe AND process.command_line:*\\ \\/E\\ * AND process.command_line:(*hklm* OR *hkey_local_machine*) AND process.command_line:(*\\\\system OR *\\\\sam OR *\\\\security))","meta":{"from":"1m"},"severity":"high","tags":["T1012"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
