{"description":"Detects the execution of AdvancedRun utitlity in the context of the TrustedInstaller or SYSTEM account Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"fa00b701-44c6-4679-994d-5a18afa8a707","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Suspicious AdvancedRun Runas Priv User","query":"(process.command_line:(*\\/EXEFilename* OR *\\/CommandLine*) AND (process.command_line:(*\\ \\/RunAs\\ 8\\ * OR *\\ \\/RunAs\\ 4\\ *) OR process.command_line:(*\\/RunAs\\ 8 OR *\\/RunAs\\ 4)))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
