{"description":"Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["administrator, hotline ask to user"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"63332011-f057-496c-ad8d-d2b6afb27f96","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Suspicious Tasklist Discovery Command","query":"(process.command_line:*tasklist* OR process.executable:\"C\\:\\\\Windows\\\\System32\\\\tasklist.exe\")","meta":{"from":"1m"},"severity":"low","tags":["T1057"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1057","name":"Process Discovery","reference":"https://attack.mitre.org/techniques/T1057"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
