{"description":"Detects a when net.exe is called with a password in the command line Author: Tim Shelton (HAWK.IO). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"d4498716-1d52-438f-8084-4a603157d131","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Password Provided In Command Line Of Net.exe","query":"((process.executable:\"C\\:\\\\Windows\\\\System32\\\\net.exe\" AND process.command_line:*net* AND process.command_line:*\\ use\\ * AND process.command_line:*\\:*\\\\\\* AND process.command_line:*\\/USER\\:*\\ *) AND (NOT ((process.command_line:*\\ ))))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
