{"description":"Detects various anomalies in relation to regsvr32.exe Author: Florian Roth, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8e2b24c9-4add-46a0-b4bb-0057b4e6187d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Regsvr32 Anomaly","query":"((process.executable:*\\\\regsvr32.exe AND process.command_line:*\\\\Temp\\\\*) OR (process.executable:*\\\\regsvr32.exe AND process.parent.executable:*\\\\powershell.exe) OR (process.executable:*\\\\regsvr32.exe AND process.parent.executable:*\\\\cmd.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:*\\/i\\:* AND process.command_line:(*http* OR *ftp*) AND process.command_line:*scrobj.dll) OR (process.executable:*\\\\wscript.exe AND process.parent.executable:*\\\\regsvr32.exe) OR (process.executable:*\\\\EXCEL.EXE AND process.command_line:*..\\\\..\\\\..\\\\Windows\\\\System32\\\\regsvr32.exe\\ *) OR (process.parent.executable:*\\\\mshta.exe AND process.executable:*\\\\regsvr32.exe) OR (process.executable:*\\\\regsvr32.exe AND process.command_line:(*\\\\AppData\\\\Local* OR *C\\:\\\\Users\\\\Public*)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
