{"description":"Detects SILENTTRINITY stager use Author: Aleksey Potapov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"03552375-cc2c-4883-bbe4-7958d5a980be","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"SILENTTRINITY Stager Execution","query":"winlog.event_data.Description:*st2stager*","meta":{"from":"1m"},"severity":"high","tags":["T1071"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
