{"description": "Detects when an application acquires a certificate private key", "author": ["Zach Mathis"], "enabled": false, "false_positives": ["Legitimate application requesting certificate exports will trigger this. Apply additional filters as needed"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e2b5163d-7deb-4566-9af3-40afea6858c3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Certificate Private Key Acquired", "query": "winlog.event_id:\"70\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
