{"description": "Detects the download of a file with a potentially suspicious extension from a .zip top level domain.", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate file downloads from a websites and web services that uses the \".zip\" top level domain."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0bb4bbeb-fe52-4044-b40c-430a04577ebe", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious File Download From ZIP TLD", "query": "(Contents:*.zip\\/* AND file.path.text:(\"*.bat\\:Zone*\" OR \"*.dat\\:Zone*\" OR \"*.dll\\:Zone*\" OR \"*.doc\\:Zone*\" OR \"*.docm\\:Zone*\" OR \"*.exe\\:Zone*\" OR \"*.hta\\:Zone*\" OR \"*.pptm\\:Zone*\" OR \"*.ps1\\:Zone*\" OR \"*.rar\\:Zone*\" OR \"*.rtf\\:Zone*\" OR \"*.sct\\:Zone*\" OR \"*.vbe\\:Zone*\" OR \"*.vbs\\:Zone*\" OR \"*.ws\\:Zone*\" OR \"*.wsf\\:Zone*\" OR \"*.xll\\:Zone*\" OR \"*.xls\\:Zone*\" OR \"*.xlsm\\:Zone*\" OR \"*.zip\\:Zone*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/cyb3rops/status/1659175181695287297", "https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
