{"description": "Detects the download of suspicious file type from a well-known file and paste sharing domain", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e64875ce-9c04-c8c6-904a-fa32a909de3b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Unusual File Download from File Sharing Domain", "query": "(Contents:(*transfer.sh* OR *raw.githubusercontent.com* OR *gist.githubusercontent.com* OR *pastebin.com* OR *cdn.discordapp.com\\/attachments\\/* OR *mediafire.com* OR *mega.nz* OR *ddns.net* OR *.paste.ee* OR *.hastebin.com* OR *.ghostbin.co\\/* OR *ufile.io* OR *storage.googleapis.com* OR *anonfiles.com* OR *send.exploit.in* OR *privatlab.net* OR *privatlab.com* OR *sendspace.com* OR *pastetext.net* OR *pastebin.pl* OR *paste.ee*) AND file.path.text:(*.ps1\\:Zone* OR *.bat\\:Zone*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015", "https://www.cisa.gov/uscert/ncas/alerts/aa22-321a"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
