{"description": "Detects the creation of an ADS data stream that contains an executable (non-empty imphash)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b69888d4-380c-45ce-9cf9-d9ce46e67821", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Executable in ADS", "query": "(winlog.event_data.Hashes:*IMPHASH\\=* AND (NOT (winlog.event_data.Hashes:*IMPHASH\\=00000000000000000000000000000000*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://twitter.com/0xrawsec/status/1002478725605273600?s=21"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "@0xrawsec"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
