{"description": "Detects the creation of an ADS (Alternate Data Stream) that contains an executable by looking at a non-empty Imphash", "author": ["Florian Roth (Nextron Systems)", "@0xrawsec"], "enabled": false, "false_positives": ["This rule isn't looking for any particular binary characteristics. As legitimate installers and programs were seen embedding hidden binaries in their ADS. Some false positives are expected from browser processes and similar."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b69888d4-380c-45ce-9cf9-d9ce46e67821", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Hidden Executable In NTFS Alternate Data Stream", "query": "(Hash:*IMPHASH\\=* AND (NOT Hash:*IMPHASH\\=00000000000000000000000000000000*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://twitter.com/0xrawsec/status/1002478725605273600?s=21"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
