{"description": "Detects the download of suspicious file type from a well-known file and paste sharing domain", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ae02ed70-11aa-4a22-b397-c0d0e8f6ea99", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Unusual File Download From File Sharing Websites", "query": "(Contents:(/.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*[Dd][Ll]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo].*/ OR /.*[Gg][Oo][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Pp][Ll].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Tt][Ee][Xx][Tt]\\.[Nn][Ee][Tt].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Nn][Ee][Tt].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/ OR /.*[Ss][Ee][Nn][Dd][Ss][Pp][Aa][Cc][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Jj][Ss][Hh][Aa][Rr][Ee]\\.[Ii][Oo].*/ OR /.*[Tt][Ee][Mm][Pp]\\.[Ss][Hh].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/) AND file.path:(/.*\\.[Pp][Ss]1\\:[Zz][Oo][Nn][Ee].*/ OR /.*\\.[Bb][Aa][Tt]\\:[Zz][Oo][Nn][Ee].*/ OR /.*\\.[Cc][Mm][Dd]\\:[Zz][Oo][Nn][Ee].*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015", "https://www.cisa.gov/uscert/ncas/alerts/aa22-321a"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
