{"description": "Detects the creation of a suspicious ADS (Alternate Data Stream) file by software other than browsers", "enabled": false, "false_positives": ["Other legitimate browsers not currently included in the filter (please add them)", "Legitimate downloads via scripting or command-line tools (Investigate to determine if it's legitimate)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "208bf444-247b-0732-be14-a6abd8b84e0e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Creation Of a Suspicious ADS File Outside a Browser Download", "query": "((Contents:\\[ZoneTransfer\\]\\ \\ ZoneId\\=3* AND file.path.text:*\\:Zone.Identifier AND file.path.text:(*.exe* OR *.scr* OR *.bat* OR *.cmd* OR *.docx* OR *.hta* OR *.jse* OR *.lnk* OR *.pptx* OR *.ps* OR *.reg* OR *.sct* OR *.vb* OR *.wsc* OR *.wsf* OR *.xlsx*)) AND (NOT (process.executable.text:(*\\\\brave.exe OR *\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe OR *\\\\chromium.exe OR *\\\\firefox.exe OR *\\\\msedge.exe OR *\\\\opera.exe OR *\\\\microsoftedge.exe OR *\\\\iexplorer.exe OR *\\\\vivaldi.exe OR *\\\\CCleaner\\ Browser\\\\Application\\\\CCleanerBrowser.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.bleepingcomputer.com/news/security/exploited-windows-zero-day-lets-javascript-files-bypass-security-warnings/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
