{"description": "Detects the creation of a suspicious ADS (Alternate Data Stream) file by software other than browsers", "author": ["frack113"], "enabled": false, "false_positives": ["Other legitimate browsers not currently included in the filter (please add them)", "Legitimate downloads via scripting or command-line tools (Investigate to determine if it's legitimate)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "573df571-a223-43bc-846e-3f98da481eca", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Creation Of a Suspicious ADS File Outside a Browser Download", "query": "((Contents:/\\[[Zz][Oo][Nn][Ee][Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\]\\ \\ [Zz][Oo][Nn][Ee][Ii][Dd]\\=3.*/ AND file.path:/.*\\:[Zz][Oo][Nn][Ee]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Ff][Ii][Ee][Rr]/ AND file.path:(/.*\\.[Ee][Xx][Ee].*/ OR /.*\\.[Ss][Cc][Rr].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Mm][Dd].*/ OR /.*\\.[Dd][Oo][Cc][Xx].*/ OR /.*\\.[Hh][Tt][Aa].*/ OR /.*\\.[Jj][Ss][Ee].*/ OR /.*\\.[Ll][Nn][Kk].*/ OR /.*\\.[Pp][Pp][Tt][Xx].*/ OR /.*\\.[Pp][Ss].*/ OR /.*\\.[Rr][Ee][Gg].*/ OR /.*\\.[Ss][Cc][Tt].*/ OR /.*\\.[Vv][Bb].*/ OR /.*\\.[Ww][Ss][Cc].*/ OR /.*\\.[Ww][Ss][Ff].*/ OR /.*\\.[Xx][Ll][Ss][Xx].*/)) AND (NOT ((process.executable:/.*\\\\\\\\[Bb][Rr][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\\\\\[Mm][Aa][Xx][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/) OR (((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\.*/) OR (process.executable:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\\\\\.*/) AND process.executable:(/.*\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/))) OR (process.executable:/.*\\\\\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ss][Aa][Ff][Aa][Rr][Ii]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ss][Ee][Aa][Mm][Oo][Nn][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ww][Hh][Aa][Ll][Ee]\\.[Ee][Xx][Ee]/) OR ((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ss][Cc][Rr][Ee][Ee][Nn][Ss][Kk][Ee][Tt][Cc][Hh]_.*/ AND process.executable:/.*\\\\\\\\[Ss][Nn][Ii][Pp][Pp][Ii][Nn][Gg][Tt][Oo][Oo][Ll]\\\\\\\\[Ss][Nn][Ii][Pp][Pp][Ii][Nn][Gg][Tt][Oo][Oo][Ll]\\.[Ee][Xx][Ee]/ AND file.path:/[Cc]\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND file.path:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Ss][Cc][Rr][Ee][Ee][Nn][Ss][Kk][Ee][Tt][Cc][Hh]_.*/ AND file.path:/.*\\\\\\\\[Tt][Ee][Mm][Pp][Ss][Tt][Aa][Tt][Ee]\\\\\\\\[Ss][Cc][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]\\ .*/ AND file.path:/.*\\.[Pp][Nn][Gg]\\:[Zz][Oo][Nn][Ee]\\.[Ii][Dd][Ee][Nn][Tt][Ii][Ff][Ii][Ee][Rr]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.bleepingcomputer.com/news/security/exploited-windows-zero-day-lets-javascript-files-bypass-security-warnings/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
