{"description": "Detects potential suspicious winget package installation from a suspicious source.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a3f5c081-e75b-43a0-9f5b-51f26fe5dba2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Suspicious Winget Package Installation", "query": "(Contents:\\[ZoneTransfer\\]\\ \\ ZoneId\\=3* AND Contents:(*\\:\\/\\/1* OR *\\:\\/\\/2* OR *\\:\\/\\/3* OR *\\:\\/\\/4* OR *\\:\\/\\/5* OR *\\:\\/\\/6* OR *\\:\\/\\/7* OR *\\:\\/\\/8* OR *\\:\\/\\/9*) AND file.path.text:\"*\\:Zone.Identifier\" AND file.path.text:\"*\\\\AppData\\\\Local\\\\Temp\\\\WinGet\\\\*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
