{"description": "Detects when S3 bucket versioning is disabled. Threat actors use this technique during AWS ransomware incidents prior to deleting S3 objects.", "author": ["Sean Johnstone | Unit 42"], "enabled": false, "false_positives": ["AWS administrator legitimately disabling bucket versioning"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a136ac98-b2bc-4189-a14d-f0d0388e57a7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AWS S3 Bucket Versioning Disable", "query": "(eventSource:/[Ss]3\\.[Aa][Mm][Aa][Zz][Oo][Nn][Aa][Ww][Ss]\\.[Cc][Oo][Mm]/ AND eventName:PutBucketVersioning AND requestParameters:*Suspended*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://invictus-ir.medium.com/ransomware-in-the-cloud-7f14805bbe82"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
