{"description":"Detects a successful export of an Exchange mailbox to untypical directory or with aspx name suffix which can be used to place a webshell or the needed role assignment for it Author: Florian Roth, Rich Warren, Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unlikely"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"4c682060-a346-7693-db53-25a7abdfbeab","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Mailbox Export to Exchange Webserver","query":"(((*New\\-MailboxExportRequest* AND *\\ \\-Mailbox\\ *) AND (*\\-FilePath\\ \\\"\\\\\\\\localhost\\\\C$* OR *\\-FilePath\\ \\\"\\\\\\\\127.0.0.1\\\\C$* OR *.aspx*)) OR (*New\\-ManagementRoleAssignment* AND *\\ \\-Role\\ \\\"Mailbox\\ Import\\ Export\\\"* AND *\\ \\-User\\ *))","meta":{"from":"1m"},"severity":"critical","tags":["T1505"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1505","name":"Server Software Component","reference":"https://attack.mitre.org/techniques/T1505"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
