{"description": "Rule to detect an adversary setting OabVirtualDirectory External URL property to a script in Exchange Management log", "author": ["Jose Rodriguez @Cyb3rPandaH"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "67e273ee-ec24-f683-24ce-529f789f334b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Exchange Set OabVirtualDirectory ExternalUrl Property", "query": "(*Set-OabVirtualDirectory* AND *ExternalUrl* AND *Page_Load* AND *script*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1505"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1505", "name": "Server Software Component", "reference": "https://attack.mitre.org/techniques/T1505"}]}], "version": 1, "references": ["https://twitter.com/OTR_Community/status/1371053369071132675"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
