{"description":"Detects log entries that appear in exploitation attempts against MS Exchange RCE CVE-2021-42321 Author: Florian Roth, @testanull. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown, please report false positives via https://github.com/SigmaHQ/sigma/issues"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a5d9c9fc-c91b-229a-27f3-2d7defda2f20","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Possible Exploitation of Exchange RCE CVE-2021-42321","query":"(winlog.event_id:(\"6\" OR \"8\") AND (*Cmdlet\\ failed.\\ Cmdlet\\ Get\\-App,\\ * OR *Task\\ Get\\-App\\ throwing\\ unhandled\\ exception\\:\\ System.InvalidCastException\\:*))","meta":{"from":"1m"},"severity":"critical","tags":["Lateral Movement","T1210"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1210","name":"Exploitation of Remote Services","reference":"https://attack.mitre.org/techniques/T1210"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
