{"description": "Detects specific patterns found after a successful ProxyLogon exploitation in relation to a Commandlet invocation of Set-OabVirtualDirectory", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "688b6535-a675-d004-25c9-e28ff8647067", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "ProxyLogon MSExchange OabVirtualDirectory", "query": "((*OabVirtualDirectory* AND * -ExternalUrl *) AND ((*eval(request*) OR (*http://f/<script*) OR (*\"unsafe\"};*) OR (*function Page_Load()*)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Resource Development", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1587", "name": "Develop Capabilities", "reference": "https://attack.mitre.org/techniques/T1587"}]}], "version": 1, "references": ["https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
