{"description": "Detects removal of an exported Exchange mailbox which could be to cover tracks from ProxyShell exploit", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3801e62e-1d9f-724c-44ce-5f59a2797c80", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remove Exported Mailbox from Exchange Webserver", "query": "(*Remove\\-MailboxExportRequest* AND *\\ \\-Identity\\ * AND *\\ \\-Confirm\\ \\\"False\\\"*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
