{"description": "Detects logons using NTLM to hosts that are potentially not part of the domain.", "enabled": false, "false_positives": ["Host connections to valid domains, exclude these.", "Host connections not using host FQDN.", "Host connections to external legitimate domains."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5dd97f23-804a-093e-4fa6-55042ef93f05", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Remote Desktop Connection to Non-Domain Host", "query": "(winlog.provider_name:\"Microsoft\\-Windows\\-NTLM\\/Operational\" AND winlog.event_id:\"8001\" AND TargetName:TERMSRV*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["n/a"], "timestamp_override": "event.ingested", "author": ["James Pemberton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
