{"description": "Detects common NTLM brute force device names", "enabled": false, "false_positives": ["Systems with names equal to the spoofed ones used by the brute force tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9c8acf1a-cbf9-4db6-b63c-74baabe03e59", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "NTLM Brute Force", "query": "(winlog.provider_name:\"Microsoft\\-Windows\\-NTLM\\/Operational\" AND winlog.event_id:\"8004\" AND source.domain:(\"Rdesktop\" OR \"Remmina\" OR \"Freerdp\" OR \"Windows7\" OR \"Windows8\" OR \"Windows2012\" OR \"Windows2016\" OR \"Windows2019\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://www.varonis.com/blog/investigate-ntlm-brute-force"], "timestamp_override": "event.ingested", "author": ["Jerry Shockley '@jsh0x'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
