{"description":"Detects the usage of Sysinternals Tools due to accepteula key being added to Registry Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of SysInternals tools","Programs that use the same Registry Key"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1cb183fc-de76-8f15-20c6-887ce82dde12","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Usage of Sysinternals Tools","query":"winlog.event_data.TargetObject:*\\\\EulaAccepted","meta":{"from":"1m"},"severity":"low","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
