{"description": "Detects when multi-factor authentication (MFA) is disabled.", "enabled": false, "false_positives": ["MFA may be disabled and performed by a system administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "780601d1-6376-4f2a-884e-b8d45599f78c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Workspace MFA Disabled", "query": "(eventService:\"admin.googleapis.com\" AND eventName:(\"ENFORCE_STRONG_AUTHENTICATION\" OR \"ALLOW_STRONG_AUTHENTICATION\") AND new_value:\"false\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3", "https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-security-settings#ENFORCE_STRONG_AUTHENTICATION", "https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-security-settings?hl=en#ALLOW_STRONG_AUTHENTICATION"], "timestamp_override": "event.ingested", "author": ["Austin Songer"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
