{"description":"Detects when an Google Workspace user is granted admin privileges. Author: Austin Songer. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Google Workspace admin role privileges, may be modified by system administrators."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"2d1b83e4-17c6-4896-a37b-29140b40a788","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Google Workspace User Granted Admin Privileges","query":"(eventService:\"admin.googleapis.com\" AND eventName:(\"GRANT_DELEGATED_ADMIN_PRIVILEGES\" OR \"GRANT_ADMIN_PRIVILEGE\"))","meta":{"from":"1m"},"severity":"medium","tags":["T1098"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
