{"description": "Detects when an a role is modified or deleted in Google Workspace.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "6e7e08b4-1efa-51ab-5104-cf1991fe7592", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Google Workspace Role Modified or Deleted", "query": "(eventService:\"admin.googleapis.com\" AND eventName:(\"DELETE_ROLE\" OR \"RENAME_ROLE\" OR \"UPDATE_ROLE\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3", "https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-delegated-admin-settings"], "timestamp_override": "event.ingested", "author": ["Austin Songer"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
