{"description": "Detects suspicious session with two users present", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "331c6cb4-f828-19d8-1fed-4062464ff68f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Guacamole Two Users Sharing Session Anomaly", "query": "\"\\(2\\ users\\ now\\ present\\)\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1212"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1212", "name": "Exploitation for Credential Access", "reference": "https://attack.mitre.org/techniques/T1212"}]}], "version": 1, "references": ["https://research.checkpoint.com/2020/apache-guacamole-rce/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
