{"description": "Detects remote thread creation from CACTUSTORCH as described in references.", "author": ["@SBousseaden (detection)", "Thomas Patzke (rule)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2e4e488a-6164-4811-9ea1-f960c7359c40", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HackTool - CACTUSTORCH Remote Thread Creation", "query": "(process.executable.text:(\"*\\\\System32\\\\cscript.exe\" OR \"*\\\\System32\\\\wscript.exe\" OR \"*\\\\System32\\\\mshta.exe\" OR \"*\\\\winword.exe\" OR \"*\\\\excel.exe\") AND winlog.event_data.TargetImage:*\\\\SysWOW64\\\\* AND NOT _exists_:winlog.event_data.StartModule)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1055", "T1059", "T1059", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}, {"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1090588499517079552", "https://github.com/mdsecactivebreach/CACTUSTORCH"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
