{"description": "Detects a remote thread creation of Ttdinject.exe used as proxy", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c15e99a3-c474-48ab-b9a7-84549a7a9d16", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Thread Creation Ttdinject.exe Proxy", "query": "process.executable:*ttdinject.exe", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1127"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1127", "name": "Trusted Developer Utilities Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1127"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
