{"description": "Detects a remote thread creation in suspicious taregt images", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "184b792c-591c-1bb2-a958-9c3e57798612", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Thread Creation in Suspicious Targets", "query": "winlog.event_data.TargetImage:(*\\\\mspaint.exe OR *\\\\calc.exe OR *\\\\notepad.exe OR *\\\\sethc.exe OR *\\\\write.exe OR *\\\\wordpad.exe)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
