{"description": "Detects uncommon target processes for remote thread creation", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a1a144b7-5c9b-4853-a559-2172be8d4a03", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote Thread Creation In Uncommon Target Image", "query": "(winlog.event_data.TargetImage:(/.*\\\\\\\\[Cc][Aa][Ll][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Cc][Aa][Ll][Cc][Uu][Ll][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Pp][Aa][Ii][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ss][Ee][Tt][Hh][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Oo][Rr][Dd][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Rr][Ii][Tt][Ee]\\.[Ee][Xx][Ee]/) AND (NOT (((process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/)) OR (StartFunction:EtwpNotificationThread) OR (process.executable:/.*[Uu][Nn][Kk][Nn][Oo][Ww][Nn]\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss].*/) OR ((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\\\\\\\[Vv][Mm][Ww][Aa][Rr][Ee]\\ [Tt][Oo][Oo][Ll][Ss]\\\\\\\\[Vv][Mm][Tt][Oo][Oo][Ll][Ss][Dd]\\.[Ee][Xx][Ee]/ AND StartFunction:GetCommandLineW AND winlog.event_data.TargetImage:(/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Nn][Oo][Tt][Ee][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/))) OR ((process.executable:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND StartFunction:(LoadLibraryW OR FreeLibrary))) OR ((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ww][Ii][Nn][Zz][Ii][Pp]\\\\\\\\[Ff][Aa][Hh][Ww][Ii][Nn][Dd][Oo][Ww]64\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetImage:/[Cc]\\:\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
