{"description": "Detects remote thread creation in KeePass.exe indicating password dumping activity", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "77564cc2-7382-438b-a7f6-395c2ae53b9a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "KeePass Password Dumping", "query": "winlog.event_data.TargetImage:*\\\\KeePass.exe", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1555"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1555", "name": "Credentials from Password Stores", "reference": "https://attack.mitre.org/techniques/T1555"}]}], "version": 1, "references": ["https://www.cisa.gov/uscert/ncas/alerts/aa20-259a", "https://github.com/denandz/KeeFarce", "https://github.com/GhostPack/KeeThief"], "timestamp_override": "event.ingested", "author": ["Timon Hackenjos"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
