{"description": "Detecting Code injection with PowerShell in another process", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7caa09a7-ffb3-aada-23b8-e1f490cf4b4e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Accessing WinAPI in PowerShell. Code Injection", "query": "process.executable:*\\\\powershell.exe", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "timestamp_override": "event.ingested", "author": ["Nikita Nazarov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
