{"description": "Offensive tradecraft is switching away from using APIs like \"CreateRemoteThread\", however, this is still largely observed in the wild. This rule aims to detect suspicious processes (those we would not expect to behave in this way like word.exe or outlook.exe) creating remote threads on other processes. It is a generalistic rule, but it should have a low FP ratio due to the selected range of processes.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f016c716-754a-467f-a39e-63c06f773987", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Remote Thread Target", "query": "(winlog.event_data.TargetImage:(*\\\\spoolsv.exe OR *\\\\notepad.exe) AND (NOT (process.executable.text:*\\\\csrss.exe OR process.executable.text:*unknown\\ process* OR StartFunction:\"EtwpNotificationThread\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
