{"description": "Detects potential use of CreateRemoteThread api and LoadLibrary function to inject DLL into a process", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "052ec6f6-1adc-41e6-907a-f1c813478bee", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CreateRemoteThread API and LoadLibrary", "query": "(winlog.event_data.StartModule:*\\\\kernel32.dll AND StartFunction:\"LoadLibraryA\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-180719170510.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
