{"description": "Detects a possible remote threat creation with certain characteristics which are typical for Cobalt Strike beacons", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "282ed3a7-27d8-7414-eb75-5995ffc61959", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CobaltStrike Process Injection", "query": "winlog.event_data.StartAddress:(*0B80 OR *0C7C OR *0C88)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://medium.com/@olafhartong/cobalt-strike-remote-threads-detection-206372d11d0f", "https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/"], "timestamp_override": "event.ingested", "author": ["Olaf Hartong", "Florian Roth", "Aleksey Potapov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
