{"description": "Detects the creation of a remote thread from a Powershell process to another process", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "eeb2e3dc-c1f4-40dd-9bd5-149ee465ad50", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Accessing WinAPI in PowerShell. Code Injection", "query": "(process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND (NOT ((SourceParentImage:\"C\\:\\\\Windows\\\\System32\\\\CompatTelRunner.exe\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "timestamp_override": "event.ingested", "author": ["Nikita Nazarov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
