{"description":"This detection uses AzureActivity logs (Administrative category) to identify the creation or update of a server instance in an Azure AD Hybrid health AD FS service.\nA threat actor can create a new AD Health ADFS service and create a fake server instance to spoof AD FS signing logs. There is no need to compromise an on-prem AD FS server.\nThis can be done programmatically via HTTP requests to Azure.\n Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["legitimate AD FS servers added to an AAD Health AD FS service instance"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"288a39fc-4914-4831-9ada-270e9dc12cb4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Active Directory Hybrid Health AD FS New Server","query":"(CategoryValue:\"Administrative\" AND ResourceProviderValue:\"Microsoft.ADHybridHealthService\" AND ResourceId:*AdFederationService* AND OperationNameValue:\"Microsoft.ADHybridHealthService\\/services\\/servicemembers\\/action\")","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1578"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1578","name":"Modify Cloud Compute Infrastructure","reference":"https://attack.mitre.org/techniques/T1578"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
