{"description": "Detect when authentications to important application(s) only required single-factor authentication", "enabled": false, "false_positives": ["If this was approved by System Administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "f272fb46-25f2-422c-b667-45837994980f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Authentications To Important Apps Using Single Factor Authentication", "query": "(winlog.event_data.Status:\"Success\" AND AppId:\"Insert\\ Application\\ ID\\ use\\ OR\\ for\\ multiple\" AND AuthenticationRequirement:\"singleFactorAuthentication\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1078"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts"], "timestamp_override": "event.ingested", "author": ["MikeDuddington", "'@dudders1'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
