{"description": "Identifies when a Virtual Network is modified or deleted in Azure.", "enabled": false, "false_positives": ["Virtual Network being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Virtual Network modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "4c0df2a0-491a-ae20-a6d9-b2f934127023", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Virtual Network Modified or Deleted", "query": "(properties.message:(MICROSOFT.NETWORK\\/VIRTUALNETWORKGATEWAYS\\/* OR MICROSOFT.NETWORK\\/VIRTUALNETWORKS\\/*) AND properties.message:(*\\/WRITE OR *\\/DELETE))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
