{"description":"Identifies when a service principal was removed in Azure. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Service principal being removed may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Service principal removed from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"448fd1ea-2116-4c62-9cde-a92d120e0f08","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Service Principal Removed","query":"properties.message:\"Remove\\ service\\ principal\"","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
