{"description": "Detects when PIM alerts are set to disabled.", "enabled": false, "false_positives": ["Administrator disabling PIM alerts as an active choice."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "44e603de-a67d-de8b-f6ec-e05f492aa147", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PIM Alert Setting Changes To Disabled", "query": "properties.message:\"Disable\\ PIM\\ Alert\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1484"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1484", "name": "Domain Policy Modification", "reference": "https://attack.mitre.org/techniques/T1484"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-identity-management#azure-ad-roles-assignment"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "Yochana Henderson", "'@Yochana-H'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
