{"description": "Detects when a user that doesn't have permissions to invite a guest user attempts to invite one.", "enabled": false, "false_positives": ["A non malicious user is unaware of the proper process"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "0b4b72e3-4c53-4d5b-b198-2c58cfef39a9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Guest User Invited By Non Approved Inviters", "query": "(properties.message:\"Invite\\ external\\ user\" AND winlog.event_data.Status:\"failure\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "Yochana Henderson", "'@Yochana-H'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
