{"description": "Detects risky authencaition from a non AD registered device without MFA being required.", "author": ["Harjot Singh", "'@cyb3rjy0t'"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "0da9099e-69ed-8a52-6466-d84dd61b9d01", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious SignIns From A Non Registered Device", "query": "(Status:\"Success\" AND AuthenticationRequirement:\"singleFactorAuthentication\" AND DeviceDetail.trusttype:\"\" AND RiskState:\"atRisk\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#non-compliant-device-sign-in"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
