{"description": "Detects when a temporary access pass (TAP) is added to an account. TAPs added to priv accounts should be investigated", "enabled": false, "false_positives": ["Administrator adding a legitmate temporary access pass"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "7e9dea9d-9235-d483-f1c0-9c2b06a14b13", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Temporary Access Pass Added To An Account", "query": "(properties.message:\"Admin\\ registered\\ security\\ info\" AND winlog.event_data.Status:\"Admin\\ registered\\ temporary\\ access\\ pass\\ method\\ for\\ user\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "Yochana Henderson", "'@Yochana-H'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
