{"description": "Detect failed attempts to sign in to disabled accounts.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "3d170dba-c6b7-50b6-8ec9-36116c377d59", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Login to Disabled Account", "query": "(ResultType:\"50057\" AND ResultDescription:\"User\\ account\\ is\\ disabled.\\ The\\ account\\ has\\ been\\ disabled\\ by\\ an\\ administrator.\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts"], "timestamp_override": "event.ingested", "author": ["AlertIQ"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
