{"description": "Identifies user account which has been locked because the user tried to sign in too many times with an incorrect user ID or password.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "2b7d6fc0-71ac-4cf7-8ed1-b5788ee5257a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Account Lockout", "query": "ResultType:\"50053\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts"], "timestamp_override": "event.ingested", "author": ["AlertIQ"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
