{"description":"Identifies when a device or device configuration in azure is modified or deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Device or device configuration being modified or deleted may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Device or device configuration modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"46530378-f9db-4af9-a9e5-889c177d3881","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Device or Configuration Modified or Deleted","query":"properties.message:(\"Delete\\ device\" OR \"Delete\\ device\\ configuration\" OR \"Update\\ device\" OR \"Update\\ device\\ configuration\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
