{"description": "Detect successful authentications from countries you do not operate out of.", "enabled": false, "false_positives": ["If this was approved by System Administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "8c944ecb-6970-4541-8496-be554b8e2846", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Successful Authentications From Countries You Do Not Operate Out Of", "query": "(winlog.event_data.Status:\"Success\" AND (NOT (Location:*<Countries\\ you\\ DO\\ operate\\ out\\ of\\ e,g\\ GB,\\ use\\ OR\\ for\\ mulitple>*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1078"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts"], "timestamp_override": "event.ingested", "author": ["MikeDuddington", "'@dudders1'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
