{"description": "Identifies when an admission controller is executed in Azure Kubernetes.\nA Kubernetes Admission controller intercepts, and possibly modifies, requests to the Kubernetes API server.\nThe behavior of this admission controller is determined by an admission webhook (MutatingAdmissionWebhook or ValidatingAdmissionWebhook) that the user deploys in the cluster.\nAn adversary can use such webhooks as the MutatingAdmissionWebhook for obtaining persistence in the cluster.\nFor example, attackers can intercept and modify the pod creation operations in the cluster and add their malicious container to every created pod.\nAn adversary can use the webhook ValidatingAdmissionWebhook, which could be used to obtain access credentials.\nAn adversary could use the webhook to intercept the requests to the API server, record secrets, and other sensitive information.\n", "author": ["Austin Songer @austinsonger"], "enabled": false, "false_positives": ["Azure Kubernetes Admissions Controller may be done by a system administrator.", "If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "1357b52e-5e44-64c1-60fd-909d83b70499", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Kubernetes Admission Controller", "query": "(operationName:(MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/ADMISSIONREGISTRATION.K8S.IO* OR MICROSOFT.CONTAINERSERVICE\\/MANAGEDCLUSTERS\\/ADMISSIONREGISTRATION.K8S.IO*) AND operationName:(*\\/MUTATINGWEBHOOKCONFIGURATIONS\\/WRITE OR *\\/VALIDATINGWEBHOOKCONFIGURATIONS\\/WRITE))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1078", "T1552", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}, {"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
