{"description": "Detects when a new credential is added to an existing applcation. Any additional credentials added outside of expected processes could be a malicious actor using those credentials.", "enabled": false, "false_positives": ["When credentials are added/removed as part of the normal working hours/workflows"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "9dce31d0-7d4e-35f1-ffc4-25169ed8f8c5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Added Credentials to Existing Application", "query": "properties.message:(\"Update\\ Application\\-Certificates\\ and\\ secrets\\ management\" OR \"Update\\ Service\\ principal\\/Update\\ Application\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-credentials"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "Bailey Bercik '@baileybercik'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
