{"description":"Identifies when an user or application modified the federation settings on the domain. Author: Austin Songer. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Federation Settings being modified or deleted may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Federation Settings modified from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"352a54e1-74ba-4929-9d47-8193d67aba1e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Domain Federation Settings Modified","query":"properties.message:\"Set\\ federation\\ settings\\ on\\ domain\"","meta":{"from":"1m"},"severity":"medium","tags":["Initial Access","T1078"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
