{"description":"Identifies IPs from which users grant access to other users on azure resources and alerts when a previously unseen source IP address is used. Author: sawwinnnaung. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Valid change"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"a622fcd2-4b5a-436a-b8a2-a4171161833c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Granting Of Permissions To An Account","query":"\"Microsoft.Authorization\\/roleAssignments\\/write\"","meta":{"from":"1m"},"severity":"medium","tags":["T1098"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
