{"description": "Detects when an end user consents to an application", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a14bb04e-e3b8-802c-0a71-0c2dddacb35a", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "End User Consent", "query": "ConsentContext.IsAdminConsent:\"false\"", "meta": {"from": "1m"}, "severity": "low", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#end-user-consent"], "timestamp_override": "event.ingested", "author": ["Bailey Bercik '@baileybercik'", "Mark Morowczynski '@markmorow'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
