{"description":"Identifies when a Firewall Rule Configuration is Modified or Deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Firewall Rule Configuration being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Firewall Rule Configuration modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"2a7d64cf-81fa-4daf-ab1b-ab80b789c067","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Firewall Rule Configuration Modified or Deleted","query":"properties.message:(\"MICROSOFT.NETWORK\\/FIREWALLPOLICIES\\/RULECOLLECTIONGROUPS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/FIREWALLPOLICIES\\/RULECOLLECTIONGROUPS\\/DELETE\" OR \"MICROSOFT.NETWORK\\/FIREWALLPOLICIES\\/RULEGROUPS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/FIREWALLPOLICIES\\/RULEGROUPS\\/DELETE\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
