{"description": "Monitor and alert for Bitlocker key retrieval.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a0413867-daf3-43dd-9245-734b3a787942", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Bitlocker Key Retrieval", "query": "(Category:\"KeyManagement\" AND OperationName:\"Read\\ BitLocker\\ key\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1078"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#bitlocker-key-retrieval"], "timestamp_override": "event.ingested", "author": ["Michael Epping", "'@mepples21'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
