{"description": "Identifies when a network security configuration is modified or deleted.", "enabled": false, "false_positives": ["Network Security Configuration being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Network Security Configuration modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e2bb95ef-f993-72ca-cd1f-ff2afee474db", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Network Security Configuration Modified or Deleted", "query": "properties.message:(\"MICROSOFT.NETWORK\\/NETWORKSECURITYGROUPS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/NETWORKSECURITYGROUPS\\/DELETE\" OR \"MICROSOFT.NETWORK\\/NETWORKSECURITYGROUPS\\/SECURITYRULES\\/WRITE\" OR \"MICROSOFT.NETWORK\\/NETWORKSECURITYGROUPS\\/SECURITYRULES\\/DELETE\" OR \"MICROSOFT.NETWORK\\/NETWORKSECURITYGROUPS\\/JOIN\\/ACTION\" OR \"MICROSOFT.NETWORK\\/NETWORKSECURITYGROUPS\\/PROVIDERS\\/MICROSOFT.INSIGHTS\\/DIAGNOSTICSETTINGS\\/WRITE\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
