{"description":"Identifies when a Keyvault Key is modified or deleted in Azure. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Key being modified or deleted may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Key modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"80eeab92-0979-4152-942d-96749e11df40","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Keyvault Key Modified or Deleted","query":"properties.message:(\"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/UPDATE\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/CREATE\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/CREATE\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/IMPORT\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/RECOVER\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/RESTORE\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/DELETE\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/BACKUP\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/KEYS\\/PURGE\\/ACTION\")","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1552","T1552"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552"},{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
