{"description":"Number of VM creations or deployment activities occur in Azure via the AzureActivity log. Author: sawwinnnaung. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Valid change"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"d2d901db-7a75-45a1-bc39-0cbf00812192","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Number Of Resource Creation Or Deployment Activities","query":"(*Microsoft.Compute\\/virtualMachines\\/write* OR *Microsoft.Resources\\/deployments\\/write*)","meta":{"from":"1m"},"severity":"medium","tags":["T1098"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
