{"description": "Identifies when secrets are modified or deleted in Azure.", "enabled": false, "false_positives": ["Secrets being modified or deleted may be performed by a system administrator.", "Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Secrets modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c0225a9e-9df5-4607-4092-50d9e4965844", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Keyvault Secrets Modified or Deleted", "query": "properties.message:(\"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/WRITE\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/DELETE\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/BACKUP\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/PURGE\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/UPDATE\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/RECOVER\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/RESTORE\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/SECRETS\\/SETSECRET\\/ACTION\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}, {"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
