{"description": "Identifies when a Point-to-site VPN is Modified or Deleted.", "enabled": false, "false_positives": ["Point-to-site VPN being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Point-to-site VPN modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "71d8ad97-20d4-cbbf-8dc2-260ed743e959", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Point-to-site VPN Modified or Deleted", "query": "properties.message:(\"MICROSOFT.NETWORK\\/P2SVPNGATEWAYS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/P2SVPNGATEWAYS\\/DELETE\" OR \"MICROSOFT.NETWORK\\/P2SVPNGATEWAYS\\/RESET\\/ACTION\" OR \"MICROSOFT.NETWORK\\/P2SVPNGATEWAYS\\/GENERATEVPNPROFILE\\/ACTION\" OR \"MICROSOFT.NETWORK\\/P2SVPNGATEWAYS\\/DISCONNECTP2SVPNCONNECTIONS\\/ACTION\" OR \"MICROSOFT.NETWORK\\/P2SVPNGATEWAYS\\/PROVIDERS\\/MICROSOFT.INSIGHTS\\/DIAGNOSTICSETTINGS\\/WRITE\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
