{"description": "Detects successful authentication from potential clients using legacy authentication via user agent strings. This could be a sign of MFA bypass using a password spray attack.", "author": ["Harjot Singh", "'@cyb3rjy0t'"], "enabled": false, "false_positives": ["Known Legacy Accounts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "53bb4f7f-48a8-4475-ac30-5a82ddfdf6fc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential MFA Bypass Using Legacy Client Authentication", "query": "(winlog.event_data.Status:\"Success\" AND userAgent:(*BAV2ROPC* OR *CBAinPROD* OR *CBAinTAR*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Initial Access", "T1078", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://blooteem.com/march-2022", "https://www.microsoft.com/en-us/security/blog/2021/10/26/protect-your-business-from-password-sprays-with-microsoft-dart-recommendations/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
