{"description":"Identifies when DNS zone is modified or deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["DNS zone modified and deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","DNS zone modification from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"af6925b0-8826-47f1-9324-337507a0babd","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure DNS Zone Modified or Deleted","query":"(properties.message:MICROSOFT.NETWORK\\/DNSZONES* AND properties.message:(*\\/WRITE OR *\\/DELETE))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
