{"description": "Monitor and alert for Sign-ins by unknown devices from non-Trusted locations.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "7d5cbc55-5a6f-bae2-262e-3a9c73412e77", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Sign-ins by Unknown Devices", "query": "(AuthenticationRequirement:\"singleFactorAuthentication\" AND ResultType:\"0\" AND NetworkLocationDetails:\"\\[\\]\" AND DeviceDetail.deviceId:\"\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1078"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#non-compliant-device-sign-in"], "timestamp_override": "event.ingested", "author": ["Michael Epping", "'@mepples21'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
