{"description": "Identifies when a key vault is modified or deleted.", "enabled": false, "false_positives": ["Key Vault being modified or deleted may be performed by a system administrator.", "Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Key Vault modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "459a2970-bb84-4e6a-a32e-ff0fbd99448d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Key Vault Modified or Deleted", "query": "properties.message:(\"MICROSOFT.KEYVAULT\\/VAULTS\\/WRITE\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/DELETE\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/DEPLOY\\/ACTION\" OR \"MICROSOFT.KEYVAULT\\/VAULTS\\/ACCESSPOLICIES\\/WRITE\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1552", "T1552"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}, {"id": "T1552", "name": "Unsecured Credentials", "reference": "https://attack.mitre.org/techniques/T1552"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
