{"description": "Identifies IPs from which users grant access to other users on azure resources and alerts when a previously unseen source IP address is used.", "enabled": false, "false_positives": ["Valid change"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "935bb50b-f86f-3511-e089-d5491a670c38", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Granting Of Permissions To An Account", "query": "\"Microsoft.Authorization\\/roleAssignments\\/write\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1098"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/master/Detections/azureactivity/Granting_Permissions_To_Account_detection.yaml"], "timestamp_override": "event.ingested", "author": ["sawwinnnaung"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
