{"description":"Identifies when a Kubernetes account access a sensitive objects such as configmaps or secrets. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Sensitive objects may be accessed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Sensitive objects accessed from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"7ee0b4aa-d8d4-4088-b661-20efdf41a04c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Kubernetes Secret or Config Object Access","query":"properties.message:(\"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/CONFIGMAPS\\/WRITE\" OR \"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/CONFIGMAPS\\/DELETE\" OR \"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/SECRETS\\/WRITE\" OR \"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/SECRETS\\/DELETE\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
