{"description": "Define a baseline threshold for failed sign-ins due to Conditional Access failures", "enabled": false, "false_positives": ["Service Account misconfigured", "Misconfigured Systems", "Vulnerability Scanners"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b4a6d707-9430-4f5f-af68-0337f52d5c42", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Sign-in Failure Due to Conditional Access Requirements Not Met", "query": "(ResultType:\"53003\" AND Resultdescription:\"Blocked\\ by\\ Conditional\\ Access\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-privileged-accounts"], "timestamp_override": "event.ingested", "author": ["Yochana Henderson", "'@Yochana-H'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
