{"description": "Identifies when a device in azure is no longer managed or compliant", "enabled": false, "false_positives": ["Administrator may have forgotten to review the device."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "542b9912-c01f-4e3f-89a8-014c48cdca7d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Device No Longer Managed or Compliant", "query": "properties.message:(\"Device\\ no\\ longer\\ compliant\" OR \"Device\\ no\\ longer\\ managed\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-audit-activities#core-directory"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
