{"description":"Detects the creation or patching of potential malicious RoleBinding/ClusterRoleBinding. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["RoleBinding/ClusterRoleBinding being modified and deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","RoleBinding/ClusterRoleBinding modification from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"25cb259b-bbdc-4b87-98b7-90d7c72f8743","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Kubernetes RoleBinding/ClusterRoleBinding Modified and Deleted","query":"properties.message:(\"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/RBAC.AUTHORIZATION.K8S.IO\\/CLUSTERROLEBINDINGS\\/WRITE\" OR \"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/RBAC.AUTHORIZATION.K8S.IO\\/CLUSTERROLEBINDINGS\\/DELETE\" OR \"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/RBAC.AUTHORIZATION.K8S.IO\\/ROLEBINDINGS\\/WRITE\" OR \"MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/RBAC.AUTHORIZATION.K8S.IO\\/ROLEBINDINGS\\/DELETE\")","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
