{"description": "Detects when a user is removed from a privileged role. Bulk changes should be investigated.", "enabled": false, "false_positives": ["Legtimate administrator actions of removing members from a role"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "2a908136-fc74-1cda-8d93-c9c04f041b33", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Bulk Deletion Changes To Privileged Account Permissions", "query": "properties.message:(\"Remove\\ eligible\\ member\\ \\(permanent\\)\" OR \"Remove\\ eligible\\ member\\ \\(eligible\\)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-identity-management#azure-ad-roles-assignment"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "Yochana Henderson", "'@Yochana-H'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
