{"description": "Detects when administrator grants either application permissions (app roles) or highly privileged delegated permissions", "enabled": false, "false_positives": ["When the permission is legitimately needed for the app"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5fdc9754-5941-5695-3a6a-cf2e893334af", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "App Granted Privileged Delegated Or App Permissions", "query": "properties.message:\"Add\\ app\\ role\\ assignment\\ to\\ service\\ principal\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-granted-highly-privileged-permissions"], "timestamp_override": "event.ingested", "author": ["Bailey Bercik '@baileybercik'", "Mark Morowczynski '@markmorow'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
