{"description": "Detects when an account was created and deleted in a short period of time.", "enabled": false, "false_positives": ["Legit administrative action"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "fc255f83-4693-2506-0254-300e7d815a83", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Account Created And Deleted Within A Close Time Frame", "query": "(properties.message:(\"Add\\ user\" OR \"Delete\\ user\") AND winlog.event_data.Status:\"Success\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-user-accounts#short-lived-accounts"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "MikeDuddington", "'@dudders1'", "Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
