{"description": "Detects when a configuration change is made to an applications AppID URI.", "enabled": false, "false_positives": ["When and administrator is making legitmate AppID URI configuration changes to an application. This should be a planned event."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5ff307df-4ba3-798a-8d23-f98b7e7c2e7d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Application AppID Uri Configuration Changes", "query": "properties.message:(\"Update\\ Application\" OR \"Update\\ Service\\ principal\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1528"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1528", "name": "Steal Application Access Token", "reference": "https://attack.mitre.org/techniques/T1528"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#appid-uri-added-modified-or-removed"], "timestamp_override": "event.ingested", "author": ["Mark Morowczynski '@markmorow'", "Bailey Bercik '@baileybercik'"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
