{"description":"Identifies when a Azure Kubernetes CronJob runs in Azure Cloud. Kubernetes Job is a controller that creates one or more pods and ensures that a specified number of them successfully terminate. Kubernetes Job can be used to run containers that perform finite tasks for batch jobs. Kubernetes CronJob is used to schedule Jobs. An Adversary may use Kubernetes CronJob for scheduling execution of malicious code that would run as a container in the cluster. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Azure Kubernetes CronJob/Job may be done by a system administrator.","If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"1c71e254-6655-42c1-b2d6-5e4718d7fc0a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Kubernetes CronJob","query":"(properties.message:(*\\/CRONJOBS\\/WRITE OR *\\/JOBS\\/WRITE) AND (properties.message:MICROSOFT.KUBERNETES\\/CONNECTEDCLUSTERS\\/BATCH* OR properties.message:MICROSOFT.CONTAINERSERVICE\\/MANAGEDCLUSTERS\\/BATCH*))","meta":{"from":"1m"},"severity":"medium","tags":["Privilege Escalation"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
