{"description": "Identifies when a new cloudshell is created inside of Azure portal.", "enabled": false, "false_positives": ["A new cloudshell may be created by a system administrator."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "72af37e2-ec32-47dc-992b-bc288a2708cb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure New CloudShell Created", "query": "properties.message:\"MICROSOFT.PORTAL\\/CONSOLES\\/WRITE\"", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
