{"description":"Identifies when a application credential is modified. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Application credential added may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Application credential added from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"cdeef967-f9a1-4375-90ee-6978c5f23974","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Application Credential Modified","query":"properties.message:\"Update\\ application\\ \\-\\ Certificates\\ and\\ secrets\\ management\"","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
