{"description": "Identifies when Rule Collections (Application, NAT, and Network) is being modified or deleted.", "enabled": false, "false_positives": ["Rule Collections (Application, NAT, and Network) being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "Rule Collections (Application, NAT, and Network) modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "ae61ffa0-bae5-16de-d057-31da47e486c2", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Azure Firewall Rule Collection Modified or Deleted", "query": "properties.message:(\"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/APPLICATIONRULECOLLECTIONS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/APPLICATIONRULECOLLECTIONS\\/DELETE\" OR \"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/NATRULECOLLECTIONS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/NATRULECOLLECTIONS\\/DELETE\" OR \"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/NETWORKRULECOLLECTIONS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/NETWORKRULECOLLECTIONS\\/DELETE\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
