{"description": "Identifies user login with multifactor authentication failures, which might be an indication an attacker has the password for the account but can't pass the MFA challenge.", "author": ["AlertIQ"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5496ff55-42ec-4369-81cb-00f417029e25", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Multifactor Authentication Interrupted", "query": "(((ResultType:\"50074\" AND ResultDescription:*Strong\\ Auth\\ required*)) OR ((ResultType:\"500121\" AND ResultDescription:*Authentication\\ failed\\ during\\ strong\\ authentication\\ request*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
