{"description":"Identifies when a firewall is created, modified, or deleted. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Firewall being modified or deleted may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","Firewall modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"512cf937-ea9b-4332-939c-4c2c94baadcd","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Azure Firewall Modified or Deleted","query":"properties.message:(\"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/WRITE\" OR \"MICROSOFT.NETWORK\\/AZUREFIREWALLS\\/DELETE\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
