{"description":"Detects additions to the Emond Launch Daemon that adversaries may use to gain persistence and elevate privileges. Author: Alejandro Ortuno, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"23c43900-e732-45a4-8354-63e4a6c187ce","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"MacOS Emond Launch Daemon","query":"((file.path:*\\/etc\\/emond.d\\/rules\\/* AND file.path:*.plist) OR file.path:*\\/private\\/var\\/db\\/emondClients\\/*)","meta":{"from":"1m"},"severity":"medium","tags":["Privilege Escalation","T1546"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
