{"description":"Detects creation of startup item plist files that automatically get executed at boot initialization to establish persistence. Author: Alejandro Ortuno, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"dfe8b941-4e54-4242-b674-6b613d521962","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Startup Items","query":"(file.path:*\\/Library\\/StartupItems\\/* AND file.path:*.plist)","meta":{"from":"1m"},"severity":"low","tags":["Privilege Escalation","T1037"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1037","name":"Boot or Logon Initialization Scripts","reference":"https://attack.mitre.org/techniques/T1037"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1037","name":"Boot or Logon Initialization Scripts","reference":"https://attack.mitre.org/techniques/T1037"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
