{"description": "Detects the creation of an \"lsass.dmp\" file by the taskmgr process. This indicates a manual dumping of the LSASS.exe process memory using Windows Task Manager.", "author": ["Swachchhanda Shrawan Poudel"], "enabled": false, "false_positives": ["Rare case of troubleshooting by an administrator or support that has to be investigated regardless"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "69ca12af-119d-44ed-b50f-a47af0ebc364", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "LSASS Process Memory Dump Creation Via Taskmgr.EXE", "query": "(event.category:file AND process.executable:(/.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Tt][Aa][Ss][Kk][Mm][Gg][Rr]\\.[Ee][Xx][Ee]/) AND file.path:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND file.path:/.*\\\\[Ll][Ss][Aa][Ss][Ss].*/ AND file.path:/.*\\.[Dd][Mm][Pp].*/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/987e3ca988ae3cff4b9f6e388c139c05bf44bbb8/atomics/T1003.001/T1003.001.md#L1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
