{"description": "Detects creation of files with the \".pub\" extension in suspicious or uncommon locations. This could be a sign of attackers abusing Publisher documents", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage of \".pub\" files from those locations"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d0a7b141-c50c-e7d2-b432-330160c52dea", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Publisher Attachment File Dropped In Suspicious Location", "query": "(file.path.text:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *C\\:\\\\Temp\\\\*) AND file.path.text:*.pub)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/EmericNasi/status/1623224526220804098"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
