{"description": "Detects potential persistence activity via startup add-ins that load when Microsoft Office starts (.wll/.xll are simply .dll fit for Word or Excel).", "author": ["NVISO"], "enabled": false, "false_positives": ["Legitimate add-ins"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ef90503e-db06-6c0a-9452-41e3df418f2b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Microsoft Office Add-In", "query": "(((file.path.text:*\\\\Microsoft\\\\Word\\\\Startup\\\\* AND file.path.text:*.wll)) OR ((file.path.text:*\\\\Microsoft\\\\Excel\\\\Startup\\\\* AND file.path.text:*.xll)) OR ((file.path.text:*Microsoft\\\\Excel\\\\XLSTART\\\\* AND file.path.text:*.xlam)) OR ((file.path.text:*\\\\Microsoft\\\\Addins\\\\* AND file.path.text:(*.xlam OR *.xla OR *.ppam))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["Internal Research", "https://labs.withsecure.com/publications/add-in-opportunities-for-office-persistence", "https://github.com/redcanaryco/atomic-red-team/blob/4ae9580a1a8772db87a1b6cdb0d03e5af231e966/atomics/T1137.006/T1137.006.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
