{"description": "Detects Windows shells and scripting applications that write files to suspicious folders", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1277f594-a7d1-4f28-a2d3-73af5cbeab43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Shell/Scripting Application File Write to Suspicious Folder", "query": "(((process.executable.text:(\"*\\\\bash.exe\" OR \"*\\\\cmd.exe\" OR \"*\\\\cscript.exe\" OR \"*\\\\msbuild.exe\" OR \"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\" OR \"*\\\\sh.exe\" OR \"*\\\\wscript.exe\") AND file.path.text:(\"C\\:\\\\PerfLogs\\\\*\" OR \"C\\:\\\\Users\\\\Public\\\\*\"))) OR ((process.executable.text:(\"*\\\\certutil.exe\" OR \"*\\\\forfiles.exe\" OR \"*\\\\mshta.exe\" OR \"*\\\\schtasks.exe\" OR \"*\\\\scriptrunner.exe\" OR \"*\\\\wmic.exe\") AND file.path.text:(\"*C\\:\\\\PerfLogs\\\\*\" OR \"*C\\:\\\\Users\\\\Public\\\\*\" OR \"*C\\:\\\\Windows\\\\Temp\\\\*\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
