{"description": "Detects creation of the Process Monitor driver by processes other than Process Monitor (procmon) itself.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Some false positives may occur with legitimate renamed process monitor binaries"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a05baa88-e922-4001-bc4d-8738135f27de", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Process Monitor Driver Creation By Non-Sysinternals Binary", "query": "((file.path.text:\"*\\\\procmon*\" AND file.path.text:\"*.sys\") AND (NOT process.executable.text:(\"*\\\\procmon.exe\" OR \"*\\\\procmon64.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
