{"description": "Detects the creation of new files with the \".evtx\" extension in non-common locations. Which could indicate tampering with default evtx locations in order to evade security controls", "author": ["D3F7A5105"], "enabled": false, "false_positives": ["Admin activity", "Backup activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6c3fa7ff-e812-c0f3-5375-79322a8b3fae", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "EVTX Created In Uncommon Location", "query": "(file.path.text:*.evtx AND (NOT (((file.path.text:C\\:\\\\Windows\\\\System32\\\\winevt\\\\Logs\\\\*)) OR ((file.path.text:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\\\Containers\\\\BaseImages\\\\* AND file.path.text:*\\\\Windows\\\\System32\\\\winevt\\\\Logs\\\\)) OR ((process.executable.text:(\"C:\\Windows\\explorer.exe\" OR \"C:\\Windows\\system32\\dllhost.exe\"))))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
