{"description": "Detects the creation of the LiveKD driver by a process image other than \"livekd.exe\".", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Administrators might rename LiveKD before its usage which could trigger this. Add additional names you use to the filter"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "059c5af9-5131-4d8d-92b2-de4ad6146712", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "LiveKD Driver Creation By Uncommon Process", "query": "(file.path.text:\"C:\\Windows\\System32\\drivers\\LiveKdD.SYS\" AND (NOT process.executable.text:(\"*\\\\livekd.exe\" OR \"*\\\\livek64.exe\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
