{"description": "Detects creation of files with the \".one\" extension in suspicious or uncommon locations. This could be a sign of attackers abusing OneNote attachments", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate usage of \".one\" files from those locations add-ins"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7fd164ba-126a-4d9c-9392-0d4f7c243df0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "OneNote Attachment File Dropped In Suspicious Location", "query": "(file.path.text:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *C\\:\\\\Temp\\\\*) AND file.path.text:*.one)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/", "https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
