{"description": "Detects the creation of binaries in the WinSxS folder by non-system processes", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "34746e8c-5fb8-415a-b135-0abc167e912a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WinSxS Executable File Creation By Non-System Process", "query": "((file.path.text:\"C\\:\\\\Windows\\\\WinSxS\\\\*\" AND file.path.text:\"*.exe\") AND (NOT process.executable.text:(\"C\\:\\\\Windows\\\\Systems32\\\\*\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\*\" OR \"C\\:\\\\Windows\\\\WinSxS\\\\*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://media.defense.gov/2023/May/09/2003218554/-1/-1/0/JOINT_CSA_HUNTING_RU_INTEL_SNAKE_MALWARE_20230509.PDF"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
