{"description": "Detects default filenames output from the execution of CrackMapExec and Impacket-secretsdump against an endpoint.", "author": ["SecurityAura"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b39356ea-0161-2bce-aa1c-44bd702c3c82", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Remote Credential Dumping Activity", "query": "(process.executable.text:*\\\\svchost.exe AND (file.path.text:/\\/ OR file.path.text:/\\/ OR file.path.text:/W/ OR file.path.text:/i/ OR file.path.text:/n/ OR file.path.text:/d/ OR file.path.text:/o/ OR file.path.text:/w/ OR file.path.text:/s/ OR file.path.text:/\\/ OR file.path.text:/\\/ OR file.path.text:/S/ OR file.path.text:/y/ OR file.path.text:/s/ OR file.path.text:/t/ OR file.path.text:/e/ OR file.path.text:/m/ OR file.path.text:/3/ OR file.path.text:/2/ OR file.path.text:/\\/ OR file.path.text:/\\/ OR file.path.text:/[/ OR file.path.text:/a/ OR file.path.text:/-/ OR file.path.text:/z/ OR file.path.text:/A/ OR file.path.text:/-/ OR file.path.text:/Z/ OR file.path.text:/0/ OR file.path.text:/-/ OR file.path.text:/9/ OR file.path.text:/]/ OR file.path.text:/{/ OR file.path.text:/8/ OR file.path.text:/}/ OR file.path.text:/\\/ OR file.path.text:/./ OR file.path.text:/t/ OR file.path.text:/m/ OR file.path.text:/p/ OR file.path.text:/$/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/Porchetta-Industries/CrackMapExec", "https://github.com/SecureAuthCorp/impacket/blob/master/examples/secretsdump.py"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
