{"description": "Detects the presence of unicode characters which are homoglyphs, or identical in appearance, to ASCII letter characters.\nThis is used as an obfuscation and masquerading techniques. Only \"perfect\" homoglyphs are included; these are characters that\nare indistinguishable from ASCII characters and thus may make excellent candidates for homoglyph attack characters.\n", "author": ["Micah Babinski", "@micahbabinski"], "enabled": false, "false_positives": ["File names with legitimate Cyrillic text. Will likely require tuning (or not be usable) in countries where these alphabets are in use."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4f1707b1-b50b-45b4-b5a2-3978b5a5d0d6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Homoglyph Attack Using Lookalike Characters in Filename", "query": "((file.path.text:(\"*\u0410*\" OR \"*\u0412*\" OR \"*\u0415*\" OR \"*\u041a*\" OR \"*\u041c*\" OR \"*\u041d*\" OR \"*\u041e*\" OR \"*\u0420*\" OR \"*\u0421*\" OR \"*\u0422*\" OR \"*\u0425*\" OR \"*\u0405*\" OR \"*\u0406*\" OR \"*\u0408*\" OR \"*\u04ae*\" OR \"*\u04c0*\" OR \"*\u050c*\" OR \"*\u051a*\" OR \"*\u051c*\" OR \"*\u0391*\" OR \"*\u0392*\" OR \"*\u0395*\" OR \"*\u0396*\" OR \"*\u0397*\" OR \"*\u0399*\" OR \"*\u039a*\" OR \"*\u039c*\" OR \"*\u039d*\" OR \"*\u039f*\" OR \"*\u03a1*\" OR \"*\u03a4*\" OR \"*\u03a5*\" OR \"*\u03a7*\")) OR (file.path.text:(\"*\u0430*\" OR \"*\u0435*\" OR \"*\u043e*\" OR \"*\u0440*\" OR \"*\u0441*\" OR \"*\u0445*\" OR \"*\u0455*\" OR \"*\u0456*\" OR \"*\u04cf*\" OR \"*\u0458*\" OR \"*\u04bb*\" OR \"*\u0501*\" OR \"*\u051b*\" OR \"*\u051d*\" OR \"*\u03bf*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1036", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}, {"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://redcanary.com/threat-detection-report/threats/socgholish/#threat-socgholish", "http://www.irongeek.com/homoglyph-attack-generator.php"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
