{"description": "Detects potential DLL hijack of \"iertutil.dll\" found in the DCOM InternetExplorer.Application Class over the network", "author": ["Roberto Rodriguez @Cyb3rWard0g", "Open Threat Research (OTR)", "wagga"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f00dd8cb-7312-59f0-4321-b6767c4c5e9f", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Potential DCOM InternetExplorer.Application DLL Hijack", "query": "(process.executable.text:\"System\" AND file.path.text:*\\\\Internet\\ Explorer\\\\iertutil.dll)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Lateral Movement", "T1021", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}, {"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
