{"description": "Detects Rclone config files being created", "author": ["Aaron Greetham (@beardofbinary) - NCC Group"], "enabled": false, "false_positives": ["Legitimate Rclone usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "34986307-b7f4-49be-92f3-e7a4d01ac5db", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rclone Config File Creation", "query": "(file.path.text:\"*\\:\\\\Users\\\\*\" AND file.path.text:\"*\\\\.config\\\\rclone\\\\*\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
