{"description": "Detects the creation of files created by mimikatz such as \".kirbi\", \"mimilsa.log\", etc.", "author": ["Florian Roth (Nextron Systems)", "David ANDRE"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9e099d99-44c2-42b6-a6d8-54c3545cab29", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Mimikatz Kirbi File Creation", "query": "file.path.text:(\"*.kirbi\" OR \"*mimilsa.log\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://cobalt.io/blog/kerberoast-attack-techniques", "https://pentestlab.blog/2019/10/21/persistence-security-support-provider/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
