{"description": "Detects the creation of a new PowerShell module in the first folder of the module directory structure \"\\WindowsPowerShell\\Modules\\malware\\malware.psm1\". This is somewhat an uncommon practice as legitimate modules often includes a version folder.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positive rate will vary depending on the environments. Additional filters might be required to make this logic usable in production."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e8a52bbd-bced-459f-bd93-64db45ce7657", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Suspicious PowerShell Module File Created", "query": "file.path.text:(\"*\\\\WindowsPowerShell\\\\Modules\\\\\\*\\\\.ps\" OR \"*\\\\WindowsPowerShell\\\\Modules\\\\\\*\\\\.dll\")", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://learn.microsoft.com/en-us/powershell/scripting/developer/module/understanding-a-windows-powershell-module?view=powershell-7.3"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
