{"description": "Detects the creation of the default output filename used by the wmiexec tool", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8d5aca11-22b3-4f22-b7ba-90e60533e1fb", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Wmiexec Default Output File", "query": "(((file.path:/\\\\Windows\\\\__1\\d{9}\\.\\d{1,7}$/)) OR ((file.path:/C:\\\\__1\\d{9}\\.\\d{1,7}$/)) OR ((file.path:/D:\\\\__1\\d{9}\\.\\d{1,7}$/)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Lateral Movement", "T1047"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.crowdstrike.com/blog/how-to-detect-and-prevent-impackets-wmiexec/", "https://github.com/fortra/impacket/blob/f4b848fa27654ca95bc0f4c73dbba8b9c2c9f30a/examples/wmiexec.py"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
