{"description": "Detects the creation of an executable by another executable", "author": ["frack113"], "enabled": false, "false_positives": ["Software installers", "Update utilities", "32bit applications launching their 64bit versions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8079ca14-9a43-b922-a536-72b60980095b", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Creation of an Executable by an Executable", "query": "((process.executable.text:*.exe AND file.path.text:*.exe) AND (NOT ((process.executable.text:(\"C:\\Windows\\System32\\msiexec.exe\" OR \"C:\\Windows\\system32\\cleanmgr.exe\" OR \"C:\\Windows\\explorer.exe\" OR \"C:\\WINDOWS\\system32\\dxgiadaptercache.exe\" OR \"C:\\WINDOWS\\system32\\Dism.exe\" OR \"C:\\Windows\\System32\\wuauclt.exe\")) OR ((process.executable.text:\"C:\\WINDOWS\\system32\\svchost.exe\" AND file.path.text:C\\:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\*)) OR ((process.executable.text:\"C:\\Windows\\system32\\svchost.exe\" AND file.path.text:*\\:\\\\WUDownloadCache\\\\* AND file.path.text:*\\\\WindowsUpdateBox.exe*)) OR ((process.executable.text:C\\:\\\\WINDOWS\\\\SoftwareDistribution\\\\Download\\\\* AND process.executable.text:*\\\\WindowsUpdateBox.Exe AND file.path.text:C\\:\\\\$WINDOWS.\\~BT\\\\Sources\\\\*)) OR ((process.executable.text:C\\:\\\\Windows\\\\WinSxS\\\\* AND process.executable.text:*\\\\TiWorker.exe)) OR (((process.executable.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (file.path.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)))) OR (process.executable.text:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\*) OR (file.path.text:*\\\\Microsoft\\\\WindowsApps\\\\*) OR ((process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\Update.exe AND file.path.text:C\\:\\\\Users\\\\* AND file.path.text:(*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\stage\\\\Teams.exe OR *\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\stage\\\\Squirrel.exe OR *\\\\AppData\\\\Local\\\\Microsoft\\\\SquirrelTemp\\\\tempb\\\\))) OR ((process.executable.text:C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\* AND process.executable.text:*\\\\mscorsvw.exe AND file.path.text:C\\:\\\\Windows\\\\assembly\\\\NativeImages_*)) OR ((process.executable.text:C\\:\\\\Users\\\\* AND process.executable.text:*\\\\AppData\\\\Local\\\\* AND process.executable.text:*\\\\Microsoft\\ VS\\ Code\\\\Code.exe AND file.path.text:*\\\\.vscode\\\\extensions\\\\*)) OR ((process.executable.text:*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\Update.exe AND file.path.text:*\\\\AppData\\\\Local\\\\SquirrelTemp\\\\*)))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Resource Development", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1587", "name": "Develop Capabilities", "reference": "https://attack.mitre.org/techniques/T1587"}]}], "version": 1, "references": ["Malware Sandbox"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
