{"description": "Detects the creation of suspicious files and folders inside the user's AppData folder but not inside any of the common and well known directories (Local, Romaing, LocalLow). This method could be used as a method to bypass detection who exclude the AppData folder in fear of FPs", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d7fc52c6-8419-3824-9f0b-a6f50fadb9d3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Creation Suspicious File In Uncommon AppData Folder", "query": "((file.path.text:*\\\\AppData\\\\* AND file.path.text:(*.exe OR *.dll OR *.bat OR *.vbe OR *.vbs OR *.msi OR *.iso OR *.lnk OR *.cmd OR *.ps1 OR *.psm1 OR *.hta OR *.cpl OR *.scr)) AND (NOT (file.path.text:(*\\\\AppData\\\\Local\\\\* OR *\\\\AppData\\\\LocalLow\\\\* OR *\\\\AppData\\\\Roaming\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
