{"description": "Detects the creation of a new PowerShell module \".psm1\", \".psd1\", \".dll\", \".ps1\", etc.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Likely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e36941d0-c0f0-443f-bc6f-cb2952eb69ea", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PowerShell Module File Created", "query": "(process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\") AND file.path.text:(\"*\\\\WindowsPowerShell\\\\Modules\\\\*\" OR \"*\\\\PowerShell\\\\7\\\\Modules\\\\*\"))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research", "https://learn.microsoft.com/en-us/powershell/scripting/developer/module/understanding-a-windows-powershell-module?view=powershell-7.3"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
