{"description": "Detects creation of Microsoft Office files inside of one of the default startup folders in order to achieve persistence.", "author": ["Max Altgelt (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Loading a user environment from a backup or a domain controller", "Synchronization of templates"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0e20c89d-2264-44ae-8238-aeeaba609ece", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Microsoft Office Startup Folder", "query": "((((((file.path.text:\"*\\\\Microsoft\\\\Word\\\\STARTUP*\") OR ((file.path.text:\"*\\\\Office*\" AND file.path.text:\"*\\\\Program\\ Files*\" AND file.path.text:\"*\\\\STARTUP*\"))) AND file.path.text:(\"*.doc\" OR \"*.docm\" OR \"*.docx\" OR \"*.dot\" OR \"*.dotm\" OR \"*.rtf\"))) OR ((((file.path.text:\"*\\\\Microsoft\\\\Excel\\\\XLSTART*\") OR ((file.path.text:\"*\\\\Office*\" AND file.path.text:\"*\\\\Program\\ Files*\" AND file.path.text:\"*\\\\XLSTART*\"))) AND file.path.text:(\"*.xls\" OR \"*.xlsm\" OR \"*.xlsx\" OR \"*.xlt\" OR \"*.xltm\")))) AND (NOT process.executable.text:(\"*\\\\WINWORD.exe\" OR \"*\\\\EXCEL.exe\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://insight-jp.nttsecurity.com/post/102hojk/operation-restylink-apt-campaign-targeting-japanese-companies", "https://learn.microsoft.com/en-us/office/troubleshoot/excel/use-startup-folders"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
