{"description": "Detects creation of Microsoft Office files inside of one of the default startup folders in order to achieve persistence.", "author": ["Max Altgelt (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Loading a user environment from a backup or a domain controller", "Synchronization of templates"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0e20c89d-2264-44ae-8238-aeeaba609ece", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Microsoft Office Startup Folder", "query": "((((((file.path:/.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Oo][Rr][Dd]\\\\\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/) OR ((file.path:/.*\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ AND file.path:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/ AND file.path:/.*\\\\\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/))) AND file.path:(/.*\\.[Dd][Oo][Cc]/ OR /.*\\.[Dd][Oo][Cc][Mm]/ OR /.*\\.[Dd][Oo][Cc][Xx]/ OR /.*\\.[Dd][Oo][Tt]/ OR /.*\\.[Dd][Oo][Tt][Mm]/ OR /.*\\.[Rr][Tt][Ff]/))) OR ((((file.path:/.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\\\\\\\[Xx][Ll][Ss][Tt][Aa][Rr][Tt].*/) OR ((file.path:/.*\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ AND file.path:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/ AND file.path:/.*\\\\\\\\[Xx][Ll][Ss][Tt][Aa][Rr][Tt].*/))) AND file.path:(/.*\\.[Xx][Ll][Ss]/ OR /.*\\.[Xx][Ll][Ss][Mm]/ OR /.*\\.[Xx][Ll][Ss][Xx]/ OR /.*\\.[Xx][Ll][Tt]/ OR /.*\\.[Xx][Ll][Tt][Mm]/)))) AND (NOT process.executable:(/.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://insight-jp.nttsecurity.com/post/102hojk/operation-restylink-apt-campaign-targeting-japanese-companies", "https://learn.microsoft.com/en-us/office/troubleshoot/excel/use-startup-folders"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
