{"description": "Detects file write event from/to a fake recycle bin folder that is often used as a staging directory for malware", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious File Creation Activity From Fake Recycle.Bin Folder", "query": "((process.executable:(/.*\\:\\\\\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr][Ss]\\.[Bb][Ii][Nn]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr]\\.[Bb][Ii][Nn]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]\\\\\\\\.*/)) OR (file.path:(/.*\\:\\\\\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr][Ss]\\.[Bb][Ii][Nn]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee][Rr]\\.[Bb][Ii][Nn]\\\\\\\\.*/ OR /.*\\:\\\\\\\\[Rr][Ee][Cc][Yy][Cc][Ll][Ee]\\.[Bb][Ii][Nn]\\\\\\\\.*/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.mandiant.com/resources/blog/infected-usb-steal-secrets"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
