{"description": "Detects the creation of a file with an uncommon extension in an Office application startup folder", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Other legitimate extensions used by either excel or word"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a10a2c40-2c4d-49f8-b557-1a946bc55d9d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Uncommon File Created In Office Startup Folder", "query": "((((((file.path:/.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ww][Oo][Rr][Dd]\\\\\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/) OR ((file.path:/.*\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ AND file.path:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/ AND file.path:/.*\\\\\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/))) AND (NOT file.path:(/.*\\.[Dd][Oo][Cc][Bb]/ OR /.*\\.[Dd][Oo][Cc][Mm]/ OR /.*\\.[Dd][Oo][Cc][Xx]/ OR /.*\\.[Dd][Oo][Tt][Mm]/ OR /.*\\.[Pp][Dd][Ff]/ OR /.*\\.[Ww][Ll][Ll]/ OR /.*\\.[Ww][Ww][Ll]/)))) OR ((((file.path:/.*\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\\\\\\\[Xx][Ll][Ss][Tt][Aa][Rr][Tt].*/) OR ((file.path:/.*\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ AND file.path:/.*\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss].*/ AND file.path:/.*\\\\\\\\[Xx][Ll][Ss][Tt][Aa][Rr][Tt].*/))) AND (NOT file.path:(/.*\\.[Xx][Ll][Ss]/ OR /.*\\.[Xx][Ll][Ss][Mm]/ OR /.*\\.[Xx][Ll][Ss][Xx]/ OR /.*\\.[Xx][Ll][Tt]/ OR /.*\\.[Xx][Ll][Tt][Mm]/ OR /.*\\.[Xx][Ll][Ll]/ OR /.*\\.[Xx][Ll][Ww]/))))) AND (NOT (((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\.*/) AND process.executable:(/.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Resource Development", "T1587"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1587", "name": "Develop Capabilities", "reference": "https://attack.mitre.org/techniques/T1587"}]}], "version": 1, "references": ["https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/", "http://addbalance.com/word/startup.htm", "https://answers.microsoft.com/en-us/msoffice/forum/all/document-in-word-startup-folder-doesnt-open-when/44ab0932-2917-4150-8cdc-2f2cf39e86f3", "https://en.wikipedia.org/wiki/List_of_Microsoft_Office_filename_extensions"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
