{"description": "Detects the creation of a file that has the same name as the default LiveKD kernel memory dump.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["In rare occasions administrators might leverage LiveKD to perform live kernel debugging. This should not be allowed on production systems. Investigate and apply additional filters where necessary."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "814ddeca-3d31-4265-8e07-8cc54fb44903", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "LiveKD Kernel Memory Dump File Created", "query": "file.path.text:\"C:\\Windows\\livekd.dmp\"", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
