{"description": "Detects the creation of a new office macro files on the systems via an application (browser, mail client).", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate macro files downloaded from the internet", "Legitimate macro files sent as attachments via emails"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0e29e3a7-1ad8-40aa-b691-9f82ecd33d66", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Office Macro File Download", "query": "(process.executable.text:(\"*\\\\RuntimeBroker.exe\" OR \"*\\\\outlook.exe\" OR \"*\\\\thunderbird.exe\" OR \"*\\\\brave.exe\" OR \"*\\\\chrome.exe\" OR \"*\\\\firefox.exe\" OR \"*\\\\iexplore.exe\" OR \"*\\\\maxthon.exe\" OR \"*\\\\MicrosoftEdge.exe\" OR \"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\" OR \"*\\\\opera.exe\" OR \"*\\\\safari.exe\" OR \"*\\\\seamonkey.exe\" OR \"*\\\\vivaldi.exe\" OR \"*\\\\whale.exe\") AND ((file.path.text:(\"*.docm\" OR \"*.dotm\" OR \"*.xlsm\" OR \"*.xltm\" OR \"*.potm\" OR \"*.pptm\")) OR (file.path.text:(\"*.docm\\:Zone*\" OR \"*.dotm\\:Zone*\" OR \"*.xlsm\\:Zone*\" OR \"*.xltm\\:Zone*\" OR \"*.potm\\:Zone*\" OR \"*.pptm\\:Zone*\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "T1566"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1566", "name": "Phishing", "reference": "https://attack.mitre.org/techniques/T1566"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md", "https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
