{"description": "Detects creation of files which are the results of executing the built-in reconnaissance script \"C:\\Windows\\System32\\gatherNetworkInfo.vbs\".", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f92a6f1e-a512-4a15-9735-da09e78d7273", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "GatherNetworkInfo.VBS Reconnaissance Script Output", "query": "(file.path.text:C\\:\\\\Windows\\\\System32\\\\config* AND file.path.text:(*\\\\Hotfixinfo.txt OR *\\\\netiostate.txt OR *\\\\sysportslog.txt OR *\\\\VmSwitchLog.evtx))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs", "https://www.mandiant.com/resources/blog/trojanized-windows-installers-ukrainian-government"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
