{"description": "Detects the creation of screensaver files (.scr) outside of system folders. Attackers may execute an application as an \".SCR\" file using \"rundll32.exe desk.cpl,InstallScreenSaver\" for example.", "author": ["Christopher Peacock @securepeacock", "SCYTHE @scythe_io"], "enabled": false, "false_positives": ["The installation of new screen savers by third party software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c048f047-7e2a-4888-b302-55f509d4a91d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "SCR File Write Event", "query": "(file.path.text:\"*.scr\" AND (NOT file.path.text:(\"C\\:\\\\$WINDOWS.\\~BT\\\\NewOS\\\\*\" OR \"C\\:\\\\Windows\\\\System32\\\\*\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\*\" OR \"C\\:\\\\Windows\\\\WinSxS\\\\*\" OR \"\\:\\\\WUDownloadCache\\\\*\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Libraries/Desk/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
