{"description": "Detects the creation of files with an executable or script extension by an Office application.", "author": ["Vadim Khrykov (ThreatIntel)", "Cyb3rEng (Rule)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c7a74c80-ba5a-486e-9974-ab9e682bc5e4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File With Uncommon Extension Created By An Office Application", "query": "(((process.executable:(/.*\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Aa][Cc][Cc][Ee][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Pp][Uu][Bb]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Vv][Ii][Ss][Ii][Oo]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/) AND file.path:(/.*\\.[Bb][Aa][Tt]/ OR /.*\\.[Cc][Mm][Dd]/ OR /.*\\.[Cc][Oo][Mm]/ OR /.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Ee][Xx][Ee]/ OR /.*\\.[Hh][Tt][Aa]/ OR /.*\\.[Oo][Cc][Xx]/ OR /.*\\.[Pp][Rr][Oo][Jj]/ OR /.*\\.[Pp][Ss]1/ OR /.*\\.[Ss][Cc][Ff]/ OR /.*\\.[Ss][Cc][Rr]/ OR /.*\\.[Ss][Yy][Ss]/ OR /.*\\.[Vv][Bb][Ee]/ OR /.*\\.[Vv][Bb][Ss]/ OR /.*\\.[Ww][Ss][Ff]/ OR /.*\\.[Ww][Ss][Hh]/)) AND (NOT (file.path:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Aa][Ss][Ss][Ee][Mm][Bb][Ll][Yy]\\\\\\\\[Tt][Mm][Pp]\\\\\\\\.*/ AND file.path:/.*\\.[Dd][Ll][Ll]/))) AND (NOT (((file.path:/.*[Cc]\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND file.path:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\.*/ AND file.path:/.*\\\\\\\\[Ww][Ee][Bb][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Cc][Aa][Cc][Hh][Ee]\\\\\\\\[Aa][Ll][Ll][Uu][Ss][Ee][Rr][Ss].*/ AND file.path:/.*\\.[Cc][Oo][Mm]/)) OR ((process.executable:/.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ AND file.path:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\[Ww][Ee][Bb][Ee][Xx][Dd][Ee][Ll][Tt][Aa]\\\\\\\\.*/ AND file.path:(/.*\\.[Dd][Ll][Ll]/ OR /.*\\.[Ee][Xx][Ee]/))))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/", "https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
