{"description": "Detects msdt.exe creating files in suspicious directories which could be a sign of exploitation of either Follina or Dogwalk vulnerabilities", "author": ["Vadim Varganov", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "318557a5-150c-4c8d-b70e-a9910e199857", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "File Creation In Suspicious Directory By Msdt.EXE", "query": "(process.executable.text:\"*\\\\msdt.exe\" AND file.path.text:(\"*\\\\Desktop\\\\*\" OR \"*\\\\Start\\ Menu\\\\Programs\\\\Startup\\\\*\" OR \"*C\\:\\\\PerfLogs\\\\*\" OR \"*C\\:\\\\ProgramData\\\\*\" OR \"*C\\:\\\\Users\\\\Public\\\\*\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd", "https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
