{"description": "Detects the creation of the LiveKD driver, which is used for live kernel debugging", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate usage of LiveKD for debugging purposes will also trigger this"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "16fe46bb-4f64-46aa-817d-ff7bec4a2352", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "LiveKD Driver Creation", "query": "(file.path.text:\"C:\\Windows\\System32\\drivers\\LiveKdD.SYS\" AND process.executable.text:(\"*\\\\livekd.exe\" OR \"*\\\\livek64.exe\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
