{"description": "Detects the creation of an executable with a system process name in folders other than the system ones (System32, SysWOW64...etc).", "enabled": false, "false_positives": ["System processes copied outside their default folders for testing purposes", "Third party software naming their software with the same names as the processes mentioned here"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "97e15fca-1487-ded8-d69c-8392de1332ff", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Files With System Process Name In Unsuspected Locations", "query": "(file.path.text:(*\\\\AtBroker.exe OR *\\\\audiodg.exe OR *\\\\backgroundTaskHost.exe OR *\\\\bcdedit.exe OR *\\\\bitsadmin.exe OR *\\\\cmdl32.exe OR *\\\\cmstp.exe OR *\\\\conhost.exe OR *\\\\csrss.exe OR *\\\\dasHost.exe OR *\\\\dfrgui.exe OR *\\\\dllhost.exe OR *\\\\dwm.exe OR *\\\\eventcreate.exe OR *\\\\eventvwr.exe OR *\\\\explorer.exe OR *\\\\extrac32.exe OR *\\\\fontdrvhost.exe OR *\\\\ipconfig.exe OR *\\\\iscsicli.exe OR *\\\\iscsicpl.exe OR *\\\\logman.exe OR *\\\\LogonUI.exe OR *\\\\LsaIso.exe OR *\\\\lsass.exe OR *\\\\lsm.exe OR *\\\\msiexec.exe OR *\\\\msinfo32.exe OR *\\\\mstsc.exe OR *\\\\nbtstat.exe OR *\\\\odbcconf.exe OR *\\\\powershell.exe OR *\\\\pwsh.exe OR *\\\\regini.exe OR *\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\RuntimeBroker.exe OR *\\\\schtasks.exe OR *\\\\SearchFilterHost.exe OR *\\\\SearchIndexer.exe OR *\\\\SearchProtocolHost.exe OR *\\\\SecurityHealthService.exe OR *\\\\SecurityHealthSystray.exe OR *\\\\services.exe OR *\\\\ShellAppRuntime.exe OR *\\\\sihost.exe OR *\\\\smartscreen.exe OR *\\\\smss.exe OR *\\\\spoolsv.exe OR *\\\\svchost.exe OR *\\\\SystemSettingsBroker.exe OR *\\\\taskhost.exe OR *\\\\taskhostw.exe OR *\\\\Taskmgr.exe OR *\\\\TiWorker.exe OR *\\\\vssadmin.exe OR *\\\\w32tm.exe OR *\\\\WerFault.exe OR *\\\\WerFaultSecure.exe OR *\\\\wermgr.exe OR *\\\\wevtutil.exe OR *\\\\wininit.exe OR *\\\\winlogon.exe OR *\\\\winrshost.exe OR *\\\\WinRTNetMUAHostServer.exe OR *\\\\wlanext.exe OR *\\\\wlrmdr.exe OR *\\\\WmiPrvSE.exe OR *\\\\wslhost.exe OR *\\\\WSReset.exe OR *\\\\WUDFHost.exe OR *\\\\WWAHost.exe) AND (NOT ((file.path.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\* OR C\\:\\\\Windows\\\\WinSxS\\\\* OR C\\:\\\\Windows\\\\SoftwareDistribution\\\\* OR \\\\SystemRoot\\\\System32\\\\*) AND process.executable.text:(*\\\\Windows\\\\System32\\\\dism.exe OR *\\\\TiWorker.exe)) OR (file.path.text:C\\:\\\\$WINDOWS.\\~BT\\\\* AND process.executable.text:\"C\\:\\\\$WINDOWS.\\~BT\\\\Sources\\\\SetupHost.exe\") OR (file.path.text:*\\\\RuntimeBroker.exe AND process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\wbengine.exe\") OR (process.executable.text:*\\:\\\\Windows\\\\system32\\\\svchost.exe AND file.path.text:C\\:\\\\Windows\\\\SoftwareDistribution\\\\Download\\\\* AND file.path.text:(*\\\\spoolsv.exe OR *\\\\bcdedit.exe)) OR (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\wuauclt.exe\") OR (file.path.text:\"C\\:\\\\Windows\\\\explorer.exe\") OR (process.executable.text:\"C\\:\\\\WINDOWS\\\\system32\\\\msiexec.exe\" AND file.path.text:\"C\\:\\\\Program\\ Files\\\\PowerShell\\\\7\\\\pwsh.exe\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1036"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1036", "name": "Masquerading", "reference": "https://attack.mitre.org/techniques/T1036"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Sander Wiebing", "Tim Shelton", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
