{"description": "Detects PowerShell creating a PowerShell file (.ps1). While often times this behavior is benign, sometimes it can be a sign of a dropper script trying to achieve persistence.", "author": ["frack113"], "enabled": false, "false_positives": ["False positives will differ depending on the environement and scripts used. Apply additional filters accordingly."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "576426ad-0131-4001-ae01-be175da0c108", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PowerShell Script Dropped Via PowerShell.EXE", "query": "((process.executable.text:(\"*\\\\powershell.exe\" OR \"*\\\\pwsh.exe\") AND file.path.text:\"*.ps1\") AND (NOT ((file.path.text:\"*__PSScriptPolicyTest_*\") OR ((file.path.text:\"C\\:\\\\Users\\\\*\" AND file.path.text:\"*\\\\AppData\\\\Local\\\\Temp\\\\*\")) OR (file.path.text:\"C\\:\\\\Windows\\\\Temp\\\\*\"))))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
