{"description": "Detects Rclone config file being created", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fccfb43e-09a7-4bd2-8b37-a5a7df33386d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RDP File Creation From Suspicious Application", "query": "(process.executable.text:(\"*\\\\brave.exe\" OR \"*\\\\CCleaner\\ Browser\\\\Application\\\\CCleanerBrowser.exe\" OR \"*\\\\chromium.exe\" OR \"*\\\\firefox.exe\" OR \"*\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\" OR \"*\\\\iexplore.exe\" OR \"*\\\\microsoftedge.exe\" OR \"*\\\\msedge.exe\" OR \"*\\\\Opera.exe\" OR \"*\\\\Vivaldi.exe\" OR \"*\\\\Whale.exe\" OR \"*\\\\Outlook.exe\" OR \"*\\\\RuntimeBroker.exe\" OR \"*\\\\Thunderbird.exe\" OR \"*\\\\Discord.exe\" OR \"*\\\\Keybase.exe\" OR \"*\\\\msteams.exe\" OR \"*\\\\Slack.exe\" OR \"*\\\\teams.exe\") AND file.path.text:\"*.rdp*\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/", "https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
