{"description": "Detects the creation of the \"PSScriptPolicyTest\" PowerShell script by an uncommon process. This file is usually generated by Microsoft Powershell to test against Applocker.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1027d292-dd87-4a1a-8701-2abe04d7783c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PSScriptPolicyTest Creation By Uncommon Process", "query": "(file.path.text:\"*__PSScriptPolicyTest_*\" AND (NOT process.executable.text:(\"*\\:\\\\Program\\ Files\\\\PowerShell\\\\7\\\\pwsh.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\dsac.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\ServerManager.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\" OR \"*\\:\\\\Windows\\\\System32\\\\wsmprovhost.exe\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell_ise.exe\" OR \"*\\:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
