{"description": "Detects when an user acount is locked or suspended.", "enabled": false, "false_positives": ["System may lock or suspend user accounts."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a717c561-d117-437e-b2d9-0118a7035d01", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "OneLogin User Account Locked", "query": "(event_type_id:\"532\" OR event_type_id:\"553\" OR event_type_id:\"551\")", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developers.onelogin.com/api-docs/1/events/event-resource/"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
