{"description": "Detects when an user assumed another user account.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "62fff148-278d-497e-8ecd-ad6083231a35", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "OneLogin User Assumed Another User", "query": "event_type_id:\"3\"", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://developers.onelogin.com/api-docs/1/events/event-resource"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
