{"description": "Detects the pattern of a pipe name as used by the tool EfsPotato", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "637f689e-b4a5-4a86-be0e-0100a0a33ba2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "EfsPotato Named Pipe", "query": "(file.name:(*\\\\pipe\\\\* OR *\\\\pipe\\\\srvsvc*) AND (NOT (file.name:*\\\\CtxShare*)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1429530155291193354?s=20", "https://github.com/zcgonvh/EfsPotato"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
