{"description": "Detects the creation of a named pipe matching a pattern used by CobaltStrike Malleable C2 profiles", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3b83df6a-22a7-f6b2-b59c-930ca4c2fa3d", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CobaltStrike Named Pipe Pattern Regex", "query": "(((file.name:/\\/ OR file.name:/\\/ OR file.name:/m/ OR file.name:/o/ OR file.name:/j/ OR file.name:/o/ OR file.name:/\\/ OR file.name:/./ OR file.name:/5/ OR file.name:/6/ OR file.name:/8/ OR file.name:/8/ OR file.name:/\\/ OR file.name:/./ OR file.name:/8/ OR file.name:/0/ OR file.name:/5/ OR file.name:/2/ OR file.name:/\\/ OR file.name:/./ OR file.name:/(/ OR file.name:/?/ OR file.name:/:/ OR file.name:/1/ OR file.name:/8/ OR file.name:/3/ OR file.name:/8/ OR file.name:/9/ OR file.name:/4/ OR file.name:/9/ OR file.name:/3/ OR file.name:/9/ OR file.name:/7/ OR file.name:/8/ OR file.name:/7/ OR file.name:/0/ OR file.name:/8/ OR file.name:/8/ OR file.name:/8/ OR file.name:/7/ OR file.name:/7/ OR file.name:/|/ OR file.name:/3/ OR file.name:/5/ OR file.name:/7/ OR file.name:/8/ OR file.name:/0/ OR file.name:/2/ OR file.name:/7/ OR file.name:/3/ OR file.name:/3/ OR file.name:/2/ OR file.name:/9/ OR file.name:/3/ OR file.name:/7/ OR file.name:/0/ OR file.name:/4/ OR file.name:/7/ OR file.name:/3/ OR file.name:/)/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/w/ OR file.name:/k/ OR file.name:/s/ OR file.name:/s/ OR file.name:/v/ OR file.name:/c/ OR file.name:/_/ OR file.name:/?/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/n/ OR file.name:/t/ OR file.name:/s/ OR file.name:/v/ OR file.name:/c/ OR file.name:/s/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/D/ OR file.name:/s/ OR file.name:/e/ OR file.name:/r/ OR file.name:/N/ OR file.name:/a/ OR file.name:/m/ OR file.name:/e/ OR file.name:/P/ OR file.name:/i/ OR file.name:/p/ OR file.name:/e/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/S/ OR file.name:/e/ OR file.name:/a/ OR file.name:/r/ OR file.name:/c/ OR file.name:/h/ OR file.name:/T/ OR file.name:/e/ OR file.name:/x/ OR file.name:/t/ OR file.name:/H/ OR file.name:/a/ OR file.name:/r/ OR file.name:/v/ OR file.name:/e/ OR file.name:/s/ OR file.name:/t/ OR file.name:/e/ OR file.name:/r/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/m/ OR file.name:/y/ OR file.name:/p/ OR file.name:/i/ OR file.name:/p/ OR file.name:/e/ OR file.name:/-/ OR file.name:/(/ OR file.name:/?/ OR file.name:/:/ OR file.name:/f/ OR file.name:/|/ OR file.name:/h/ OR file.name:/)/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/w/ OR file.name:/i/ OR file.name:/n/ OR file.name:/d/ OR file.name:/o/ OR file.name:/w/ OR file.name:/s/ OR file.name:/\\/ OR file.name:/./ OR file.name:/u/ OR file.name:/p/ OR file.name:/d/ OR file.name:/a/ OR file.name:/t/ OR file.name:/e/ OR file.name:/\\/ OR file.name:/./ OR file.name:/m/ OR file.name:/a/ OR file.name:/n/ OR file.name:/a/ OR file.name:/g/ OR file.name:/e/ OR file.name:/r/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/,/ OR file.name:/3/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/n/ OR file.name:/t/ OR file.name:/s/ OR file.name:/v/ OR file.name:/c/ OR file.name:/s/ OR file.name:/_/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/s/ OR file.name:/c/ OR file.name:/e/ OR file.name:/r/ OR file.name:/p/ OR file.name:/c/ OR file.name:/_/ OR file.name:/?/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/P/ OR file.name:/G/ OR file.name:/M/ OR file.name:/e/ OR file.name:/s/ OR file.name:/s/ OR file.name:/a/ OR file.name:/g/ OR file.name:/e/ OR file.name:/P/ OR file.name:/i/ OR file.name:/p/ OR file.name:/e/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/M/ OR file.name:/s/ OR file.name:/F/ OR file.name:/t/ OR file.name:/e/ OR file.name:/W/ OR file.name:/d/ OR file.name:/s/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/f/ OR file.name:/4/ OR file.name:/c/ OR file.name:/3/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/f/ OR file.name:/u/ OR file.name:/l/ OR file.name:/l/ OR file.name:/d/ OR file.name:/u/ OR file.name:/p/ OR file.name:/l/ OR file.name:/e/ OR file.name:/x/ OR file.name:/_/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/m/ OR file.name:/s/ OR file.name:/r/ OR file.name:/p/ OR file.name:/c/ OR file.name:/_/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/4/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/w/ OR file.name:/i/ OR file.name:/n/ OR file.name:/\\/ OR file.name:/\\/ OR file.name:/m/ OR file.name:/s/ OR file.name:/r/ OR file.name:/p/ OR file.name:/c/ OR file.name:/_/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/f/ OR file.name:/5/ OR file.name:/3/ OR file.name:/f/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/r/ OR file.name:/p/ OR file.name:/c/ OR file.name:/_/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/s/ OR file.name:/p/ OR file.name:/o/ OR file.name:/o/ OR file.name:/l/ OR file.name:/s/ OR file.name:/s/ OR file.name:/_/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/2/ OR file.name:/}/)) OR ((file.name:/\\/ OR file.name:/\\/ OR file.name:/W/ OR file.name:/i/ OR file.name:/n/ OR file.name:/s/ OR file.name:/o/ OR file.name:/c/ OR file.name:/k/ OR file.name:/2/ OR file.name:/\\/ OR file.name:/\\/ OR file.name:/C/ OR file.name:/a/ OR file.name:/t/ OR file.name:/a/ OR file.name:/l/ OR file.name:/o/ OR file.name:/g/ OR file.name:/C/ OR file.name:/h/ OR file.name:/a/ OR file.name:/n/ OR file.name:/g/ OR file.name:/e/ OR file.name:/L/ OR file.name:/i/ OR file.name:/s/ OR file.name:/t/ OR file.name:/e/ OR file.name:/n/ OR file.name:/e/ OR file.name:/r/ OR file.name:/-/ OR file.name:/[/ OR file.name:/0/ OR file.name:/-/ OR file.name:/9/ OR file.name:/a/ OR file.name:/-/ OR file.name:/f/ OR file.name:/]/ OR file.name:/{/ OR file.name:/3/ OR file.name:/}/ OR file.name:/-/ OR file.name:/0/ OR file.name:/,/)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575", "https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
