{"description": "Detects the creation of a named pipe matching a pattern used by CobaltStrike Malleable C2 profiles", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3b83df6a-22a7-f6b2-b59c-930ca4c2fa3d", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CobaltStrike Named Pipe Pattern Regex", "query": "(file.name:/\\\\\\\\mojo\\.5688\\.8052\\.(?:183894939787088877|35780273329370473)[0-9a-f]{2}/ OR file.name:/\\\\\\\\wkssvc_?[0-9a-f]{2}/ OR file.name:/\\\\\\\\ntsvcs[0-9a-f]{2}/ OR file.name:/\\\\\\\\DserNamePipe[0-9a-f]{2}/ OR file.name:/\\\\\\\\SearchTextHarvester[0-9a-f]{2}/ OR file.name:/\\\\\\\\mypipe\\-(?:f|h)[0-9a-f]{2}/ OR file.name:/\\\\\\\\windows\\.update\\.manager[0-9a-f]{2,3}/ OR file.name:/\\\\\\\\ntsvcs_[0-9a-f]{2}/ OR file.name:/\\\\\\\\scerpc_?[0-9a-f]{2}/ OR file.name:/\\\\\\\\PGMessagePipe[0-9a-f]{2}/ OR file.name:/\\\\\\\\MsFteWds[0-9a-f]{2}/ OR file.name:/\\\\\\\\f4c3[0-9a-f]{2}/ OR file.name:/\\\\\\\\fullduplex_[0-9a-f]{2}/ OR file.name:/\\\\\\\\msrpc_[0-9a-f]{4}/ OR file.name:/\\\\\\\\win\\\\\\\\msrpc_[0-9a-f]{2}/ OR file.name:/\\\\\\\\f53f[0-9a-f]{2}/ OR file.name:/\\\\\\\\rpc_[0-9a-f]{2}/ OR file.name:/\\\\\\\\spoolss_[0-9a-f]{2}/ OR file.name:/\\\\\\\\Winsock2\\\\\\\\CatalogChangeListener-[0-9a-f]{3}-0,/)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575", "https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
