{"description": "Detects suspicious local connections via a named pipe to the AD FS configuration database (Windows Internal Database). Used to access information such as the AD FS configuration settings which contains sensitive information used to sign SAML tokens.", "enabled": false, "false_positives": ["Processes in the filter condition"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8e93e526-16cf-7f9c-f0e8-1e8d74b5a8f3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "ADFS Database Named Pipe Connection", "query": "(file.name:\"\\\\MICROSOFT##WID\\\\tsql\\\\query\" AND (NOT (process.executable:(*\\\\Microsoft.IdentityServer.ServiceHost.exe OR *\\\\Microsoft.Identity.Health.Adfs.PshSurrogate.exe OR *\\\\AzureADConnect.exe OR *\\\\Microsoft.Tri.Sensor.exe OR *\\\\wsmprovhost.exe OR *\\\\mmc.exe OR *\\\\sqlservr.exe OR *\\\\tssdis.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1005"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1005", "name": "Data from Local System", "reference": "https://attack.mitre.org/techniques/T1005"}]}], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/ADFSDBNamedPipeConnection.yaml", "https://o365blog.com/post/adfs/", "https://github.com/Azure/SimuLand"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
