{"description": "Detects a named pipe used by Turla group samples", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "739915e4-1e70-4778-8b8a-17db02f66db1", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Turla Group Named Pipes", "query": "file.name:(\"\\\\atctl\" OR \"\\\\userpipe\" OR \"\\\\iehelper\" OR \"\\\\sdlrpc\" OR \"\\\\comnap\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1106"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1106", "name": "Native API", "reference": "https://attack.mitre.org/techniques/T1106"}]}], "version": 1, "references": ["Internal Research", "https://attack.mitre.org/groups/G0010/"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
