{"description": "Detects execution of PowerShell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ac7102b4-9e1e-4802-9b4f-17c5524c015c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "T1086 PowerShell Execution", "query": "file.name:\\\\PSHost*", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
