{"description": "Detects the creation of a named pipe used by known APT malware", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fe3ac066-98bb-432a-b1e7-a5229cb39d4a", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Malicious Named Pipe", "query": "file.name:(\"\\\\isapi_http\" OR \"\\\\isapi_dg\" OR \"\\\\isapi_dg2\" OR \"\\\\sdlrpc\" OR \"\\\\ahexec\" OR \"\\\\winsession\" OR \"\\\\lsassw\" OR \"\\\\46a676ab7f179e511e30dd2dc41bd388\" OR \"\\\\9f81f59bc58452127884ce513865ed20\" OR \"\\\\e710f28d59aa529d6792ca6ff0ca1b34\" OR \"\\\\rpchlp_3\" OR \"\\\\NamePipe_MoreWindows\" OR \"\\\\pcheap_reuse\" OR \"\\\\gruntsvc\" OR \"\\\\583da945\\-62af\\-10e8\\-4902\\-a8f205c72b2e\" OR \"\\\\bizkaz\" OR \"\\\\svcctl\" OR \\\\Posh* OR \"\\\\jaccdpqnvbrrxlaf\" OR \"\\\\csexecsvc\" OR \"\\\\6e7645c4\\-32c5\\-4fe3\\-aabf\\-e94c2f4370e7\" OR \"\\\\adschemerpc\" OR \"\\\\AnonymousPipe\" OR \"\\\\bc367\" OR \"\\\\bc31a7\" OR \"\\\\testPipe\" OR \"\\\\dce_3d\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://securelist.com/wild-neutron-economic-espionage-threat-actor-returns-with-new-tricks/71275/", "https://securelist.com/faq-the-projectsauron-apt/75533/", "https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf", "https://www.us-cert.gov/ncas/alerts/TA17-117A", "https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html", "https://thedfirreport.com/2020/06/21/snatch-ransomware/", "https://github.com/RiccardoAncarani/LiquidSnake", "https://www.accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity", "https://us-cert.cisa.gov/ncas/analysis-reports/ar19-304a", "https://download.bitdefender.com/resources/files/News/CaseStudies/study/115/Bitdefender-Whitepaper-PAC-A4-en-EN1.pdf", "https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-government-sharepoint-servers/", "https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "blueteam0ps", "elhoim"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
