{"description": "Detecting use PsExec via Pipe Creation/Access to pipes", "enabled": false, "false_positives": ["Legitimate Administrator activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9e77ed63-2ecf-4c7b-b09d-640834882028", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PsExec Pipes Artifacts", "query": "file.name:(psexec* OR paexec* OR remcom* OR csexec*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view"], "timestamp_override": "event.ingested", "author": ["Nikita Nazarov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
