{"description": "Detects creation of default named pipe used by the DiagTrackEoP POC", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b396473e-62a1-11b4-7b45-0ecf49f74088", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "DiagTrackEoP Default Named Pipe", "query": "file.name:*thisispipe*", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L22"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
