{"description": "Detects the WMI Event Consumer service scrcons.exe creating a named pipe", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WMI Event Consumer Created Named Pipe", "query": "process.executable:*\\\\scrcons.exe", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://github.com/RiccardoAncarani/LiquidSnake"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
