{"description": "Detects the creation of a named pipe as used by CobaltStrike", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d5601f8c-b26f-4ab0-9035-69e11a8d4ad2", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "CobaltStrike Named Pipe", "query": "((file.name:*\\\\MSSE\\-* AND file.name:*\\-server*) OR file.name:\\\\postex_* OR file.name:\\\\postex_ssh_* OR file.name:\\\\status_* OR file.name:\\\\msagent_*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "Privilege Escalation", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://twitter.com/d4rksystem/status/1357010969264873472", "https://labs.f-secure.com/blog/detecting-cobalt-strike-default-modules-via-named-pipe-analysis/", "https://github.com/Neo23x0/sigma/issues/253", "https://blog.cobaltstrike.com/2021/02/09/learn-pipe-fitting-for-all-of-your-offense-projects/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "Wojciech Lesicki"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
