{"description":"Detects well-known credential dumping tools execution via specific named pipes Author: Teymur Kheirkhabarov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate Administrator using tool for password recovery"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ab8a3e1d-58dc-e8fb-e62f-cc9e9b79f065","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Cred Dump-Tools Named Pipes","query":"file.name:(*\\\\lsadump* OR *\\\\cachedump* OR *\\\\wceservicepipe*)","meta":{"from":"1m"},"severity":"critical","tags":["Credential Access","T1003","T1003","T1003","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
