{"description":"Detects a named pipe used by Turla group samples Author: Markus Neis. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"bf0e759e-b641-8a9b-8acb-8591efd3040a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Turla Group Named Pipes","query":"file.name:(\"\\\\atctl\" OR \"\\\\userpipe\" OR \"\\\\iehelper\" OR \"\\\\sdlrpc\" OR \"\\\\comnap\")","meta":{"from":"1m"},"severity":"critical","tags":["T1106"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1106","name":"Native API","reference":"https://attack.mitre.org/techniques/T1106"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
