{"description":"Detects the creation of a named pipe as used by CobaltStrike Author: Florian Roth, Wojciech Lesicki. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"7afdf78f-9c92-b08d-645f-8f226f7be552","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"CobaltStrike Named Pipe","query":"((file.name:*\\\\MSSE\\-* AND file.name:*\\-server*) OR file.name:\\\\postex_* OR file.name:\\\\postex_ssh_* OR file.name:\\\\status_* OR file.name:\\\\msagent_*)","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","Privilege Escalation","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
