{"description":"Detects the creation of a named pipe with a pattern found in CobaltStrike malleable C2 profiles Author: Florian Roth, Christian Burkard. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Chrome instances using the exactly same name pipe named mojo.something"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"88d3a3b1-2c73-199f-6200-d283ffa92d4e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"CobaltStrike Named Pipe Patterns","query":"(((file.name:(\\\\mojo.5688.8052.183894939787088877* OR \\\\mojo.5688.8052.35780273329370473* OR \\\\mypipe\\-f* OR \\\\mypipe\\-h* OR \\\\ntsvcs* OR \\\\scerpc* OR \\\\win_svc* OR \\\\spoolss* OR \\\\msrpc_* OR \\\\win\\\\msrpc_* OR \\\\wkssvc* OR \\\\f53f* OR \\\\windows.update.manager* OR \\\\SearchTextHarvester* OR \\\\DserNamePipe* OR \\\\PGMessagePipe* OR \\\\MsFteWds* OR \\\\f4c3* OR \\\\fullduplex_* OR \\\\rpc_*) OR file.name:(\"\\\\demoagent_11\" OR \"\\\\demoagent_22\")) OR (file.name:\\\\Winsock2\\\\CatalogChangeListener\\-* AND file.name:*\\-0,)) AND (NOT (file.name:(\"\\\\wkssvc\" OR \"\\\\spoolss\" OR \"\\\\scerpc\" OR \"\\\\ntsvcs\" OR \"\\\\SearchTextHarvester\" OR \"\\\\PGMessagePipe\" OR \"\\\\MsFteWds\"))))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","Privilege Escalation","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
