{"description":"Detects the creation of a named pipe used by known APT malware Author: Florian Roth, blueteam0ps, elhoim. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"0a708148-b980-6a34-110a-d002bf628a18","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Malicious Named Pipe","query":"file.name:(\"\\\\isapi_http\" OR \"\\\\isapi_dg\" OR \"\\\\isapi_dg2\" OR \"\\\\sdlrpc\" OR \"\\\\ahexec\" OR \"\\\\winsession\" OR \"\\\\lsassw\" OR \"\\\\46a676ab7f179e511e30dd2dc41bd388\" OR \"\\\\9f81f59bc58452127884ce513865ed20\" OR \"\\\\e710f28d59aa529d6792ca6ff0ca1b34\" OR \"\\\\rpchlp_3\" OR \"\\\\NamePipe_MoreWindows\" OR \"\\\\pcheap_reuse\" OR \"\\\\gruntsvc\" OR \"\\\\583da945\\-62af\\-10e8\\-4902\\-a8f205c72b2e\" OR \"\\\\bizkaz\" OR \"\\\\svcctl\" OR \\\\Posh* OR \"\\\\jaccdpqnvbrrxlaf\" OR \"\\\\csexecsvc\" OR \"\\\\6e7645c4\\-32c5\\-4fe3\\-aabf\\-e94c2f4370e7\" OR \"\\\\adschemerpc\" OR \"\\\\AnonymousPipe\" OR \"\\\\bc367\" OR \"\\\\bc31a7\" OR \"\\\\testPipe\")","meta":{"from":"1m"},"severity":"critical","tags":["Defense Evasion","Privilege Escalation","T1055"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]},{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
