{"description":"Automatically lock workstation sessions after a standard period of inactivity. The case is not applicable for Unix OS. Supported OS - Windows 2008 R2 and 7, Windows 2012 R2 and 8.1, Windows 2016 and 10 Windows Server 2019. Author: Alexandr Yampolskyi, SOC Prime. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"9ca81fc9-2acc-ed51-21e4-38b27cd226c9","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Locked Workstation","query":"(winlog.channel:\"Security\" AND winlog.event_id:\"4800\")","meta":{"from":"1m"},"severity":"low","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
