{"description": "Detects possible ransomware adding a custom extension to the encrypted files, such as \".jpg.crypted\", \".docx.locky\" etc.", "enabled": false, "false_positives": ["Backup software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8f15f776-dcea-04ea-bdd9-24a93a778a64", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Appended Extension", "query": "((OriginalFilename:(*.lnk OR *.rtf OR *.pst OR *.docx OR *.xlsx OR *.jpg OR *.jpeg OR *.png OR *.pdf) AND file.path.text:(*.lnk.* OR *.rtf.* OR *.pst.* OR *.docx.* OR *.xlsx.* OR *.jpg.* OR *.jpeg.* OR *.png.* OR *.pdf.*)) AND (NOT ((file.path.text:(*.tmp OR *.bak OR *.old OR *.orig OR *.backup OR *.temp)) OR (file.path.text:C\\:\\\\ProgramData\\\\Anaconda3\\\\* AND file.path.text:*.c\\~))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1486"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1486", "name": "Data Encrypted for Impact", "reference": "https://attack.mitre.org/techniques/T1486"}]}], "version": 1, "references": ["https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/", "https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
