{"description": "Detects cases in which a file gets renamed to .dll, which often happens to bypass perimeter protection", "enabled": false, "false_positives": ["Application installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bbfd974c-248e-4435-8de6-1e938c79c5c1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Rename Common File to DLL File", "query": "(file.path:*.dll AND (NOT ((OriginalFilename:(*.dll OR *.tmp) OR OriginalFilename:(*.dll.* OR *\\\\SquirrelTemp\\\\temp*)) OR (process.executable:C\\:\\\\Windows\\\\WinSxS\\\\* AND process.executable:*\\\\TiWorker.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/ffforward/status/1481672378639912960", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036/T1036.md#atomic-test-1---system-file-copied-to-unusual-location"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
