{"description": "Detects the load of the vulnerable Lenovo driver as reported in CVE-2022-3699 which can be used to escalate privileges", "enabled": false, "false_positives": ["Legitimate driver loads (old driver that didn't receive an update)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b80966ac-e518-e3cd-2af5-518aa3b408f3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Vulnerable Lenovo Driver Load", "query": "(winlog.event_data.Hashes:(*SHA256\\=F05B1EE9E2F6AB704B8919D5071BECBCE6F9D0F9D0BA32A460C41D5272134ABE* OR *SHA1\\=B89A8EEF5AEAE806AF5BA212A8068845CAFDAB6F* OR *MD5\\=B941C8364308990EE4CC6EADF7214E0F*) OR SHA256:\"f05b1ee9e2f6ab704b8919d5071becbce6f9d0f9d0ba32a460c41d5272134abe\" OR SHA1:\"b89a8eef5aeae806af5ba212a8068845cafdab6f\" OR MD5:\"b941c8364308990ee4cc6eadf7214e0f\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://support.lenovo.com/de/en/product_security/ps500533-lenovo-diagnostics-vulnerabilities", "https://github.com/alfarom256/CVE-2022-3699/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
