{"description": "Detects the load of a signed and vulnerable AVAST Anti Rootkit driver often used by threat actors or malware for stopping and disabling AV and EDR products", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a0327e40-54c7-4f94-5bb7-68446eae850f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Vulnerable AVAST Anti Rootkit Driver Load", "query": "((((winlog.event_data.Hashes:(*MD5\\=a179c4093d05a3e1ee73f6ff07f994aa* OR *SHA1\\=5d6b9e80e12bfc595d4d26f6afb099b3cb471dd4* OR *SHA256\\=4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1*)) OR (md5:\"a179c4093d05a3e1ee73f6ff07f994aa\") OR (sha1:\"5d6b9e80e12bfc595d4d26f6afb099b3cb471dd4\") OR (sha256:\"4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1\"))) OR ((dll.path:*\\\\aswArPot.sys AND ((Signed:\"false\") OR (SignatureStatus:\"Expired\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://www.aon.com/cyber-solutions/aon_cyber_labs/yours-truly-signed-av-driver-weaponizing-an-antivirus-driver/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
