{"description": "Detects the load of the Windiver driver, a powerful user-mode capture/sniffing/modification/blocking/re-injection package for Windows", "enabled": false, "false_positives": ["Legitimate WinDivert driver usage"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d73809af-f224-98c0-e38d-6d6179a675bd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "WinDivert Driver Load", "query": "file.path:(*\\\\WinDivert.sys* OR *\\\\WinDivert64.sys*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1557"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1557", "name": "Man-in-the-Middle", "reference": "https://attack.mitre.org/techniques/T1557"}]}], "version": 1, "references": ["https://reqrypt.org/windivert-doc.html", "https://rastamouse.me/ntlm-relaying-via-cobalt-strike/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
