{"description": "Detects the load of a signed WinRing0 driver often used by threat actors, crypto miners (XMRIG) or malware for privilege escalation", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1a42dfa6-6cb2-4df9-9b48-295be477e835", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Vulnerable WinRing0 Driver Load", "query": "(file.path.text:(*\\\\WinRing0x64.sys OR *\\\\WinRing0.sys OR *\\\\WinRing0.dll OR *\\\\WinRing0x64.dll) OR winlog.event_data.Hashes:*IMPHASH\\=D41FA95D4642DC981F10DE36F4DC8CD7* OR IMPHASH:\"d41fa95d4642dc981f10de36f4dc8cd7\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://github.com/xmrig/xmrig/tree/master/bin/WinRing0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
