{"description": "Detects the load of known vulnerable drivers via their names only.", "enabled": false, "false_positives": ["Some false positives may occure if one of the vulnerable driver names mentioned above didn't change it's name between versions. So always make sure that the driver being loaded is the legitimate one and the non vulnerable version.", "If you experience a lot of FP you could comment the driver name or it's exact known legitimate location (when possible)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6dafe95c-29cf-cead-f486-3fe7c6558702", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Vulnerable Driver Load By Name", "query": "dll.path:(*\\\\ADV64DRV.sys OR *\\\\Agent64.sys OR *\\\\ALSysIO64.sys OR *\\\\amifldrv64.sys OR *\\\\AsIO.sys OR *\\\\AsIO64.sys OR *\\\\asmmap64.sys OR *\\\\AsrAutoChkUpdDrv.sys OR *\\\\AsrDrv10.sys OR *\\\\AsrDrv101.sys OR *\\\\AsrIbDrv.sys OR *\\\\AsrOmgDrv.sys OR *\\\\AsrRapidStartDrv.sys OR *\\\\AsrSmartConnectDrv.sys OR *\\\\AsUpIO.sys OR *\\\\atillk64.sys OR *\\\\BS_Def64.sys OR *\\\\CITMDRV_AMD64.sys OR *\\\\CITMDRV_IA64.sys OR *\\\\cpuz_x64.sys OR *\\\\cpuz141.sys OR *\\\\dbutil_2_3.sys OR *\\\\Dh_Kernel_10.sys OR *\\\\Dh_Kernel.sys OR *\\\\gdrv.sys OR *\\\\GLCKIO2.sys OR *\\\\HOSTNT.sys OR *\\\\HwRwDrv.sys OR *\\\\inpoutx64.sys OR *\\\\iomem64.sys OR *\\\\Mhyprot2.sys OR *\\\\MsIo64.sys OR *\\\\msrhook.sys OR *\\\\NTIOLib.sys OR *\\\\OpenLibSys.sys OR *\\\\Se64a.sys OR *\\\\smep_capcom.sys OR *\\\\smep_namco.sys OR *\\\\SysInfo.sys OR *\\\\VProEventMonitor.sys OR *\\\\WCPU.sys OR *\\\\WINIODrv.sys OR *\\\\WinRing0.sys OR *\\\\physmem.sys OR *\\\\procexp152.sys OR *\\\\viraglt64.sys OR *\\\\vboxdrv.sys OR *\\\\rwdrv.sys OR *\\\\speedfan.sys OR *\\\\kprocesshacker.sys OR *\\\\sandra.sys OR *\\\\elbycdio.sys OR *\\\\goad.sys OR *\\\\aswsnx.sys OR *\\\\sandbox.sys OR *\\\\nicm.sys OR *\\\\nscm.sys OR *\\\\ncpl.sys OR *\\\\elrawdsk.sys OR *\\\\DBUtilDrv2.sys OR *\\\\BS_RCIO64.sys OR *\\\\mhyprot.sys OR *\\\\EneTechIo64.sys OR *\\\\amp.sys OR *\\\\EneIo64.sys OR *\\\\ATSZIO.sys OR *\\\\NalDrv.sys OR *\\\\DirectIo32.sys OR *\\\\DirectIo64.sys OR *\\\\AsUpIO64.sys OR *\\\\AsrDrv102.sys OR *\\\\AsrDrv103.sys OR *\\\\BSMEMx64.sys OR *\\\\BSMIXP64.sys OR *\\\\BSMIx64.sys OR *\\\\BS_Flash64.sys OR *\\\\BS_HWMIO64_W10.sys OR *\\\\BS_HWMIo64.sys OR *\\\\BS_I2c64.sys OR *\\\\GVCIDrv64.sys OR *\\\\HwOs2Ec10x64.sys OR *\\\\HwOs2Ec7x64.sys OR *\\\\NBIOLib_X64.sys OR *\\\\NCHGBIOS2x64.SYS OR *\\\\NTIOLib_X64.sys OR *\\\\PhlashNT.sys OR *\\\\Phymemx64.sys OR *\\\\UCOREW64.SYS OR *\\\\WinFlash64.sys OR *\\\\WinRing0x64.sys OR *\\\\dbk64.sys OR *\\\\mtcBSv64.sys OR *\\\\nvflash.sys OR *\\\\nvflsh64.sys OR *\\\\phymem64.sys OR *\\\\rtkio64.sys OR *\\\\rtkiow10x64.sys OR *\\\\rtkiow8x64.sys OR *\\\\segwindrvx64.sys OR *\\\\superbmc.sys OR *\\\\semav6msr.sys OR *\\\\piddrv64.sys OR *\\\\BS_I2cIo.sys OR *\\\\rtkio.sys OR *\\\\AMDRyzenMasterDriver.sys OR *\\\\LHA.sys OR *\\\\kEvP64.sys OR *\\\\BSMI.sys OR *\\\\TmComm.sys OR *\\\\cpuz.sys OR *\\\\iQVW64.SYS OR *\\\\vmdrv.sys OR *\\\\HpPortIox64.sys OR *\\\\AMDPowerProfiler.sys OR *\\\\CorsairLLAccess64.sys OR *\\\\RTCore64.sys OR *\\\\libnicm.sys OR *\\\\procexp.Sys OR *\\\\viragt.sys OR *\\\\viragt64.sys OR *\\\\AsrDrv106.sys OR *\\\\zamguard64.sys OR *\\\\zam64.sys OR *\\\\fidpcidrv64.sys OR *\\\\MsIo32.sys OR *\\\\winio64.sys OR *\\\\capcom.sys OR *\\\\IOMap64.sys OR *\\\\ATSZIO64.sys OR *\\\\aswVmm.sys OR *\\\\FairplayKD.sys OR *\\\\pgldqpoc.sys OR *\\\\iqvw64e.sys OR *\\\\Monitor_win10_x64.sys OR *\\\\srvnetbus.sys OR *\\\\Mslo64.sys OR *\\\\pcdsrvc_x64.pkms OR *\\\\krpocesshacker.sys OR *\\\\HWiNFO64A.sys OR *\\\\rzpnk.sys OR *\\\\magdrvamd64.sys OR *\\\\driver7\\-x64.sys OR *\\\\driver7\\-x86\\-withoutdbg.sys OR *\\\\driver7\\-x86.sys OR *\\\\gmer.sys OR *\\\\PCADRVX64.sys OR *\\\\clfs.sys OR *\\\\ActiveHealth.sys OR *\\\\CAM_V3.sys OR *\\\\GameFire.sys OR *\\\\OpenHardwareMonitor.sys OR *\\\\OpenHardwareMonitorLib.sys OR *\\\\OpenHardwareMonitorReport.sys OR *\\\\SmartDashboard.sys OR *\\\\SystemGauge.sys OR *\\\\SystemGaugeX7.sys OR *\\\\VideoNovaServerControllerService.sys OR *\\\\ellp_service.sys OR *\\\\hardwareproviders.sys OR *\\\\ohm.sys OR *\\\\sensorsview32_64.sys OR *\\\\touchpointanalyticsclient.sys)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://github.com/eclypsium/Screwed-Drivers/blob/master/DRIVERS.md", "https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules", "https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/", "https://github.com/jbaines-r7/dellicious", "https://github.com/MicrosoftDocs/windows-itpro-docs/blob/public/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules.md", "https://github.com/namazso/physmem_drivers", "https://github.com/stong/CVE-2020-15368", "https://github.com/CaledoniaProject/drivers-binaries", "https://github.com/Chigusa0w0/AsusDriversPrivEscala", "https://www.welivesecurity.com/2022/01/11/signed-kernel-drivers-unguarded-gateway-windows-core/", "https://eclypsium.com/2019/11/12/mother-of-all-drivers/", "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-37969"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
