{"description": "Detects driver load of the Process Hacker tool", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use of process hacker or system informer by low level developers or system administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "67add051-9ee7-4ad3-93ba-42935615ae8d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PUA - Process Hacker Driver Load", "query": "((dll.path:*\\\\kprocesshacker.sys) OR (winlog.event_data.Hashes:(*IMPHASH\\=821D74031D3F625BCBD0DF08B70F1E77* OR *IMPHASH\\=F86759BB4DE4320918615DC06E998A39* OR *IMPHASH\\=0A64EEB85419257D0CE32BD5D55C3A18* OR *IMPHASH\\=6E7B34DFC017700B1517B230DF6FF0D0*)) OR (winlog.event_data.Imphash:(\"821D74031D3F625BCBD0DF08B70F1E77\" OR \"F86759BB4DE4320918615DC06E998A39\" OR \"0A64EEB85419257D0CE32BD5D55C3A18\" OR \"6E7B34DFC017700B1517B230DF6FF0D0\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://processhacker.sourceforge.io/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
