{"description": "Detects the load of known vulnerable drivers via their names only.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["False positives may occur if one of the vulnerable driver names mentioned above didn't change its name between versions. So always make sure that the driver being loaded is the legitimate one and the non vulnerable version.", "If you experience a lot of FP you could comment the driver name or its exact known legitimate location (when possible)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c316eac1-f3d8-42da-ad1c-66dcec5ca787", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Vulnerable Driver Load By Name", "query": "dll.path:(*\\\\mtcbsv64.sys OR *\\\\bs_def64.sys OR *\\\\gameink.sys OR *\\\\81.sys OR *\\\\bs_rcio.sys OR *\\\\sense5ext.sys OR *\\\\asrdrv10.sys OR *\\\\gvcidrv64.sys OR *\\\\wantd_5.sys OR *\\\\driver7\\-x86\\-withoutdbg.sys OR *\\\\atillk64.sys OR *\\\\lurker.sys OR *\\\\segwindrvx64.sys OR *\\\\nt3.sys OR *\\\\enetechio64.sys OR *\\\\asio64.sys OR *\\\\inpoutx64.sys OR *\\\\windows8\\-10\\-32.sys OR *\\\\directio.sys OR *\\\\rtkio.sys OR *\\\\corsairllaccess64.sys OR *\\\\nt6.sys OR *\\\\winflash64.sys OR *\\\\paniox64.sys OR *\\\\blackbonedrv10.sys OR *\\\\msio32.sys OR *\\\\fiddrv.sys OR *\\\\asio.sys OR *\\\\dbutildrv2.sys OR *\\\\my.sys OR *\\\\wantd_3.sys OR *\\\\winio32a.sys OR *\\\\wyproxy64.sys OR *\\\\ni.sys OR *\\\\bs_i2cio.sys OR *\\\\kprocesshacker.sys OR *\\\\protects.sys OR *\\\\phymem64.sys OR *\\\\proxy32.sys OR *\\\\b.sys OR *\\\\netproxydriver.sys OR *\\\\bs_hwmio64_w10.sys OR *\\\\physmem.sys OR *\\\\asrsmartconnectdrv.sys OR *\\\\b3.sys OR *\\\\monitor_win10_x64.sys OR *\\\\poortry2.sys OR *\\\\amdryzenmasterdriver.sys OR *\\\\t.sys OR *\\\\sandra.sys OR *\\\\bsmix64.sys OR *\\\\bs_i2c64.sys OR *\\\\wantd_6.sys OR *\\\\bs_rcio64.sys OR *\\\\zam64.sys OR *\\\\viragt64.sys OR *\\\\winio32b.sys OR *\\\\poortry1.sys OR *\\\\msio64.sys OR *\\\\winio32.sys OR *\\\\ncpl.sys OR *\\\\nchgbios2x64.sys OR *\\\\bwrsh.sys OR *\\\\panio.sys OR *\\\\lha.sys OR *\\\\ntbios.sys OR *\\\\blacklotus_driver.sys OR *\\\\fidpcidrv.sys OR *\\\\b4.sys OR *\\\\mhyprot3.sys OR *\\\\ucorew64.sys OR *\\\\hwos2ec7x64.sys OR *\\\\bsmemx64.sys OR *\\\\windows7\\-32.sys OR *\\\\asrdrv106.sys OR *\\\\elbycdio.sys OR *\\\\iomem64.sys OR *\\\\asupio.sys OR *\\\\otipcibus.sys OR *\\\\windows\\-xp\\-64.sys OR *\\\\aswarpot.sys OR *\\\\amdpowerprofiler.sys OR *\\\\d.sys OR *\\\\2.sys OR *\\\\tgsafe.sys OR *\\\\ntiolib_x64.sys OR *\\\\asrrapidstartdrv.sys OR *\\\\1.sys OR *\\\\hwos2ec10x64.sys OR *\\\\daxin_blank5.sys OR *\\\\viraglt64.sys OR *\\\\iomap64.sys OR *\\\\lv561av.sys OR *\\\\nscm.sys OR *\\\\c.sys OR *\\\\asribdrv.sys OR *\\\\b1.sys OR *\\\\eneio64.sys OR *\\\\capcom.sys OR *\\\\80.sys OR *\\\\asio32.sys OR *\\\\iobitunlocker.sys OR *\\\\zamguard64.sys OR *\\\\nstrwsk.sys OR *\\\\wiseunlo.sys OR *\\\\t7.sys OR *\\\\bs_hwmio64.sys OR *\\\\hostnt.sys OR *\\\\glckio2.sys OR *\\\\hpportiox64.sys OR *\\\\citmdrv_amd64.sys OR *\\\\kevp64.sys OR *\\\\bsmixp64.sys OR *\\\\nbiolib_x64.sys OR *\\\\d3.sys OR *\\\\full.sys OR *\\\\nvflash.sys OR *\\\\rtcore64.sys OR *\\\\speedfan.sys OR *\\\\fidpcidrv64.sys OR *\\\\hwrwdrv.sys OR *\\\\msrhook.sys OR *\\\\proxy64.sys OR *\\\\7.sys OR *\\\\winring0.sys OR *\\\\hw_sys OR *\\\\winio64b.sys OR *\\\\semav6msr64.sys OR *\\\\bandai.sys OR *\\\\piddrv.sys OR *\\\\t8.sys OR *\\\\asrdrv103.sys OR *\\\\adv64drv.sys OR *\\\\asrsetupdrv103.sys OR *\\\\bwrs.sys OR *\\\\d4.sys OR *\\\\dbk64.sys OR *\\\\fiddrv64.sys OR *\\\\goad.sys OR *\\\\gametersafe.sys OR *\\\\mhyprot2.sys OR *\\\\lenovodiagnosticsdriver.sys OR *\\\\netflt.sys OR *\\\\bw.sys OR *\\\\ntbios_2.sys OR *\\\\dbutil.sys OR *\\\\dh_kernel.sys OR *\\\\rtkiow8x64.sys OR *\\\\daxin_blank.sys OR *\\\\superbmc.sys OR *\\\\nodedriver.sys OR *\\\\cpuz141.sys OR *\\\\gftkyj64.sys OR *\\\\d2.sys OR *\\\\4.sys OR *\\\\dh_kernel_10.sys OR *\\\\naldrv.sys OR *\\\\winiodrv.sys OR *\\\\asmmap64.sys OR *\\\\smep_namco.sys OR *\\\\mhyprot.sys OR *\\\\iqvw64e.sys OR *\\\\nstr.sys OR *\\\\ntiolib.sys OR *\\\\pciecubed.sys OR *\\\\vmdrv.sys OR *\\\\daxin_blank2.sys OR *\\\\atszio.sys OR *\\\\agent64.sys OR *\\\\cpupress.sys OR *\\\\driver7\\-x86.sys OR *\\\\krpocesshacker.sys OR *\\\\asrdrv102.sys OR *\\\\aswvmm.sys OR *\\\\tmcomm.sys OR *\\\\bs_def.sys OR *\\\\bsmi.sys OR *\\\\alsysio64.sys OR *\\\\cpuz.sys OR *\\\\daxin_blank1.sys OR *\\\\amifldrv64.sys OR *\\\\rwdrv.sys OR *\\\\testbone.sys OR *\\\\winio64c.sys OR *\\\\winring0x64.sys OR *\\\\nt4.sys OR *\\\\procexp.sys OR *\\\\winio64.sys OR *\\\\se64a.sys OR *\\\\air_system10.sys OR *\\\\wantd.sys OR *\\\\wcpu.sys OR *\\\\nicm.sys OR *\\\\daxin_blank6.sys OR *\\\\kbdcap64.sys OR *\\\\lctka.sys OR *\\\\nvflsh64.sys OR *\\\\phlashnt.sys OR *\\\\viragt.sys OR *\\\\atszio64.sys OR *\\\\dbutil_2_3.sys OR *\\\\phymemx64.sys OR *\\\\wantd_4.sys OR *\\\\ndislan.sys OR *\\\\panmonfltx64.sys OR *\\\\t3.sys OR *\\\\panmonflt.sys OR *\\\\daxin_blank3.sys OR *\\\\gdrv.sys OR *\\\\smep_capcom.sys OR *\\\\wyproxy32.sys OR *\\\\black.sys OR *\\\\vboxdrv.sys OR *\\\\cpuz_x64.sys OR *\\\\poortry.sys OR *\\\\mydrivers.sys OR *\\\\winio64a.sys OR *\\\\openlibsys.sys OR *\\\\bs_flash64.sys OR *\\\\vproeventmonitor.sys OR *\\\\piddrv64.sys OR *\\\\wantd_2.sys OR *\\\\sysinfo.sys OR *\\\\asrdrv104.sys OR *\\\\netfilterdrv.sys OR *\\\\libnicm.sys OR *\\\\driver7\\-x64.sys OR *\\\\semav6msr.sys OR *\\\\pchunter.sys OR *\\\\asupio64.sys OR *\\\\rtkio64.sys OR *\\\\rzpnk.sys OR *\\\\magdrvamd64.sys OR *\\\\elrawdsk.sys OR *\\\\amp.sys OR *\\\\asrautochkupddrv.sys OR *\\\\lgdcatcher.sys OR *\\\\fairplaykd.sys OR *\\\\daxin_blank4.sys OR *\\\\rtkiow10x64.sys OR *\\\\citmdrv_ia64.sys OR *\\\\nt5.sys OR *\\\\asromgdrv.sys OR *\\\\nt2.sys OR *\\\\asrdrv101.sys)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1068", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}, {"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://loldrivers.io/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
