{"description": "Detects failed logon attempts from clients to MSSQL server.", "author": ["Nasreddine Bencherchali (Nextron Systems)", "j4son"], "enabled": false, "false_positives": ["This event could stem from users changing an account's password that's used to authenticate via a job or an automated process. Investigate the source of such events and mitigate them"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "218d2855-2bba-4f61-9c85-81d0ea63ac71", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "MSSQL Server Failed Logon", "query": "(winlog.channel:Application AND Provider_Name:MSSQLSERVER AND winlog.event_id:18456)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Credential Access", "T1110"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110"}]}], "version": 1, "references": ["https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/", "https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
