{"description":"Raw disk access using illegitimate tools, possible defence evasion Author: Teymur Kheirkhabarov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate Administrator using tool for raw access or ongoing forensic investigation"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"ddbec290-196f-fb9a-b453-c126fdd046fd","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Raw Disk Access Using Illegitimate Tools","query":"(NOT ((Device:*floppy*) OR (process.executable:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SystemApps\\\\*) AND process.executable:(*\\\\wmiprvse.exe OR *\\\\sdiagnhost.exe OR *\\\\searchindexer.exe OR *\\\\csrss.exe OR *\\\\defrag.exe OR *\\\\smss.exe OR *\\\\vssvc.exe OR *\\\\compattelrunner.exe OR *\\\\wininit.exe OR *\\\\autochk.exe OR *\\\\taskhost.exe OR *\\\\dfsrs.exe OR *\\\\vds.exe OR *\\\\lsass.exe OR *\\\\svchost.exe OR *\\\\MsMpEng.exe OR *\\\\SearchApp.exe OR *\\\\powershell.exe OR *\\\\GamingServices.exe OR *\\\\SearchUI.exe)) OR (ProcessId:\"4\") OR (process.executable:(\"C\\:\\\\Windows\\\\System32\\\\backgroundTaskHost.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\RuntimeBroker.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\MoUsoCoreWorker.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\taskhostw.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\SrTasks.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\dllhost.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\DeviceCensus.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\MpSigStub.exe\" OR \"C\\:\\\\Windows\\\\UUS\\\\amd64\\\\MoUsoCoreWorker.exe\")) OR (process.executable:\"System\") OR (process.executable:*\\\\Keybase\\\\upd.exe) OR (process.executable:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND process.executable:*\\\\MsMpEng.exe) OR (process.executable:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (process.executable:*C\\:\\\\Users\\\\* AND process.executable:*\\\\AppData\\\\* AND process.executable:*\\\\Microsoft\\\\*)))","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1006"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1006","name":"Direct Volume Access","reference":"https://attack.mitre.org/techniques/T1006"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
