{"description": "Detects a PDQDeploy service installation which indicates that PDQDeploy was installed on the machines.\nPDQDeploy can be abused by attackers to remotely install packages or execute commands on target machines\n", "enabled": false, "false_positives": ["Legitimate use of the tool"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ee9ca27c-9bd7-4cee-9b01-6e906be7cae3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New PDQDeploy Service - Server Side", "query": "(winlog.channel:\"System\" AND (Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\") AND (winlog.event_data.ImagePath:*PDQDeployService.exe* OR winlog.event_data.ServiceName:(\"PDQDeploy\" OR \"PDQ\\ Deploy\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
