{"description": "Detects Obfuscated Powershell via COMPRESS OBFUSCATION", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "548de027-8b27-5515-6195-1128bc30397a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Invoke-Obfuscation COMPRESS OBFUSCATION", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\" AND winlog.event_data.ImagePath:*new\\-object* AND winlog.event_data.ImagePath:*text.encoding\\]\\:\\:ascii* AND winlog.event_data.ImagePath:*readtoend* AND winlog.event_data.ImagePath:(*\\:system.io.compression.deflatestream* OR *system.io.streamreader*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1027", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://github.com/Neo23x0/sigma/issues/1009"], "timestamp_override": "event.ingested", "author": ["Timur Zinniatullin", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
