{"description": "Detects a service installation that uses a suspicious double ampersand used in the image path value", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "96f0c78b-dd3c-4e6e-01e0-21595b911e53", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New Service Uses Double Ampersand in Path", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\" AND winlog.event_data.ImagePath:*\\&&*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["Internal Research"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
