{"description": "Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG is used on a system in brute force mode", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "df49cf49-0885-7b59-5d20-5a0ba0793127", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Local Privilege Escalation Indicator TabTip", "query": "(winlog.channel:\"System\" AND winlog.event_id:\"10001\" AND param1:\"C:\\Program Files\\Common Files\\microsoft shared\\ink\\TabTip.exe\" AND param2:\"2147943140\" AND param3:\"{054AAE20-4BEA-4347-8A35-64A533254A9D}\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1557"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/antonioCoco/JuicyPotatoNG"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
