{"description": "Detects Remote Utilities Host service installation on the target system.", "enabled": false, "false_positives": ["Legitimate use of the tool"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d248aed8-8083-a420-024f-a41c04c8d555", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remote Utilities Host Service Install", "query": "(winlog.channel:\"System\" AND (Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\") AND ((winlog.event_data.ImagePath:*\\\\rutserv.exe* AND winlog.event_data.ImagePath:*\\-service*) OR winlog.event_data.ServiceName:\"Remote\\ Utilities\\ \\-\\ Host\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.remoteutilities.com/support/kb/host-service-won-t-start/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
