{"description":"Detects QuarksPwDump clearing access history in hive Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"67fd78ce-6719-1ffa-2634-9a3d0382e305","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"QuarksPwDump Clearing Access History","query":"(winlog.channel:\"System\" AND winlog.event_id:\"16\" AND winlog.event_data.HiveName:*\\\\AppData\\\\Local\\\\Temp\\\\SAM* AND winlog.event_data.HiveName:*.dmp)","meta":{"from":"1m"},"severity":"critical","tags":["Credential Access","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
