{"description": "Detects the reporting of NTLMv1 being used between a client and server", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa0b0ff5-32d6-c785-044e-76af28a099eb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NTLMv1 Logon Between Client and Server", "query": "(winlog.channel:\"System\" AND Provider_Name:\"LsaSrv\" AND winlog.event_id:\"6038\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1550"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1550/002/"], "timestamp_override": "event.ingested", "author": ["Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
