{"description": "This rule detects a DHCP server error in which a specified Callout DLL (in registry) could not be loaded", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "adf6b48e-cb7f-22db-51bc-c6aaeda4127e", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "DHCP Server Error Failed Loading the CallOut DLL", "query": "(winlog.channel:\"System\" AND winlog.event_id:(\"1031\" OR \"1032\" OR \"1034\") AND Provider_Name:\"Microsoft\\-Windows\\-DHCP\\-Server\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html", "https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx", "https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx"], "timestamp_override": "event.ingested", "author": ["Dimitrios Slamaris", "@atc_project (fix)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
