{"description":"Detects disabling Windows Defender threat protection Author: Ján Trenčanský, frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrator actions"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"33a3d0ea-448a-51b3-5839-b208ddf4d798","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Windows Defender Threat Detection Disabled","query":"(winlog.channel:\"System\" AND winlog.event_id:\"7036\" AND Provider_Name:\"Service\\ Control\\ Manager\" AND param1:(\"Windows\\ Defender\\ Antivirus\\ Service\" OR \"Service\\ antivirus\\ Microsoft\\ Defender\") AND param2:\"stopped\")","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
