{"description": "Detects suspicious service installation commands", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "007c2889-39de-5a78-046e-a6c02b4c0ec2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Service Installation", "query": "(winlog.channel:\"System\" AND ((Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\") AND (winlog.event_data.ImagePath:(*\\ \\-w\\ hidden\\ * OR *\\ \\-nop\\ * OR *\\ \\-sta\\ * OR *\\\\Users\\\\Public\\\\* OR *\\\\Windows\\\\Temp\\\\* OR *\\\\Perflogs\\\\* OR *\\\\\\\\.\\\\pipe* OR *\\\\ADMIN$\\\\* OR *C\\:\\\\Temp\\\\* OR *.downloadstring\\(* OR *.downloadfile\\(*) OR (winlog.event_data.ImagePath:*\\ \\-e* AND winlog.event_data.ImagePath:(*\\ JAB* OR *\\ SUVYI* OR *\\ SQBFAFgA* OR *\\ aWV4I* OR *\\ IAB* OR *\\ PAA* OR *\\ aQBlAHgA*)))) AND (NOT ((winlog.event_data.ImagePath:C\\:\\\\WINDOWS\\\\TEMP\\\\thor10\\-remote\\\\thor64.exe*) OR (winlog.event_data.ImagePath:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Definition\\ Updates\\\\*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
