{"description": "Windows Update get some error Check if need a 0-days KB", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "769a5d62-5f1a-c52e-3cca-f27790960428", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Windows Update Error", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Microsoft\\-Windows\\-WindowsUpdateClient\" AND winlog.event_id:(\"16\" OR \"20\" OR \"24\" OR \"213\" OR \"217\"))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
