{"description": "This method detects a service install of malicious services mentioned in Carbon Paper - Turla report by ESET", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "57309198-cc78-0923-a9fb-c7c338fd3b90", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Turla Service Install", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\" AND winlog.event_data.ServiceName:(\"srservice\" OR \"ipvpn\" OR \"hkmsvc\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
