{"description": "Detects that a vulnerable Netlogon secure channel connection was allowed, which could be an indicator of CVE-2020-1472.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8f07d470-aa2a-be68-a5ec-39a2b6541bcf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Vulnerable Netlogon Secure Channel Connection Allowed", "query": "(winlog.channel:\"System\" AND Provider_Name:\"NetLogon\" AND winlog.event_id:\"5829\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc"], "timestamp_override": "event.ingested", "author": ["NVISO"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
