{"description": "Detects the exploitation of a security bypass and elevation of privilege vulnerability with Authentication Negotiation by using weak RC4-HMAC negotiation", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e6f81941-b1cd-4766-87db-9fc156f658ee", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "KDC RC4-HMAC Downgrade CVE-2022-37966", "query": "(winlog.channel:\"System\" AND winlog.event_id:\"42\" AND Provider_Name:\"Kerberos\\-Key\\-Distribution\\-Center\" AND Level:\"2\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://support.microsoft.com/en-us/topic/kb5021131-how-to-manage-the-kerberos-protocol-changes-related-to-cve-2022-37966-fd837ac3-cdec-4e76-a6ec-86e67501407d"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
