{"description": "Detects suspicious service installation scripts", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8d9ef7e1-f2da-59c0-a919-39ed8a76e871", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Service Installation Script", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\" AND winlog.event_data.ImagePath:*\\ \\/C\\ * AND winlog.event_data.ImagePath:(*powershell* OR *wscript* OR *cscript* OR *mshta* OR *rundll32*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["pH-T"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
