{"description":"Detects the use of Moriya rootkit as described in the securelist's Operation TunnelSnake report Author: Bhabesh Raj. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["None"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"3ac94590-cf84-b43c-148b-8d2055053000","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"Moriya Rootkit","query":"(winlog.channel:\"System\" AND Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\" AND winlog.event_data.ServiceName:\"ZzNetSvc\")","meta":{"from":"1m"},"severity":"critical","tags":["Privilege Escalation","T1543"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
