{"description": "Detects a service installed by a client which has PID 0 or whose parent has PID 0", "author": ["Tim Rauch"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "83ac2207-fb64-f18c-9392-16dc9a83a583", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Service Installed By Unusual Client - System", "query": "(Provider_Name:\"Service Control Manager\" AND winlog.event_id:\"7045\" AND ProcessId:\"0\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/windows-service-installed-via-an-unusual-client.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
