{"description": "Detects suspicious SAM dump activity as cause by QuarksPwDump and other password dumpers", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d0123879-9d7a-4507-e6d6-85e10d866df4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SAM Dump to AppData", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Microsoft\\-Windows\\-Kernel\\-General\" AND winlog.event_id:\"16\" AND \"\\\\AppData\\\\Local\\\\Temp\\\\SAM\\-\" AND \".dmp\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
