{"description":"The attacker creates a computer object using those permissions with a password known to her.\nAfter that she clears the attribute ServicePrincipalName on the computer object.\nBecause she created the object (CREATOR OWNER), she gets granted additional permissions and can do many changes to the object.\n Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"a76ee185-a174-b455-c618-d86489addf39","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Exploit SamAccountName Spoofing with Kerberos","query":"(winlog.channel:\"System\" AND ((Provider_Name:\"Microsoft\\-Windows\\-Kerberos\\-Key\\-Distribution\\-Center\" AND winlog.event_id:(\"35\" OR \"36\" OR \"37\" OR \"38\")) OR (Provider_Name:\"Microsoft\\-Windows\\-Directory\\-Services\\-SAM\" AND winlog.event_id:(\"16990\" OR \"16991\"))))","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1558"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1558","name":"Steal or Forge Kerberos Tickets","reference":"https://attack.mitre.org/techniques/T1558"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
