{"description": "Detects volume shadow copy mount", "enabled": false, "false_positives": ["Legitimate use of volume shadow copy mounts (backups maybe)."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c8d3787f-e3f2-0b78-0873-1146e298af1b", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Volume Shadow Copy Mount", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Microsoft\\-Windows\\-Ntfs\" AND winlog.event_id:\"98\" AND DeviceName:*HarddiskVolumeShadowCopy*)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g", "Open Threat Research (OTR)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
