{"description": "During exploitation of this vuln, two logs (providername:Microsoft-Windows-User Profiles Service) with eventid 1511 and 1515 (maybe lot of false positives with this event) are created. Moreover, it appears the directory \\Users\\TEMP is created may be created during the exploitation.Viewed on 2008 Server", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "52a85084-6989-40c3-8f32-091e12e17692", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Usage of CVE_2021_34484 or CVE 2022_21919", "query": "(winlog.channel:\"Application\" AND winlog.event_id:\"1511\" AND Provider_Name:\"Microsoft\\-Windows\\-User\\ Profiles\\ Service\")", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html"], "timestamp_override": "event.ingested", "author": ["Cybex"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
