{"description": "Detect suspicious error on protocol RDP, potential CVE-2019-0708", "enabled": false, "false_positives": ["Bad connections or network interruptions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8f524c92-3800-d41e-f0ff-f5c9882582fa", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential RDP Exploit CVE-2019-0708", "query": "(winlog.channel:\"System\" AND winlog.event_id:(\"56\" OR \"50\") AND Provider_Name:\"TermDD\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Lateral Movement", "T1210"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1210", "name": "Exploitation of Remote Services", "reference": "https://attack.mitre.org/techniques/T1210"}]}], "version": 1, "references": ["https://github.com/zerosum0x0/CVE-2019-0708", "https://github.com/Ekultek/BlueKeep"], "timestamp_override": "event.ingested", "author": ["Lionel PRAT", "Christophe BROCAS", "@atc_project (improvements)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
