{"description":"Detects service installation with suspicious folder patterns Author: pH-T. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Service Installation with Suspicious Folder Pattern","query":"(winlog.channel:\"System\" AND (Provider_Name:\"Service\\ Control\\ Manager\" AND winlog.event_id:\"7045\") AND (winlog.event_data.ImagePath:/^[Cc]:\\\\[Pp]rogram[Dd]ata\\\\.{1,9}\\.exe/ OR winlog.event_data.ImagePath:/^[Cc]:\\\\.{1,9}\\.exe/))","meta":{"from":"1m"},"severity":"high","tags":["Privilege Escalation","T1543"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
