{"description": "Detectes application popup reporting a failure of the Sysmon service", "enabled": false, "false_positives": ["none"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "46ef6019-abf3-4420-f7e7-a51249624e66", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Sysmon Crash", "query": "(winlog.channel:\"System\" AND Provider_Name:\"Application\\ Popup\" AND winlog.event_id:\"26\" AND Caption:\"sysmon64.exe\\ \\-\\ Application\\ Error\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1562"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Tim Shelton"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
