{"description": "Detects the addition of a rule to the Windows Firewall exception list where the application resides in a suspicious folder", "author": ["frack113"], "enabled": false, "false_positives": ["Any legitimate application that runs from the AppData user directory"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9e2575e7-2cb9-4da1-adc8-ed94221dca5e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New Firewall Exception Rule Added For A Suspicious Folder", "query": "(((winlog.event_id:(2004 OR 2071) AND ApplicationPath:(/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\.*/ OR /.*\\\\\\\\[Tt][Ee][Mm][Pp]\\\\\\\\.*/)) AND (NOT Action:2)) AND (NOT ((ApplicationPath:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Tt][Ee][Aa][Mm][Ss]\\\\\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/) OR (ApplicationPath:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Kk][Ee][Yy][Bb][Aa][Ss][Ee]\\\\\\\\[Kk][Ee][Yy][Bb][Aa][Ss][Ee]\\.[Ee][Xx][Ee]/) OR (ApplicationPath:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\\\\\[Mm][Ee][Ss][Ss][Ee][Nn][Gg][Ee][Rr]\\\\\\\\[Mm][Ee][Ss][Ss][Ee][Nn][Gg][Ee][Rr]\\.[Ee][Xx][Ee]/) OR ((ApplicationPath:/[Cc]\\:\\\\\\\\[Uu][Ss][Ee][Rr][Ss]\\\\\\\\.*/ AND ApplicationPath:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\\\\\[Oo][Pp][Ee][Rr][Aa]\\\\\\\\.*/ AND ApplicationPath:/.*\\\\\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)", "https://app.any.run/tasks/7123e948-c91e-49e0-a813-00e8d72ab393/#"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
