{"description": "The Windows Firewall service failed to load Group Policy.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "17454dc2-f767-b96d-1b83-e731df140363", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Failed to Load Policy in Windows Firewall with Advanced Security", "query": "winlog.event_id:\"2009\"", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
