{"description": "Setting have been change in Windows Firewall", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a64a5887-19f3-284d-8500-6a83730b3924", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Setting Change in Windows Firewall with Advanced Security", "query": "winlog.event_id:(\"2002\" OR \"2003\" OR \"2008\")", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
