{"description": "Detects when a all the rules have been deleted from the Windows Defender Firewall configuration", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "79609c82-a488-426e-abcf-9f341a39365d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "All Rules Have Been Deleted From The Windows Firewall Configuration", "query": "((winlog.event_id:(\"2033\" OR \"2059\") AND (NOT ((ModifyingApplication:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (ModifyingApplication:\"C:\\Windows\\System32\\svchost.exe\")))) AND (NOT (ModifyingApplication:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND ModifyingApplication:*\\\\MsMpEng.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
