{"description": "A rule has been deleted in the Windows Firewall exception list.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f2f35b28-9d08-1be2-62f0-03e4106bc327", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Delete Rule in Windows Firewall with Advanced Security", "query": "(winlog.event_id:(\"2006\" OR \"2033\") AND (NOT ((ModifyingApplication:\"C\\:\\\\Windows\\\\System32\\\\svchost.exe\" OR ModifyingApplication:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (ModifyingApplication:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND ModifyingApplication:*\\\\MsMpEng.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
