{"description": "Detects when a singe rules or all of the rules have been deleted from the Windows Defender Firewall", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9c944d3d-1325-f42f-70c2-73aa950205ea", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "A Rule Has Been Deleted From The Windows Firewall Exception List", "query": "(winlog.event_id:\"2006\" AND (NOT ((ModifyingApplication:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (ModifyingApplication:\"C:\\Windows\\System32\\svchost.exe\") OR ((ModifyingApplication:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND ModifyingApplication:*\\\\MsMpEng.exe)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
