{"description": "Detects when a rule has been added to the Windows Firewall exception list", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "32a592a7-69db-2be0-1b3f-249892cd3de9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Firewall Rule Added In Windows Firewall Exception List", "query": "(winlog.event_id:\"2004\" AND (NOT ((Action:\"2\") OR (((ApplicationPath:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (ModifyingApplication:\"C:\\Windows\\System32\\oobe\\Setup.exe\") OR (ModifyingApplication:C\\:\\\\Windows\\\\WinSxS\\\\*) OR (ModifyingApplication:(\"C:\\Windows\\SysWOW64\\msiexec.exe\" OR \"C:\\Windows\\System32\\svchost.exe\" OR \"C:\\Windows\\System32\\dllhost.exe\" OR \"C:\\Program Files\\Windows Defender\\MsMpEng.exe\")))) OR ((ModifyingApplication:C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* AND ModifyingApplication:*\\\\MsMpEng.exe)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
