{"description":"DA rule has been deleted in the Windows Firewall exception list. Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"c187c075-bb3e-4c62-b4fa-beae0ffc211f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Deteled Rule in Windows Firewall with Advanced Security","query":"(winlog.event_id:(\"2006\" OR \"2033\") AND (NOT (ModifyingApplication:\"C\\:\\\\Windows\\\\System32\\\\svchost.exe\" OR ModifyingApplication:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*))))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
