{"description": "Detects the addition of a rule to the Windows Firewall exception list where the application resides in a suspicious folder", "author": ["frack113"], "enabled": false, "false_positives": ["Any legitimate application that runs from the AppData user directory"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9e2575e7-2cb9-4da1-adc8-ed94221dca5e", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New Firewall Exception Rule Added For A Suspicious Folder", "query": "(((winlog.event_id:(\"2004\" OR \"2071\") AND ApplicationPath:(*\\\\AppData\\\\* OR *\\\\Temp\\\\*)) AND (NOT Action:\"2\")) AND (NOT ((ApplicationPath:*\\\\AppData\\\\local\\\\microsoft\\\\teams\\\\current\\\\teams.exe) OR (ApplicationPath:*\\\\AppData\\\\Local\\\\Keybase\\\\keybase.exe) OR (ApplicationPath:*\\\\AppData\\\\Local\\\\Programs\\\\Messenger\\\\Messenger.exe) OR ((ApplicationPath:C\\:\\\\Users\\\\* AND ApplicationPath:*\\\\AppData\\\\Local\\\\Programs\\\\Opera\\\\* AND ApplicationPath:*\\\\opera.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)", "https://app.any.run/tasks/7123e948-c91e-49e0-a813-00e8d72ab393/#"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
