{"description":"A rule has been modified in the Windows Firewall exception list Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"5d379852-df8c-fda0-6450-9f7748f461ee","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Added Rule in Windows Firewall with Advanced Security","query":"(winlog.event_id:\"2004\" AND (NOT ((Action:\"2\") OR (ApplicationPath:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*) OR ModifyingApplication:\"C\\:\\\\Windows\\\\System32\\\\oobe\\\\Setup.exe\" OR ModifyingApplication:C\\:\\\\Windows\\\\WinSxS\\\\* OR ModifyingApplication:(\"C\\:\\\\Windows\\\\SysWOW64\\\\msiexec.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\svchost.exe\" OR \"C\\:\\\\Windows\\\\System32\\\\dllhost.exe\" OR \"C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe\")))))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
