{"description": "Detects the deletion of registry keys containing the MSTSC connection history", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "07bdd2f5-9c58-4f38-aec8-e101bb79ef8d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Terminal Server Client Connection History Cleared", "query": "((winlog.event_data.EventType:\"DeleteValue\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Terminal\\ Server\\ Client\\\\Default\\\\MRU*) OR (winlog.event_data.EventType:\"DeleteKey\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Terminal\\ Server\\ Client\\\\Servers\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}, {"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/troubleshoot/windows-server/remote/remove-entries-from-remote-desktop-connection-computer", "http://woshub.com/how-to-clear-rdp-connections-history/"], "timestamp_override": "event.ingested", "author": ["Christian Burkard"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
