{"description": "A General detection to trigger for processes removing .*\\shell\\open\\command registry keys. Registry keys that might have been used for COM hijacking activities.", "enabled": false, "false_positives": ["Legitimate software (un)installations are known to cause some false positives. Please add them as a filter when encountered"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "96f697b0-b499-4e5d-9908-a67bec11cdb6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Removal of Potential COM Hijacking Registry Keys", "query": "((winlog.event_data.EventType:\"DeleteKey\" AND winlog.event_data.TargetObject:*\\\\shell\\\\open\\\\command) AND (NOT ((process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\svchost.exe\") OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable.text:*\\\\OfficeClickToRun.exe) OR (process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\") OR (process.executable.text:*\\\\Dropbox.exe AND winlog.event_data.TargetObject:*\\\\Dropbox.*) OR (process.executable.text:*\\\\AppData\\\\Local\\\\Temp\\\\Wireshark_uninstaller.exe AND winlog.event_data.TargetObject:*\\\\wireshark\\-capture\\-file\\\\*) OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\Opera\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Opera\\\\*) AND process.executable.text:*\\\\installer.exe) OR (process.executable.text:*peazip* AND winlog.event_data.TargetObject:*\\\\PeaZip.*) OR (process.executable.text:*\\\\Everything.exe AND winlog.event_data.TargetObject:*\\\\Everything.*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/7", "https://threathunterplaybook.com/evals/apt29/detections/3.C.1_22A46621-7A92-48C1-81BF-B3937EB4FDC3.html", "https://docs.microsoft.com/en-us/windows/win32/shell/launch", "https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand", "https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
