{"description": "Detects non-sysinternals tools setting the \"accepteula\" key which normally is set on sysinternals tool execution", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8023f872-3f1d-4301-a384-801889917ab4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Usage of Renamed Sysinternals Tools - RegistrySet", "query": "(((winlog.event_data.TargetObject:(/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp].*/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee].*/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd].*/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt].*/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd].*/ OR /.*\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/) AND winlog.event_data.TargetObject:/.*\\\\[Ee][Uu][Ll][Aa][Aa][Cc][Cc][Ee][Pp][Tt][Ee][Dd]/) AND (NOT process.executable:(/.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ee][Xx][Ee][Cc]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Dd][Uu][Mm][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ll][Ii][Vv][Ee][Kk][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Ll][Oo][Gg][Ll][Ii][Ss][Tt]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Ss][Pp][Aa][Ss][Ss][Ww][Dd]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Dd][Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]64\\.[Ee][Xx][Ee]/))) AND (NOT NOT _exists_:process.executable.text))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Resource Development", "T1588"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1588", "name": "Obtain Capabilities", "reference": "https://attack.mitre.org/techniques/T1588"}]}], "version": 1, "references": ["Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
