{"description": "Detects potential persistence using Appx DebugPath", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "df4dc653-1029-47ba-8231-3c44238cc0ae", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Registry Persistence DebugPath", "query": "(winlog.event_data.EventType:\"SetValue\" AND ((winlog.event_data.TargetObject:*Classes\\\\ActivatableClasses\\\\Package\\\\Microsoft.* AND winlog.event_data.TargetObject:*\\\\DebugPath) OR (winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\PackagedAppXDebug\\\\Microsoft.* AND winlog.event_data.TargetObject:*\\\\\\(Default\\))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://oddvar.moe/2018/09/06/persistence-using-universal-windows-platform-apps-appx/", "https://github.com/rootm0s/WinPwnage"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
