{"description": "Detects disabling the CrashDump per registry (as used by HermeticWiper)", "author": ["Tobias Michalski (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate disabling of crashdumps"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2ff692c2-4594-41ec-8fcb-46587de769e0", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CrashControl CrashDump Disabled", "query": "(winlog.event_data.TargetObject:/.*[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Cc][Rr][Aa][Ss][Hh][Cc][Oo][Nn][Tt][Rr][Oo][Ll].*/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1112", "T1564"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
