{"description": "Detects registry persistence technique using the GlobalFlags and SilentProcessExit keys", "author": ["Karneades", "Jonhnathan Ribeiro", "Florian Roth"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "36803969-5421-41ec-b92f-8500f79c23b0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via GlobalFlags", "query": "(winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\* AND winlog.event_data.TargetObject:*\\\\Image\\ File\\ Execution\\ Options\\\\* AND winlog.event_data.TargetObject:*\\\\GlobalFlag* AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\* AND winlog.event_data.TargetObject:*\\\\SilentProcessExit\\\\* AND winlog.event_data.TargetObject:(*\\\\ReportingMode* OR *\\\\MonitorProcess*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/", "https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
