{"description": "Detects installation of NalDrv or PROCEXP152 services via registry-keys to non-system32 folders.\nBoth services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses KDU (https://github.com/hfiref0x/KDU)\n", "author": ["xknow (@xknow_infosec)", "xorxes (@xor_xes)"], "enabled": false, "false_positives": ["Other legimate tools using this service names and drivers. Note - clever attackers may easily bypass this detection by just renaming the services. Therefore just Medium-level and don't rely on it."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f2485272-a156-4773-82d7-1d178bc4905b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Service Installed", "query": "(winlog.event_data.TargetObject:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Nn][Aa][Ll][Dd][Rr][Vv]\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]152\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]/) AND (NOT (process.executable:(/.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Pp][Rr][Oo][Cc][Mm][Oo][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Hh][Aa][Nn][Dd][Ll][Ee]64\\.[Ee][Xx][Ee]/) AND winlog.event_data.Details:/.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Pp][Rr][Oo][Cc][Ee][Xx][Pp]152\\.[Ss][Yy][Ss].*/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://web.archive.org/web/20200419024230/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
