{"description": "Detects the addition of the \"Debugger\" value to the \"DbgManagedDebugger\" key in order to achieve persistence. Which will get invoked when an application crashes", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate use of the key to setup a debugger. Which is often the case on developers machines"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9827ae57-3802-418f-994b-d5ecf5cd974b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Registry Persistence Attempt Via DbgManagedDebugger", "query": "(winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\.[Nn][Ee][Tt][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\[Dd][Bb][Gg][Mm][Aa][Nn][Aa][Gg][Ee][Dd][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]/ AND (NOT winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Ss][Jj][Ii][Tt][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]\\.[Ee][Xx][Ee]\\\"\\ [Pp][Ii][Dd]\\ \\%[Dd]\\ [Aa][Pp][Pp][Dd][Oo][Mm]\\ \\%[Dd]\\ [Ee][Xx][Tt][Ee][Xx][Tt]\\ \\\"\\%[Ss]\\\"\\ [Ee][Vv][Tt][Hh][Dd][Ll]\\ \\%[Dd]/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/", "https://github.com/last-byte/PersistenceSniper"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
