{"description": "Detects when an attacker register a new SIP provider for persistence and defense evasion", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate SIP being registered by the OS or different software."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5a2b21ee-6aaa-4234-ac9d-59a59edf90a1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Persistence Via New SIP Provider", "query": "((winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Oo][Ii][Dd]\\\\[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg][Tt][Yy][Pp][Ee].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Rr][Yy][Pp][Tt][Oo][Gg][Rr][Aa][Pp][Hh][Yy]\\\\[Oo][Ii][Dd]\\\\[Ee][Nn][Cc][Oo][Dd][Ii][Nn][Gg][Tt][Yy][Pp][Ee].*/) AND winlog.event_data.TargetObject:(/.*\\\\[Dd][Ll][Ll].*/ OR /.*\\\\\\$[Dd][Ll][Ll].*/)) AND (NOT ((winlog.event_data.Details:(/[Ww][Ii][Nn][Tt][Rr][Uu][Ss][Tt]\\.[Dd][Ll][Ll]/ OR /[Mm][Ss][Oo]\\.[Dd][Ll][Ll]/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Oo][Qq][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Cc][Rr][Yy][Pp][Tt][Ss][Ii][Pp][Dd][Ll][Ll].*/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Ss][Ff][Ss][Ii][Pp]\\.[Dd][Ll][Ll]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1553"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1553", "name": "Subvert Trust Controls", "reference": "https://attack.mitre.org/techniques/T1553"}]}], "version": 1, "references": ["https://persistence-info.github.io/Data/codesigning.html", "https://github.com/gtworek/PSBits/tree/master/SIP", "https://specterops.io/assets/resources/SpecterOps_Subverting_Trust_in_Windows.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
