{"description": "Detects changes to 'HKCU\\Software\\Classes\\Folder\\shell\\open\\command\\DelegateExecute'", "author": ["Omkar Gudhate"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "07743f65-7ec9-404a-a519-913db7118a8d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "COM Hijack via Sdclt", "query": "winlog.event_data.TargetObject:/[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Ff][Oo][Ll][Dd][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Dd][Ee][Ll][Ee][Gg][Aa][Tt][Ee][Ee][Xx][Ee][Cc][Uu][Tt][Ee]/", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1546", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}, {"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass", "https://www.exploit-db.com/exploits/47696"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
