{"description": "Detects installation of new shim databases that try to patch sections of known processes for potential process injection or persistence.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bf344fea-d947-4ef4-9192-34d008315d3a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Shim Database Patching Activity", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Cc][Uu][Ss][Tt][Oo][Mm]\\\\.*/ AND winlog.event_data.TargetObject:(/.*\\\\[Cc][Ss][Rr][Ss][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Dd][Ll][Ll][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Tt][Aa][Ss][Kk][Hh][Oo][Ss][Tt][Ww]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\.[Ee][Xx][Ee]/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/pillowmint-fin7s-monkey-thief/", "https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
