{"description": "Detects changes to Microsoft Office protected view registry keys with which the attacker disables this feature.", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a5c7a43f-6009-4a8c-80c5-32abf1c53ecc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Office Protected View Disabled", "query": "((winlog.event_data.EventType:SetValue AND winlog.event_data.TargetObject:/.*\\\\\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\\\\\.*/ AND winlog.event_data.TargetObject:/.*\\\\\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\\\\\[Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd][Vv][Ii][Ee][Ww]\\\\\\\\.*/) AND (((winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ AND winlog.event_data.TargetObject:(/.*\\\\\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Tt][Tt][Aa][Cc][Hh][Ee][Mm][Ee][Nn][Tt][Ss][Ii][Nn][Pp][Vv]/ OR /.*\\\\\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt][Ff][Ii][Ll][Ee][Ss][Ii][Nn][Pp][Vv]/ OR /.*\\\\\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Aa][Nn][Ee][Tt][Cc][Hh][Ee][Cc][Kk]/ OR /.*\\\\\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Uu][Nn][Ss][Aa][Ff][Ee][Ll][Oo][Cc][Aa][Tt][Ii][Oo][Nn][Ss][Ii][Nn][Pp][Vv]/))) OR ((winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/ AND winlog.event_data.TargetObject:(/.*\\\\\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Dd][Aa][Tt][Aa][Bb][Aa][Ss][Ee][Ff][Ii][Ll][Ee][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd][Vv][Ii][Ee][Ww]/ OR /.*\\\\\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Ff][Oo][Rr][Ee][Ii][Gg][Nn][Tt][Ee][Xx][Tt][Ff][Ii][Ll][Ee][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ee][Dd][Vv][Ii][Ee][Ww]/)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/", "https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/", "https://admx.help/HKCU/software/policies/microsoft/office/16.0/excel/security/protectedview"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
