{"description": "Enable Dynamic Data Exchange protocol (DDE) in all supported editions of Microsoft Word or Excel.", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "63647769-326d-4dde-a419-b925cc0caf42", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Enable Microsoft Dynamic Data Exchange", "query": "(((winlog.event_data.TargetObject:/.*\\\\[Ww][Oo][Rr][Dd]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Aa][Ll][Ll][Oo][Ww][Dd][Dd][Ee]/ AND winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000002\\)/))) OR ((winlog.event_data.TargetObject:(/.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd][Dd][Ee][Ss][Ee][Rr][Vv][Ee][Rr][Ll][Aa][Uu][Nn][Cc][Hh]/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd][Dd][Ee][Ss][Ee][Rr][Vv][Ee][Rr][Ll][Oo][Oo][Kk][Uu][Pp]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1559"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1559", "name": "Inter-Process Communication", "reference": "https://attack.mitre.org/techniques/T1559"}]}], "version": 1, "references": ["https://msrc.microsoft.com/update-guide/vulnerability/ADV170021"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
