{"description": "Detects potential persistence activity via outlook home pages.", "author": ["Tobias Michalski (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ddd171b5-2cc6-4975-9e78-f0eccd08cc76", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Outlook Home Page", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Software\\\\Microsoft\\\\Office\\\\* OR *\\\\Outlook\\\\WebView\\\\*) AND winlog.event_data.TargetObject:*\\\\URL AND winlog.event_data.TargetObject:(*\\\\Calendar\\\\* OR *\\\\Inbox\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1112"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70", "https://support.microsoft.com/en-us/topic/outlook-home-page-feature-is-missing-in-folder-properties-d207edb7-aa02-46c5-b608-5d9dbed9bd04?ui=en-us&rs=en-us&ad=us"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
