{"description": "Detects a new and suspicious printer port creation in Registry that could be an attempt to exploit CVE-2020-1048", "author": ["EagleEye Team", "Florian Roth (Nextron Systems)", "NVISO"], "enabled": false, "false_positives": ["New printer port install on host"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7ec912f2-5175-4868-b811-ec13ad0f8567", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious New Printer Ports in Registry (CVE-2020-1048)", "query": "(winlog.event_data.TargetObject:/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Rr][Tt][Ss].*/ AND winlog.event_data.Details:(/.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Ee][Xx][Ee].*/ OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Cc][Oo][Mm].*/ OR /.*[Cc]\\:.*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://windows-internals.com/printdemon-cve-2020-1048/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
