{"description": "Detects tampering with autologger trace sessions which is a technique used by attackers to disable logging", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f37b4bce-49d0-4087-9f5b-58bffda77316", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential AutoLogger Sessions Tampering", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ww][Mm][Ii]\\\\[Aa][Uu][Tt][Oo][Ll][Oo][Gg][Gg][Ee][Rr]\\\\.*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg]\\-.*/ OR /.*\\\\[Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr].*/) AND winlog.event_data.TargetObject:(/.*\\\\[Ee][Nn][Aa][Bb][Ll][Ee]/ OR /.*\\\\[Ss][Tt][Aa][Rr][Tt]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/) AND (NOT process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ee][Vv][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/MichalKoczwara/status/1553634816016498688", "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://i.blackhat.com/EU-21/Wednesday/EU-21-Teodorescu-Veni-No-Vidi-No-Vici-Attacks-On-ETW-Blind-EDRs.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
