{"description": "Detects persistence via Visual Studio Tools for Office (VSTO) add-ins in Office applications.", "author": ["Bhabesh Raj"], "enabled": false, "false_positives": ["Legitimate Addin Installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "acaaeeda-ba7b-4aa1-71b7-32603ca51b52", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via Visual Studio Tools for Office", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Software\\\\Microsoft\\\\Office\\\\Outlook\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\Office\\\\Word\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\Office\\\\Excel\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\Office\\\\Powerpoint\\\\Addins\\\\* OR *\\\\Software\\\\Microsoft\\\\VSTO\\\\Security\\\\Inclusion\\\\*)) AND (NOT ((process.executable.text:(*\\\\msiexec.exe OR *\\\\regsvr32.exe)) OR (process.executable.text:(*\\\\winword.exe OR *\\\\integrator.exe OR *\\\\OfficeClickToRun.exe)) OR ((process.executable.text:\"C:\\Program Files\\AVG\\Antivirus\\RegSvr.exe\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Office\\\\Outlook\\\\Addins\\\\Antivirus.AsOutExt\\\\*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://twitter.com/_vivami/status/1347925307643355138", "https://vanmieghem.io/stealth-outlook-persistence/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
