{"description": "Detects that a powershell code is written to the registry as a service.", "author": ["oscd.community", "Natalia Shornikova"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4a5f5a5e-ac01-474b-9b4e-d61298c9df1d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell as a Service in Registry", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND winlog.event_data.TargetObject:/.*\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh]/ AND winlog.event_data.Details:(*powershell* OR *pwsh*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1569"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1569", "name": "System Services", "reference": "https://attack.mitre.org/techniques/T1569"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
