{"description": "Detects the keyboard preload installation with a suspicious keyboard layout, e.g. Chinese, Iranian or Vietnamese layout load in user session on systems maintained by US staff only", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Administrators or users that actually use the selected keyboard layouts (heavily depends on the organisation's user base)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "34aa0252-6039-40ff-951f-939fd6ce47d8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Keyboard Layout Load", "query": "(winlog.event_data.TargetObject:(/.*\\\\[Kk][Ee][Yy][Bb][Oo][Aa][Rr][Dd]\\ [Ll][Aa][Yy][Oo][Uu][Tt]\\\\[Pp][Rr][Ee][Ll][Oo][Aa][Dd]\\\\.*/ OR /.*\\\\[Kk][Ee][Yy][Bb][Oo][Aa][Rr][Dd]\\ [Ll][Aa][Yy][Oo][Uu][Tt]\\\\[Ss][Uu][Bb][Ss][Tt][Ii][Tt][Uu][Tt][Ee][Ss]\\\\.*/) AND winlog.event_data.Details:(*00000429* OR *00050429* OR *0000042a*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Resource Development", "T1588"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1588", "name": "Obtain Capabilities", "reference": "https://attack.mitre.org/techniques/T1588"}]}], "version": 1, "references": ["https://renenyffenegger.ch/notes/Windows/registry/tree/HKEY_CURRENT_USER/Keyboard-Layout/Preload/index", "https://github.com/SwiftOnSecurity/sysmon-config/pull/92/files"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
