{"description": "Detects when an attacker modifies the registry key \"HtmlHelp Author\" to achieve persistence", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "976dd1f2-a484-45ec-aa1d-0e87e882262b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via CHM Helper DLL", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Software\\\\Microsoft\\\\HtmlHelp\\ Author\\\\Location* OR *\\\\Software\\\\WOW6432Node\\\\Microsoft\\\\HtmlHelp\\ Author\\\\Location*))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/htmlhelpauthor.html", "https://www.hexacorn.com/blog/2018/04/22/beyond-good-ol-run-key-part-76/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
