{"description": "Detects potential COM object hijacking where the \"Server\" (In/Out) is pointing to a supsicious or unsuale location", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Probable legitimate applications. If you find these please add them to an exclusion list"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3d968d17-ffa4-4bc0-bfdc-f139de76ce77", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via COM Hijacking From Suspicious Locations", "query": "(winlog.event_data.TargetObject:(/[Hh][Kk][Cc][Rr]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/ OR /[Hh][Kk][Ee][Yy]\\_[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\_[Rr][Oo][Oo][Tt]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/ OR /[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/ OR /[Hh][Kk][Ee][Yy]\\_[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\_[Uu][Ss][Ee][Rr]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/) AND winlog.event_data.TargetObject:(/.*\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ OR /.*\\\\[Ll][Oo][Cc][Aa][Ll][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/) AND winlog.event_data.Details:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Tt][Aa][Rr][Tt]\\ [Mm][Ee][Nn][Uu]\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp]\\\\.*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Cc][Oo][Ll][Oo][Rr]\\\\.*/ OR /.*\\%[Tt][Ee][Mm][Pp]\\%.*/ OR /.*\\%[Tt][Mm][Pp]\\%.*/ OR /.*\\%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\%.*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/ (idea)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
