{"description": "Detects the registration of a new ODBC driver where the driver is located in a potentially suspicious location", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e4d22291-f3d5-4b78-9a0c-a1fbaf32a6a4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potentially Suspicious ODBC Driver Registered", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\ODBC\\\\ODBCINST.INI\\\\* AND winlog.event_data.TargetObject:(*\\\\Driver OR *\\\\Setup) AND winlog.event_data.Details:(*\\:\\\\PerfLogs\\\\* OR *\\:\\\\ProgramData\\\\* OR *\\:\\\\Temp\\\\* OR *\\:\\\\Users\\\\Public\\\\* OR *\\:\\\\Windows\\\\Registration\\\\CRMLog* OR *\\:\\\\Windows\\\\System32\\\\com\\\\dmp\\\\* OR *\\:\\\\Windows\\\\System32\\\\FxsTmp\\\\* OR *\\:\\\\Windows\\\\System32\\\\Microsoft\\\\Crypto\\\\RSA\\\\MachineKeys\\\\* OR *\\:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\color\\\\* OR *\\:\\\\Windows\\\\System32\\\\spool\\\\PRINTERS\\\\* OR *\\:\\\\Windows\\\\System32\\\\spool\\\\SERVERS\\\\* OR *\\:\\\\Windows\\\\System32\\\\Tasks_Migrated\\\\* OR *\\:\\\\Windows\\\\System32\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\com\\\\dmp\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\FxsTmp\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\PLA\\\\System\\\\* OR *\\:\\\\Windows\\\\SysWOW64\\\\Tasks\\\\Microsoft\\\\Windows\\\\SyncCenter\\\\* OR *\\:\\\\Windows\\\\Tasks\\\\* OR *\\:\\\\Windows\\\\Temp\\\\* OR *\\:\\\\Windows\\\\Tracing\\\\* OR *\\\\AppData\\\\Local\\\\Temp\\\\* OR *\\\\AppData\\\\Roaming\\\\*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1003"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
