{"description": "Detects the abuse of custom file open handler, executing powershell", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "31069c3d-2d36-8df5-67a2-b28f3ff5e4b5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Custom File Open Handler Executes PowerShell", "query": "(winlog.event_data.TargetObject:*shell\\\\open\\\\command\\\\* AND winlog.event_data.Details:*powershell* AND winlog.event_data.Details:*\\-command* AND winlog.event_data.EventType:\"SetValue\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1202"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1202", "name": "Indirect Command Execution", "reference": "https://attack.mitre.org/techniques/T1202"}]}], "version": 1, "references": ["https://news.sophos.com/en-us/2022/02/01/solarmarker-campaign-used-novel-registry-changes-to-establish-persistence/?cmp=30728"], "timestamp_override": "event.ingested", "author": ["CD_R0M_"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
