{"description": "Detects potential COM object hijacking leveraging the COM Search Order", "author": ["Maxime Thiebaut (@0xThiebaut)", "oscd.community", "C\u00e9dric Hien"], "enabled": false, "false_positives": ["Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via COM Search Order Hijacking", "query": "((winlog.event_data.TargetObject:(/[Hh][Kk][Cc][Rr]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/ OR /[Hh][Kk][Cc][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\.*/) AND winlog.event_data.TargetObject:/.*\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/) AND (NOT ((winlog.event_data.Details:(/.*\\%\\%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]\\%\\%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*\\%\\%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]\\%\\%\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/)) OR (winlog.event_data.Details:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\.*/ OR /.*\\\\[Ff][Ii][Ll][Ee][Cc][Oo][Aa][Uu][Tt][Hh][Ll][Ii][Bb]64\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Ff][Ii][Ll][Ee][Ss][Yy][Nn][Cc][Ss][Hh][Ee][Ll][Ll]64\\.[Dd][Ll][Ll].*/ OR /.*\\\\[Ff][Ii][Ll][Ee][Ss][Yy][Nn][Cc][Aa][Pp][Ii]64\\.[Dd][Ll][Ll].*/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Hh][Ee][Aa][Ll][Tt][Hh][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss][Mm][Ee][Ee][Tt][Ii][Nn][Gg][Aa][Dd][Dd][Ii][Nn]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Tt][Ee][Aa][Mm][Ss]\\.[Aa][Dd][Dd][Ii][Nn][Ll][Oo][Aa][Dd][Ee][Rr]\\.[Dd][Ll][Ll].*/) OR (winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Ee][Xx][Tt]64\\.\\*\\.[Dd][Ll][Ll].*/) OR (winlog.event_data.Details:/.*[Tt][Mm][Oo][Pp][Ii][Ee][Pp][Ll][Gg]\\.[Dd][Ll][Ll]/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Uu][Aa][Uu][Cc][Ll][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/) AND process.executable:/.*\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/)) OR (winlog.event_data.Details:/.*\\\\[Ff][Ii][Ll][Ee][Rr][Ee][Pp][Oo][Ss][Ii][Tt][Oo][Rr][Yy]\\\\[Nn][Vv][Mm][Dd][Ii]\\.[Ii][Nn][Ff].*/) OR (process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Cc][Oo][Mm][Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Ss][Hh][Ee][Ll][Ll]64\\.[Ee][Xx][Ee]/) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Xx][Dd][Ii][Aa][Gg]\\.[Ee][Xx][Ee]/) OR (winlog.event_data.Details:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Yy][Ss][Hh][Ee][Ll][Ll][Ee][Xx][Tt]\\.[Aa][Mm][Dd]64\\.[Dd][Ll][Ll]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Yy][Ss][Hh][Ee][Ll][Ll][Ee][Xx][Tt]\\.[Dd][Ll][Ll]/)) OR (winlog.event_data.Details:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Nn][Ss][Ss][Dd][Xx]\\.[Dd][Ll][Ll]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\[Dd][Nn][Ss][Ss][Dd][Xx]\\.[Dd][Ll][Ll]/)) OR (winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Xx]64\\\\3\\\\[Pp][Rr][Ii][Nn][Tt][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Dd][Ll][Ll]/) OR (winlog.event_data.Details:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/)) OR (winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\.*/) OR (winlog.event_data.Details:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Gg][Aa][Mm][Ii][Nn][Gg][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Pp][Rr][Oo][Xx][Yy]\\.[Dd][Ll][Ll].*/) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Oo][Qq][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Aa][Uu][Tt][Oo][Pp][Ii][Ll][Oo][Tt]\\.[Dd][Ll][Ll].*/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Hh][Ee][Aa][Ll][Tt][Hh][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Hh][Ee][Aa][Ll][Tt][Hh].*/)) OR ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Oo][Qq][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetObject:/.*\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
