{"description": "Detects the modification of the registry to disable a system restore on the computer", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5de03871-5d46-4539-a82d-3aa992a69a83", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Registry Disable System Restore", "query": "(winlog.event_data.EventType:\"Setvalue\" AND winlog.event_data.TargetObject:(HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\SystemRestore* OR HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SystemRestore*) AND winlog.event_data.TargetObject:(*DisableConfig OR *DisableSR) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
