{"description": "Detects changes to the AppInstaller (winget) policy. Specifically the activation of the local manifest installation, which allows a user to install new packages via custom manifests.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Administrators or developers might enable this for testing purposes or to install custom private packages"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa277e82-9b78-42dd-b05c-05555c7b6015", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Enable Local Manifest Installation With Winget", "query": "(winlog.event_data.TargetObject:/.*\\\\[Aa][Pp][Pp][Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Ll][Oo][Cc][Aa][Ll][Mm][Aa][Nn][Ii][Ff][Ee][Ss][Tt][Ff][Ii][Ll][Ee][Ss]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
