{"description": "Detects changes to registry keys related to \"Trusted Location\" of Microsoft Office where the path is set to something uncommon. Attackers might add additional trusted locations to avoid macro security restrictions.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Other unknown legitimate or custom paths need to be filtered to avoid false positives"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f742bde7-9528-42e5-bd82-84f51a8387d2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Uncommon Microsoft Office Trusted Location Added", "query": "(((winlog.event_data.EventType:\"Setvalue\" AND winlog.event_data.TargetObject:*Security\\\\Trusted\\ Locations\\\\Location* AND winlog.event_data.TargetObject:*\\\\Path) AND (NOT (((process.executable.text:\"C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\*\" AND process.executable.text:\"*\\\\OfficeClickToRun.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\*\") AND process.executable.text:(\"*\\\\winword.exe\" OR \"*\\\\excel.exe\")))))) AND (NOT winlog.event_data.Details:(%APPDATA%\\\\Microsoft\\\\Templates* OR %%APPDATA%%\\\\Microsoft\\\\Templates* OR %APPDATA%\\\\Microsoft\\\\Word\\\\Startup* OR %%APPDATA%%\\\\Microsoft\\\\Word\\\\Startup* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\Templates\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\ \\(x86\\)\\\\Templates* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\root\\\\Templates\\\\* OR C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\Templates\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["Internal Research", "https://admx.help/?Category=Office2016&Policy=excel16.Office.Microsoft.Policies.Windows::L_TrustedLoc01"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
