{"description": "Detects the registration of a new ODBC driver.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Likely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3390fbef-c98d-4bdd-a863-d65ed7c610dd", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "New ODBC Driver Registered", "query": "(((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\ODBC\\\\ODBCINST.INI\\\\* AND winlog.event_data.TargetObject:*\\\\Driver) AND (NOT (winlog.event_data.TargetObject:*\\\\SQL\\ Server\\\\* AND winlog.event_data.Details:\"%WINDIR%\\System32\\SQLSRV32.dll\"))) AND (NOT (((winlog.event_data.TargetObject:*\\\\Microsoft\\ Access\\ * AND winlog.event_data.Details:C\\:\\\\Progra* AND winlog.event_data.Details:*\\\\ACEODBC.DLL)) OR ((winlog.event_data.TargetObject:*\\\\Microsoft\\ Excel\\ Driver* AND winlog.event_data.Details:C\\:\\\\Progra* AND winlog.event_data.Details:*\\\\ACEODBC.DLL)))))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
