{"description": "Detects registry changes to Office macro settings. The TrustRecords contain information on executed macro-enabled documents. (see references)", "enabled": false, "false_positives": ["Valid Macros and/or internal documents"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Office Security Settings Changed", "query": "(winlog.event_data.EventType:\"Setvalue\" AND winlog.event_data.TargetObject:(*\\\\Security\\\\Trusted\\ Documents\\\\TrustRecords OR *\\\\Security\\\\AccessVBOM OR *\\\\Security\\\\VBAWarnings))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/inversecos/status/1494174785621819397", "https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/", "https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/"], "timestamp_override": "event.ingested", "author": ["Trent Liffick (@tliffick)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
