{"description": "Detects changes to the \"Default\" property for keys located in the \\Software\\Microsoft\\Windows\\CurrentVersion\\App Paths\\ registry. Which might be used as a method of persistence\nThe entries found under App Paths are used primarily for the following purposes.\nFirst, to map an application's executable file name to that file's fully qualified path.\nSecond, to pre-pend information to the PATH environment variable on a per-application, per-process basis.\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate applications registering their binary from on of the suspicious locations mentioned above (tune it)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "707e097c-e20f-4f67-8807-1f72ff4500d6", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via App Paths Default Property", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Pp][Pp]\\ [Pp][Aa][Tt][Hh][Ss].*/ AND winlog.event_data.TargetObject:(/.*\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ OR *Path) AND winlog.event_data.Details:(/.*\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc].*/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /.*\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\.*/ OR /.*\\\\[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss]\\\\.*/ OR /.*\\%[Tt][Ee][Mm][Pp]\\%.*/ OR /.*\\%[Tt][Mm][Pp]\\%.*/ OR *iex* OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-.*/ OR *rundll32* OR *regsvr32* OR *mshta* OR *cscript* OR *wscript* OR /.*\\.[Bb][Aa][Tt].*/ OR /.*\\.[Hh][Tt][Aa].*/ OR /.*\\.[Dd][Ll][Ll].*/ OR /.*\\.[Pp][Ss]1.*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/", "https://docs.microsoft.com/en-us/windows/win32/shell/app-registration?redirectedfrom=MSDN"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
