{"description": "Detects tamper attempts to sophos av functionality via registry key modification", "enabled": false, "false_positives": ["Some FP may occure when the feature is disabled by the AV itself, you should always investigate if the action was legitimate"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2c0ed973-ae54-f656-9c14-2993fbc7db02", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tamper With Sophos AV Registry Keys", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Sophos\\ Endpoint\\ Defense\\\\TamperProtection\\\\Config\\\\SAVEnabled* OR *\\\\Sophos\\ Endpoint\\ Defense\\\\TamperProtection\\\\Config\\\\SEDEnabled* OR *\\\\Sophos\\\\SAVService\\\\TamperProtection\\\\Enabled*) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
