{"description": "Detects the modification of the registry of the currently logged in user to disable PowerShell module logging, script block logging or transcription and script execution logging", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "PowerShell Logging Disabled", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ModuleLogging\\\\EnableModuleLogging OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ScriptBlockLogging\\\\EnableScriptBlockLogging OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\Transcription\\\\EnableTranscripting OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\EnableScripts) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
