{"description": "A General detection for a new application in AppCompat. This indicates an application executing for the first time on an endpoint.", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "enabled": false, "false_positives": ["This rule is to explore new applications on an endpoint. False positives depends on the organization.", "Newly setup system.", "Legitimate installation of new application."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "60936b49-fca0-4f32-993d-7415edcf9a5d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Application in AppCompat", "query": "winlog.event_data.TargetObject:/.*\\\\[Aa][Pp][Pp][Cc][Oo][Mm][Pp][Aa][Tt][Ff][Ll][Aa][Gg][Ss]\\\\[Cc][Oo][Mm][Pp][Aa][Tt][Ii][Bb][Ii][Ll][Ii][Tt][Yy]\\ [Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]\\\\[Ss][Tt][Oo][Rr][Ee]\\\\.*/", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/1", "https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/1.A.1_DFD6A782-9BDB-4550-AB6B-525E825B095E.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
