{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "046218bd-e0d8-4113-a3c3-895a12b2b298", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Session Manager Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Ee][Ss][Ss][Ii][Oo][Nn]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr].*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ss][Ee][Tt][Uu][Pp][Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*\\\\[Ss]0[Ii][Nn][Ii][Tt][Ii][Aa][Ll][Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*\\\\[Kk][Nn][Oo][Ww][Nn][Dd][Ll][Ll][Ss].*/ OR /.*\\\\[Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*\\\\[Bb][Oo][Oo][Tt][Ee][Xx][Ee][Cc][Uu][Tt][Ee].*/ OR /.*\\\\[Aa][Pp][Pp][Cc][Ee][Rr][Tt][Dd][Ll][Ll][Ss].*/)) AND (NOT winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546", "T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}, {"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
