{"description": "Detects installation of NalDrv or PROCEXP152 services via registry-keys to non-system32 folders. Both services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses KDU (https://github.com/hfiref0x/KDU)", "enabled": false, "false_positives": ["Other legimate tools using this service names and drivers. Note - clever attackers may easily bypass this detection by just renaming the services. Therefore just Medium-level and don't rely on it."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "984afd12-d24d-9d5a-ee6b-dd914d4ad50a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Service Installed", "query": "(((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(\"HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\NalDrv\\\\ImagePath\" OR \"HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\PROCEXP152\\\\ImagePath\")) AND (NOT (process.executable:(*\\\\procexp64.exe OR *\\\\procexp.exe OR *\\\\procmon64.exe OR *\\\\procmon.exe)))) AND (NOT (winlog.event_data.Details:*\\\\WINDOWS\\\\system32\\\\Drivers\\\\PROCEXP152.SYS*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/"], "timestamp_override": "event.ingested", "author": ["xknow (@xknow_infosec)", "xorxes (@xor_xes)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
