{"description": "Detects when an attacker register a new SIP provider for persistence and defense evasion", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Might trigger if a legitimate new SIP provider is registered. But this is not a common occurrence in an environment and should be investigated either way"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fd004942-0ffc-7cdb-582c-6f7a97ddb61c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Mpnotify", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon\\\\mpnotify*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/mpnotify.html", "https://www.youtube.com/watch?v=ggY3srD9dYs&ab_channel=GrzegorzTworek"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
