{"description": "Detects registry modifications that change features of internal Windows tools (malware like Agent Tesla uses this technique)", "author": ["frack113", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate admin script"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e2482f8d-3443-4237-b906-cc145d87a076", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Disable Internal Tools or Feature in Registry", "query": "(((winlog.event_data.TargetObject:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy][Tt][Oo][Oo][Ll][Ss]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Cc][Mm][Dd]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Tt][Aa][Ss][Kk][Mm][Gg][Rr]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Cc][Ee][Nn][Tt][Ee][Rr]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Cc][Hh][Aa][Nn][Gg][Ee][Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ll][Oo][Cc][Kk][Ww][Oo][Rr][Kk][Ss][Tt][Aa][Tt][Ii][Oo][Nn]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Tt][Aa][Rr][Tt][Mm][Ee][Nn][Uu][Ll][Oo][Gg][Oo][Ff][Ff]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)) OR ((winlog.event_data.TargetObject:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn][Ww][Ii][Tt][Hh][Oo][Uu][Tt][Ll][Oo][Gg][Oo][Nn]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Oo][Nn][Ss][Ee][Nn][Tt][Pp][Rr][Oo][Mm][Pp][Tt][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Aa][Dd][Mm][Ii][Nn]/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Uu][Ss][Hh][Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ss]\\\\[Tt][Oo][Aa][Ss][Tt][Ee][Nn][Aa][Bb][Ll][Ee][Dd]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\\\[Ww][Rr][Ii][Tt][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Tt][Oo][Rr][Aa][Gg][Ee][Dd][Ee][Vv][Ii][Cc][Ee][Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ww][Rr][Ii][Tt][Ee][Pp][Rr][Oo][Tt][Ee][Cc][Tt]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md", "https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions", "https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
