{"description": "Detects changes to the registry for the currently logged-in user. In order to disable PowerShell module logging, script block logging or transcription and script execution logging", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c6cde6e5-6e37-710b-6004-0d960492a881", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "PowerShell Logging Disabled Via Registry Key Tampering", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Microsoft\\\\Windows\\\\PowerShell\\\\* OR *\\\\Microsoft\\\\PowerShellCore\\\\*) AND winlog.event_data.TargetObject:(*\\\\ModuleLogging\\\\EnableModuleLogging OR *\\\\ScriptBlockLogging\\\\EnableScriptBlockLogging OR *\\\\ScriptBlockLogging\\\\EnableScriptBlockInvocationLogging OR *\\\\Transcription\\\\EnableTranscripting OR *\\\\Transcription\\\\EnableInvocationHeader OR *\\\\EnableScripts) AND winlog.event_data.Details:\"DWORD (0x00000000)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
