{"description": "Detects the modification of Outlook security setting to allow unprompted execution of macros.", "author": ["@ScoubiMtl"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e3b50fa5-3c3f-444e-937b-0a99d33731cd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Outlook Macro Execution Without Warning Setting Enabled", "query": "(winlog.event_data.TargetObject:/.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Ll][Ee][Vv][Ee][Ll]/ AND winlog.event_data.Details:*0x00000001*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1008", "T1137", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}, {"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/", "https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
