{"description": "Detects changes to Microsoft Office protected view registry keys with which the attacker disables this feature.", "author": ["frack113", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a5c7a43f-6009-4a8c-80c5-32abf1c53ecc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Office Protected View Disabled", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Office\\\\* AND winlog.event_data.TargetObject:*\\\\Security\\\\ProtectedView\\\\*) AND (((winlog.event_data.Details:\"DWORD (0x00000001)\" AND winlog.event_data.TargetObject:(*\\\\DisableAttachementsInPV OR *\\\\DisableInternetFilesInPV OR *\\\\DisableIntranetCheck OR *\\\\DisableUnsafeLocationsInPV))) OR ((winlog.event_data.Details:\"DWORD (0x00000000)\" AND winlog.event_data.TargetObject:(*\\\\enabledatabasefileprotectedview OR *\\\\enableforeigntextfileprotectedview)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md", "https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/", "https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/", "https://admx.help/HKCU/software/policies/microsoft/office/16.0/excel/security/protectedview"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
