{"description": "Detects set value ms-msdt MSProtocol URI scheme in Registry that could be an attempt to exploit CVE-2022-30190.", "author": ["Sittikorn S"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "2d9403d5-7927-46b7-8216-37ab7c9ec5e3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Set Value of MSDT in Registry (CVE-2022-30190)", "query": "winlog.event_data.TargetObject:/[Hh][Kk][Cc][Rr]\\\\[Mm][Ss]\\-[Mm][Ss][Dd][Tt]\\\\.*/", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1221"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1221", "name": "Template Injection", "reference": "https://attack.mitre.org/techniques/T1221"}]}], "version": 1, "references": ["https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-30190", "https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
