{"description": "Detects when an attacker register a new IFilter for an extension. Microsoft Windows Search uses filters to extract the content of items for inclusion in a full-text index. You can extend Windows Search to index new or proprietary file types by writing filters to extract the content, and property handlers to extract the properties of files", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate registration of IFilters by the OS or software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b23818c7-e575-4d13-8012-332075ec0a2b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Register New IFiltre For Persistence", "query": "((((winlog.event_data.TargetObject:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\\\..*/ OR /[Hh][Kk][Ee][Yy]\\_[Ll][Oo][Cc][Aa][Ll]\\_[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\\\..*/) AND winlog.event_data.TargetObject:/.*\\\\[Pp][Ee][Rr][Ss][Ii][Ss][Tt][Ee][Nn][Tt][Hh][Aa][Nn][Dd][Ll][Ee][Rr].*/)) OR ((winlog.event_data.TargetObject:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd].*/ OR /[Hh][Kk][Ee][Yy]\\_[Ll][Oo][Cc][Aa][Ll]\\_[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd].*/) AND winlog.event_data.TargetObject:/.*\\\\[Pp][Ee][Rr][Ss][Ii][Ss][Tt][Ee][Nn][Tt][Aa][Dd][Dd][Ii][Nn][Ss][Rr][Ee][Gg][Ii][Ss][Tt][Ee][Rr][Ee][Dd]\\\\\\{89[Bb][Cc][Bb]740\\-6119\\-101[Aa]\\-[Bb][Cc][Bb]7\\-00[Dd][Dd]010655[Aa][Ff]\\}.*/))) AND (NOT ((winlog.event_data.TargetObject:(/.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{4[Ff]46[Ff]75[Ff]\\-199[Ff]\\-4[Cc]63\\-8[Bb]7[Dd]\\-86[Dd]48[Ff][Ee]7970[Cc]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{4887767[Ff]\\-7[Aa][Dd][Cc]\\-4983\\-[Bb]576\\-88[Ff][Bb]643[Dd]6[Ff]79\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Dd]3[Bb]41[Ff][Aa]1\\-01[Ee]3\\-49[Aa][Ff]\\-[Aa][Aa]25\\-1[Dd]0[Dd]824275[Aa][Ee]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{72773[Ee]1[Aa]\\-[Bb]711\\-4[Dd]8[Dd]\\-81[Ff][Aa]\\-[Bb]9[Aa]43[Bb]0650[Dd][Dd]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{098[Ff]2470\\-[Bb][Aa][Ee]0\\-11[Cc][Dd]\\-[Bb]579\\-08002[Bb]30[Bb][Ff][Ee][Bb]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{1[Aa][Aa]9[Bb][Ff]05\\-9[Aa]97\\-48[Cc]1\\-[Bb][Aa]28\\-[Dd]9[Dd][Cc][Ee]795[Ee]93[Cc]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{2[Ee]2294[Aa]9\\-50[Dd]7\\-4[Ff][Ee]7\\-[Aa]09[Ff]\\-[Ee]6492[Ee]185884\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{34[Cc][Ee][Aa][Cc]8[Dd]\\-[Cc][Bb][Cc]0\\-4[Ff]77\\-[Bb]7[Bb]1\\-8[Aa]60[Cc][Bb]6[Dd][Aa]0[Ff]7\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{3[Bb]224[Bb]11\\-9363\\-407[Ee]\\-850[Ff]\\-[Cc]9[Ee]1[Ff][Ff][Aa][Cc][Dd]8[Ff][Bb]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{3[Dd][Dd][Ee][Bb]7[Aa]4\\-8[Aa][Bb][Ff]\\-4[Dd]82\\-[Bb]9[Ee][Ee]\\-[Ee]1[Ff]4552[Ee]95[Bb][Ee]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{5645[Cc]8[Cc]1\\-[Ee]277\\-11[Cc][Ff]\\-8[Ff][Dd][Aa]\\-00[Aa][Aa]00[Aa]14[Ff]93\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{5645[Cc]8[Cc]4\\-[Ee]277\\-11[Cc][Ff]\\-8[Ff][Dd][Aa]\\-00[Aa][Aa]00[Aa]14[Ff]93\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{58[Aa]9[Ee][Bb][Ff]6\\-5755\\-4554\\-[Aa]67[Ee]\\-[Aa]2467[Aa][Dd]1447[Bb]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{5[Ee]941[Dd]80\\-[Bb][Ff]96\\-11[Cc][Dd]\\-[Bb]579\\-08002[Bb]30[Bb][Ff][Ee][Bb]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{698[Aa]4[Ff][Ff][Cc]\\-63[Aa]3\\-4[Ee]70\\-8[Ff]00\\-376[Aa][Dd]29363[Ff][Bb]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{7[Ee]9[Dd]8[Dd]44\\-6926\\-426[Ff]\\-[Aa][Aa]2[Bb]\\-217[Aa]819[Aa]5[Cc][Cc][Ee]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{8[Cc][Dd]34779\\-9[Ff]10\\-4[Ff]9[Bb]\\-[Aa][Dd][Ff][Bb]\\-[Bb]3[Ff][Aa][Ee][Aa][Bb][Dd][Aa][Bb]5[Aa]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{9694[Ee]38[Aa]\\-[Ee]081\\-46[Aa][Cc]\\-99[Aa]0\\-8743[Cc]909[Aa][Cc][Bb]6\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{98[Dd][Ee]59[Aa]0\\-[Dd]175\\-11[Cc][Dd]\\-[Aa]7[Bb][Dd]\\-00006[Bb]827[Dd]94\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Aa][Aa]10385[Aa]\\-[Ff]5[Aa][Aa]\\-4[Ee][Ff][Ff]\\-[Bb]3[Dd][Ff]\\-71[Bb]701[Ee]25[Ee]18\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Bb]4132098\\-7[Aa]03\\-423[Dd]\\-9463\\-163[Cc][Bb]07[Cc]151[Ff]\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Dd]044309[Bb]\\-5[Dd][Aa]6\\-4633\\-[Bb]085\\-4[Ee][Dd]02522[Ee]5[Aa]5\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Dd]169[Cc]14[Aa]\\-5148\\-4322\\-92[Cc]8\\-754[Ff][Cc]9[Dd]018[Dd]8\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Dd][Dd]75716[Ee]\\-[Bb]42[Ee]\\-4978\\-[Bb][Bb]60\\-1497[Bb]92[Ee]30[Cc]4\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Ee]2[Ff]83[Ee][Ee][Dd]\\-62[Dd][Ee]\\-4[Aa]9[Ff]\\-9[Cc][Dd]0\\-[Aa]1[Dd]40[Dd][Cc][Dd]13[Bb]6\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Ee]772[Cc][Ee][Bb]3\\-[Ee]203\\-4828\\-[Aa][Dd][Ff]1\\-765713[Dd]981[Bb]8\\}\\\\.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Ee][Ee][Cc]97550\\-47[Aa]9\\-11[Cc][Ff]\\-[Bb]952\\-00[Aa][Aa]0051[Ff][Ee]20\\}.*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Ff][Bb]10[Bb][Dd]80\\-[Aa]331\\-4[Ee]9[Ee]\\-9[Ee][Bb]7\\-00279903[Aa][Dd]99\\}\\\\.*/)) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\.*/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/ifilters.html", "https://twitter.com/0gtweet/status/1468548924600459267", "https://github.com/gtworek/PSBits/tree/master/IFilter", "https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/IFilter/Dll.cpp#L281-L308"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
