{"description": "Detects the registration of a new ODBC driver.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Likely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3390fbef-c98d-4bdd-a863-d65ed7c610dd", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "New ODBC Driver Registered", "query": "(((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Oo][Dd][Bb][Cc]\\\\[Oo][Dd][Bb][Cc][Ii][Nn][Ss][Tt]\\.[Ii][Nn][Ii]\\\\.*/ AND winlog.event_data.TargetObject:/.*\\\\[Dd][Rr][Ii][Vv][Ee][Rr]/) AND (NOT (winlog.event_data.TargetObject:/.*\\\\[Ss][Qq][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/ AND winlog.event_data.Details:/\\%[Ww][Ii][Nn][Dd][Ii][Rr]\\%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Qq][Ll][Ss][Rr][Vv]32\\.[Dd][Ll][Ll]/))) AND (NOT (((winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Aa][Cc][Cc][Ee][Ss][Ss]\\ .*/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa].*/ AND winlog.event_data.Details:/.*\\\\[Aa][Cc][Ee][Oo][Dd][Bb][Cc]\\.[Dd][Ll][Ll]/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ee][Xx][Cc][Ee][Ll]\\ [Dd][Rr][Ii][Vv][Ee][Rr].*/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa].*/ AND winlog.event_data.Details:/.*\\\\[Aa][Cc][Ee][Oo][Dd][Bb][Cc]\\.[Dd][Ll][Ll]/)))))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
