{"description": "Detects potential registry persistence technique using the Event Viewer \"Events.asp\" technique", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a1e11042-a74a-46e6-b07c-c4ce8ecc239b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via Event Viewer Events.asp", "query": "(winlog.event_data.TargetObject:(*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Event\\ Viewer\\\\MicrosoftRedirectionProgram* OR *\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Event\\ Viewer\\\\MicrosoftRedirectionURL*) AND (NOT (((process.executable.text:\"*C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Event\\ Viewer\\\\MicrosoftRedirectionProgram AND winlog.event_data.Details:\"%%SystemRoot%%\\PCHealth\\HelpCtr\\Binaries\\HelpCtr.exe\")) OR ((process.executable.text:\"*C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Event\\ Viewer\\\\MicrosoftRedirectionProgramCommandLineParameters AND winlog.event_data.Details:-url hcp://services/centers/support?topic=%%s)) OR (winlog.event_data.Details:\"http://go.microsoft.com/fwlink/events.asp\") OR (winlog.event_data.Details:\"(Empty)\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/nas_bench/status/1626648985824788480", "https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.InternetCommunicationManagement::EventViewer_DisableLinks", "https://www.hexacorn.com/blog/2019/02/15/beyond-good-ol-run-key-part-103/", "https://github.com/redcanaryco/atomic-red-team/blob/f296668303c29d3f4c07e42bdd2b28d8dd6625f9/atomics/T1112/T1112.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
