{"description": "Detects when the 'AllowMultipleTSSessions' value is enabled. Which allows for multiple Remote Desktop connection sessions to be opened at once. This is often used by attacker as a way to connect to an RDP session without disconnecting the other users", "enabled": false, "false_positives": ["Legitmate use of the multi session functionality"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b672054f-3fa8-a22c-f78e-bc5465f5b7e7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Winlogon AllowMultipleTSSessions Enable", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Winlogon\\\\AllowMultipleTSSessions AND winlog.event_data.Details:*DWORD\\ \\(0x00000001\\))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
