{"description": "Detects change the the \"AutodialDLL\" key which could be used as a persistence method to load custom DLL via the \"ws2_32\" library", "enabled": false, "false_positives": ["Unlikley"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9efa695a-73c0-05b3-8185-82d4895697d9", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Persistence Via AutodialDLL", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Services\\\\WinSock2\\\\Parameters\\\\AutodialDLL*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.hexacorn.com/blog/2015/01/13/beyond-good-ol-run-key-part-24/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
