{"description": "Detects tampering of RDP Terminal Service/Server sensitive settings.\nSuch as allowing unauthorized users access to a system via the 'fAllowUnsolicited' or enabling RDP via 'fDenyTSConnections'...etc\n", "author": ["Samir Bousseaden", "David ANDRE", "Roberto Rodriguez @Cyb3rWard0g", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Some of the keys mentioned here could be modified by an administrator while setting group policy (it should be investigated either way)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3f6b7b62-61aa-45db-96bd-9c31b36b653c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RDP Sensitive Settings Changed", "query": "(((winlog.event_data.TargetObject:(/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ OR /.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/) AND winlog.event_data.TargetObject:/.*\\\\[Ss][Hh][Aa][Dd][Oo][Ww]/ AND winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000002\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000003\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000004\\)/))) OR ((winlog.event_data.TargetObject:(/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\.*/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/) AND winlog.event_data.TargetObject:(/.*\\\\[Ff][Aa][Ll][Ll][Oo][Ww][Uu][Nn][Ss][Oo][Ll][Ii][Cc][Ii][Tt][Ee][Dd]/ OR /.*\\\\[Ff][Aa][Ll][Ll][Oo][Ww][Uu][Nn][Ss][Oo][Ll][Ii][Cc][Ii][Tt][Ee][Dd][Ff][Uu][Ll][Ll][Cc][Oo][Nn][Tt][Rr][Oo][Ll]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)) OR (winlog.event_data.TargetObject:(/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Tt][Ee][Rr][Mm][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll].*/ OR /.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ww][Ii][Nn][Ss][Tt][Aa][Tt][Ii][Oo][Nn][Ss]\\\\[Rr][Dd][Pp]\\-[Tt][Cc][Pp]\\\\[Ii][Nn][Ii][Tt][Ii][Aa][Ll][Pp][Rr][Oo][Gg][Rr][Aa][Mm].*/ OR /.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ii][Nn][Ii][Tt][Ii][Aa][Ll][Pp][Rr][Oo][Gg][Rr][Aa][Mm].*/ OR /.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ii][Nn][Ii][Tt][Ii][Aa][Ll][Pp][Rr][Oo][Gg][Rr][Aa][Mm].*/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html", "http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/", "https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03", "https://threathunterplaybook.com/hunts/windows/190407-RegModEnableRDPConnections/notebook.html", "https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/", "http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/", "https://admx.help/HKLM/SOFTWARE/Policies/Microsoft/Windows%20NT/Terminal%20Services"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
