{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f674e36a-4b91-431e-8aef-f8a96c2aca35", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CurrentControlSet Autorun Keys Modification", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SYSTEM\\\\CurrentControlSet\\\\Control* AND winlog.event_data.TargetObject:(*\\\\Terminal\\ Server\\\\WinStations\\\\RDP\\-Tcp\\\\InitialProgram* OR *\\\\Terminal\\ Server\\\\Wds\\\\rdpwd\\\\StartupPrograms* OR *\\\\SecurityProviders\\\\SecurityProviders* OR *\\\\SafeBoot\\\\AlternateShell* OR *\\\\Print\\\\Providers* OR *\\\\Print\\\\Monitors* OR *\\\\NetworkProvider\\\\Order* OR *\\\\Lsa\\\\Notification\\ Packages* OR *\\\\Lsa\\\\Authentication\\ Packages* OR *\\\\BootVerificationProgram\\\\ImagePath*)) AND (NOT ((winlog.event_data.Details:\"\\(Empty\\)\") OR (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\spoolsv.exe\" AND winlog.event_data.TargetObject:*\\\\Print\\\\Monitors\\\\CutePDF\\ Writer\\ Monitor* AND winlog.event_data.Details:(\"cpwmon64_v40.dll\" OR \"CutePDF\\ Writer\")) OR (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\spoolsv.exe\" AND winlog.event_data.TargetObject:*Print\\\\Monitors\\\\Appmon\\\\Ports\\\\Microsoft.Office.OneNote_* AND user.name:(*AUTHORI* OR *AUTORI*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
