{"description": "Detect set UseActionCenterExperience to 0 to disable the windows security center notification", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cc13239e-060e-6254-b5a8-9443d053d042", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Disable Windows Security Center Notifications", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\UX\\ Configuration\\\\Notification_Suppress AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
