{"description": "Detects tempering with the \"Enabled\" registry key in order to disable windows logging of a windows event channel", "enabled": false, "false_positives": ["Legitimate administrators disabling specific event log for troubleshooting"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f264ad1d-68ae-5530-e4d5-01f58bad3c92", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable Winevt Event Logging Via Registry", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\WINEVT\\\\Channels\\\\* AND winlog.event_data.TargetObject:*\\\\Enabled AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\") AND (NOT (process.executable:*\\\\Windows\\\\system32\\\\wevtutil.exe)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/WhichbufferArda/status/1543900539280293889", "https://github.com/DebugPrivilege/CPP/blob/main/Windows%20Defender/RestoreDefenderConfig.cpp"], "timestamp_override": "event.ingested", "author": ["frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
