{"description": "Detects disabling Windows Defender threat protection", "enabled": false, "false_positives": ["Administrator actions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a64e4198-c1c8-46a5-bc9c-324c86455fd4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Defender Threat Detection Disabled", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\" AND (winlog.event_data.TargetObject:(\"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\DisableAntiSpyware\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\DisableAntiVirus\") OR winlog.event_data.TargetObject:(\"HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\WinDefend\" OR \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md", "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/"], "timestamp_override": "event.ingested", "author": ["J\u00e1n Tren\u010dansk\u00fd", "frack113", "AlertIQ"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
