{"description": "Detects registry key established after masqueraded .scr file execution using Rundll32 through desk.cpl", "author": ["Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)"], "enabled": false, "false_positives": ["Legitimate use of screen saver"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40b6e656-4e11-4c0c-8772-c1cc6dae34ce", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "ScreenSaver Registry Key Set", "query": "((process.executable:/.*\\\\[Rr][Uu][Nn][Dd][Ll][Ll]32\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Ss][Cc][Rr][Nn][Ss][Aa][Vv][Ee]\\.[Ee][Xx][Ee].*/ AND winlog.event_data.Details:/.*\\.[Ss][Cc][Rr]/) AND (NOT winlog.event_data.Details:(/.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\.*/ OR /.*[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Ww][Oo][Ww]64\\\\.*/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://twitter.com/VakninHai/status/1517027824984547329", "https://twitter.com/pabraeken/status/998627081360695297", "https://jstnk9.github.io/jstnk9/research/InstallScreenSaver-SCR-files"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
