{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "20f0ee37-5942-4e45-b7d5-c5b5db9df5cd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CurrentVersion Autorun Keys Modification", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run\\\\* OR *\\\\RunOnce\\\\* OR *\\\\RunOnceEx\\\\* OR *\\\\RunServices\\\\* OR *\\\\RunServicesOnce\\\\* OR *\\\\Policies\\\\System\\\\Shell* OR *\\\\Policies\\\\Explorer\\\\Run* OR *\\\\Group\\ Policy\\\\Scripts\\\\Startup* OR *\\\\Group\\ Policy\\\\Scripts\\\\Shutdown* OR *\\\\Group\\ Policy\\\\Scripts\\\\Logon* OR *\\\\Group\\ Policy\\\\Scripts\\\\Logoff* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects* OR *\\\\Authentication\\\\PLAP\\ Providers* OR *\\\\Authentication\\\\Credential\\ Providers* OR *\\\\Authentication\\\\Credential\\ Provider\\ Filters*)) AND (NOT ((winlog.event_data.Details:\"\\(Empty\\)\" OR winlog.event_data.TargetObject:*\\\\NgcFirst\\\\ConsecutiveSwitchCount OR process.executable.text:(*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\Update\\\\OneDriveSetup.exe OR *\\\\AppData\\\\Roaming\\\\Spotify\\\\Spotify.exe OR *\\\\AppData\\\\Local\\\\WebEx\\\\WebexHost.exe) OR process.executable.text:(\"C\\:\\\\WINDOWS\\\\system32\\\\devicecensus.exe\" OR \"C\\:\\\\Windows\\\\system32\\\\winsat.exe\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\ OneDrive\\\\StandaloneUpdater\\\\OneDriveSetup.exe\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\ OneDrive\\\\Update\\\\OneDriveSetup.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ OneDrive\\\\Update\\\\OneDriveSetup.exe\" OR \"C\\:\\\\Program\\ Files\\\\KeePass\\ Password\\ Safe\\ 2\\\\ShInstUtil.exe\" OR \"C\\:\\\\Program\\ Files\\\\Everything\\\\Everything.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\")) OR (process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\LogonUI.exe\" AND winlog.event_data.TargetObject:(*\\\\Authentication\\\\Credential\\ Providers\\\\\\{D6886603\\-9D2F\\-4EB2\\-B667\\-1971041FA96B\\}\\\\* OR *\\\\Authentication\\\\Credential\\ Providers\\\\\\{BEC09223\\-B018\\-416D\\-A0AC\\-523971B639F5\\}\\\\* OR *\\\\Authentication\\\\Credential\\ Providers\\\\\\{8AF662BF\\-65A0\\-4D0A\\-A540\\-A338A999D36F\\}\\\\* OR *\\\\Authentication\\\\Credential\\ Providers\\\\\\{27FBDB57\\-B613\\-4AF2\\-9D7E\\-4FA7A66C21AD\\}\\\\*)) OR (process.executable.text:(C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\Edge\\\\Application\\\\msedge.exe*)) OR (process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\regsvr32.exe\" AND winlog.event_data.TargetObject:*DropboxExt* AND winlog.event_data.Details:*A251\\-47B7\\-93E1\\-CDD82E34AF8B\\}) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Opera\\ Browser\\ Assistant AND winlog.event_data.Details:\"C\\:\\\\Program\\ Files\\\\Opera\\\\assistant\\\\browser_assistant.exe\") OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\iTunesHelper AND winlog.event_data.Details:\"\\\"C\\:\\\\Program\\ Files\\\\iTunes\\\\iTunesHelper.exe\\\"\") OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\zoommsirepair AND winlog.event_data.Details:\"\\\"C\\:\\\\Program\\ Files\\\\Zoom\\\\bin\\\\installer.exe\\\"\\ \\/repair\") OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Greenshot AND winlog.event_data.Details:\"C\\:\\\\Program\\ Files\\\\Greenshot\\\\Greenshot.exe\") OR (winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\GoogleDriveFS AND winlog.event_data.Details:C\\:\\\\Program\\ Files\\\\Google\\\\Drive\\ File\\ Stream\\\\* AND winlog.event_data.Details:*\\\\GoogleDriveFS.exe*) OR (winlog.event_data.TargetObject:*GoogleDrive* AND winlog.event_data.Details:(\"\\{CFE8B367\\-77A7\\-41D7\\-9C90\\-75D16D7DC6B6\\}\" OR \"\\{A8E52322\\-8734\\-481D\\-A7E2\\-27B309EF8D56\\}\" OR \"\\{C973DA94\\-CBDF\\-4E77\\-81D1\\-E5B794FBD146\\}\" OR \"\\{51EF1569\\-67EE\\-4AD6\\-9646\\-E726C3FFC8A2\\}\")) OR (winlog.event_data.Details:(C\\:\\\\Windows\\\\system32\\\\cmd.exe\\ \\/q\\ \\/c\\ rmdir\\ \\/s\\ \\/q\\ \\\"C\\:\\\\Users\\\\* OR C\\:\\\\Windows\\\\system32\\\\cmd.exe\\ \\/q\\ \\/c\\ del\\ \\/q\\ \\\"C\\:\\\\Users\\\\*) AND winlog.event_data.Details:*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{c60fd5ac\\-367d\\-4e3a\\-a975\\-f157502ac30a\\} AND winlog.event_data.Details:*\\\\AppData\\\\Local\\\\Package\\ Cache\\\\\\{c60fd5ac\\-367d\\-4e3a\\-a975\\-f157502ac30a\\}\\\\python* AND winlog.event_data.Details:*.exe\\\"\\ \\/burn.runonce) OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable.text:*\\\\OfficeClickToRun.exe) OR (process.executable.text:\"C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\MsMpEng.exe\") OR (process.executable.text:*\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe AND winlog.event_data.Details:*\\\\Microsoft\\\\Teams\\\\Update.exe\\ \\-\\-processStart\\ *) OR (process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\userinit.exe\" AND winlog.event_data.Details:\"ctfmon.exe\\ \\/n\") OR (process.executable.text:C\\:\\\\Program\\ Files\\\\AVG\\\\Antivirus\\\\Setup\\\\* AND winlog.event_data.Details:(\"\\\"C\\:\\\\Program\\ Files\\\\AVG\\\\Antivirus\\\\AvLaunch.exe\\\"\\ \\/gui\" OR \"\\\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\AVG\\\\Antivirus\\\\AvLaunch.exe\\\"\\ \\/gui\" OR \"\\{472083B0\\-C522\\-11CF\\-8763\\-00608CC02F24\\}\")))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d", "https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
