{"description": "Detects the creation of user-specific or system-wide environement variables via the registry. Which contains suspicious commands and strings", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "966315ef-c5e1-4767-ba25-fce9c8de3660", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Environment Variable Has Been Registered", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Environment\\\\*) AND ((winlog.event_data.Details:(\"powershell\" OR \"pwsh\")) OR (winlog.event_data.Details:(*\\\\AppData\\\\Local\\\\Temp\\\\* OR *C\\:\\\\Users\\\\Public\\\\* OR *TVqQAAMAAAAEAAAA* OR *TVpQAAIAAAAEAA8A* OR *TVqAAAEAAAAEABAA* OR *TVoAAAAAAAAAAAAA* OR *TVpTAQEAAAAEAAAA* OR *SW52b2tlL* OR *ludm9rZS* OR *JbnZva2Ut* OR *SQBuAHYAbwBrAGUALQ* OR *kAbgB2AG8AawBlAC0A* OR *JAG4AdgBvAGsAZQAtA*)) OR (winlog.event_data.Details:(SUVY* OR SQBFAF* OR SQBuAH* OR cwBhA* OR aWV4* OR aQBlA* OR R2V0* OR dmFy* OR dgBhA* OR dXNpbm* OR H4sIA* OR Y21k* OR cABhAH* OR Qzpc* OR Yzpc*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://infosec.exchange/@sbousseaden/109542254124022664"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
