{"description": "Detects potential PowerShell commands or code within registry run keys", "author": ["frack113", "Florian Roth"], "enabled": false, "false_positives": ["Legitimate admin or third party scripts. Baseline according to your environnement"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8d85cf08-bf97-4260-ba49-986a2a65129c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Powershell In Registry Run Keys", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run* AND winlog.event_data.Details:(*powershell* OR *pwsh\\ * OR *FromBase64String* OR *.DownloadFile\\(* OR *.DownloadString\\(* OR *\\ \\-w\\ hidden\\ * OR *\\ \\-w\\ 1\\ * OR *\\-windowstyle\\ hidden* OR *\\-window\\ hidden* OR *\\ \\-nop\\ * OR *\\ \\-encodedcommand\\ * OR *\\-ExecutionPolicy\\ Bypass* OR *Invoke\\-Expression* OR *IEX\\ \\(* OR *Invoke\\-Command* OR *ICM\\ \\-* OR *Invoke\\-WebRequest* OR *IWR\\ * OR *\\ \\-noni\\ * OR *\\ \\-noninteractive\\ *))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/frack113/atomic-red-team/blob/a9051c38de8a5320b31c7039efcbd3b56cf2d65a/atomics/T1547.001/T1547.001.md#atomic-test-9---systembc-malware-as-a-service-registry", "https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
