{"description": "Detects when an attacker modifies the registry value of the \"hhctrl\" to point to a custom binary", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f10ed525-97fe-4fed-be7c-2feecca941b1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Persistence Via Hhctrl.ocx", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\CLSID\\\\\\{52A2AAAE\\-085D\\-4187\\-97EA\\-8C30DB990436\\}\\\\InprocServer32\\\\\\(Default\\)*) AND (NOT (winlog.event_data.Details:\"C\\:\\\\Windows\\\\System32\\\\hhctrl.ocx\")))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/hhctrl.html", "https://www.hexacorn.com/blog/2018/04/23/beyond-good-ol-run-key-part-77/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
