{"description": "Detects javaw.exe in AppData folder as used by Adwind / JRAT", "author": ["Florian Roth (Nextron Systems)", "Tom Ueltschi", "Jonhnathan Ribeiro", "oscd.community"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "42f0e038-767e-4b85-9d96-2c6335bad0b5", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Adwind RAT / JRAT - Registry", "query": "(winlog.event_data.TargetObject:/[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/ AND winlog.event_data.Details:/\\%[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\%\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Oo][Rr][Aa][Cc][Ll][Ee]\\\\[Bb][Ii][Nn]\\\\.*/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}, {"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100", "https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
