{"description": "Detects potential persistence activity via the registering of a new custom protocole handlers. While legitimate applications register protocole handlers often times during installation. And attacker can abuse this by setting a custom handler to be used as a persistence mechanism.", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Legitimate applications registering a new custom protocol handler"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fdbf0b9d-0182-4c43-893b-a1eaab92d085", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via Custom Protocol Handler", "query": "((winlog.event_data.TargetObject:HKCR\\\\* AND winlog.event_data.Details:URL\\:*) AND (NOT ((winlog.event_data.Details:URL\\:ms\\-*) OR (process.executable.text:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)* OR C\\:\\\\Windows\\\\*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://ladydebug.com/blog/2019/06/21/custom-protocol-handler-cph/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
