{"description": "Detects changes to the Internet Explorer \"DisableFirstRunCustomize\" value, which prevents Internet Explorer from running the first run wizard the first time a user starts the browser after installing Internet Explorer or Windows.\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["As this is controlled by group policy as well as user settings. Some false positives may occur."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab567429-1dfb-4674-b6d2-979fd2f9d125", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Internet Explorer DisableFirstRunCustomize Enabled", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Internet\\ Explorer\\\\Main\\\\DisableFirstRunCustomize AND winlog.event_data.Details:(\"DWORD (0x00000001)\" OR \"DWORD (0x00000002)\")) AND (NOT process.executable.text:(\"C:\\Windows\\explorer.exe\" OR \"C:\\Windows\\System32\\ie4uinit.exe\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf", "https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/", "https://admx.help/?Category=InternetExplorer&Policy=Microsoft.Policies.InternetExplorer::NoFirstRunCustomise"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
