{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)", "wagga (name)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f59c3faf-50f3-464b-9f4c-1b67ab512d99", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Common Autorun Keys Modification", "query": "(winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Cc][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Aa][Uu][Tt][Oo][Ss][Tt][Aa][Rr][Tt].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss][Oo][Rr]\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Ss][Ee][Tt][Uu][Pp]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd]\\ [Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Cc][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Aa][Uu][Tt][Oo][Ss][Tt][Aa][Rr][Tt][Oo][Nn][Dd][Ii][Ss][Cc][Oo][Nn][Nn][Ee][Cc][Tt].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Cc][Ee]\\ [Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Aa][Uu][Tt][Oo][Ss][Tt][Aa][Rr][Tt][Oo][Nn][Cc][Oo][Nn][Nn][Ee][Cc][Tt].*/ OR /.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ss][Ee][Tt][Uu][Pp]\\\\[Cc][Mm][Dd][Ll][Ii][Nn][Ee].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Tt][Ff]\\\\[Ll][Aa][Nn][Gg][Bb][Aa][Rr][Aa][Dd][Dd][Ii][Nn].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss][Oo][Rr]\\\\[Aa][Uu][Tt][Oo][Rr][Uu][Nn].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Ss][Ee][Tt][Uu][Pp]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd]\\ [Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Ss]\\\\[Hh][Aa][Nn][Dd][Ll][Ee][Rr].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Ss]\\\\[Ff][Ii][Ll][Tt][Ee][Rr].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Hh][Tt][Mm][Ll][Ff][Ii][Ll][Ee]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\).*/ OR /.*\\\\[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt]\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt][Mm][Pp][Rr][Ll][Oo][Gg][Oo][Nn][Ss][Cc][Rr][Ii][Pp][Tt].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Ss][Cc][Rr][Nn][Ss][Aa][Vv][Ee]\\.[Ee][Xx][Ee].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Uu][Rr][Ll][Ss][Ee][Aa][Rr][Cc][Hh][Hh][Oo][Oo][Kk][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Aa][Bb]8902[Bb]4\\-09[Cc][Aa]\\-4[Bb][Bb]6\\-[Bb]78[Dd]\\-[Aa]8[Ff]59079[Aa]8[Dd]5\\}\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32.*/ OR /.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\ [Pp][Aa][Nn][Ee][Ll]\\\\[Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\[Ss][Cc][Rr][Nn][Ss][Aa][Vv][Ee]\\.[Ee][Xx][Ee].*/) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR (((winlog.event_data.TargetObject:(/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\\\[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Ss]\\\\[Hh][Aa][Nn][Dd][Ll][Ee][Rr]\\\\.*/ OR /.*\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn][Ss][Tt][Oo][Rr][Ee]\\\\[Hh][Kk][Mm][Uu]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Pp][Rr][Oo][Tt][Oo][Cc][Oo][Ll][Ss]\\\\[Hh][Aa][Nn][Dd][Ll][Ee][Rr]\\\\.*/)) OR (winlog.event_data.Details:(/\\{314111[Cc]7\\-[Aa]502\\-11[Dd]2\\-[Bb][Bb][Cc][Aa]\\-00[Cc]04[Ff]8[Ee][Cc]294\\}/ OR /\\{3459[Bb]272\\-[Cc][Cc]19\\-4448\\-86[Cc]9\\-[Dd][Dd][Cc]3[Bb]4[Bb]2[Ff][Aa][Dd]3\\}/ OR /\\{42089[Dd]2[Dd]\\-912[Dd]\\-4018\\-9087\\-2[Bb]87803[Ee]93[Ff][Bb]\\}/ OR /\\{5504[Bb][Ee]45\\-[Aa]83[Bb]\\-4808\\-900[Aa]\\-3[Aa]5[Cc]36[Ee]7[Ff]77[Aa]\\}/ OR /\\{807583[Ee]5\\-5146\\-11[Dd]5\\-[Aa]672\\-00[Bb]0[Dd]022[Ee]945\\}/)))) OR (winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Ss][Ee][Tt][Uu][Pp]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd]\\ [Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss]\\\\\\{8[Aa]69[Dd]345\\-[Dd]564\\-463[Cc]\\-[Aa][Ff][Ff]1\\-[Aa]69[Dd]9[Ee]530[Ff]96\\}.*/) OR (winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Ss][Ee][Tt][Uu][Pp]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd]\\ [Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss]\\\\\\{9459[Cc]573\\-[Bb]17[Aa]\\-45[Aa][Ee]\\-9[Ff]64\\-1857[Bb]5[Dd]58[Cc][Ee][Ee]\\}.*/) OR (winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Aa][Cc][Tt][Ii][Vv][Ee]\\ [Ss][Ee][Tt][Uu][Pp]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Dd]\\ [Cc][Oo][Mm][Pp][Oo][Nn][Ee][Nn][Tt][Ss]\\\\\\{89820200\\-[Ee][Cc][Bb][Dd]\\-11[Cc][Ff]\\-8[Bb]85\\-00[Aa][Aa]005[Bb]4383\\}.*/) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Oo][Qq][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d", "https://persistence-info.github.io/Data/userinitmprlogonscript.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
