{"description": "Detects disabling Windows Defender PUA protection", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8ffc5407-52e3-478f-9596-0a7371eafe13", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable PUA Protection on Windows Defender", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\PUAProtection* AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
