{"description": "Detects changes to the Registry in which a monitor program gets registered to monitor the exit of another process", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ed0761e2-3aa1-8695-94ca-94966eee357a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "SilentProcessExit Monitor Registrytion", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\SilentProcessExit* AND winlog.event_data.Details:*MonitorProcess*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/", "https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
