{"description": "Detect changes to the \"LegalNoticeCaption\" or \"LegalNoticeText\" registry values where the message set contains keywords often used in ransomware ransom messages", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8b9606c9-28be-4a38-b146-0e313cc232c1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Ransomware Activity Using LegalNotice Message", "query": "(winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ll][Ee][Gg][Aa][Ll][Nn][Oo][Tt][Ii][Cc][Ee][Cc][Aa][Pp][Tt][Ii][Oo][Nn].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ll][Ee][Gg][Aa][Ll][Nn][Oo][Tt][Ii][Cc][Ee][Tt][Ee][Xx][Tt].*/) AND winlog.event_data.Details:(*encrypted* OR /.*[Uu][Nn][Ll][Oo][Cc][Kk]\\-[Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd].*/ OR *paying*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1491"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0040", "reference": "https://attack.mitre.org/tactics/TA0040", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1491", "name": "Defacement", "reference": "https://attack.mitre.org/techniques/T1491"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1491.001/T1491.001.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
