{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "baecf8fb-edbf-429f-9ade-31fc3f22b970", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Office Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee].*/) AND winlog.event_data.TargetObject:(/.*\\\\[Ww][Oo][Rr][Dd]\\\\[Aa][Dd][Dd][Ii][Nn][Ss].*/ OR /.*\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Oo][Ii][Nn][Tt]\\\\[Aa][Dd][Dd][Ii][Nn][Ss].*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss].*/ OR /.*\\\\[Oo][Nn][Ee][Nn][Oo][Tt][Ee]\\\\[Aa][Dd][Dd][Ii][Nn][Ss].*/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss].*/ OR /.*\\\\[Aa][Cc][Cc][Ee][Ss][Ss]\\\\[Aa][Dd][Dd][Ii][Nn][Ss].*/ OR /.*[Tt][Ee][Ss][Tt]\\\\[Ss][Pp][Ee][Cc][Ii][Aa][Ll]\\\\[Pp][Ee][Rr][Ff].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee].*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee].*/) AND winlog.event_data.TargetObject:(/.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Aa][Dd][Hh][Oo][Cc][Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg][Ee][Xx][Cc][Ee][Ll][Cc][Ll][Ii][Ee][Nn][Tt][Ll][Ii][Bb]\\.[Aa][Dd][Hh][Oo][Cc][Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg][Ee][Xx][Cc][Ee][Ll][Cc][Ll][Ii][Ee][Nn][Tt][Aa][Dd][Dd][Ii][Nn]\\.1\\\\.*/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Ee][Xx][Cc][Ee][Ll][Pp][Ll][Uu][Gg][Ii][Nn][Ss][Hh][Ee][Ll][Ll]\\.[Pp][Oo][Ww][Ee][Rr][Mm][Aa][Pp][Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\\\.*/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Nn][Aa][Tt][Ii][Vv][Ee][Ss][Hh][Ii][Mm]\\\\.*/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Nn][Aa][Tt][Ii][Vv][Ee][Ss][Hh][Ii][Mm]\\.[Ii][Nn][Qq][Uu][Ii][Rr][Ee][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Oo][Rr]\\.1\\\\.*/ OR /.*\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Ii][Vv][Oo][Tt][Ee][Xx][Cc][Ee][Ll][Cc][Ll][Ii][Ee][Nn][Tt][Aa][Dd][Dd][Ii][Nn]\\.[Nn][Aa][Tt][Ii][Vv][Ee][Ee][Nn][Tt][Rr][Yy]\\.1\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Aa][Dd][Dd][Ii][Nn]\\.[Dd][Cc]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Cc][Oo][Ll][Ll][Ee][Aa][Gg][Uu][Ee][Ii][Mm][Pp][Oo][Rr][Tt]\\.[Cc][Oo][Ll][Ll][Ee][Aa][Gg][Uu][Ee][Ii][Mm][Pp][Oo][Rr][Tt][Aa][Dd][Dd][Ii][Nn]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Ee][Vv][Ee][Rr][Nn][Oo][Tt][Ee][Cc][Cc]\\.[Ee][Vv][Ee][Rr][Nn][Oo][Tt][Ee][Cc][Oo][Nn][Tt][Aa][Cc][Tt][Cc][Oo][Nn][Nn][Ee][Cc][Tt][Oo][Rr]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Ee][Vv][Ee][Rr][Nn][Oo][Tt][Ee][Oo][Ll][Rr][Dd]\\.[Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Vv][Bb][Aa][Aa][Dd][Dd][Ii][Nn][Ff][Oo][Rr][Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.1\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Oo][Cc][Oo][Ff][Ff][Ii][Cc][Ee]\\.[Oo][Cc][Ff][Oo][Rr][Mm][Ss]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\\\\\[Oo][Nn][Ee][Nn][Oo][Tt][Ee]\\.[Oo][Uu][Tt][Ll][Oo][Oo][Kk][Aa][Dd][Dd][Ii][Nn].*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Oo][Ss][Cc][Aa][Dd][Dd][Ii][Nn]\\.[Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk][Cc][Hh][Aa][Nn][Gg][Ee][Nn][Oo][Tt][Ii][Ff][Ii][Ee][Rr]\\.[Cc][Oo][Nn][Nn][Ee][Cc][Tt]\\\\.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Uu][Cc][Aa][Dd][Dd][Ii][Nn]\\.[Ll][Yy][Nn][Cc][Aa][Dd][Dd][Ii][Nn]\\.1.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Uu][Cc][Aa][Dd][Dd][Ii][Nn]\\.[Uu][Cc][Aa][Dd][Dd][Ii][Nn]\\.1.*/ OR /.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Uu][Mm][Oo][Uu][Tt][Ll][Oo][Oo][Kk][Aa][Dd][Dd][Ii][Nn]\\.[Ff][Oo][Rr][Mm][Rr][Ee][Gg][Ii][Oo][Nn][Aa][Dd][Dd][Ii][Nn]\\\\.*/))) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Rr][Ee][Gg][Ss][Vv][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\.[Aa][Ss][Oo][Uu][Tt][Ee][Xx][Tt]\\\\.*/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
