{"description": "Detects when an attacker tries to add a new network provider in order to dump clear text credentials, similar to how the NPPSpy tool does it", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Other legitimate network providers used and not filtred in this rule"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "50d75006-935d-20e2-db3a-36a1562cdf9e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Credential Dumping Attempt Using New NetworkProvider - REG", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND winlog.event_data.TargetObject:*\\\\NetworkProvider*) AND (NOT ((winlog.event_data.TargetObject:(*\\\\System\\\\CurrentControlSet\\\\Services\\\\WebClient\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\LanmanWorkstation\\\\NetworkProvider* OR *\\\\System\\\\CurrentControlSet\\\\Services\\\\RDPNP\\\\NetworkProvider*)) OR (process.executable.text:\"C:\\Windows\\System32\\poqexec.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://docs.microsoft.com/en-us/troubleshoot/windows-client/deployment/network-provider-settings-removed-in-place-upgrade", "https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
