{"description": "Running Chrome VPN Extensions via the Registry install 2 vpn extension", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b64a026b-8deb-4c1d-92fd-98893209dff1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Running Chrome VPN Extensions via the Registry 2 VPN Extension", "query": "(winlog.event_data.TargetObject:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss].*/ AND winlog.event_data.TargetObject:/.*[Uu][Pp][Dd][Aa][Tt][Ee]\\_[Uu][Rr][Ll]/ AND winlog.event_data.TargetObject:(*fdcgdnkidjaadafnichfpabhfomcebme* OR *fcfhplploccackoneaefokcmbjfbkenj* OR *bihmplhobchoageeokmgbdihknkjbknd* OR *gkojfkhlekighikafcpjkiklfbnlmeio* OR *jajilbjjinjmgcibalaakngmkilboobh* OR *gjknjjomckknofjidppipffbpoekiipm* OR *nabbmpekekjknlbkgpodfndbodhijjem* OR *kpiecbcckbofpmkkkdibbllpinceiihk* OR *nlbejmccbhkncgokjcmghpfloaajcffj* OR *omghfjlpggmjjaagoclmmobgdodcjboh* OR *bibjcjfmgapbfoljiojpipaooddpkpai* OR *mpcaainmfjjigeicjnlkdfajbioopjko* OR *jljopmgdobloagejpohpldgkiellmfnc* OR *lochiccbgeohimldjooaakjllnafhaid* OR *nhnfcgpcbfclhfafjlooihdfghaeinfc* OR *ookhnhpkphagefgdiemllfajmkdkcaim* OR *namfblliamklmeodpcelkokjbffgmeoo* OR *nbcojefnccbanplpoffopkoepjmhgdgh* OR *majdfhpaihoncoakbjgbdhglocklcgno* OR *lnfdmdhmfbimhhpaeocncdlhiodoblbd* OR *eppiocemhmnlbhjplcgkofciiegomcon* OR *cocfojppfigjeefejbpfmedgjbpchcng* OR *foiopecknacmiihiocgdjgbjokkpkohc* OR *hhdobjgopfphlmjbmnpglhfcgppchgje* OR *jgbaghohigdbgbolncodkdlpenhcmcge* OR *inligpkjkhbpifecbdjhmdpcfhnlelja* OR *higioemojdadgdbhbbbkfbebbdlfjbip* OR *hipncndjamdcmphkgngojegjblibadbe* OR *iolonopooapdagdemdoaihahlfkncfgg* OR *nhfjkakglbnnpkpldhjmpmmfefifedcj* OR *jpgljfpmoofbmlieejglhonfofmahini* OR *fgddmllnllkalaagkghckoinaemmogpe* OR *ejkaocphofnobjdedneohbbiilggdlbi* OR *keodbianoliadkoelloecbhllnpiocoi* OR *hoapmlpnmpaehilehggglehfdlnoegck* OR *poeojclicodamonabcabmapamjkkmnnk* OR *dfkdflfgjdajbhocmfjolpjbebdkcjog* OR *kcdahmgmaagjhocpipbodaokikjkampi* OR *klnkiajpmpkkkgpgbogmcgfjhdoljacg* OR *lneaocagcijjdpkcabeanfpdbmapcjjg* OR *pgfpignfckbloagkfnamnolkeaecfgfh* OR *jplnlifepflhkbkgonidnobkakhmpnmh* OR *jliodmnojccaloajphkingdnpljdhdok* OR *hnmpcagpplmpfojmgmnngilcnanddlhb* OR *ffbkglfijbcbgblgflchnbphjdllaogb* OR *kcndmbbelllkmioekdagahekgimemejo* OR *jdgilggpfmjpbodmhndmhojklgfdlhob* OR *bihhflimonbpcfagfadcnbbdngpopnjb* OR *ppajinakbfocjfnijggfndbdmjggcmde* OR *oofgbpoabipfcfjapgnbbjjaenockbdp* OR *bhnhkdgoefpmekcgnccpnhjfdgicfebm* OR *knmmpciebaoojcpjjoeonlcjacjopcpf* OR *dhadilbmmjiooceioladdphemaliiobo* OR *jedieiamjmoflcknjdjhpieklepfglin* OR *mhngpdlhojliikfknhfaglpnddniijfh* OR *omdakjcmkglenbhjadbccaookpfjihpa* OR *npgimkapccfidfkfoklhpkgmhgfejhbj* OR *akeehkgglkmpapdnanoochpfmeghfdln* OR *gbmdmipapolaohpinhblmcnpmmlgfgje* OR *aigmfoeogfnljhnofglledbhhfegannp* OR *cgojmfochfikphincbhokimmmjenhhgk* OR *ficajfeojakddincjafebjmfiefcmanc* OR *ifnaibldjfdmaipaddffmgcmekjhiloa* OR *jbnmpdkcfkochpanomnkhnafobppmccn* OR *apcfdffemoinopelidncddjbhkiblecc* OR *mjolnodfokkkaichkcjipfgblbfgojpa* OR *oifjbnnafapeiknapihcmpeodaeblbkn* OR *plpmggfglncceinmilojdkiijhmajkjh* OR *mjnbclmflcpookeapghfhapeffmpodij* OR *bblcccknbdbplgmdjnnikffefhdlobhp* OR *aojlhgbkmkahabcmcpifbolnoichfeep* OR *lcmammnjlbmlbcaniggmlejfjpjagiia* OR *knajdeaocbpmfghhmijicidfcmdgbdpm* OR *bdlcnpceagnkjnjlbbbcepohejbheilk* OR *edknjdjielmpdlnllkdmaghlbpnmjmgb* OR *eidnihaadmmancegllknfbliaijfmkgo* OR *ckiahbcmlmkpfiijecbpflfahoimklke* OR *macdlemfnignjhclfcfichcdhiomgjjb* OR *chioafkonnhbpajpengbalkececleldf* OR *amnoibeflfphhplmckdbiajkjaoomgnj* OR *llbhddikeonkpbhpncnhialfbpnilcnc* OR *pcienlhnoficegnepejpfiklggkioccm* OR *iocnglnmfkgfedpcemdflhkchokkfeii* OR *igahhbkcppaollcjeaaoapkijbnphfhb* OR *njpmifchgidinihmijhcfpbdmglecdlb* OR *ggackgngljinccllcmbgnpgpllcjepgc* OR *kchocjcihdgkoplngjemhpplmmloanja* OR *bnijmipndnicefcdbhgcjoognndbgkep* OR *lklekjodgannjcccdlbicoamibgbdnmi* OR *dbdbnchagbkhknegmhgikkleoogjcfge* OR *egblhcjfjmbjajhjhpmnlekffgaemgfh* OR *ehbhfpfdkmhcpaehaooegfdflljcnfec* OR *bkkgdjpomdnfemhhkalfkogckjdkcjkg* OR *almalgbpmcfpdaopimbdchdliminoign* OR *akkbkhnikoeojlhiiomohpdnkhbkhieh* OR *gbfgfbopcfokdpkdigfmoeaajfmpkbnh* OR *bniikohfmajhdcffljgfeiklcbgffppl* OR *lejgfmmlngaigdmmikblappdafcmkndb* OR *ffhhkmlgedgcliajaedapkdfigdobcif* OR *gcknhkkoolaabfmlnjonogaaifnjlfnp* OR *pooljnboifbodgifngpppfklhifechoe* OR *fjoaledfpmneenckfbpdfhkmimnjocfa* OR *aakchaleigkohafkfjfjbblobjifikek* OR *dpplabbmogkhghncfbfdeeokoefdjegm* OR *padekgcemlokbadohgkifijomclgjgif* OR *bfidboloedlamgdmenmlbipfnccokknp*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1133"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1133", "name": "External Remote Services", "reference": "https://attack.mitre.org/techniques/T1133"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1133/T1133.md#atomic-test-1---running-chrome-vpn-extensions-via-the-registry-2-vpn-extension"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
