{"description": "Monitor the creation of a new key under 'TaskCache' when a new scheduled task is registered by a process that is not svchost.exe, which is suspicious", "author": ["Syed Hasan (@syedhasan009)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4720b7df-40c3-48fd-bbdf-fd4b3c464f0d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Scheduled TaskCache Change by Uncommon Program", "query": "(winlog.event_data.TargetObject:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]\\\\[Tt][Aa][Ss][Kk][Cc][Aa][Cc][Hh][Ee]\\\\.*/ AND (NOT ((winlog.event_data.TargetObject:(/.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Oo][Rr][Cc][Hh][Ee][Ss][Tt][Rr][Aa][Tt][Oo][Rr].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn][Pp][Ll][Aa][Tt][Ff][Oo][Rr][Mm]\\\\[Ss][Vv][Cc][Rr][Ee][Ss][Tt][Aa][Rr][Tt][Tt][Aa][Ss][Kk]\\\\[Ii][Nn][Dd][Ee][Xx].*/ OR /.*[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ff][Ll][Ii][Gg][Hh][Tt][Ii][Nn][Gg]\\\\[Oo][Nn][Ee][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Ss]\\\\[Rr][Ee][Ff][Rr][Ee][Ss][Hh][Cc][Aa][Cc][Hh][Ee]\\\\[Ii][Nn][Dd][Ee][Xx].*/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ AND process.executable:/.*\\\\[Tt][Ii][Ww][Oo][Rr][Kk][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk].*/ AND process.executable:/.*\\\\[Nn][Gg][Ee][Nn]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:(/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]\\\\[Tt][Aa][Ss][Kk][Cc][Aa][Cc][Hh][Ee]\\\\[Tt][Aa][Ss][Kk][Ss]\\\\\\{[Bb]66[Bb]135[Dd]\\-[Dd][Aa]06\\-4[Ff][Cc]4\\-95[Ff]8\\-7458[Ee]1[Dd]10129\\}.*/ OR /.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]\\\\[Tt][Aa][Ss][Kk][Cc][Aa][Cc][Hh][Ee]\\\\[Tt][Rr][Ee][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\\\.[Nn][Ee][Tt]\\ [Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\\\.[Nn][Ee][Tt]\\ [Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\ [Nn][Gg][Ee][Nn].*/))) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee]\\\\[Tt][Aa][Ss][Kk][Cc][Aa][Cc][Hh][Ee]\\\\[Tt][Rr][Ee][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Pp][Ll][Aa]\\\\[Ss][Ee][Rr][Vv][Ee][Rr]\\ [Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\ [Pp][Ee][Rr][Ff][Oo][Rr][Mm][Aa][Nn][Cc][Ee]\\ [Mm][Oo][Nn][Ii][Tt][Oo][Rr]\\\\.*/)) OR (process.executable.text:System))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/", "https://labs.f-secure.com/blog/scheduled-task-tampering/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
