{"description": "Detects tamper attempts to sophos av functionality via registry key modification", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Some FP may occur when the feature is disabled by the AV itself, you should always investigate if the action was legitimate"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9f4662ac-17ca-43aa-8f12-5d7b989d0101", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Tamper With Sophos AV Registry Keys", "query": "(winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Aa][Vv][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\ [Ee][Nn][Dd][Pp][Oo][Ii][Nn][Tt]\\ [Dd][Ee][Ff][Ee][Nn][Ss][Ee]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Ss][Ee][Dd][Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/ OR /.*\\\\[Ss][Oo][Pp][Hh][Oo][Ss]\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Dd].*/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
