{"description": "Attempts to detect system changes made by Blue Mockingbird", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "92b0b372-a939-44ed-a11b-5136cf680e27", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Blue Mockingbird", "query": "(winlog.event_data.EventType:\"Setvalue\" AND winlog.event_data.TargetObject:*\\\\CurrentControlSet\\\\Services\\\\wercplsupport\\\\Parameters\\\\ServiceDll)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1047", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1047", "name": "Windows Management Instrumentation", "reference": "https://attack.mitre.org/techniques/T1047"}]}], "version": 1, "references": ["https://redcanary.com/blog/blue-mockingbird-cryptominer/"], "timestamp_override": "event.ingested", "author": ["Trent Liffick (@tliffick)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
