{"description": "Detects the modification of the registry to allow a driver or service to persist in Safe Mode.", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1547e27c-3974-43e2-a7d7-7f484fb928ec", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Registry Persitence via Service in Safe Mode", "query": "((winlog.event_data.TargetObject:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Mm][Ii][Nn][Ii][Mm][Aa][Ll]\\\\.*/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\\\.*/) AND winlog.event_data.TargetObject:/.*\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ AND winlog.event_data.Details:Service) AND (NOT (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:(/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Mm][Ii][Nn][Ii][Mm][Aa][Ll]\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ OR /[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk]\\\\[Ss][Aa][Vv][Ss][Ee][Rr][Vv][Ii][Cc][Ee]\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-33---windows-add-registry-value-to-load-service-in-safe-mode-without-network", "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-34---windows-add-registry-value-to-load-service-in-safe-mode-with-network"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
