{"description": "Detects changes to the \"ServiceDLL\" value related to a service in the registry. This is often used as a method of persistence.", "author": ["frack113"], "enabled": false, "false_positives": ["Administrative scripts", "Installation of a service"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "612e47e9-8a59-43a6-b404-f48683f45bd6", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "ServiceDll Hijack", "query": "((winlog.event_data.TargetObject:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ AND winlog.event_data.TargetObject:/.*\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll]/) AND (NOT ((winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll]\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]\\\\[Xx]64\\\\3\\\\[Pp][Rr][Ii][Nn][Tt][Cc][Oo][Nn][Ff][Ii][Gg]\\.[Dd][Ll][Ll]/) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Ss][Aa][Ss][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Nn][Tt][Dd][Ss]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Dd][Ll][Ll]/ AND winlog.event_data.Details:/\\%\\%[Ss][Yy][Ss][Tt][Ee][Mm][Rr][Oo][Oo][Tt]\\%\\%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Nn][Tt][Dd][Ss][Aa]\\.[Dd][Ll][Ll]/)) OR (process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Oo][Qq][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time", "https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
