{"description": "Detects tampering of autologger trace sessions which is a technique used by attackers to disable logging", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "03d28d7c-7b72-374e-1d07-aaa2f6cc7718", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AutoLogger Sessions Tamper", "query": "(winlog.event_data.TargetObject:*\\\\System\\\\CurrentControlSet\\\\Control\\\\WMI\\\\Autologger\\\\* AND winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\EventLog\\-* OR *\\\\Defender*) AND winlog.event_data.TargetObject:(*\\\\Enabled OR *\\\\Start) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/MichalKoczwara/status/1553634816016498688", "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
