{"description": "Detect use of scrobj.dll as this DLL looks for the ScriptletURL key to get the location of the script to execute", "author": ["frack113"], "enabled": false, "false_positives": ["Legitimate use of the dll."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fe20dda1-6f37-4379-bbe0-a98d400cae90", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via Scrobj.dll COM Hijacking", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*InprocServer32\\\\\\(Default\\) AND winlog.event_data.Details:\"C:\\WINDOWS\\system32\\scrobj.dll\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
