{"description": "Detects changes to the ClickOnce trust prompt registry key in order to enable an installation from different locations such as the Internet.", "author": ["@SerkinValery", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate internal requirements."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ac9159cc-c364-4304-8f0a-d63fc1a0aabb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "ClickOnce Trust Prompt Tampering", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\.[Nn][Ee][Tt][Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Tt][Rr][Uu][Ss][Tt][Mm][Aa][Nn][Aa][Gg][Ee][Rr]\\\\[Pp][Rr][Oo][Mm][Pp][Tt][Ii][Nn][Gg][Ll][Ee][Vv][Ee][Ll]\\\\.*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]/ OR /.*\\\\[Ll][Oo][Cc][Aa][Ll][Ii][Nn][Tt][Rr][Aa][Nn][Ee][Tt]/ OR /.*\\\\[Mm][Yy][Cc][Oo][Mm][Pp][Uu][Tt][Ee][Rr]/ OR /.*\\\\[Tt][Rr][Uu][Ss][Tt][Ee][Dd][Ss][Ii][Tt][Ee][Ss]/ OR /.*\\\\[Uu][Nn][Tt][Rr][Uu][Ss][Tt][Ee][Dd][Ss][Ii][Tt][Ee][Ss]/) AND winlog.event_data.Details:Enabled)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5", "https://learn.microsoft.com/en-us/visualstudio/deployment/how-to-configure-the-clickonce-trust-prompt-behavior"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
