{"description": "Detects when the enablement of developer features such as \"Developer Mode\" or \"Application Sideloading\". Which allows the user to install untrusted packages.", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40cceda0-0ef0-9109-943a-b744e68915ed", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Signing Bypass Via Windows Developer Features - Registry", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\AppModelUnlock* OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\Appx\\\\*) AND winlog.event_data.TargetObject:(*\\\\AllowAllTrustedApps OR *\\\\AllowDevelopmentWithoutDevLicense) AND winlog.event_data.Details:\"DWORD (0x00000001)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/malmoeb/status/1560536653709598721", "https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
