{"description": "Detects potential COM object hijacking leveraging the COM Search Order", "enabled": false, "false_positives": ["Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "25868beb-10cf-c2a3-7eda-249e00cc1e04", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Registry Persistence COM Search Order Hijacking", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(HKCR\\\\CLSID\\\\* OR HKCU\\\\Software\\\\Classes\\\\CLSID\\\\*) AND winlog.event_data.TargetObject:*\\\\InprocServer32\\\\\\(Default\\)) AND (NOT ((winlog.event_data.Details:(*%%systemroot%%\\\\system32\\\\* OR *%%systemroot%%\\\\SysWow64\\\\*)) OR (winlog.event_data.Details:(*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\* OR *\\\\FileCoAuthLib64.dll* OR *\\\\FileSyncShell64.dll* OR *\\\\FileSyncApi64.dll*)) OR (winlog.event_data.Details:*\\\\AppData\\\\Local\\\\Microsoft\\\\TeamsMeetingAddin\\\\* AND winlog.event_data.Details:*\\\\Microsoft.Teams.AddinLoader.dll*) OR (winlog.event_data.Details:*\\\\AppData\\\\Roaming\\\\Dropbox\\\\* AND winlog.event_data.Details:*\\\\DropboxExt64.*.dll*) OR (winlog.event_data.Details:*TmopIEPlg.dll) OR (process.executable.text:(\"C\\:\\\\WINDOWS\\\\system32\\\\wuauclt.exe\" OR \"C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\")) OR (process.executable.text:(C\\:\\\\ProgramData\\\\Microsoft\\\\Windows\\ Defender\\\\Platform\\\\* OR C\\:\\\\Program\\ Files\\\\Windows\\ Defender\\\\*) AND process.executable.text:*\\\\MsMpEng.exe) OR (winlog.event_data.Details:*\\\\FileRepository\\\\nvmdi.inf*) OR (process.executable.text:*\\\\MicrosoftEdgeUpdateComRegisterShell64.exe) OR (process.executable.text:\"C\\:\\\\WINDOWS\\\\SYSTEM32\\\\dxdiag.exe\") OR (winlog.event_data.Details:(\"C\\:\\\\Windows\\\\pyshellext.amd64.dll\" OR \"C\\:\\\\Windows\\\\pyshellext.dll\")) OR (winlog.event_data.Details:(\"C\\:\\\\Windows\\\\system32\\\\dnssdX.dll\" OR \"C\\:\\\\Windows\\\\SysWOW64\\\\dnssdX.dll\")) OR (winlog.event_data.Details:\"C\\:\\\\Windows\\\\system32\\\\spool\\\\drivers\\\\x64\\\\3\\\\PrintConfig.dll\") OR (winlog.event_data.Details:(C\\:\\\\Program\\ Files\\\\* OR C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\*)) OR (winlog.event_data.Details:C\\:\\\\ProgramData\\\\Microsoft\\\\*) OR (winlog.event_data.Details:*C\\:\\\\WINDOWS\\\\system32\\\\GamingServicesProxy.dll*) OR (process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\poqexec.exe\" AND winlog.event_data.Details:*C\\:\\\\Windows\\\\System32\\\\Autopilot.dll*) OR (process.executable.text:\"C\\:\\\\Windows\\\\system32\\\\SecurityHealthService.exe\" AND winlog.event_data.Details:*C\\:\\\\Windows\\\\System32\\\\SecurityHealth*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/", "https://attack.mitre.org/techniques/T1546/015/"], "timestamp_override": "event.ingested", "author": ["Maxime Thiebaut (@0xThiebaut)", "oscd.community", "C\u00e9dric Hien"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
