{"description": "Detects the modification of a ServiceDLL value in the service settings", "enabled": false, "false_positives": ["Administrative scripts", "Installation of a service"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "75ee7f0a-8aec-2753-0885-d0a1bb841001", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "ServiceDll Modification", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND winlog.event_data.TargetObject:*\\\\Parameters\\\\ServiceDll) AND (NOT ((winlog.event_data.Details:\"C\\:\\\\Windows\\\\system32\\\\spool\\\\drivers\\\\x64\\\\3\\\\PrintConfig.dll\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Privilege Escalation", "T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
