{"description": "Detects when an attacker modifies the registry value of the \"hhctrl\" to point to a custom binary", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f10ed525-97fe-4fed-be7c-2feecca941b1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Persistence Via Hhctrl.ocx", "query": "(winlog.event_data.TargetObject:/.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{52[Aa]2[Aa][Aa][Aa][Ee]\\-085[Dd]\\-4187\\-97[Ee][Aa]\\-8[Cc]30[Dd][Bb]990436\\}\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\).*/ AND (NOT winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Hh][Hh][Cc][Tt][Rr][Ll]\\.[Oo][Cc][Xx]/))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/hhctrl.html", "https://www.hexacorn.com/blog/2018/04/23/beyond-good-ol-run-key-part-77/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
