{"description": "Detects tampering to RDP Terminal Service/Server sensitive settings. Such as allowing unauthorized users access to a system via the 'fAllowUnsolicited' or enabling RDP via 'fDenyTSConnections'...etc", "enabled": false, "false_positives": ["Some of the keys mentioned here could be modified by an administrator while setting group policy (it should be investigated either way)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a10fc8c6-f1f1-18e5-17f8-067f1383da37", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RDP Sensitive Settings Changed", "query": "(winlog.event_data.EventType:\"SetValue\" AND ((winlog.event_data.TargetObject:(*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\Terminal\\ Services\\\\* OR *\\\\Control\\\\Terminal\\ Server\\\\*) AND winlog.event_data.TargetObject:*\\\\Shadow AND winlog.event_data.Details:(\"DWORD\\ \\(0x00000001\\)\" OR \"DWORD\\ \\(0x00000002\\)\" OR \"DWORD\\ \\(0x00000003\\)\" OR \"DWORD\\ \\(0x00000004\\)\")) OR (winlog.event_data.TargetObject:(*\\\\Control\\\\Terminal\\ Server\\\\* OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\Terminal\\ Services\\\\*) AND winlog.event_data.TargetObject:(*\\\\fAllowUnsolicited OR *\\\\fAllowUnsolicitedFullControl) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\") OR winlog.event_data.TargetObject:(*\\\\services\\\\TermService\\\\Parameters\\\\ServiceDll* OR *\\\\Control\\\\Terminal\\ Server\\\\WinStations\\\\RDP\\-Tcp\\\\InitialProgram* OR *\\\\Control\\\\Terminal\\ Server\\\\InitialProgram* OR *SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\Terminal\\ Services\\\\InitialProgram*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html", "http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/", "https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03", "https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190407183310.html", "https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/", "http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/", "https://admx.help/HKLM/SOFTWARE/Policies/Microsoft/Windows%20NT/Terminal%20Services"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden", "David ANDRE", "Roberto Rodriguez @Cyb3rWard0g", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
