{"description": "Detects a suspicious printer driver installation with an empty Manufacturer value", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Alerts on legitimate printer drivers that do not set any more details in the Manufacturer value"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e0813366-0407-449a-9869-a2db1119dc41", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Printer Driver Empty Manufacturer", "query": "((winlog.event_data.TargetObject:/.*\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Ee][Nn][Vv][Ii][Rr][Oo][Nn][Mm][Ee][Nn][Tt][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Xx]64\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss].*/ AND winlog.event_data.TargetObject:/.*\\\\[Mm][Aa][Nn][Uu][Ff][Aa][Cc][Tt][Uu][Rr][Ee][Rr].*/ AND winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) AND (NOT ((winlog.event_data.TargetObject:/.*\\\\[Cc][Uu][Tt][Ee][Pp][Dd][Ff]\\ [Ww][Rr][Ii][Tt][Ee][Rr]\\ [Vv]4\\.0\\\\.*/) OR (winlog.event_data.TargetObject:(/.*\\\\[Vv][Nn][Cc]\\ [Pp][Rr][Ii][Nn][Tt][Ee][Rr]\\ \\([Pp][Ss]\\)\\\\.*/ OR /.*\\\\[Vv][Nn][Cc]\\ [Pp][Rr][Ii][Nn][Tt][Ee][Rr]\\ \\([Uu][Dd]\\)\\\\.*/)) OR (winlog.event_data.TargetObject:/.*\\\\[Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\-3\\\\[Pp][Dd][Ff]24\\\\.*/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1410545674773467140"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
