{"description": "Detects persistence via Visual Studio Tools for Office (VSTO) add-ins in Office applications.", "author": ["Bhabesh Raj"], "enabled": false, "false_positives": ["Legitimate Addin Installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9d15044a-7cfe-4d23-8085-6ebc11df7685", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Persistence Via Visual Studio Tools for Office", "query": "(winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Ww][Oo][Rr][Dd]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Ee][Xx][Cc][Ee][Ll]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Oo][Ii][Nn][Tt]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Vv][Ss][Tt][Oo]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\[Ii][Nn][Cc][Ll][Uu][Ss][Ii][Oo][Nn]\\\\.*/) AND (NOT ((process.executable:(/.*\\\\[Mm][Ss][Ii][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Rr][Ee][Gg][Ss][Vv][Rr]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Aa][Dd][Dd][Ii][Nn][Ss]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\.[Aa][Ss][Oo][Uu][Tt][Ee][Xx][Tt]\\\\.*/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1137"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}]}], "version": 1, "references": ["https://twitter.com/_vivami/status/1347925307643355138", "https://vanmieghem.io/stealth-outlook-persistence/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
