{"description": "Detects disabling Windows Defender Real-Time Protection by modifying registry", "enabled": false, "false_positives": ["Administrator actions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "de50411f-d705-2c13-596f-530b63c2011f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Defender Real-Time Protection Disabled", "query": "(winlog.event_data.EventType:\"SetValue\" AND ((winlog.event_data.TargetObject:(\"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\Real\\-Time\\ Protection\\\\DisableBehaviorMonitoring\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\Real\\-Time\\ Protection\\\\DisableIOAVProtection\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\Real\\-Time\\ Protection\\\\DisableOnAccessProtection\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\Real\\-Time\\ Protection\\\\DisableRealtimeMonitoring\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\Real\\-Time\\ Protection\\\\DisableScanOnRealtimeEnable\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\SpyNet\\\\DisableBlockAtFirstSeen\") AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\") OR (winlog.event_data.TargetObject:(\"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\SpyNet\\\\SpynetReporting\" OR \"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\SpyNet\\\\SubmitSamplesConsent\") AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105"], "timestamp_override": "event.ingested", "author": ["AlertIQ"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
