{"description": "Detects persistence registry keys", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e94a5d71-6bde-f59f-26fa-8258352a781b", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "GlobalFlags Registry Persistence Mechanisms", "query": "(winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion* AND ((winlog.event_data.TargetObject:*\\\\Image\\ File\\ Execution\\ Options\\\\* AND winlog.event_data.TargetObject:*\\\\GlobalFlag*) OR (winlog.event_data.TargetObject:*SilentProcessExit\\\\* AND winlog.event_data.TargetObject:*\\\\ReportingMode*) OR (winlog.event_data.TargetObject:*SilentProcessExit\\\\* AND winlog.event_data.TargetObject:*\\\\MonitorProcess*)))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Defense Evasion", "Privilege Escalation", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/"], "timestamp_override": "event.ingested", "author": ["Karneades", "Jonhnathan Ribeiro"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
