{"description": "Detects setting a custom URL for OneDriveStandaloneUpdater.exe to download a file from the Internet without executing any\nanomalous executables with suspicious arguments. The downloaded file will be in C:\\Users\\redacted\\AppData\\Local\\Microsoft\\OneDrive\\StandaloneUpdaterreSignInSettingsConfig.json\n", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3aff0be0-7802-4a7e-a4fa-c60c74bc5e1d", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Lolbas OneDriveStandaloneUpdater.exe Proxy Download", "query": "winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Oo][Ff][Ff][Ii][Cc][Ee][Cc][Oo][Nn][Ff][Ii][Gg]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Rr][Ii][Nn][Gg][Ss][Ee][Tt][Tt][Ii][Nn][Gg][Uu][Rr][Ll][Ff][Rr][Oo][Mm][Oo][Cc].*/", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://lolbas-project.github.io/lolbas/Binaries/OneDriveStandaloneUpdater/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
