{"description": "Detects tampering with the \"ChannelAccess\" registry key in order to change access to windows event channel", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7d9263bd-dc47-4a58-bc92-5474abab390c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Change Winevt Event Access Permission Via Registry", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\WINEVT\\\\Channels\\\\* AND winlog.event_data.TargetObject:*\\\\ChannelAccess AND winlog.event_data.Details:(*\\(A;;0x1;;;SY\\)* OR *\\(A;;0x5;;;BA\\)* OR *\\(A;;0x1;;;LA\\)*)) AND (NOT ((process.executable.text:\"C\\:\\\\Windows\\\\servicing\\\\TrustedInstaller.exe\") OR (process.executable.text:*\\\\TiWorker.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://app.any.run/tasks/77b2e328-8f36-46b2-b2e2-8a80398217ab/", "https://learn.microsoft.com/en-us/windows/win32/api/winevt/", "https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
