{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "96c15a0a-07f3-e2cd-a409-445ec200d4ab", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Wow6432Node CurrentVersion Autorun Keys Modification", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion* AND winlog.event_data.TargetObject:(*\\\\ShellServiceObjectDelayLoad* OR *\\\\Run\\\\* OR *\\\\RunOnce\\\\* OR *\\\\RunOnceEx\\\\* OR *\\\\RunServices\\\\* OR *\\\\RunServicesOnce\\\\* OR *\\\\Explorer\\\\ShellServiceObjects* OR *\\\\Explorer\\\\ShellIconOverlayIdentifiers* OR *\\\\Explorer\\\\ShellExecuteHooks* OR *\\\\Explorer\\\\SharedTaskScheduler* OR *\\\\Explorer\\\\Browser\\ Helper\\ Objects*)) AND (NOT ((winlog.event_data.Details:\"(Empty)\") OR (process.executable.text:*C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeUpdate\\\\Install\\\\\\{* AND process.executable.text:*\\\\setup.exe*) OR ((process.executable.text:\"C:\\Program Files\\Common Files\\Microsoft Shared\\ClickToRun\\OfficeClickToRun.exe\" AND winlog.event_data.TargetObject:*\\\\Office\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Wow6432Node\\\\*)) OR ((process.executable.text:(\"C:\\Program Files\\Microsoft Office\\root\\integration\\integrator.exe\" OR \"C:\\Program Files (x86)\\Microsoft Office\\root\\integration\\integrator.exe\") AND winlog.event_data.TargetObject:*\\\\Explorer\\\\Browser\\ Helper\\ Objects\\\\\\{31D09BA0\\-12F5\\-4CCE\\-BE8A\\-2923E76605DA\\}\\\\*)) OR (((winlog.event_data.Details:*\\-A251\\-47B7\\-93E1\\-CDD82E34AF8B\\}) OR (winlog.event_data.Details:\"grpconv -o\") OR (winlog.event_data.Details:*C\\:\\\\Program\\ Files* AND winlog.event_data.Details:*\\\\Dropbox\\\\Client\\\\Dropbox.exe* AND winlog.event_data.Details:*\\ \\/systemstartup*))) OR (winlog.event_data.TargetObject:*\\\\Explorer\\\\Browser\\ Helper\\ Objects\\\\\\{92EF2EAD\\-A7CE\\-4424\\-B0DB\\-499CF856608E\\}\\\\NoExplorer) OR ((process.executable.text:*\\\\windowsdesktop\\-runtime\\-* AND winlog.event_data.TargetObject:(*\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{e2d1ae32\\-dd1d\\-4ad7\\-a298\\-10e42e7840fc\\} OR *\\\\WOW6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\\\{7037b699\\-7382\\-448c\\-89a7\\-4765961d2537\\}) AND winlog.event_data.Details:\\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\* AND winlog.event_data.Details:*.exe\\\"\\ \\/burn.runonce)) OR ((process.executable.text:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable.text:*\\\\OfficeClickToRun.exe)) OR (winlog.event_data.Details:\\\"C\\:\\\\ProgramData\\\\Package\\ Cache\\\\\\{d21a4f20\\-968a\\-4b0c\\-bf04\\-a38da5f06e41\\}\\\\windowsdesktop\\-runtime\\-*) OR ((process.executable.text:*\\\\VC_redist.x64.exe AND winlog.event_data.Details:*\\}\\\\VC_redist.x64.exe\\\"\\ \\/burn.runonce)) OR ((process.executable.text:(C\\:\\\\ProgramData\\\\Package\\ Cache* OR C\\:\\\\Windows\\\\Temp\\\\*) AND process.executable.text:(*\\\\winsdksetup.exe* OR *\\\\windowsdesktop\\-runtime\\-* OR *\\\\AspNetCoreSharedFrameworkBundle\\-*) AND winlog.event_data.Details:*\\ \\/burn.runonce)) OR ((process.executable.text:C\\:\\\\Windows\\\\Installer\\\\MSI* AND winlog.event_data.TargetObject:*\\\\Explorer\\\\Browser\\ Helper\\ Objects*)) OR ((process.executable.text:\"C:\\WINDOWS\\system32\\msiexec.exe\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d", "https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
