{"description": "Detects when an attacker adds a new \"Debugger\" value to the \"DbgManagedDebugger\" key in order to achieve persistence which will get invoked when an application crashes", "enabled": false, "false_positives": ["Legitimate use of the key to setup a debugger. Which is often the case on developers machines"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "344690f1-c954-4a4c-8af7-d101b783f80d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Add Debugger Entry To DbgManagedDebugger For Persistence", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\.NETFramework\\\\DbgManagedDebugger) AND (NOT (winlog.event_data.Details:\"\\\"C\\:\\\\Windows\\\\system32\\\\vsjitdebugger.exe\\\"\\ PID\\ %d\\ APPDOM\\ %d\\ EXTEXT\\ \\\"%s\\\"\\ EVTHDL\\ %d\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/", "https://github.com/last-byte/PersistenceSniper"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
