{"description": "This rule detects that the path to the DLL written in the registry is different from the default one. Launched WAB.exe tries to load the DLL from Registry.", "author": ["oscd.community", "Natalia Shornikova"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fc014922-5def-4da9-a0fc-28c973f41bfb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Execution DLL of Choice Using WAB.EXE", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Aa][Bb]\\\\[Dd][Ll][Ll][Pp][Aa][Tt][Hh]/ AND (NOT winlog.event_data.Details:/\\%[Cc][Oo][Mm][Mm][Oo][Nn][Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ff][Ii][Ll][Ee][Ss]\\%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ww][Aa][Bb]32\\.[Dd][Ll][Ll]/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OSBinaries/Wab.yml", "https://twitter.com/Hexacorn/status/991447379864932352", "http://www.hexacorn.com/blog/2018/05/01/wab-exe-as-a-lolbin/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
