{"description": "Detects the modification of Outlook setting \"LoadMacroProviderOnBoot\" which if enabled allows the automatic loading of any configured VBA project/module", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "396ae3eb-4174-4b9b-880e-dc0364d78a19", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via Outlook LoadMacroProviderOnBoot Setting", "query": "(winlog.event_data.TargetObject:/.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\\\[Ll][Oo][Aa][Dd][Mm][Aa][Cc][Rr][Oo][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Oo][Nn][Bb][Oo][Oo][Tt]/ AND winlog.event_data.Details:*0x00000001*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1008", "T1137", "T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1137", "name": "Office Application Startup", "reference": "https://attack.mitre.org/techniques/T1137"}, {"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53", "https://www.linkedin.com/pulse/outlook-backdoor-using-vba-samir-b-/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
