{"description": "Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe (UACMe 52)", "author": ["Christian Burkard (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6597be7b-ac61-4ac8-bef4-d3ec88174853", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "UAC Bypass Abusing Winsat Path Parsing - Registry", "query": "(winlog.event_data.TargetObject:/.*\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Vv][Ee][Nn][Tt][Oo][Rr][Yy][Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ff][Ii][Ll][Ee]\\\\[Ww][Ii][Nn][Ss][Aa][Tt]\\.[Ee][Xx][Ee]\\|.*/ AND winlog.event_data.TargetObject:/.*\\\\[Ll][Oo][Ww][Ee][Rr][Cc][Aa][Ss][Ee][Ll][Oo][Nn][Gg][Pp][Aa][Tt][Hh]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Tt][Ee][Mm][Pp]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ss][Aa][Tt]\\.[Ee][Xx][Ee]/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://github.com/hfiref0x/UACME"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
