{"description": "Detects when an attacker adds a new \"DLLPathOverride\" value to the \"Natural Language\" key in order to achieve persistence which will get invoked by \"SearchIndexer.exe\" process", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a1b1fd53-9c4a-444c-bae0-34a330fc7aa8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via DLLPathOverride", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll]\\\\[Cc][Oo][Nn][Tt][Ee][Nn][Tt][Ii][Nn][Dd][Ee][Xx]\\\\[Ll][Aa][Nn][Gg][Uu][Aa][Gg][Ee]\\\\.*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ss][Tt][Ee][Mm][Mm][Ee][Rr][Dd][Ll][Ll][Pp][Aa][Tt][Hh][Oo][Vv][Ee][Rr][Rr][Ii][Dd][Ee].*/ OR /.*\\\\[Ww][Bb][Dd][Ll][Ll][Pp][Aa][Tt][Hh][Oo][Vv][Ee][Rr][Rr][Ii][Dd][Ee].*/ OR /.*\\\\[Ss][Tt][Ee][Mm][Mm][Ee][Rr][Cc][Ll][Aa][Ss][Ss].*/ OR /.*\\\\[Ww][Bb][Rr][Ee][Aa][Kk][Ee][Rr][Cc][Ll][Aa][Ss][Ss].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/naturallanguage6.html", "https://www.hexacorn.com/blog/2018/12/30/beyond-good-ol-run-key-part-98/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
