{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cbf93e5d-ca6c-4722-8bea-e9119007c248", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CurrentVersion NT Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Vv][Mm][Aa][Pp][Pp][Ll][Ee][Tt].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Tt][Aa][Ss][Kk][Mm][Aa][Nn].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Gg][Pp][Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Aa][Pp][Pp][Ss][Ee][Tt][Uu][Pp].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Aa][Ll][Tt][Ee][Rr][Nn][Aa][Tt][Ee][Ss][Hh][Ee][Ll][Ll][Ss]\\\\[Aa][Vv][Aa][Ii][Ll][Aa][Bb][Ll][Ee][Ss][Hh][Ee][Ll][Ll][Ss].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ii][Cc][Oo][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ll][Ii][Bb].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Aa][Pp][Pp][Ii][Nn][Ii][Tt]\\_[Dd][Ll][Ll][Ss].*/ OR /.*\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss].*/ OR /.*\\\\[Ff][Oo][Nn][Tt]\\ [Dd][Rr][Ii][Vv][Ee][Rr][Ss].*/ OR /.*\\\\[Dd][Rr][Ii][Vv][Ee][Rr][Ss]32.*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Rr][Uu][Nn].*/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ll][Oo][Aa][Dd].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR ((winlog.event_data.TargetObject:/.*\\\\[Ii][Mm][Aa][Gg][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn]\\ [Oo][Pp][Tt][Ii][Oo][Nn][Ss]\\\\.*/ AND winlog.event_data.TargetObject:(/.*\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ee][Xx][Cc][Ee][Pp][Tt][Ii][Oo][Nn][Cc][Hh][Aa][Ii][Nn][Vv][Aa][Ll][Ii][Dd][Aa][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Mm][Ii][Tt][Ii][Gg][Aa][Tt][Ii][Oo][Nn][Oo][Pp][Tt][Ii][Oo][Nn][Ss]/))) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Mm][Pp]\\\\.*/ AND process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/)) OR (((winlog.event_data.TargetObject:(/.*\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn][Ss][Tt][Oo][Rr][Ee]\\\\[Hh][Kk][Ll][Mm]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\.*/ OR /.*\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Rr][Ee][Gg][Ii][Ss][Tt][Rr][Yy]\\\\[Mm][Aa][Cc][Hh][Ii][Nn][Ee]\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\.*/)) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Vv][Cc][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:(/.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Gg][Pp][Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{827[Dd]319[Ee]\\-6[Ee][Aa][Cc]\\-11[Dd]2\\-[Aa]4[Ee][Aa]\\-00[Cc]04[Ff]79[Ff]83[Aa]\\}\\\\[Pp][Rr][Ee][Vv][Ii][Oo][Uu][Ss][Pp][Oo][Ll][Ii][Cc][Yy][Aa][Rr][Ee][Aa][Ss].*/ OR /.*\\\\[Ww][Ii][Nn][Ll][Oo][Gg][Oo][Nn]\\\\[Gg][Pp][Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{827[Dd]319[Ee]\\-6[Ee][Aa][Cc]\\-11[Dd]2\\-[Aa]4[Ee][Aa]\\-00[Cc]04[Ff]79[Ff]83[Aa]\\}\\\\[Mm][Aa][Xx][Nn][Oo][Gg][Pp][Oo][Ll][Ii][Ss][Tt][Cc][Hh][Aa][Nn][Gg][Ee][Ss][Ii][Nn][Tt][Ee][Rr][Vv][Aa][Ll].*/) AND winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000009\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]000003[Cc]0\\)/))) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Nn][Ee][Tt]\\\\[Ff][Rr][Aa][Mm][Ee][Ww][Oo][Rr][Kk].*/ AND process.executable:/.*\\\\[Nn][Gg][Ee][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Ss][Tt][Aa][Nn][Dd][Aa][Ll][Oo][Nn][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Rr]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\[Dd][Ee][Ll][Ee][Tt][Ee]\\ [Cc][Aa][Cc][Hh][Ee][Dd]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\ [Bb][Ii][Nn][Aa][Rr][Yy]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Qq]\\ \\/[Cc]\\ [Dd][Ee][Ll]\\ \\/[Qq]\\ \\\"[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]\\\"/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
