{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "18f2065c-d36c-464a-a748-bcf909acb2e3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Wow6432Node Classes Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss].*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ff][Oo][Ll][Dd][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Ee][Xx][Tt][Ss][Hh][Ee][Ll][Ll][Ff][Oo][Ll][Dd][Ee][Rr][Vv][Ii][Ee][Ww][Ss].*/ OR /.*\\\\[Ff][Oo][Ll][Dd][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Dd][Rr][Aa][Gg][Dd][Rr][Oo][Pp][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/ OR /.*\\\\[Ff][Oo][Ll][Dd][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Cc][Oo][Ll][Uu][Mm][Nn][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/ OR /.*\\\\[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Dd][Rr][Aa][Gg][Dd][Rr][Oo][Pp][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/ OR /.*\\\\[Dd][Ii][Rr][Ee][Cc][Tt][Oo][Rr][Yy]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Cc][Oo][Pp][Yy][Hh][Oo][Oo][Kk][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Aa][Cc]757296\\-3522\\-4[Ee]11\\-9862\\-[Cc]17[Bb][Ee]5[Aa]1767[Ee]\\}\\\\[Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Aa][Bb][Ee]3[Bb]9[Aa]4\\-257[Dd]\\-4[Bb]97\\-[Bb][Dd]1[Aa]\\-294[Aa][Ff]496222[Ee]\\}\\\\[Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{7[Ee][Dd]96837\\-96[Ff]0\\-4812\\-[Bb]211\\-[Ff]13[Cc]24117[Ee][Dd]3\\}\\\\[Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{083863[Ff]1\\-70[Dd][Ee]\\-11[Dd]0\\-[Bb][Dd]40\\-00[Aa]0[Cc]911[Cc][Ee]86\\}\\\\[Ii][Nn][Ss][Tt][Aa][Nn][Cc][Ee].*/ OR /.*\\\\[Aa][Ll][Ll][Ff][Ii][Ll][Ee][Ss][Yy][Ss][Tt][Ee][Mm][Oo][Bb][Jj][Ee][Cc][Tt][Ss]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Dd][Rr][Aa][Gg][Dd][Rr][Oo][Pp][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/ OR /.*\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Pp][Rr][Oo][Pp][Ee][Rr][Tt][Yy][Ss][Hh][Ee][Ee][Tt][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/ OR /.*\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx]\\\\[Cc][Oo][Nn][Tt][Ee][Xx][Tt][Mm][Ee][Nn][Uu][Hh][Aa][Nn][Dd][Ll][Ee][Rr][Ss].*/)) AND (NOT winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
