{"description": "Detects when an attacker adds a new \"Debugger\" value to the \"AeDebug\" key in order to achieve persistence which will get invoked when an application crashes", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use of the key to setup a debugger. Which is often the case on developers machines"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "092af964-4233-4373-b4ba-d86ea2890288", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Add Debugger Entry To AeDebug For Persistence", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Aa][Ee][Dd][Ee][Bb][Uu][Gg]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr].*/ AND winlog.event_data.Details:/.*\\.[Dd][Ll][Ll]/) AND (NOT winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Vv][Ss][Jj][Ii][Tt][Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr]\\.[Ee][Xx][Ee]\\\"\\ \\-[Pp]\\ \\%[Ll][Dd]\\ \\-[Ee]\\ \\%[Ll][Dd]\\ \\-[Jj]\\ 0[Xx]\\%[Pp]/))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/aedebug.html", "https://docs.microsoft.com/en-us/windows/win32/debug/configuring-automatic-debugging"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
