{"description": "Detects registry changes to Microsoft Office \"AccessVBOM\" to a value of \"1\" which disables trust access for VBA on the victim machine and lets attackers execute malicious macros without any Microsoft Office warnings.", "author": ["Trent Liffick (@tliffick)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1a5c46e9-f32f-42f7-b2bc-6e9084db7fbf", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Trust Access Disable For VBApplications", "query": "(winlog.event_data.EventType:Setvalue AND winlog.event_data.TargetObject:/.*\\\\\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\\\\\\\[Aa][Cc][Cc][Ee][Ss][Ss][Vv][Bb][Oo][Mm]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/inversecos/status/1494174785621819397", "https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/", "https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
