{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "20f0ee37-5942-4e45-b7d5-c5b5db9df5cd", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CurrentVersion Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn].*/ AND winlog.event_data.TargetObject:(/.*\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Dd][Ee][Ll][Aa][Yy][Ll][Oo][Aa][Dd].*/ OR /.*\\\\[Rr][Uu][Nn]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee][Ee][Xx]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\.*/ OR /.*\\\\[Rr][Uu][Nn][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss][Oo][Nn][Cc][Ee]\\\\.*/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Rr][Uu][Nn].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ss][Hh][Uu][Tt][Dd][Oo][Ww][Nn].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ll][Oo][Gg][Oo][Nn].*/ OR /.*\\\\[Gg][Rr][Oo][Uu][Pp]\\ [Pp][Oo][Ll][Ii][Cc][Yy]\\\\[Ss][Cc][Rr][Ii][Pp][Tt][Ss]\\\\[Ll][Oo][Gg][Oo][Ff][Ff].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ss][Ee][Rr][Vv][Ii][Cc][Ee][Oo][Bb][Jj][Ee][Cc][Tt][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ii][Cc][Oo][Nn][Oo][Vv][Ee][Rr][Ll][Aa][Yy][Ii][Dd][Ee][Nn][Tt][Ii][Ff][Ii][Ee][Rr][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Ee][Xx][Ee][Cc][Uu][Tt][Ee][Hh][Oo][Oo][Kk][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ss][Hh][Aa][Rr][Ee][Dd][Tt][Aa][Ss][Kk][Ss][Cc][Hh][Ee][Dd][Uu][Ll][Ee][Rr].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Hh][Ee][Ll][Pp][Ee][Rr]\\ [Oo][Bb][Jj][Ee][Cc][Tt][Ss].*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Pp][Ll][Aa][Pp]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\ [Ff][Ii][Ll][Tt][Ee][Rr][Ss].*/)) AND (NOT ((((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR (winlog.event_data.TargetObject:/.*\\\\[Nn][Gg][Cc][Ff][Ii][Rr][Ss][Tt]\\\\[Cc][Oo][Nn][Ss][Ee][Cc][Uu][Tt][Ii][Vv][Ee][Ss][Ww][Ii][Tt][Cc][Hh][Cc][Oo][Uu][Nn][Tt]/) OR (process.executable:(/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\[Ss][Pp][Oo][Tt][Ii][Ff][Yy]\\\\[Ss][Pp][Oo][Tt][Ii][Ff][Yy]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Ww][Ee][Bb][Ee][Xx]\\\\[Ww][Ee][Bb][Ee][Xx][Hh][Oo][Ss][Tt]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Dd][Ee][Vv][Ii][Cc][Ee][Cc][Ee][Nn][Ss][Uu][Ss]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ss][Aa][Tt]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Ss][Tt][Aa][Nn][Dd][Aa][Ll][Oo][Nn][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Rr]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee][Ss][Ee][Tt][Uu][Pp]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Kk][Ee][Ee][Pp][Aa][Ss][Ss]\\ [Pp][Aa][Ss][Ss][Ww][Oo][Rr][Dd]\\ [Ss][Aa][Ff][Ee]\\ 2\\\\[Ss][Hh][Ii][Nn][Ss][Tt][Uu][Tt][Ii][Ll]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Oo][Ff][Ff][Ii][Cc][Ee]\\\\[Rr][Oo][Oo][Tt]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Ii][Oo][Nn]\\\\[Ii][Nn][Tt][Ee][Gg][Rr][Aa][Tt][Oo][Rr]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ll][Oo][Gg][Oo][Nn][Uu][Ii]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:(/.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{[Dd]6886603\\-9[Dd]2[Ff]\\-4[Ee][Bb]2\\-[Bb]667\\-1971041[Ff][Aa]96[Bb]\\}\\\\.*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{[Bb][Ee][Cc]09223\\-[Bb]018\\-416[Dd]\\-[Aa]0[Aa][Cc]\\-523971[Bb]639[Ff]5\\}\\\\.*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{8[Aa][Ff]662[Bb][Ff]\\-65[Aa]0\\-4[Dd]0[Aa]\\-[Aa]540\\-[Aa]338[Aa]999[Dd]36[Ff]\\}\\\\.*/ OR /.*\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Rr][Ee][Dd][Ee][Nn][Tt][Ii][Aa][Ll]\\ [Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\\\{27[Ff][Bb][Dd][Bb]57\\-[Bb]613\\-4[Aa][Ff]2\\-9[Dd]7[Ee]\\-4[Ff][Aa]7[Aa]66[Cc]21[Aa][Dd]\\}\\\\.*/))) OR (process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee].*/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Rr][Ee][Gg][Ss][Vv][Rr]32\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:*DropboxExt* AND winlog.event_data.Details:/.*[Aa]251\\-47[Bb]7\\-93[Ee]1\\-[Cc][Dd][Dd]82[Ee]34[Aa][Ff]8[Bb]\\}/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Oo][Pp][Ee][Rr][Aa]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Oo][Pp][Ee][Rr][Aa]\\\\[Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]\\\\[Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\_[Aa][Ss][Ss][Ii][Ss][Tt][Aa][Nn][Tt]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Ii][Tt][Uu][Nn][Ee][Ss][Hh][Ee][Ll][Pp][Ee][Rr]/ AND winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ii][Tt][Uu][Nn][Ee][Ss]\\\\[Ii][Tt][Uu][Nn][Ee][Ss][Hh][Ee][Ll][Pp][Ee][Rr]\\.[Ee][Xx][Ee]\\\"/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\[Zz][Oo][Oo][Mm][Mm][Ss][Ii][Rr][Ee][Pp][Aa][Ii][Rr]/ AND winlog.event_data.Details:/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Zz][Oo][Oo][Mm]\\\\[Bb][Ii][Nn]\\\\[Ii][Nn][Ss][Tt][Aa][Ll][Ll][Ee][Rr]\\.[Ee][Xx][Ee]\\\"\\ \\/[Rr][Ee][Pp][Aa][Ii][Rr]/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Gg][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]\\\\[Gg][Rr][Ee][Ee][Nn][Ss][Hh][Oo][Tt]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ff][Ss]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Dd][Rr][Ii][Vv][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Tt][Rr][Ee][Aa][Mm]\\\\.*/ AND winlog.event_data.Details:/.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ff][Ss]\\.[Ee][Xx][Ee].*/)) OR ((winlog.event_data.TargetObject:*GoogleDrive* AND winlog.event_data.Details:(/\\{[Cc][Ff][Ee]8[Bb]367\\-77[Aa]7\\-41[Dd]7\\-9[Cc]90\\-75[Dd]16[Dd]7[Dd][Cc]6[Bb]6\\}/ OR /\\{[Aa]8[Ee]52322\\-8734\\-481[Dd]\\-[Aa]7[Ee]2\\-27[Bb]309[Ee][Ff]8[Dd]56\\}/ OR /\\{[Cc]973[Dd][Aa]94\\-[Cc][Bb][Dd][Ff]\\-4[Ee]77\\-81[Dd]1\\-[Ee]5[Bb]794[Ff][Bb][Dd]146\\}/ OR /\\{51[Ee][Ff]1569\\-67[Ee][Ee]\\-4[Aa][Dd]6\\-9646\\-[Ee]726[Cc]3[Ff][Ff][Cc]8[Aa]2\\}/))) OR ((winlog.event_data.Details:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Qq]\\ \\/[Cc]\\ [Rr][Mm][Dd][Ii][Rr]\\ \\/[Ss]\\ \\/[Qq]\\ \\\"[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Cc][Mm][Dd]\\.[Ee][Xx][Ee]\\ \\/[Qq]\\ \\/[Cc]\\ [Dd][Ee][Ll]\\ \\/[Qq]\\ \\\"[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\.*/) AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\.*/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn][Oo][Nn][Cc][Ee]\\\\\\{.*/ AND winlog.event_data.Details:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Ll][Oo][Cc][Aa][Ll]\\\\[Pp][Aa][Cc][Kk][Aa][Gg][Ee]\\ [Cc][Aa][Cc][Hh][Ee]\\\\\\{.*/ AND winlog.event_data.Details:/.*\\}\\\\[Pp][Yy][Tt][Hh][Oo][Nn]\\-.*/ AND winlog.event_data.Details:/.*\\.[Ee][Xx][Ee]\\\"\\ \\/[Bb][Uu][Rr][Nn]\\.[Rr][Uu][Nn][Oo][Nn][Cc][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Cc][Oo][Mm][Mm][Oo][Nn]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\ [Ss][Hh][Aa][Rr][Ee][Dd]\\\\[Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\\\[Uu][Pp][Dd][Aa][Tt][Ee][Ss]\\\\.*/) AND process.executable:/.*\\\\[Oo][Ff][Ff][Ii][Cc][Ee][Cc][Ll][Ii][Cc][Kk][Tt][Oo][Rr][Uu][Nn]\\.[Ee][Xx][Ee]/)) OR (process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/) OR ((process.executable:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Tt][Ee][Aa][Mm][Ss]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]\\ \\-\\-[Pp][Rr][Oo][Cc][Ee][Ss][Ss][Ss][Tt][Aa][Rr][Tt]\\ .*/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Uu][Ss][Ee][Rr][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Details:/[Cc][Tt][Ff][Mm][Oo][Nn]\\.[Ee][Xx][Ee]\\ \\/[Nn]/)) OR ((process.executable:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Ss][Ee][Tt][Uu][Pp]\\\\.*/ AND winlog.event_data.Details:(/\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Aa][Vv][Ll][Aa][Uu][Nn][Cc][Hh]\\.[Ee][Xx][Ee]\\\"\\ \\/[Gg][Uu][Ii]/ OR /\\\"[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Aa][Vv][Gg]\\\\[Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]\\\\[Aa][Vv][Ll][Aa][Uu][Nn][Cc][Hh]\\.[Ee][Xx][Ee]\\\"\\ \\/[Gg][Uu][Ii]/ OR /\\{472083[Bb]0\\-[Cc]522\\-11[Cc][Ff]\\-8763\\-00608[Cc][Cc]02[Ff]24\\}/))) OR ((process.executable:(/.*\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Aa][Gg][Ee][Nn][Tt]\\-64\\.[Ee][Xx][Ee]/ OR /.*\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Aa][Gg][Ee][Nn][Tt]\\.[Ee][Xx][Ee]/) AND winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Dd][Aa][Ss][Hh][Bb][Oo][Aa][Rr][Dd]/ AND winlog.event_data.Details:/[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Aa][Gg][Ee][Nn][Tt]\\\\[Tt][Oo][Oo][Ll][Ss]\\\\[Aa][Uu][Rr][Oo][Rr][Aa]\\-[Dd][Aa][Ss][Hh][Bb][Oo][Aa][Rr][Dd]\\.[Ee][Xx][Ee]/)) OR ((winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn]\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]/ AND winlog.event_data.Details:/.*\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]\\\\[Ee][Vv][Ee][Rr][Yy][Tt][Hh][Ii][Nn][Gg]\\.[Ee][Xx][Ee]\\\"\\ \\-[Ss][Tt][Aa][Rr][Tt][Uu][Pp]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d", "https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
