{"description": "Detects when attackers or tools disable Windows Defender functionalities via the windows registry", "enabled": false, "false_positives": ["Administrator actions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0eb46774-f1ab-4a74-8238-1155855f2263", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable Windows Defender Functionalities Via Registry Keys", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\*) AND ((winlog.event_data.TargetObject:(*\\\\Real\\-Time\\ Protection\\\\DisableBehaviorMonitoring OR *\\\\Real\\-Time\\ Protection\\\\DisableIOAVProtection OR *\\\\Real\\-Time\\ Protection\\\\DisableOnAccessProtection OR *\\\\Real\\-Time\\ Protection\\\\DisableRealtimeMonitoring OR *\\\\Real\\-Time\\ Protection\\\\DisableScanOnRealtimeEnable OR *\\\\SpyNet\\\\DisableBlockAtFirstSeen OR *\\\\DisableAntiSpyware OR *\\\\DisableAntiVirus) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000001\\)\") OR (winlog.event_data.TargetObject:(*\\\\SpyNet\\\\SpynetReporting OR *\\\\SpyNet\\\\SubmitSamplesConsent OR *\\\\MpEngine\\\\MpEnablePus) AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105", "https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting"], "timestamp_override": "event.ingested", "author": ["AlertIQ", "J\u00e1n Tren\u010dansk\u00fd", "frack113", "Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
