{"description": "Adversaries may use port monitors to run an attacker supplied DLL during system boot for persistence or privilege escalation.\nA port monitor can be set through the AddMonitor API call to set a DLL to be loaded at startup.\n", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0ea10bbc-fdfd-a394-fea9-e0f27759ba2a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Add Port Monitor Persistence in Registry", "query": "((winlog.event_data.TargetObject:HKLM\\\\System\\\\CurrentControlSet\\\\Control\\\\Print\\\\Monitors\\\\* AND winlog.event_data.Details:*.dll AND winlog.event_data.EventType:\"SetValue\") AND (NOT ((process.executable.text:\"C\\:\\\\Windows\\\\System32\\\\spoolsv.exe\" AND winlog.event_data.TargetObject:*\\\\System\\\\CurrentControlSet\\\\Control\\\\Print\\\\Monitors\\\\CutePDF\\ Writer\\ Monitor\\ v4.0\\\\Driver* AND winlog.event_data.Details:\"cpwmon64_v40.dll\" AND user.name:(*AUTHORI* OR *AUTORI*)) OR (winlog.event_data.TargetObject:*Control\\\\Print\\\\Monitors\\\\MONVNC\\\\Driver*) OR (winlog.event_data.TargetObject:*Control\\\\Print\\\\Environments\\\\* AND winlog.event_data.TargetObject:*\\\\Drivers\\\\* AND winlog.event_data.TargetObject:*\\\\VNC\\ Printer*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.010/T1547.010.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
