{"description": "Detects when an attacker register a new IFilter for an exntesion. Microsoft Windows Search uses filters to extract the content of items for inclusion in a full-text index. You can extend Windows Search to index new or proprietary file types by writing filters to extract the content, and property handlers to extract the properties of files", "enabled": false, "false_positives": ["Legitimate registration of IFilters by the OS or software"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "856eeb03-0bdc-42bb-4ae8-14f57ad714bb", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Register New IFiltre For Persistence", "query": "(winlog.event_data.EventType:\"SetValue\" AND ((winlog.event_data.TargetObject:(HKLM\\\\SOFTWARE\\\\Classes\\\\.* OR HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Classes\\\\.*) AND winlog.event_data.TargetObject:*\\\\PersistentHandler*) OR (winlog.event_data.TargetObject:(HKLM\\\\SOFTWARE\\\\Classes\\\\CLSID* OR HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Classes\\\\CLSID*) AND winlog.event_data.TargetObject:*\\\\PersistentAddinsRegistered\\\\\\{89BCB740\\-6119\\-101A\\-BCB7\\-00DD010655AF\\}*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/ifilters.html", "https://twitter.com/0gtweet/status/1468548924600459267", "https://github.com/gtworek/PSBits/tree/master/IFilter", "https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/IFilter/Dll.cpp#L281-L308"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
