{"description": "Detects changes to the PowerShell execution policy in order to bypass signing requirements for script execution", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "bc4ec78e-6af0-20c2-6295-43993d62f46f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential PowerShell Execution Policy Tampering", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\ShellIds\\\\Microsoft.PowerShell\\\\ExecutionPolicy OR *\\\\Policies\\\\Microsoft\\\\Windows\\\\PowerShell\\\\ExecutionPolicy) AND winlog.event_data.Details:(*Bypass* OR *RemoteSigned* OR *Unrestricted*)) AND (NOT process.executable.text:(C\\:\\\\Windows\\\\System32\\\\* OR C\\:\\\\Windows\\\\SysWOW64\\\\*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
