{"description": "Detects the installation of a DNS plugin DLL via ServerLevelPluginDll parameter in registry, which can be used to execute code in context of the DNS server (restart required)", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e61e8a88-59a9-451c-874e-70fcc9740d67", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New DNS ServerLevelPluginDll Installed", "query": "winlog.event_data.TargetObject:/.*\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Dd][Nn][Ss]\\\\[Pp][Aa][Rr][Aa][Mm][Ee][Tt][Ee][Rr][Ss]\\\\[Ss][Ee][Rr][Vv][Ee][Rr][Ll][Ee][Vv][Ee][Ll][Pp][Ll][Uu][Gg][Ii][Nn][Dd][Ll][Ll]/", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112", "T1574"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}, {"id": "T1574", "name": "Hijack Execution Flow", "reference": "https://attack.mitre.org/techniques/T1574"}]}], "version": 1, "references": ["https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83", "https://blog.3or.de/hunting-dns-server-level-plugin-dll-injection.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
