{"description": "Detect the creation of a service with a service binary located in a temporary directory", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c0abc838-36b0-47c9-b3b3-a90c39455382", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Register A Service With Temp Folder", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:HKLM\\\\System\\\\CurrentControlSet\\\\Services\\\\* AND ((winlog.event_data.TargetObject:*\\\\Start AND process.executable:*\\\\Temp\\\\* AND winlog.event_data.Details:(\"DWORD\\ \\(0x00000000\\)\" OR \"DWORD\\ \\(0x00000001\\)\" OR \"DWORD\\ \\(0x00000002\\)\")) OR (winlog.event_data.TargetObject:*\\\\ImagePath AND winlog.event_data.Details:*\\\\Temp\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
