{"description": "Monitor the creation of a new key under 'TaskCache' when a new scheduled task is registered", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1ac40a58-c801-f990-7491-c3ac4891524b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New TaskCache Entry", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tree\\\\*) AND (NOT ((winlog.event_data.TargetObject:(*Microsoft\\\\Windows\\\\UpdateOrchestrator* OR *Microsoft\\\\Windows\\\\SoftwareProtectionPlatform\\\\SvcRestartTask\\\\Index* OR *Microsoft\\\\Windows\\\\Flighting\\\\OneSettings\\\\RefreshCache\\\\Index*)) OR (process.executable:\"C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\" AND winlog.event_data.TargetObject:(*Microsoft\\\\Windows\\\\WindowsUpdate\\\\Scheduled\\ Start\\\\Index* OR *Microsoft\\\\Windows\\\\PushToInstall\\\\Registration\\\\Index* OR *Microsoft\\\\Windows\\\\GroupPolicy\\\\\\{*\\}\\\\Index* OR *\\\\TaskCache\\\\Tree\\\\Opera\\ scheduled\\ Autoupdate* OR *\\\\TaskCache\\\\Tree\\\\Opera\\ scheduled\\ assistant\\ Autoupdate* OR *\\\\TaskCache\\\\Tree\\\\OneDrive\\ Reporting* OR *\\\\TaskCache\\\\Tree\\\\OneDrive\\ Standalone\\ Update\\ Task* OR *\\\\TaskCache\\\\Tree\\\\OneDrive\\ Per\\-Machine\\ Standalone\\ Update\\ Task\\\\* OR *\\\\TaskCache\\\\Tree\\\\Mozilla\\\\SD* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\.NET\\ Framework\\\\.NET\\ Framework\\ * OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\OfficeOsfInstaller\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\OfficeBackgroundTaskHandler* OR *\\\\TaskCache\\\\Tree\\\\GoogleUpdateTaskMachine* OR *\\\\TaskCache\\\\Tree\\\\DropboxUpdateTaskMachine* OR *\\\\TaskCache\\\\Tree\\\\Mozilla\\\\Firefox\\ Default\\ Browser\\ Agent\\ * OR *\\\\TaskCache\\\\Tree\\\\Mozilla\\\\Firefox\\ Background\\ Update\\ * OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\WOF\\\\WIM\\-Hash\\-Validation\\\\Index* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\SD* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\OfficeTelemetry* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\Office\\ ClickToRun\\ Service\\ Monitor\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\Office\\ Automatic\\ Updates\\ 2.0\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Office\\\\Office\\ Feature\\ Updates* OR *\\\\TaskCache\\\\Tree\\\\klcp_update\\\\* OR *\\\\TaskCache\\\\Tree\\\\Apple\\\\SD* OR *\\\\TaskCache\\\\Tree\\\\Apple\\\\AppleSoftwareUpdate\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\Windows\\ Defender\\\\Windows\\ Defender\\ Verification\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\Windows\\ Defender\\\\Windows\\ Defender\\ Cache\\ Maintenance\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\Windows\\ Defender\\\\Windows\\ Defender\\ Cleanup\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\Windows\\ Defender\\\\Windows\\ Defender\\ Scheduled\\ Scan\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\ Defender\\\\MP\\ Scheduled\\ Scan\\\\* OR *\\\\TaskCache\\\\Tree\\\\TVInstallRestore\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\InstallService\\\\SmartRetry\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\DeviceDirectoryClient\\\\RegisterDevicePeriodic24\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\DeviceDirectoryClient\\\\RegisterDeviceLocationRightsChange\\\\* OR *\\\\TaskCache\\\\Tree\\\\Microsoft\\\\Windows\\\\Application\\ Experience\\\\Microsoft\\ Compatibility\\ Appraiser\\\\* OR *\\\\TaskCache\\\\Tree\\\\MicrosoftEdgeUpdateTaskMachine*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1053", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/"], "timestamp_override": "event.ingested", "author": ["Syed Hasan (@syedhasan009)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
