{"description": "Detects tampering with EventLog service \"file\" key. In order to change the default location of an Evtx file. This technique is used to tamper with log collection and alerting", "author": ["D3F7A5105"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0cb8d736-995d-4ce7-a31e-1e8d452a1459", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential EventLog File Location Tampering", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ee][Vv][Ee][Nn][Tt][Ll][Oo][Gg]\\\\.*/ AND winlog.event_data.TargetObject:/.*\\\\[Ff][Ii][Ll][Ee]/) AND (NOT winlog.event_data.Details:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ww][Ii][Nn][Ee][Vv][Tt]\\\\[Ll][Oo][Gg][Ss]\\\\.*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
