{"description": "Detects changes to the \"TracingDisabled\" key in order to disable ETW logging for services.exe (SCM)", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4f281b83-0200-4b34-bf35-d24687ea57c2", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "ETW Logging Disabled For SCM", "query": "(winlog.event_data.TargetObject:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Nn][Tt]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Tt][Rr][Aa][Cc][Ii][Nn][Gg]\\\\[Ss][Cc][Mm]\\\\[Rr][Ee][Gg][Uu][Ll][Aa][Rr]\\\\[Tt][Rr][Aa][Cc][Ii][Nn][Gg][Dd][Ii][Ss][Aa][Bb][Ll][Ee][Dd]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1112", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["http://redplait.blogspot.com/2020/07/whats-wrong-with-etw.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
