{"description": "Detects the addition of new root, CA or AuthRoot certificates to the Windows registry", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9fec8c4c-3fbb-7b92-8271-294a56651eb8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "New Root or CA or AuthRoot Certificate to Store", "query": "(winlog.event_data.TargetObject:(*\\\\SOFTWARE\\\\Microsoft\\\\SystemCertificates\\\\Root\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\SystemCertificates\\\\Root\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Microsoft\\\\EnterpriseCertificates\\\\Root\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Microsoft\\\\SystemCertificates\\\\CA\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\SystemCertificates\\\\CA\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Microsoft\\\\EnterpriseCertificates\\\\CA\\\\Certificates\\\\* OR *\\\\Software\\\\Microsoft\\\\SystemCertificates\\\\AuthRoot\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\SystemCertificates\\\\AuthRoot\\\\Certificates\\\\* OR *\\\\SOFTWARE\\\\Microsoft\\\\EnterpriseCertificates\\\\AuthRoot\\\\Certificates\\\\*) AND winlog.event_data.TargetObject:*\\\\Blob AND winlog.event_data.Details:\"Binary\\ Data\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1490"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1490", "name": "Inhibit System Recovery", "reference": "https://attack.mitre.org/techniques/T1490"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1553.004/T1553.004.md#atomic-test-6---add-root-certificate-to-currentuser-certificate-store", "https://posts.specterops.io/code-signing-certificate-cloning-attacks-and-defenses-6f98657fc6ec"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
