{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a80f662f-022f-4429-9b8c-b1a41aaa6688", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Internet Explorer Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Ww][Oo][Ww]6432[Nn][Oo][Dd][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr].*/) AND winlog.event_data.TargetObject:(/.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr].*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss].*/ OR /.*\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\ [Bb][Aa][Rr][Ss].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR (winlog.event_data.TargetObject:(/.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{2670000[Aa]\\-7350\\-4[Ff]3[Cc]\\-8081\\-5663[Ee][Ee]0[Cc]6[Cc]49\\}.*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{31[Dd]09[Bb][Aa]0\\-12[Ff]5\\-4[Cc][Cc][Ee]\\-[Bb][Ee]8[Aa]\\-2923[Ee]76605[Dd][Aa]\\}.*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{789[Ff][Ee]86[Ff]\\-6[Ff][Cc]4\\-46[Aa]1\\-9849\\-[Ee][Dd][Ee]0[Dd][Bb]0[Cc]95[Cc][Aa]\\}.*/ OR /.*\\\\[Ee][Xx][Tt][Ee][Nn][Ss][Ii][Oo][Nn][Ss]\\\\\\{[Aa]95[Ff][Ee]080\\-8[Ff]5[Dd]\\-11[Dd]2\\-[Aa]20[Bb]\\-00[Aa][Aa]003[Cc]157[Aa]\\}.*/)) OR (winlog.event_data.TargetObject:(/.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr]\\\\[Ss][Hh][Ee][Ll][Ll][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\[Ii][Tt][Bb][Aa][Rr]7[Ll][Aa][Yy][Oo][Uu][Tt]/ OR /.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr]\\\\[Ss][Hh][Oo][Ww][Dd][Ii][Ss][Cc][Uu][Ss][Ss][Ii][Oo][Nn][Bb][Uu][Tt][Tt][Oo][Nn]/ OR /.*\\\\[Tt][Oo][Oo][Ll][Bb][Aa][Rr]\\\\[Ll][Oo][Cc][Kk][Ee][Dd]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
