{"description": "Detects potential PowerShell commands or code within registry run keys", "author": ["frack113", "Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate admin or third party scripts. Baseline according to your environment"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8d85cf08-bf97-4260-ba49-986a2a65129c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Powershell In Registry Run Keys", "query": "(winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Vv][Ee][Rr][Ss][Ii][Oo][Nn]\\\\[Rr][Uu][Nn].*/ AND winlog.event_data.Details:(*powershell* OR /.*[Pp][Ww][Ss][Hh]\\ .*/ OR *FromBase64String* OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ff][Ii][Ll][Ee]\\(.*/ OR /.*\\.[Dd][Oo][Ww][Nn][Ll][Oo][Aa][Dd][Ss][Tt][Rr][Ii][Nn][Gg]\\(.*/ OR /.*\\ \\-[Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn]\\ .*/ OR /.*\\ \\-[Ww]\\ 1\\ .*/ OR /.*\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Tt][Yy][Ll][Ee]\\ [Hh][Ii][Dd][Dd][Ee][Nn].*/ OR /.*\\-[Ww][Ii][Nn][Dd][Oo][Ww]\\ [Hh][Ii][Dd][Dd][Ee][Nn].*/ OR /.*\\ \\-[Nn][Oo][Pp]\\ .*/ OR /.*\\ \\-[Ee][Nn][Cc][Oo][Dd][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ .*/ OR /.*\\-[Ee][Xx][Ee][Cc][Uu][Tt][Ii][Oo][Nn][Pp][Oo][Ll][Ii][Cc][Yy]\\ [Bb][Yy][Pp][Aa][Ss][Ss].*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ee][Xx][Pp][Rr][Ee][Ss][Ss][Ii][Oo][Nn].*/ OR /.*[Ii][Ee][Xx]\\ \\(.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Cc][Oo][Mm][Mm][Aa][Nn][Dd].*/ OR /.*[Ii][Cc][Mm]\\ \\-.*/ OR /.*[Ii][Nn][Vv][Oo][Kk][Ee]\\-[Ww][Ee][Bb][Rr][Ee][Qq][Uu][Ee][Ss][Tt].*/ OR /.*[Ii][Ww][Rr]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii]\\ .*/ OR /.*\\ \\-[Nn][Oo][Nn][Ii][Nn][Tt][Ee][Rr][Aa][Cc][Tt][Ii][Vv][Ee]\\ .*/))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/frack113/atomic-red-team/blob/a9051c38de8a5320b31c7039efcbd3b56cf2d65a/atomics/T1547.001/T1547.001.md#atomic-test-9---systembc-malware-as-a-service-registry", "https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
