{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "f674e36a-4b91-431e-8aef-f8a96c2aca35", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "CurrentControlSet Autorun Keys Modification", "query": "((winlog.event_data.TargetObject:/.*\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll].*/ AND winlog.event_data.TargetObject:(/.*\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ww][Ii][Nn][Ss][Tt][Aa][Tt][Ii][Oo][Nn][Ss]\\\\[Rr][Dd][Pp]\\-[Tt][Cc][Pp]\\\\[Ii][Nn][Ii][Tt][Ii][Aa][Ll][Pp][Rr][Oo][Gg][Rr][Aa][Mm].*/ OR /.*\\\\[Tt][Ee][Rr][Mm][Ii][Nn][Aa][Ll]\\ [Ss][Ee][Rr][Vv][Ee][Rr]\\\\[Ww][Dd][Ss]\\\\[Rr][Dd][Pp][Ww][Dd]\\\\[Ss][Tt][Aa][Rr][Tt][Uu][Pp][Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss].*/ OR /.*\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss]\\\\[Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ OR /.*\\\\[Ss][Aa][Ff][Ee][Bb][Oo][Oo][Tt]\\\\[Aa][Ll][Tt][Ee][Rr][Nn][Aa][Tt][Ee][Ss][Hh][Ee][Ll][Ll].*/ OR /.*\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Ss].*/ OR /.*\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ss].*/ OR /.*\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\\\[Oo][Rr][Dd][Ee][Rr].*/ OR /.*\\\\[Ll][Ss][Aa]\\\\[Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\ [Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss].*/ OR /.*\\\\[Ll][Ss][Aa]\\\\[Aa][Uu][Tt][Hh][Ee][Nn][Tt][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\ [Pp][Aa][Cc][Kk][Aa][Gg][Ee][Ss].*/ OR /.*\\\\[Bb][Oo][Oo][Tt][Vv][Ee][Rr][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\\\[Ii][Mm][Aa][Gg][Ee][Pp][Aa][Tt][Hh].*/)) AND (NOT ((winlog.event_data.Details:/\\([Ee][Mm][Pp][Tt][Yy]\\)/) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ss]\\\\[Cc][Uu][Tt][Ee][Pp][Dd][Ff]\\ [Ww][Rr][Ii][Tt][Ee][Rr]\\ [Mm][Oo][Nn][Ii][Tt][Oo][Rr].*/ AND winlog.event_data.Details:(/[Cc][Pp][Ww][Mm][Oo][Nn]64\\_[Vv]40\\.[Dd][Ll][Ll]/ OR /[Cc][Uu][Tt][Ee][Pp][Dd][Ff]\\ [Ww][Rr][Ii][Tt][Ee][Rr]/))) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*[Pp][Rr][Ii][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ss]\\\\[Aa][Pp][Pp][Mm][Oo][Nn]\\\\[Pp][Oo][Rr][Tt][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Oo][Ff][Ff][Ii][Cc][Ee]\\.[Oo][Nn][Ee][Nn][Oo][Tt][Ee]\\_.*/ AND user.name:(*AUTHORI* OR *AUTORI*))) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Pp][Oo][Qq][Ee][Xx][Ee][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Nn][Ee][Tt][Ww][Oo][Rr][Kk][Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr]\\\\[Oo][Rr][Dd][Ee][Rr]\\\\[Pp][Rr][Oo][Vv][Ii][Dd][Ee][Rr][Oo][Rr][Dd][Ee][Rr]/)) OR ((process.executable:/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ss][Pp][Oo][Oo][Ll][Ss][Vv]\\.[Ee][Xx][Ee]/ AND winlog.event_data.TargetObject:/.*\\\\[Pp][Rr][Ii][Nn][Tt]\\\\[Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ss]\\\\[Mm][Oo][Nn][Vv][Nn][Cc]\\\\[Dd][Rr][Ii][Vv][Ee][Rr]/ AND winlog.event_data.Details:/[Vv][Nn][Cc][Pp][Mm]\\.[Dd][Ll][Ll]/)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
