{"description": "Monitor the creation of a new key under 'TaskCache' when a new scheduled task is registered by a process that is not svchost.exe, which is suspicious", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e96f2db0-ff3e-644d-15bc-b02dcb125463", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Scheduled TaskCache Change by Uncommon Program", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\*) AND (NOT ((winlog.event_data.TargetObject:(*Microsoft\\\\Windows\\\\UpdateOrchestrator* OR *Microsoft\\\\Windows\\\\SoftwareProtectionPlatform\\\\SvcRestartTask\\\\Index* OR *Microsoft\\\\Windows\\\\Flighting\\\\OneSettings\\\\RefreshCache\\\\Index*)) OR (process.executable.text:C\\:\\\\Windows\\\\* AND process.executable.text:*\\\\TiWorker.exe) OR (process.executable.text:\"C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\") OR (process.executable.text:C\\:\\\\Windows\\\\Microsoft.NET\\\\Framework\\\\* AND process.executable.text:*\\\\ngen.exe AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tasks\\\\\\{B66B135D\\-DA06\\-4FC4\\-95F8\\-7458E1D10129\\}*) OR (process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Microsoft\\ Office\\\\root\\\\Integration\\\\Integrator.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\Integration\\\\Integrator.exe\")))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1053", "T1053"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}, {"id": "T1053", "name": "Scheduled Task/Job", "reference": "https://attack.mitre.org/techniques/T1053"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/", "https://labs.f-secure.com/blog/scheduled-task-tampering/"], "timestamp_override": "event.ingested", "author": ["Syed Hasan (@syedhasan009)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
