{"description": "Detects when an attacker adds a new \"Debugger\" value to the \"AeDebug\" key in order to achieve persistence which will get invoked when an application crashes", "enabled": false, "false_positives": ["Legitimate use of the key to setup a debugger. Which is often the case on developers machines"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "092af964-4233-4373-b4ba-d86ea2890288", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Add Debugger Entry To AeDebug For Persistence", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ NT\\\\CurrentVersion\\\\AeDebug\\\\Debugger* AND winlog.event_data.Details:*.dll) AND (NOT (winlog.event_data.Details:\"\\\"C\\:\\\\WINDOWS\\\\system32\\\\vsjitdebugger.exe\\\"\\ \\-p\\ %ld\\ \\-e\\ %ld\\ \\-j\\ 0x%p\")))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/aedebug.html", "https://docs.microsoft.com/en-us/windows/win32/debug/configuring-automatic-debugging"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
