{"description": "Adds a RUN key that contains a powershell keyword", "enabled": false, "false_positives": ["Legitimate admin or third party scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "beacc1da-3e4a-b7e6-72ad-20ec190cb745", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Powershell in Windows Run Keys", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run* OR *\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce*) AND winlog.event_data.Details:(*powershell* OR *FromBase64String* OR *.DownloadFile\\(* OR *.DownloadString\\(* OR *\\ \\-w\\ hidden\\ * OR *\\-windowstyle\\ hidden* OR *\\ \\-nop\\ * OR *\\ \\-encodedcommand\\ * OR *\\-ExecutionPolicy\\ Bypass*))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/frack113/atomic-red-team/blob/a9051c38de8a5320b31c7039efcbd3b56cf2d65a/atomics/T1547.001/T1547.001.md#atomic-test-9---systembc-malware-as-a-service-registry"], "timestamp_override": "event.ingested", "author": ["frack113", "Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
