{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8b739e2b-c0d8-ca92-913a-6f644cd9ece3", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Common Autorun Keys Modification", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Windows\\ CE\\ Services\\\\AutoStart* OR *\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Command\\ Processor\\\\Autorun* OR *\\\\SOFTWARE\\\\Wow6432Node\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ CE\\ Services\\\\AutoStartOnDisconnect* OR *\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ CE\\ Services\\\\AutoStartOnConnect* OR *\\\\SYSTEM\\\\Setup\\\\CmdLine* OR *\\\\Software\\\\Microsoft\\\\Ctf\\\\LangBarAddin* OR *\\\\Software\\\\Microsoft\\\\Command\\ Processor\\\\Autorun* OR *\\\\SOFTWARE\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components* OR *\\\\SOFTWARE\\\\Classes\\\\Protocols\\\\Handler* OR *\\\\SOFTWARE\\\\Classes\\\\Protocols\\\\Filter* OR *\\\\SOFTWARE\\\\Classes\\\\Htmlfile\\\\Shell\\\\Open\\\\Command\\\\\\(Default\\)* OR *\\\\Environment\\\\UserInitMprLogonScript* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\Control\\ Panel\\\\Desktop\\\\Scrnsave.exe* OR *\\\\Software\\\\Microsoft\\\\Internet\\ Explorer\\\\UrlSearchHooks* OR *\\\\SOFTWARE\\\\Microsoft\\\\Internet\\ Explorer\\\\Desktop\\\\Components* OR *\\\\Software\\\\Classes\\\\Clsid\\\\\\{AB8902B4\\-09CA\\-4bb6\\-B78D\\-A8F59079A8D5\\}\\\\Inprocserver32* OR *\\\\Control\\ Panel\\\\Desktop\\\\Scrnsave.exe*)) AND (NOT ((winlog.event_data.Details:\"\\(Empty\\)\") OR (winlog.event_data.TargetObject:(*\\\\Office\\\\ClickToRun\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Classes\\\\PROTOCOLS\\\\Handler\\\\* OR *\\\\ClickToRunStore\\\\HKMU\\\\SOFTWARE\\\\Classes\\\\PROTOCOLS\\\\Handler\\\\*) OR winlog.event_data.Details:(\"\\{314111c7\\-a502\\-11d2\\-bbca\\-00c04f8ec294\\}\" OR \"\\{3459B272\\-CC19\\-4448\\-86C9\\-DDC3B4B2FAD3\\}\" OR \"\\{42089D2D\\-912D\\-4018\\-9087\\-2B87803E93FB\\}\" OR \"\\{5504BE45\\-A83B\\-4808\\-900A\\-3A5C36E7F77A\\}\" OR \"\\{807583E5\\-5146\\-11D5\\-A672\\-00B0D022E945\\}\")) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components\\\\\\{8A69D345\\-D564\\-463c\\-AFF1\\-A69D9E530F96\\}\\\\*) OR (winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components\\\\\\{9459C573\\-B17A\\-45AE\\-9F64\\-1857B5D58CEE\\}\\\\*) OR (winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Active\\ Setup\\\\Installed\\ Components\\\\\\{89820200\\-ECBD\\-11cf\\-8B85\\-00AA005B4383\\}\\\\*) OR (process.executable:(\"C\\:\\\\Windows\\\\System32\\\\poqexec.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\ Office\\\\root\\\\integration\\\\integrator.exe\")) OR (process.executable:(C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\* OR C\\:\\\\Program\\ Files\\\\Common\\ Files\\\\Microsoft\\ Shared\\\\ClickToRun\\\\Updates\\\\*) AND process.executable:*\\\\OfficeClickToRun.exe))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)", "wagga (name)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
