{"description": "Detects the disabling of the Windows Defender eventlog as seen in relation to Lockbit 3.0 infections", "enabled": false, "false_positives": ["Other Antivirus software installations could cause Windows to disable that eventlog (unknown)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "068bcc90-d836-96cc-3293-0e7377109d91", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disabled Windows Defender Eventlog", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\WINEVT\\\\Channels\\\\Microsoft\\-Windows\\-Windows\\ Defender\\/Operational\\\\Enabled* AND winlog.event_data.Details:\"DWORD\\ \\(0x00000000\\)\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://twitter.com/WhichbufferArda/status/1543900539280293889/photo/2"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
