{"description": "Detects changes to the Internet Explorer \"DisableFirstRunCustomize\" value, which prevents Internet Explorer from running the first run wizard the first time a user starts the browser after installing Internet Explorer or Windows.\n", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["As this is controlled by group policy as well as user settings. Some false positives may occur."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ab567429-1dfb-4674-b6d2-979fd2f9d125", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Internet Explorer DisableFirstRunCustomize Enabled", "query": "((winlog.event_data.TargetObject:/.*\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Mm][Aa][Ii][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ff][Ii][Rr][Ss][Tt][Rr][Uu][Nn][Cc][Uu][Ss][Tt][Oo][Mm][Ii][Zz][Ee]/ AND winlog.event_data.Details:(/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/ OR /[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000002\\)/)) AND (NOT process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Ii][Ee]4[Uu][Ii][Nn][Ii][Tt]\\.[Ee][Xx][Ee]/)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf", "https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/", "https://admx.help/?Category=InternetExplorer&Policy=Microsoft.Policies.InternetExplorer::NoFirstRunCustomise"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
