{"description": "Detects when attackers or tools disable Windows Defender functionalities via the Windows registry", "author": ["AlertIQ", "J\u00e1n Tren\u010dansk\u00fd", "frack113", "Nasreddine Bencherchali", "Swachchhanda Shrawan Poudel"], "enabled": false, "false_positives": ["Administrator actions via the Windows Defender interface"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0eb46774-f1ab-4a74-8238-1155855f2263", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable Windows Defender Functionalities Via Registry Keys", "query": "(winlog.event_data.TargetObject:(/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\ [Ss][Ee][Cc][Uu][Rr][Ii][Tt][Yy]\\ [Cc][Ee][Nn][Tt][Ee][Rr]\\\\.*/ OR /.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Pp][Oo][Ll][Ii][Cc][Ii][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\\\.*/) AND (((winlog.event_data.TargetObject:(/.*\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Ss][Pp][Yy][Ww][Aa][Rr][Ee]/ OR /.*\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Aa][Nn][Tt][Ii][Vv][Ii][Rr][Uu][Ss]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ee][Hh][Aa][Vv][Ii][Oo][Rr][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Nn][Tt][Rr][Uu][Ss][Ii][Oo][Nn][Pp][Rr][Ee][Vv][Ee][Nn][Tt][Ii][Oo][Nn][Ss][Yy][Ss][Tt][Ee][Mm]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ii][Oo][Aa][Vv][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Oo][Nn][Aa][Cc][Cc][Ee][Ss][Ss][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Mm][Oo][Nn][Ii][Tt][Oo][Rr][Ii][Nn][Gg]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Aa][Nn][Oo][Nn][Rr][Ee][Aa][Ll][Tt][Ii][Mm][Ee][Ee][Nn][Aa][Bb][Ll][Ee]/ OR /.*\\\\[Rr][Ee][Aa][Ll]\\-[Tt][Ii][Mm][Ee]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ss][Cc][Rr][Ii][Pp][Tt][Ss][Cc][Aa][Nn][Nn][Ii][Nn][Gg]/ OR /.*\\\\[Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Ee][Nn][Hh][Aa][Nn][Cc][Ee][Dd][Nn][Oo][Tt][Ii][Ff][Ii][Cc][Aa][Tt][Ii][Oo][Nn][Ss]/ OR /.*\\\\[Ss][Pp][Yy][Nn][Ee][Tt]\\\\[Dd][Ii][Ss][Aa][Bb][Ll][Ee][Bb][Ll][Oo][Cc][Kk][Aa][Tt][Ff][Ii][Rr][Ss][Tt][Ss][Ee][Ee][Nn]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000001\\)/)) OR ((winlog.event_data.TargetObject:(/.*\\\\[Aa][Pp][Pp]\\ [Aa][Nn][Dd]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\ [Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]\\\\[Dd][Ii][Ss][Aa][Ll][Ll][Oo][Ww][Ee][Xx][Pp][Ll][Oo][Ii][Tt][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn][Oo][Vv][Ee][Rr][Rr][Ii][Dd][Ee]/ OR /.*\\\\[Ff][Ee][Aa][Tt][Uu][Rr][Ee][Ss]\\\\[Tt][Aa][Mm][Pp][Ee][Rr][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Mm][Pp][Ee][Nn][Gg][Ii][Nn][Ee]\\\\[Mm][Pp][Ee][Nn][Aa][Bb][Ll][Ee][Pp][Uu][Ss]/ OR /.*\\\\[Pp][Uu][Aa][Pp][Rr][Oo][Tt][Ee][Cc][Tt][Ii][Oo][Nn]/ OR /.*\\\\[Ss][Ii][Gg][Nn][Aa][Tt][Uu][Rr][Ee]\\ [Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Ff][Oo][Rr][Cc][Ee][Uu][Pp][Dd][Aa][Tt][Ee][Ff][Rr][Oo][Mm][Mm][Uu]/ OR /.*\\\\[Ss][Pp][Yy][Nn][Ee][Tt]\\\\[Ss][Pp][Yy][Nn][Ee][Tt][Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]/ OR /.*\\\\[Ss][Pp][Yy][Nn][Ee][Tt]\\\\[Ss][Uu][Bb][Mm][Ii][Tt][Ss][Aa][Mm][Pp][Ll][Ee][Ss][Cc][Oo][Nn][Ss][Ee][Nn][Tt]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Dd][Ee][Ff][Ee][Nn][Dd][Ee][Rr]\\ [Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\ [Gg][Uu][Aa][Rr][Dd]\\\\[Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Dd]\\ [Ff][Oo][Ll][Dd][Ee][Rr]\\ [Aa][Cc][Cc][Ee][Ss][Ss]\\\\[Ee][Nn][Aa][Bb][Ll][Ee][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ll][Ee][Dd][Ff][Oo][Ll][Dd][Ee][Rr][Aa][Cc][Cc][Ee][Ss][Ss]/) AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000000\\)/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105", "https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker", "https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html", "https://www.tenforums.com/tutorials/105533-enable-disable-windows-defender-exploit-protection-settings.html", "https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
