{"description": "Detects when an attacker adds a new \"Debugger\" value to the \"Hangs\" key in order to achieve persistence which will get invoked when an application crashes", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["This value is not set by default but could be rarly used by administrators"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "833ef470-fa01-4631-a79b-6f291c9ac498", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Add Debugger Entry To Hangs Key For Persistence", "query": "winlog.event_data.TargetObject:/.*\\\\[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\ [Ee][Rr][Rr][Oo][Rr]\\ [Rr][Ee][Pp][Oo][Rr][Tt][Ii][Nn][Gg]\\\\[Hh][Aa][Nn][Gg][Ss]\\\\[Dd][Ee][Bb][Uu][Gg][Gg][Ee][Rr].*/", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/wer_debugger.html", "https://www.hexacorn.com/blog/2019/09/20/beyond-good-ol-run-key-part-116/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
