{"description": "This rule detects cor_enable_profiling and cor_profiler environment variables being set and configured.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ad89044a-8f49-4673-9a55-cbd88a1b374f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Enabling COR Profiler Environment Variables", "query": "(winlog.event_data.EventType:\"Setvalue\" AND winlog.event_data.TargetObject:(*\\\\COR_ENABLE_PROFILING OR *\\\\COR_PROFILER))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/jamieantisocial/status/1304520651248668673", "https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors", "https://www.sans.org/cyber-security-summit/archives"], "timestamp_override": "event.ingested", "author": ["Jose Rodriguez (@Cyb3rPandaH)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
