{"description": "Detects changes to the AMSI come server registry key in order disable AMSI scanning functionalities. When AMSI attempts to starts its COM component, it will query its registered CLSID and return a non-existent COM server. This causes a load failure and prevents any scanning methods from being accessed, ultimately rendering AMSI useless", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "160d2780-31f7-4922-8b3a-efce30e63e96", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential AMSI COM Server Hijacking", "query": "(winlog.event_data.TargetObject:/.*\\\\[Cc][Ll][Ss][Ii][Dd]\\\\\\{[Ff][Dd][Bb]00[Ee]52\\-[Aa]214\\-4[Aa][Aa]1\\-8[Ff][Bb][Aa]\\-4357[Bb][Bb]0072[Ee][Cc]\\}\\\\[Ii][Nn][Pp][Rr][Oo][Cc][Ss][Ee][Rr][Vv][Ee][Rr]32\\\\\\([Dd][Ee][Ff][Aa][Uu][Ll][Tt]\\)/ AND (NOT winlog.event_data.Details:/\\%[Ww][Ii][Nn][Dd][Ii][Rr]\\%\\\\[Ss][Yy][Ss][Tt][Ee][Mm]32\\\\[Aa][Mm][Ss][Ii]\\.[Dd][Ll][Ll]/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://enigma0x3.net/2017/07/19/bypassing-amsi-via-com-server-hijacking/", "https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-comreg-bypass"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
