{"description": "Detects changes to RDP terminal service sensitive settings", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a10fc8c6-f1f1-18e5-17f8-067f1383da37", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RDP Sensitive Settings Changed", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\services\\\\TermService\\\\Parameters\\\\ServiceDll* OR *\\\\Control\\\\Terminal\\ Server\\\\fSingleSessionPerUser* OR *\\\\Control\\\\Terminal\\ Server\\\\fDenyTSConnections* OR *\\\\Policies\\\\Microsoft\\\\Windows\\ NT\\\\Terminal\\ Services\\\\Shadow* OR *\\\\Control\\\\Terminal\\ Server\\\\WinStations\\\\RDP\\-Tcp\\\\InitialProgram*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html", "https://knowledge.insourcess.com/Supporting_Technologies/Wonderware/Tech_Notes/TN_WW213_How_to_shadow_an_established_RDP_Session_on_Windows_10_Pro", "https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03", "http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden", "David ANDRE"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
