{"description": "Detects changes to the AppInstaller (winget) admin settings. Such as enabling local manifest installations or disabling installer hash checks", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["The event doesn't contain information about the type of change. False positives are expected with legitimate changes"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6db5eaf9-88f7-4ed9-af7d-9ef2ad12f236", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Winget Admin Settings Modification", "query": "(winlog.event_data.EventType:\"SetValue\" AND process.executable.text:\"*\\\\winget.exe\" AND winlog.event_data.TargetObject:\\\\REGISTRY\\\\A\\\\* AND winlog.event_data.TargetObject:*\\\\LocalState\\\\admin_settings)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget", "https://github.com/microsoft/winget-cli/blob/02d2f93807c9851d73eaacb4d8811a76b64b7b01/src/AppInstallerCommonCore/Public/winget/AdminSettings.h#L13"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
