{"description": "Detects changes to the PSFactory COM InProcServer32 registry. This technique was used by RomCom to create persistence storing a malicious DLL.", "author": ["BlackBerry Threat Research and Intelligence Team - @Joseliyo_Jstnk"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "243380fa-11eb-4141-af92-e14925e77c1b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential PSFactoryBuffer COM Hijacking", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\CLSID\\\\\\{c90250f3\\-4d7d\\-4991\\-9b69\\-a5c5bc1c2ae6\\}\\\\InProcServer32\\\\\\(Default\\)) AND (NOT winlog.event_data.Details:(\"%windir%\\System32\\ActXPrxy.dll\" OR \"C:\\Windows\\System32\\ActXPrxy.dll\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://blogs.blackberry.com/en/2023/06/romcom-resurfaces-targeting-ukraine", "https://strontic.github.io/xcyclopedia/library/clsid_C90250F3-4D7D-4991-9B69-A5C5BC1C2AE6.html", "https://www.virustotal.com/gui/file/6d3ab9e729bb03ae8ae3fcd824474c5052a165de6cb4c27334969a542c7b261d/detection", "https://www.trendmicro.com/en_us/research/23/e/void-rabisu-s-use-of-romcom-backdoor-shows-a-growing-shift-in-th.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
