{"description": "Detects when attackers or tools disable Windows Defender functionalities via the Windows registry", "author": ["AlertIQ", "J\u00e1n Tren\u010dansk\u00fd", "frack113", "Nasreddine Bencherchali", "Swachchhanda Shrawan Poudel"], "enabled": false, "false_positives": ["Administrator actions via the Windows Defender interface"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0eb46774-f1ab-4a74-8238-1155855f2263", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable Windows Defender Functionalities Via Registry Keys", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\ Defender\\\\* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\ Security\\ Center\\\\* OR *\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\ Defender\\\\*)) AND (((winlog.event_data.TargetObject:(*\\\\DisableAntiSpyware OR *\\\\DisableAntiVirus OR *\\\\Real\\-Time\\ Protection\\\\DisableBehaviorMonitoring OR *\\\\Real\\-Time\\ Protection\\\\DisableIntrusionPreventionSystem OR *\\\\Real\\-Time\\ Protection\\\\DisableIOAVProtection OR *\\\\Real\\-Time\\ Protection\\\\DisableOnAccessProtection OR *\\\\Real\\-Time\\ Protection\\\\DisableRealtimeMonitoring OR *\\\\Real\\-Time\\ Protection\\\\DisableScanOnRealtimeEnable OR *\\\\Real\\-Time\\ Protection\\\\DisableScriptScanning OR *\\\\Reporting\\\\DisableEnhancedNotifications OR *\\\\SpyNet\\\\DisableBlockAtFirstSeen) AND winlog.event_data.Details:\"DWORD (0x00000001)\")) OR ((winlog.event_data.TargetObject:(*\\\\App\\ and\\ Browser\\ protection\\\\DisallowExploitProtectionOverride OR *\\\\Features\\\\TamperProtection OR *\\\\MpEngine\\\\MpEnablePus OR *\\\\PUAProtection OR *\\\\Signature\\ Update\\\\ForceUpdateFromMU OR *\\\\SpyNet\\\\SpynetReporting OR *\\\\SpyNet\\\\SubmitSamplesConsent OR *\\\\Windows\\ Defender\\ Exploit\\ Guard\\\\Controlled\\ Folder\\ Access\\\\EnableControlledFolderAccess) AND winlog.event_data.Details:\"DWORD (0x00000000)\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105", "https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker", "https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html", "https://www.tenforums.com/tutorials/105533-enable-disable-windows-defender-exploit-protection-settings.html", "https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
