{"description": "Detects the abuse of the exefile handler in new file association. Used for bypass of security products.", "author": ["Andreas Hunkeler (@Karneades)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "44a22d59-b175-4f13-8c16-cbaef5b581ff", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "New File Association Using Exefile", "query": "(winlog.event_data.TargetObject:/.*[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\\\..*/ AND winlog.event_data.Details:exefile)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/mrd0x/status/1461041276514623491"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
