{"description": "Detect possible persistence using Fax DLL load when service restart", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5f2374c3-3d7e-f81a-5f37-b51b417d9bc4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Change the Fax Dll", "query": "((winlog.event_data.TargetObject:*\\\\Software\\\\Microsoft\\\\Fax\\\\Device\\ Providers\\\\* AND winlog.event_data.TargetObject:*\\\\ImageName*) AND (NOT (winlog.event_data.Details:\"%systemroot%\\system32\\fxst30.dll\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/dottor_morte/status/1544652325570191361", "https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
