{"description": "Detects modification of autostart extensibility point (ASEP) in registry.", "enabled": false, "false_positives": ["Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason", "Legitimate administrator sets up autorun keys for legitimate reason"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a80f662f-022f-4429-9b8c-b1a41aaa6688", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Internet Explorer Autorun Keys Modification", "query": "((winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:(*\\\\Software\\\\Wow6432Node\\\\Microsoft\\\\Internet\\ Explorer* OR *\\\\Software\\\\Microsoft\\\\Internet\\ Explorer*) AND winlog.event_data.TargetObject:(*\\\\Toolbar* OR *\\\\Extensions* OR *\\\\Explorer\\ Bars*)) AND (NOT ((winlog.event_data.Details:\"\\(Empty\\)\") OR (winlog.event_data.TargetObject:(*\\\\Extensions\\\\\\{2670000A\\-7350\\-4f3c\\-8081\\-5663EE0C6C49\\}* OR *\\\\Extensions\\\\\\{31D09BA0\\-12F5\\-4CCE\\-BE8A\\-2923E76605DA\\}* OR *\\\\Extensions\\\\\\{789FE86F\\-6FC4\\-46A1\\-9849\\-EDE0DB0C95CA\\}* OR *\\\\Extensions\\\\\\{A95fe080\\-8f5d\\-11d2\\-a20b\\-00aa003c157a\\}*)) OR (winlog.event_data.TargetObject:(*\\\\Toolbar\\\\ShellBrowser\\\\ITBar7Layout OR *\\\\Toolbar\\\\ShowDiscussionButton OR *\\\\Toolbar\\\\Locked)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1547"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1547", "name": "Boot or Logon Autostart Execution", "reference": "https://attack.mitre.org/techniques/T1547"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md", "https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns", "https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d"], "timestamp_override": "event.ingested", "author": ["Victor Sergeev", "Daniil Yugoslavskiy", "Gleb Sukhodolskiy", "Timur Zinniatullin", "oscd.community", "Tim Shelton", "frack113 (split)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
