{"description": "Detects when an attacker or tool disables the  Windows Defender service (WinDefend) via the registry", "author": ["J\u00e1n Tren\u010dansk\u00fd", "frack113", "AlertIQ", "Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Administrator actions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e1aa95de-610a-427d-b9e7-9b46cfafbe6a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Windows Defender Service Disabled", "query": "(winlog.event_data.TargetObject:/[Hh][Kk][Ll][Mm]\\\\[Ss][Yy][Ss][Tt][Ee][Mm]\\\\[Cc][Uu][Rr][Rr][Ee][Nn][Tt][Cc][Oo][Nn][Tt][Rr][Oo][Ll][Ss][Ee][Tt]\\\\[Ss][Ee][Rr][Vv][Ii][Cc][Ee][Ss]\\\\[Ww][Ii][Nn][Dd][Ee][Ff][Ee][Nn][Dd]\\\\[Ss][Tt][Aa][Rr][Tt]/ AND winlog.event_data.Details:/[Dd][Ww][Oo][Rr][Dd]\\ \\(0[Xx]00000004\\)/)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/", "https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
