{"description": "Detects the pattern of UAC Bypass using registry key manipulation of sdclt.exe (e.g. UACMe 53)", "author": ["Omer Yampel", "Christian Burkard (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5b872a46-3b90-45c1-8419-f675db8053aa", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "UAC Bypass via Sdclt", "query": "((winlog.event_data.TargetObject:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Ee][Xx][Ee][Ff][Ii][Ll][Ee]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Rr][Uu][Nn][Aa][Ss]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Ii][Ss][Oo][Ll][Aa][Tt][Ee][Dd][Cc][Oo][Mm][Mm][Aa][Nn][Dd]/) OR ((winlog.event_data.TargetObject:/.*[Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\[Cc][Ll][Aa][Ss][Ss][Ee][Ss]\\\\[Ff][Oo][Ll][Dd][Ee][Rr]\\\\[Ss][Hh][Ee][Ll][Ll]\\\\[Oo][Pp][Ee][Nn]\\\\[Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\\\[Ss][Yy][Mm][Bb][Oo][Ll][Ii][Cc][Ll][Ii][Nn][Kk][Vv][Aa][Ll][Uu][Ee]/ AND (winlog.event_data.Details:/-1[0-9]{3}\\\\Software\\\\Classes\\\\/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "Privilege Escalation", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}], "version": 1, "references": ["https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/", "https://github.com/hfiref0x/UACME"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
