{"description": "Detects modification to the \"Default\" value of the \"MyComputer\" key and subkeys to point to a custom binary that will be launched whenever the associated action is executed (see reference section for example)", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Unlikely but if you experience FPs add specific processes and locations you would like to monitor for"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8fbe98a8-8f9d-44f8-aa71-8c572e29ef06", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Persistence Via MyComputer Registry Keys", "query": "(winlog.event_data.EventType:\"SetValue\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\MyComputer* AND winlog.event_data.TargetObject:*\\(Default\\))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.hexacorn.com/blog/2017/01/18/beyond-good-ol-run-key-part-55/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
