{"description": "Detects registry changes to Office trust records where the path is located in a potentially suspicious location", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Macro Enabled In A Potentially Suspicious Document", "query": "(winlog.event_data.EventType:\"Setvalue\" AND winlog.event_data.TargetObject:*\\\\Security\\\\Trusted\\ Documents\\\\TrustRecords* AND winlog.event_data.TargetObject:(*\\/AppData\\/Local\\/Microsoft\\/Windows\\/INetCache\\/* OR *\\/AppData\\/Local\\/Temp\\/* OR *\\/PerfLogs\\/* OR *C\\:\\/Users\\/Public\\/* OR *file\\:\\/\\/\\/D\\:\\/* OR *file\\:\\/\\/\\/E\\:\\/*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1112"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1112", "name": "Modify Registry", "reference": "https://attack.mitre.org/techniques/T1112"}]}], "version": 1, "references": ["https://twitter.com/inversecos/status/1494174785621819397", "Internal Research"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
