{"description": "Detects multiple blocks by the mod_security module (Web Application Firewall)", "enabled": false, "false_positives": ["Vulnerability scanners", "Frequent attacks if system faces Internet"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a06eea10-d932-4aa6-8ba9-186df72c8d23", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Multiple Modsecurity Blocks", "query": "(*mod_security\\:\\ Access\\ denied* OR *ModSecurity\\:\\ Access\\ denied* OR *mod_security\\-message\\:\\ Access\\ denied*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1499"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1499", "name": "Endpoint Denial of Service", "reference": "https://attack.mitre.org/techniques/T1499"}]}], "version": 1, "threshold": {"field": [], "value": 7}, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
