{"description": "Detects activity when a member is removed from a security-enabled global group", "author": ["Alexandr Yampolskyi", "SOC Prime"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "02c39d30-02b5-45d2-b435-8aebfe5a8629", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "A Member Was Removed From a Security-Enabled Global Group", "query": "(winlog.channel:\"Security\" AND winlog.event_id:(\"633\" OR \"4729\"))", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.cisecurity.org/controls/cis-controls-list/", "https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf", "https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf", "https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4729", "https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=633"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
