{"description": "Detects potential token impersonation and theft. Example, when using \"DuplicateToken(Ex)\" and \"ImpersonateLoggedOnUser\" with the \"LOGON32_LOGON_NEW_CREDENTIALS flag\".", "author": ["Michaela Adams", "Zach Mathis"], "enabled": false, "false_positives": ["Anti-Virus"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "02f7c9c1-1ae8-4c6a-8add-04693807f92f", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Access Token Abuse", "query": "(winlog.channel:\"Security\" AND winlog.event_id:\"4624\" AND winlog.event_data.LogonType:\"9\" AND winlog.event_data.LogonProcessName:\"Advapi\" AND winlog.event_data.AuthenticationPackageName:\"Negotiate\" AND ImpersonationLevel:\"%%1833\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "Privilege Escalation", "T1134"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1134", "name": "Access Token Manipulation", "reference": "https://attack.mitre.org/techniques/T1134"}]}], "version": 1, "references": ["https://www.elastic.co/fr/blog/how-attackers-abuse-access-token-manipulation", "https://www.manageengine.com/log-management/cyber-security/access-token-manipulation.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
