{"description": "Rule to detect the Hybrid Connection Manager service running on an endpoint.", "enabled": false, "false_positives": ["Legitimate use of Hybrid Connection Manager via Azure function apps."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "14e25afc-334b-edf9-3afd-67646a28a89f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "HybridConnectionManager Service Running", "query": "(winlog.event_id:(\"40300\" OR \"40301\" OR \"40302\") AND (*HybridConnection* OR *sb\\:\\/\\/* OR *servicebus.windows.net* OR *HybridConnectionManage*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1554"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1554", "name": "Compromise Client Software Binary", "reference": "https://attack.mitre.org/techniques/T1554"}]}], "version": 1, "references": ["https://twitter.com/Cyb3rWard0g/status/1381642789369286662"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
