{"description": "Detects command execution via ScreenConnect RMM", "author": ["Ali Alwashali"], "enabled": false, "false_positives": ["Legitimate use of ScreenConnect"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "076ebe48-cc05-4d8f-9d41-89245cd93a14", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Remote Access Tool - ScreenConnect Command Execution", "query": "(winlog.channel:Application AND Provider_Name:ScreenConnect AND winlog.event_id:200 AND Data:/.*[Ee][Xx][Ee][Cc][Uu][Tt][Ee][Dd]\\ [Cc][Oo][Mm][Mm][Aa][Nn][Dd]\\ [Oo][Ff]\\ [Ll][Ee][Nn][Gg][Tt][Hh].*/)", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling", "https://github.com/SigmaHQ/sigma/pull/4467"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
