{"description":"Detects the presence of default Cobalt Strike certificate in the HTTPS traffic Author: Bhabesh Raj. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["none"],"filters":[],"from":"now-360s","immutable":false,"index":["*ecs-*"],"interval":"5m","rule_id":"a39f8e7a-d378-60ab-9005-6ee3182ac3b8","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Default Cobalt Strike Certificate","query":"(event.dataset:\"x509\" AND x509.certificate.serial.text:\"8BB00EE\")","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
