{"description": "detects execution of psexec or paexec with renamed service name, this rule helps to filter out the noise if psexec is used for legit purposes or if attacker uses a different psexec client other than sysinternal one", "author": ["Samir Bousseaden", "@neu5ron", "Tim Shelton"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "f1b3a22a-45e6-4004-afb5-4291f9c21166", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PsExec Execution - Zeek", "query": "(event.dataset:\"smb_files\" AND (file.path.text:*\\\\* AND file.path.text:*\\\\IPC$* AND file.name.text:(*\\-stdin OR *\\-stdout OR *\\-stderr)) AND (NOT (file.name.text:PSEXESVC*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
