{"description": "Transferring files with well-known filenames (sensitive files with credential data) using network shares", "enabled": false, "false_positives": ["Transferring sensitive files for legitimate administration work by legitimate administrator"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "322cf8e8-998d-eacf-918f-7f0a64f2c9b1", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Transferring Files with Credential Data via Network Shares - Zeek", "query": "(event.dataset:\"smb_files\" AND file.name.text:(\"\\\\mimidrv\" OR \"\\\\lsass\" OR \"\\\\windows\\\\minidump\\\\\" OR \"\\\\hiberfil\" OR \"\\\\sqldmpr\" OR \"\\\\sam\" OR \"\\\\ntds.dit\" OR \"\\\\security\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1003", "T1003", "T1003"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}]}], "version": 1, "references": ["https://github.com/neo23x0/sigma/blob/373424f14574facf9e261d5c822345a282b91479/rules/windows/builtin/win_transferring_files_with_credential_data_via_network_shares.yml"], "timestamp_override": "event.ingested", "author": ["@neu5ron", "Teymur Kheirkhabarov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
