{"description":"Windows DCE-RPC functions which indicate a persistence techniques on the remote system. All credit for the Zeek mapping of the suspicious endpoint/operation field goes to MITRE. Author: @neu5ron, SOC Prime. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Windows administrator tasks or troubleshooting","Windows management scripts or software"],"filters":[],"from":"now-360s","immutable":false,"index":["*ecs-*"],"interval":"5m","rule_id":"cd30fcab-b5c2-a626-4000-f2c3f87b94b7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"MITRE BZAR Indicators for Persistence","query":"(event.dataset:\"dce_rpc\" AND ((dce_rpc.endpoint.text:\"spoolss\" AND dce_rpc.operation.text:\"RpcAddMonitor\") OR (dce_rpc.endpoint.text:\"spoolss\" AND dce_rpc.operation.text:\"RpcAddPrintProcessor\") OR (dce_rpc.endpoint.text:\"IRemoteWinspool\" AND dce_rpc.operation.text:\"RpcAsyncAddMonitor\") OR (dce_rpc.endpoint.text:\"IRemoteWinspool\" AND dce_rpc.operation.text:\"RpcAsyncAddPrintProcessor\") OR (dce_rpc.endpoint.text:\"ISecLogon\" AND dce_rpc.operation.text:\"SeclCreateProcessWithLogonW\") OR (dce_rpc.endpoint.text:\"ISecLogon\" AND dce_rpc.operation.text:\"SeclCreateProcessWithLogonExW\")))","meta":{"from":"1m"},"severity":"medium","tags":["T1547"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
