{"description": "Detects executable access via webdav6. Can be seen in APT 29 such as from the emulated APT 29 hackathon https://github.com/OTRF/detection-hackathon-apt29/", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "5578794b-70a5-63e0-1f7d-186d1a1435b5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Executable from Webdav", "query": "(event.dataset:\"http\" AND (user_agent.original:*WebDAV* OR url.original:*webdav*) AND (http.resp_mime_types:*dosexec* OR url.original:*.exe))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["http://carnal0wnage.attackresearch.com/2012/06/webdav-server-to-download-custom.html", "https://github.com/OTRF/detection-hackathon-apt29"], "timestamp_override": "event.ingested", "author": ["SOC Prime", "Adam Swan"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
