{"description": "detects execution of psexec or paexec with renamed service name, this rule helps to filter out the noise if psexec is used for legit purposes or if attacker uses a different psexec client other than sysinternal one", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "f1b3a22a-45e6-4004-afb5-4291f9c21166", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious PsExec Execution - Zeek", "query": "(event.dataset:\"smb_files\" AND (file.path:*\\\\\\* AND file.path:*\\\\IPC$* AND file.name:(*\\-stdin OR *\\-stdout OR *\\-stderr)) AND (NOT (file.name:*\\\\\\* AND file.name:*\\\\IPC$* AND file.path:PSEXESVC*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://github.com/neo23x0/sigma/blob/d42e87edd741dd646db946f30964f331f92f50e6/rules/windows/builtin/win_susp_psexec.yml"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden", "@neu5ron"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
