{"description": "Detects connections from routable IPs to an RDP listener - which is indicative of a publicly-accessible RDP service.", "enabled": false, "false_positives": ["Although it is recommended to NOT have RDP exposed to the internet, verify that this is a) allowed b) the server has not already been compromised via some brute force or remote exploit since it has been exposed to the internet. Work to secure the server if you are unable to remove it from being exposed to the internet."], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "511340fd-6f52-4785-4df8-5defd2296ffe", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Publicly Accessible RDP Service", "query": "(event.dataset:\"rdp\" AND (NOT (source.ip:(192.168.* OR 10.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1021"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1021/001/"], "timestamp_override": "event.ingested", "author": ["Josh Brower @DefensiveDepth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
