{"description": "Detects kerberos TGS request using RC4 encryption which may be indicative of kerberoasting", "enabled": false, "false_positives": ["normal enterprise SPN requests activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "503fe26e-b5f2-4944-a126-eab405cc06e5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Kerberos Network Traffic RC4 Ticket Encryption", "query": "(event.dataset:\"kerberos\" AND (kerberos.request_type.text:\"TGS\" AND kerberos.cipher.text:\"rc4\\-hmac\") AND (NOT (kerberos.service:$*)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Credential Access", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}], "version": 1, "references": ["https://adsecurity.org/?p=3458"], "timestamp_override": "event.ingested", "author": ["sigma"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
