{"description": "Detects known sensitive file extensions via Zeek", "enabled": false, "false_positives": ["Help Desk operator doing backup or re-imaging end user machine or pentest or backup software", "Users working with these data types or exchanging message files"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "286b47ed-f6fe-40b3-b3a8-35129acd43bc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Access to Sensitive File Extensions - Zeek", "query": "(event.dataset:\"smb_files\" AND file.name:(*.pst OR *.ost OR *.msg OR *.nst OR *.oab OR *.edb OR *.nsf OR *.bak OR *.dmp OR *.kirbi OR *\\\\groups.xml OR *.rdp))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/neo23x0/sigma/blob/d42e87edd741dd646db946f30964f331f92f50e6/rules/windows/builtin/win_susp_raccess_sensitive_fext.yml"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden", "@neu5ron"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
