{"description": "Detects the presence of default Cobalt Strike certificate in the HTTPS traffic", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "a39f8e7a-d378-60ab-9005-6ee3182ac3b8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Default Cobalt Strike Certificate", "query": "(event.dataset:\"x509\" AND x509.certificate.serial.text:\"8BB00EE\")", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://sergiusechel.medium.com/improving-the-network-based-detection-of-cobalt-strike-c2-servers-in-the-wild-while-reducing-the-6964205f6468"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
