{"description":"Windows DCE-RPC functions which indicate an execution techniques on the remote system. All credit for the Zeek mapping of the suspicious endpoint/operation field goes to MITRE Author: @neu5ron, SOC Prime. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Windows administrator tasks or troubleshooting","Windows management scripts or software"],"filters":[],"from":"now-360s","immutable":false,"index":["*ecs-*"],"interval":"5m","rule_id":"f5bfe579-f21f-f096-d3c6-1101aa4a6c22","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"MITRE BZAR Indicators for Execution","query":"(event.dataset:\"dce_rpc\" AND ((dce_rpc.endpoint.text:\"JobAdd\" AND dce_rpc.operation.text:\"atsvc\") OR (dce_rpc.endpoint.text:\"ITaskSchedulerService\" AND dce_rpc.operation.text:\"SchRpcEnableTask\") OR (dce_rpc.endpoint.text:\"ITaskSchedulerService\" AND dce_rpc.operation.text:\"SchRpcRegisterTask\") OR (dce_rpc.endpoint.text:\"ITaskSchedulerService\" AND dce_rpc.operation.text:\"SchRpcRun\") OR (dce_rpc.endpoint.text:\"IWbemServices\" AND dce_rpc.operation.text:\"ExecMethod\") OR (dce_rpc.endpoint.text:\"IWbemServices\" AND dce_rpc.operation.text:\"ExecMethodAsync\") OR (dce_rpc.endpoint.text:\"svcctl\" AND dce_rpc.operation.text:\"CreateServiceA\") OR (dce_rpc.endpoint.text:\"svcctl\" AND dce_rpc.operation.text:\"CreateServiceW\") OR (dce_rpc.endpoint.text:\"svcctl\" AND dce_rpc.operation.text:\"StartServiceA\") OR (dce_rpc.endpoint.text:\"svcctl\" AND dce_rpc.operation.text:\"StartServiceW\")))","meta":{"from":"1m"},"severity":"medium","tags":["T1047","T1053","T1569"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1047","name":"Windows Management Instrumentation","reference":"https://attack.mitre.org/techniques/T1047"},{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053"},{"id":"T1569","name":"System Services","reference":"https://attack.mitre.org/techniques/T1569"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
