{"description": "Detects the remote installation of a print driver which is possible indication of the exploitation of PrintNightmare (CVE-2021-1675).\nThe occurrence of print drivers being installed remotely via RPC functions should be rare, as print drivers are normally installed locally and or through group policy.\n", "enabled": false, "false_positives": ["Legitimate remote alteration of a printer driver."], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "ee84058c-c02a-18fe-4c46-0961466f8f35", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Possible PrintNightmare Print Driver Install", "query": "(event.dataset:\"dce_rpc\" AND dce_rpc.operation.text:(\"RpcAsyncInstallPrinterDriverFromPackage\" OR \"RpcAsyncAddPrintProcessor\" OR \"RpcAddPrintProcessor\" OR \"RpcAddPrinterDriverEx\" OR \"RpcAddPrinterDriver\" OR \"RpcAsyncAddPrinterDriver\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-par/93d1915d-4d9f-4ceb-90a7-e8f2a59adc29", "https://github.com/zeek/zeek/blob/691b099de13649d6576c7b9d637f8213ff818832/scripts/base/protocols/dce-rpc/consts.zeek", "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527", "https://github.com/corelight/CVE-2021-1675", "https://old.zeek.org/zeekweek2019/slides/bzar.pdf", "https://www.crowdstrike.com/blog/cve-2021-1678-printer-spooler-relay-security-advisory/"], "timestamp_override": "event.ingested", "author": ["@neu5ron (Nate Guagenti)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
