{"description":"Detects remote task creation via at.exe or API interacting with ATSVC namedpipe Author: Samir Bousseaden, @neu5rn. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["*ecs-*"],"interval":"5m","rule_id":"92069cb2-3440-ab68-4eef-167397169eac","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Remote Task Creation via ATSVC Named Pipe - Zeek","query":"(event.dataset:\"smb_files\" AND file.path:\\\\\\*\\\\IPC$ AND file.name.text:\"atsvc\")","meta":{"from":"1m"},"severity":"medium","tags":["Lateral Movement","T1053"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
