{"description":"Transferring files with well-known filenames (sensitive files with credential data) using network shares Author: @neu5ron, Teymur Kheirkhabarov, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Transferring sensitive files for legitimate administration work by legitimate administrator"],"filters":[],"from":"now-360s","immutable":false,"index":["*ecs-*"],"interval":"5m","rule_id":"2e69f167-47b5-4ae7-a390-47764529eff5","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Transferring Files with Credential Data via Network Shares - Zeek","query":"(event.dataset:\"smb_files\" AND file.name.text:(\"\\\\mimidrv\" OR \"\\\\lsass\" OR \"\\\\windows\\\\minidump\\\\\" OR \"\\\\hiberfil\" OR \"\\\\sqldmpr\" OR \"\\\\sam\" OR \"\\\\ntds.dit\" OR \"\\\\security\"))","meta":{"from":"1m"},"severity":"medium","tags":["Credential Access","T1003","T1003","T1003"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0006","reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"},{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
