{"description": "The DNS Z flag is bit within the DNS protocol header that is, per the IETF design, meant to be used reserved (unused). Although recently it has been used in DNSSec, the value being set to anything other than 0 should be rare. Otherwise if it is set to non 0 and DNSSec is being used, then excluding the legitimate domains is low effort and high reward. Determine if multiple of these files were accessed in a short period of time to further enhance the possibility of seeing if this was a one off or the possibility of larger sensitive file gathering. This Sigma query is designed to accompany the Corelight Threat Hunting Guide, which can be found here: https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs", "enabled": false, "false_positives": ["Internal or legitimate external domains using DNSSec. Verify if these are legitimate DNSSec domains and then exclude them.", "If you work in a Public Sector then it may be good to exclude things like endswith \".edu\", \".gov\" and or \".mil\""], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "66740a87-a46c-379e-9fdd-371f4833360c", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious DNS Z Flag Bit Set", "query": "(event.dataset:\"dns\" AND ((NOT (dns.Z.text:\"0\")) AND dns.question.name:*.*) AND (NOT ((dns.question.name:(*.arpa OR *.local OR *.ultradns.net OR *.twtrdns.net OR *.azuredns\\-prd.info OR *.azure\\-dns.com OR *.azuredns\\-ff.info OR *.azuredns\\-ff.org OR *.azuregov\\-dns.org) OR dns.question.type.text:(\"NS\" OR \"ns\" OR \"MX\" OR \"mx\") OR dns.answers.name:*\\\\x00 OR destination.port:(\"137\" OR \"138\" OR \"139\")))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1095", "T1571"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/neu5ron/status/1346245602502443009", "https://tdm.socprime.com/tdm/info/eLbyj4JjI15v#sigma", "https://tools.ietf.org/html/rfc2929#section-2.1", "https://www.netresec.com/?page=Blog&month=2021-01&post=Finding-Targeted-SUNBURST-Victims-with-pDNS"], "timestamp_override": "event.ingested", "author": ["@neu5ron", "SOC Prime Team", "Corelight"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
