{"description":"This detection excludes known namped pipes accessible remotely and notify on newly observed ones, may help to detect lateral movement and remote exec using named pipes Author: Samir Bousseaden, @neu5ron. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["update the excluded named pipe to filter out any newly observed legit named pipe"],"filters":[],"from":"now-360s","immutable":false,"index":["*ecs-*"],"interval":"5m","rule_id":"025023ce-3ec9-05e6-b9a7-3a08534c162f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"First Time Seen Remote Named Pipe - Zeek","query":"(event.dataset:\"smb_files\" AND file.path:\\\\\\*\\\\IPC$ AND (NOT (file.path:\\\\\\*\\\\IPC$ AND file.name.text:(\"atsvc\" OR \"samr\" OR \"lsarpc\" OR \"winreg\" OR \"netlogon\" OR \"srvsvc\" OR \"protected_storage\" OR \"wkssvc\" OR \"browser\" OR \"netdfs\" OR \"svcctl\" OR \"spoolss\" OR \"ntsvcs\" OR \"LSM_API_service\" OR \"HydraLsPipe\" OR \"TermSrv_API_service\" OR \"MsFteWds\"))))","meta":{"from":"1m"},"severity":"high","tags":["Lateral Movement","T1021"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
