{"description": "Identifies IPs performing DNS lookups associated with common Tor proxies.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "a8322756-015c-42e7-afb1-436e85ed3ff5", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "DNS TOR Proxies", "query": "(event.dataset:\"dns\" AND dns.question.name.text:(\"tor2web.org\" OR \"tor2web.com\" OR \"torlink.co\" OR \"onion.to\" OR \"onion.ink\" OR \"onion.cab\" OR \"onion.nu\" OR \"onion.link\" OR \"onion.it\" OR \"onion.city\" OR \"onion.direct\" OR \"onion.top\" OR \"onion.casa\" OR \"onion.plus\" OR \"onion.rip\" OR \"onion.dog\" OR \"tor2web.fi\" OR \"tor2web.blutmagie.de\" OR \"onion.sh\" OR \"onion.lu\" OR \"onion.pet\" OR \"t2w.pw\" OR \"tor2web.ae.org\" OR \"tor2web.io\" OR \"tor2web.xyz\" OR \"onion.lt\" OR \"s1.tor\\-gateways.de\" OR \"s2.tor\\-gateways.de\" OR \"s3.tor\\-gateways.de\" OR \"s4.tor\\-gateways.de\" OR \"s5.tor\\-gateways.de\" OR \"hiddenservice.net\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1048"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDNS_TorProxies.yaml"], "timestamp_override": "event.ingested", "author": ["Saw Winn Naung ", "Azure-Sentinel"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
