{"description": "Identifies clients that may be performing DNS lookups associated with common currency mining pools.", "enabled": false, "false_positives": ["A DNS lookup does not necessarily  mean a successful attempt, verify a) if there was a response using the zeek answers field, if there was then verify the connections (conn.log) to those IPs. b) verify if HTTP, SSL, or TLS activity to the domain that was queried. http.log field is 'host' and ssl/tls is 'server_name'."], "filters": [], "from": "now-360s", "immutable": false, "index": ["*ecs-*"], "interval": "5m", "rule_id": "eb014e62-fcee-bb6d-baf0-e1d416de7e54", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "DNS Events Related To Mining Pools", "query": "(event.dataset:\"dns\" AND dns.question.name:(*monerohash.com OR *do\\-dear.com OR *xmrminerpro.com OR *secumine.net OR *xmrpool.com OR *minexmr.org OR *hashanywhere.com OR *xmrget.com OR *mininglottery.eu OR *minergate.com OR *moriaxmr.com OR *multipooler.com OR *moneropools.com OR *xmrpool.eu OR *coolmining.club OR *supportxmr.com OR *minexmr.com OR *hashvault.pro OR *xmrpool.net OR *crypto\\-pool.fr OR *xmr.pt OR *miner.rocks OR *walpool.com OR *herominers.com OR *gntl.co.uk OR *semipool.com OR *coinfoundry.org OR *cryptoknight.cc OR *fairhash.org OR *baikalmine.com OR *tubepool.xyz OR *fairpool.xyz OR *asiapool.io OR *coinpoolit.webhop.me OR *nanopool.org OR *moneropool.com OR *miner.center OR *prohash.net OR *poolto.be OR *cryptoescrow.eu OR *monerominers.net OR *cryptonotepool.org OR *extrmepool.org OR *webcoin.me OR *kippo.eu OR *hashinvest.ws OR *monero.farm OR *linux\\-repository\\-updates.com OR *1gh.com OR *dwarfpool.com OR *hash\\-to\\-coins.com OR *pool\\-proxy.com OR *hashfor.cash OR *fairpool.cloud OR *litecoinpool.org OR *mineshaft.ml OR *abcxyz.stream OR *moneropool.ru OR *cryptonotepool.org.uk OR *extremepool.org OR *extremehash.com OR *hashinvest.net OR *unipool.pro OR *crypto\\-pools.org OR *monero.net OR *backup\\-pool.com OR *mooo.com OR *freeyy.me OR *cryptonight.net OR *shscrypto.net) AND (NOT ((dns.answers.name.text:(\"127.0.0.1\" OR \"0.0.0.0\")) OR (dns.rejected.text:\"true\"))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1496", "T1569"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/Azure/Azure-Sentinel/blob/fa0411f9424b6c47b4d5a20165e4f1b168c1f103/Detections/ASimDNS/imDNS_Miners.yaml"], "timestamp_override": "event.ingested", "author": ["Saw Winn Naung", "Azure-Sentinel", "@neu5ron"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
