{"description": "Detects BITS transfer job downloading files from a file sharing domain.", "author": ["Florian Roth (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d635249d-86b5-4dad-a8c7-d7272b788586", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "BITS Transfer Job Download From File Sharing Domains", "query": "(winlog.channel:/[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\-[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\-[Bb][Ii][Tt][Ss]\\-[Cc][Ll][Ii][Ee][Nn][Tt]\\/[Oo][Pp][Ee][Rr][Aa][Tt][Ii][Oo][Nn][Aa][Ll]/ AND winlog.event_id:16403 AND RemoteName:(/.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm].*/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\/.*/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt].*/ OR /.*[Dd][Ll]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm].*/ OR /.*[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo].*/ OR /.*[Gg][Oo][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/ OR /.*[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz].*/ OR /.*[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Pp][Ll].*/ OR /.*[Pp][Aa][Ss][Tt][Ee][Tt][Ee][Xx][Tt]\\.[Nn][Ee][Tt].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Cc][Oo][Mm].*/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Nn][Ee][Tt].*/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn].*/ OR /.*[Ss][Ee][Nn][Dd][Ss][Pp][Aa][Cc][Ee]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Tt][Oo][Rr][Jj][Ss][Hh][Aa][Rr][Ee]\\.[Ii][Oo].*/ OR /.*[Tt][Ee][Mm][Pp]\\.[Ss][Hh].*/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh].*/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo].*/))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md", "https://twitter.com/malmoeb/status/1535142803075960832", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
