{"description": "Detects a suspicious download using the BITS client from a FQDN that is unusual. Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.", "enabled": false, "false_positives": ["Other legitimate domains used by software updaters"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6d44fb93-e7d2-475c-9d3d-54c9c1e33427", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Download with BITS from Suspicious TLD", "query": "(winlog.event_id:\"16403\" AND (NOT (RemoteName:(*.com* OR *.azureedge.net* OR *.sfx.ms* OR *download.mozilla.org*))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md", "https://twitter.com/malmoeb/status/1535142803075960832"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
