{"description": "Detects a suspicious download using the BITS client form a FQDN that is unusual. Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.", "enabled": false, "false_positives": ["Other legitimate domains used by software updaters"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4b13fb6a-cedc-6f7b-6c36-ac22818d0841", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Download with BITS from Suspicious TLD", "query": "(winlog.event_id:\"16403\" AND (NOT (RemoteName:(*.com* OR *.azureedge.net* OR *.sfx.ms* OR *download.mozilla.org*))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md", "https://twitter.com/malmoeb/status/1535142803075960832"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
