{"description": "Detects a BITS transfer job downloading file(s) from a direct IP address.", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "90f138c1-f578-4ac3-8c49-eecfd847c8b7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "BITS Transfer Job Download From Direct IP", "query": "((winlog.event_id:\"16403\" AND RemoteName:(*http\\:\\/\\/1* OR *http\\:\\/\\/2* OR *http\\:\\/\\/3* OR *http\\:\\/\\/4* OR *http\\:\\/\\/5* OR *http\\:\\/\\/6* OR *http\\:\\/\\/7* OR *http\\:\\/\\/8* OR *http\\:\\/\\/9* OR *https\\:\\/\\/1* OR *https\\:\\/\\/2* OR *https\\:\\/\\/3* OR *https\\:\\/\\/4* OR *https\\:\\/\\/5* OR *https\\:\\/\\/6* OR *https\\:\\/\\/7* OR *https\\:\\/\\/8* OR *https\\:\\/\\/9*)) AND (NOT ((RemoteName:(*\\:\\/\\/10.* OR *\\:\\/\\/192.168.* OR *\\:\\/\\/172.16.* OR *\\:\\/\\/172.17.* OR *\\:\\/\\/172.18.* OR *\\:\\/\\/172.19.* OR *\\:\\/\\/172.20.* OR *\\:\\/\\/172.21.* OR *\\:\\/\\/172.22.* OR *\\:\\/\\/172.23.* OR *\\:\\/\\/172.24.* OR *\\:\\/\\/172.25.* OR *\\:\\/\\/172.26.* OR *\\:\\/\\/172.27.* OR *\\:\\/\\/172.28.* OR *\\:\\/\\/172.29.* OR *\\:\\/\\/172.30.* OR *\\:\\/\\/172.31.* OR *\\:\\/\\/127.* OR *\\:\\/\\/169.254.*)) OR (RemoteName:(*https\\:\\/\\/7\\-* OR *http\\:\\/\\/7\\-*)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1197"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1197", "name": "BITS Jobs", "reference": "https://attack.mitre.org/techniques/T1197"}]}], "version": 1, "references": ["https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin", "https://isc.sans.edu/diary/22264", "https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/", "https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
