{"description": "Detects suspicious command lines that look as if they would create symbolic links to /etc/passwd", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "3334958f-ab07-a9e9-6b79-ab9bb4abe78f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Symlink Etc Passwd", "query": "(*ln\\ \\-s\\ \\-f\\ \\/etc\\/passwd* OR *ln\\ \\-s\\ \\/etc\\/passwd*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://www.qualys.com/2021/05/04/21nails/21nails.txt"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
