{"description": "Detects suspicious command with /dev/tcp", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "15f6095d-d912-da37-073a-03fe89479e61", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Use of /dev/tcp", "query": "(*cat\\ <\\/dev\\/tcp\\/* OR *exec\\ 3<>\\/dev\\/tcp\\/* OR *echo\\ >\\/dev\\/tcp\\/* OR *bash\\ \\-i\\ >&\\ \\/dev\\/tcp\\/* OR *sh\\ \\-i\\ >&\\ \\/dev\\/udp\\/* OR *0<&196;exec\\ 196<>\\/dev\\/tcp\\/* OR *exec\\ 5<>\\/dev\\/tcp\\/* OR *\\(sh\\)0>\\/dev\\/tcp\\/* OR *bash\\ \\-c\\ 'bash\\ \\-i\\ >&\\ \\/dev\\/tcp\\/* OR *echo\\ \\-e\\ '#\\!\\/bin\\/bash\\\\nbash\\ \\-i\\ >&\\ \\/dev\\/tcp\\/*)", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.andreafortuna.org/2021/03/06/some-useful-tips-about-dev-tcp/", "https://book.hacktricks.xyz/shells/shells/linux", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1046/T1046.md#atomic-test-1---port-scan"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
