{"description": "Detects the addition of a new user to a privileged group such as \"root\" or \"sudo\"", "author": ["Pawel Mazur"], "enabled": false, "false_positives": ["Administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "795813e9-d9c4-0038-4a2a-62a3c565c22f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Privileged User Has Been Created", "query": "(\"new user\" AND ((*GID=0*) OR (*UID=0*) OR (*GID=10*) OR (*GID=27*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1098", "T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}, {"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["https://digital.nhs.uk/cyber-alerts/2018/cc-2825", "https://linux.die.net/man/8/useradd", "https://github.com/redcanaryco/atomic-red-team/blob/25acadc0b43a07125a8a5b599b28bbc1a91ffb06/atomics/T1136.001/T1136.001.md#atomic-test-5---create-a-new-user-in-linux-with-root-uid-and-gid"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
