{"description": "Detects suspicious shell commands indicating the information gathering phase as preparation for the Privilege Escalation.", "enabled": false, "false_positives": ["Troubleshooting on Linux Machines"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "fc964370-e620-2dbc-abc3-b6e9dfc9c933", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Privilege Escalation Preparation", "query": "(*cat\\ \\/etc\\/issue* OR *cat\\ \\/etc\\/*\\-release* OR *cat\\ \\/proc\\/version* OR *uname\\ \\-a* OR *uname\\ \\-mrs* OR *rpm\\ \\-q\\ kernel* OR *dmesg\\ |\\ grep\\ Linux* OR *ls\\ \\/boot\\ |\\ grep\\ vmlinuz\\-* OR *cat\\ \\/etc\\/profile* OR *cat\\ \\/etc\\/bashrc* OR *cat\\ \\~\\/.bash_profile* OR *cat\\ \\~\\/.bashrc* OR *cat\\ \\~\\/.bash_logout* OR *ps\\ \\-aux\\ |\\ grep\\ root* OR *ps\\ \\-ef\\ |\\ grep\\ root* OR *crontab\\ \\-l* OR *cat\\ \\/etc\\/cron* OR *cat\\ \\/etc\\/cron.allow* OR *cat\\ \\/etc\\/cron.deny* OR *cat\\ \\/etc\\/crontab* OR *grep\\ \\-i\\ user\\ * OR *grep\\ \\-i\\ pass\\ * OR *ifconfig* OR *cat\\ \\/etc\\/network\\/interfaces* OR *cat\\ \\/etc\\/sysconfig\\/network* OR *cat\\ \\/etc\\/resolv.conf* OR *cat\\ \\/etc\\/networks* OR *iptables\\ \\-L* OR *ip6tables\\ \\-L* OR *lsof\\ \\-i* OR *netstat\\ \\-antup* OR *netstat\\ \\-antpx* OR *netstat\\ \\-tulpn* OR *arp\\ \\-e* OR *route* OR *cat\\ \\/etc\\/passwd* OR *cat\\ \\/etc\\/group* OR *cat\\ \\/etc\\/shadow* OR *find\\ \\/\\ \\-perm\\ \\-u\\=s* OR *find\\ \\/\\ \\-perm\\ \\-g\\=s* OR *find\\ \\/\\ \\-perm\\ \\-4000* OR *find\\ \\/\\ \\-perm\\ \\-2000* OR *find\\ \\/\\ \\-perm\\ \\-o\\+w*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1059"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "threshold": {"field": "host", "value": 7}, "references": ["https://blog.g0tmi1k.com/2011/08/basic-linux-privilege-escalation/", "https://patrick-bareiss.com/detect-privilege-escalation-preparation-in-linux-with-sigma/", "https://github.com/uber-common/metta/blob/master/MITRE/Privilege_Escalation/privesc_linux_filesystemweakness.yml"], "timestamp_override": "event.ingested", "author": ["Patrick Bareiss"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
