{"description": "Detects specific commands commonly used to remove or empty the syslog", "enabled": false, "false_positives": ["Log rotation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e09eb557-96d2-4de9-ba2d-30f712a5afd3", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Commands to Clear or Remove the Syslog", "query": "((*rm\\ \\/var\\/log\\/syslog* OR *rm\\ \\-r\\ \\/var\\/log\\/syslog* OR *rm\\ \\-f\\ \\/var\\/log\\/syslog* OR *rm\\ \\-rf\\ \\/var\\/log\\/syslog* OR *mv\\ \\/var\\/log\\/syslog* OR *\\ >\\/var\\/log\\/syslog* OR *\\ >\\ \\/var\\/log\\/syslog*) AND (NOT (*\\/syslog.*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1565"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1565", "name": "Data Manipulation", "reference": "https://attack.mitre.org/techniques/T1565"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/fc614fb4bda24ae8ca2c44e812d12c0fab6dd7a097472a35dd12ded053ab8474"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
