{"description":"Detects shellshock expressions in log files Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"c67e0c98-4d39-46ee-8f6b-437ebf6b950e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Shellshock Expression","query":"(*\\(\\)\\{\\:;\\};* OR *\\(\\)\\ \\{\\:;\\};* OR *\\(\\)\\ \\{\\ \\:;\\};* OR *\\(\\)\\ \\{\\ \\:;\\ \\};*)","meta":{"from":"1m"},"severity":"high","tags":["T1505"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1505","name":"Server Software Component","reference":"https://attack.mitre.org/techniques/T1505"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
