{"description":"Detects suspicious command with /dev/tcp Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"6cc5fceb-9a71-4c23-aeeb-963abe0b279c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Suspicious Use of /dev/tcp","query":"(*cat\\ <\\/dev\\/tcp\\/* OR *exec\\ 3<>\\/dev\\/tcp\\/* OR *echo\\ >\\/dev\\/tcp\\/* OR *bash\\ \\-i\\ >&\\ \\/dev\\/tcp\\/* OR *sh\\ \\-i\\ >&\\ \\/dev\\/udp\\/* OR *0<&196;exec\\ 196<>\\/dev\\/tcp\\/* OR *exec\\ 5<>\\/dev\\/tcp\\/* OR *\\(sh\\)0>\\/dev\\/tcp\\/* OR *bash\\ \\-c\\ 'bash\\ \\-i\\ >&\\ \\/dev\\/tcp\\/* OR *echo\\ \\-e\\ '#\\!\\/bin\\/bash\\\\nbash\\ \\-i\\ >&\\ \\/dev\\/tcp\\/*)","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
