{"description":"Clear command history in linux which is used for defense evasion. Author: Patrick Bareiss. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"fdc88d25-96fb-4b7c-9633-c0e417fdbd4e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Clear Command History","query":"(*rm\\ *bash_history* OR *echo\\ \\\"\\\"\\ >\\ *bash_history* OR *cat\\ \\/dev\\/null\\ >\\ *bash_history* OR *cat\\ \\/dev\\/zero\\ >\\ *bash_history* OR *ln\\ \\-sf\\ \\/dev\\/null\\ *bash_history* OR *ln\\ \\-sf\\ \\/dev\\/zero\\ *bash_history* OR *truncate\\ \\-s0\\ *bash_history* OR *export\\ HISTFILESIZE\\=0* OR *history\\ \\-c* OR *history\\ \\-w* OR *shred\\ *bash_history* OR *empty_bash_history* OR *chattr\\ \\+i\\ *bash_history*)","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1070"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
