{"description": "Detects the deletion of a prefetch file which may indicate an attempt to destroy forensic evidence", "author": ["Cedric MAURUGEON"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "0a1f9d29-6465-4776-b091-7f43b26e4c89", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Prefetch File Deleted", "query": "((file.path.text:\"C\\:\\\\Windows\\\\Prefetch\\\\*\" AND file.path.text:\"*.pf\") AND (NOT (process.executable.text:\"C:\\windows\\system32\\svchost.exe\" AND user.name:(*AUTHORI* OR *AUTORI*))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "references": ["https://tdm.socprime.com/tdm/info/"], "timestamp_override": "event.ingested"}
