{"description": "Detects the deletion of the Exchange PowerShell cmdlet History logs which may indicate an attempt to destroy forensic evidence", "author": ["Nasreddine Bencherchali"], "enabled": false, "false_positives": ["Possible FP during log rotation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "76a1408c-8b5a-c22c-3f21-de6087fa4b5a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Exchange PowerShell Cmdlet History Deleted", "query": "(file.path.text:\\\\Logging\\\\CmdletInfra\\\\LocalPowerShell\\\\Cmdlet\\\\* AND file.path.text:*_Cmdlet_*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
