{"description": "Detects the deletion of WebServer access logs which may indicate an attempt to destroy forensic evidence", "author": ["Tim Rauch"], "enabled": false, "false_positives": ["During uninstallation of the IIS service", "During log rotation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d7c711d6-4a6d-77d8-70cd-26454dca9f62", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "WebServer Access Logs Deleted", "query": "(file.path.text:C\\:\\\\inetpub\\\\logs\\\\LogFiles\\\\* AND file.path.text:*.log)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://www.elastic.co/guide/en/security/current/webserver-access-logs-deleted.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
