{"description": "Detects the deletion of files by the Sysinternals SDelete utility. It looks for the common name pattern used to rename files.", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "enabled": false, "false_positives": ["Legitime usage of SDelete"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6ddab845-b1b8-49c2-bbf7-1a11967f64bc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "File Deleted Via Sysinternals SDelete", "query": "(file.path.text:(\"*.AAA\" OR \"*.ZZZ\") AND (NOT file.path.text:\"*\\\\Wireshark\\\\radius\\\\dictionary.alcatel\\-lucent.aaa\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/9", "https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/4.B.4_83D62033-105A-4A02-8B75-DAB52D8D51EC.md"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
