{"description": "Detects a highly relevant Antivirus alert that reports a hack tool or other attack tool", "author": ["Florian Roth (Nextron Systems)", "Arnim Rupp"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "fa0c05b6-8ad3-468d-8231-c1cbccb64fba", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Antivirus Hacktool Detection", "query": "((winlog.event_data.Signature:(HTOOL* OR HKTL* OR SecurityTool* OR Adfind* OR ATK\\/* OR Exploit.Script.CVE* OR PWS.* OR PWSX*)) OR (winlog.event_data.Signature:(*Hacktool* OR *ATK\\/* OR *Potato* OR *Rozena* OR *Sbelt* OR *Seatbelt* OR *SecurityTool* OR *SharpDump* OR *Sliver* OR *Splinter* OR *Swrort* OR *Impacket* OR *Koadic* OR *Lazagne* OR *Metasploit* OR *Meterpreter* OR *MeteTool* OR *Mimikatz* OR *Mpreter* OR *Nighthawk* OR *PentestPowerShell* OR *PowerSploit* OR *PowerSSH* OR *PshlSpy* OR *PSWTool* OR *PWCrack* OR *Brutel* OR *BruteR* OR *Cobalt* OR *COBEACON* OR *Cometer* OR *DumpCreds* OR *FastReverseProxy* OR *PWDump*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1204"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204"}]}], "version": 1, "references": ["https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/", "https://www.nextron-systems.com/?s=antivirus"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
