{"description": "Indicates sign-ins from an anonymous IP address, for example, using an anonymous browser or VPN.", "author": ["Gloria Lee", "'@gleeiamglo'"], "enabled": false, "false_positives": ["We recommend investigating the sessions flagged by this detection in the context of other sign-ins"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "53acd925-2003-440d-a1f3-71a5253fe237", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Anonymous IP Address", "query": "riskEventType:anonymizedIPAddress", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1528"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1528", "name": "Steal Application Access Token", "reference": "https://attack.mitre.org/techniques/T1528"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/graph/api/resources/riskdetection?view=graph-rest-1.0", "https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#anonymous-ip-address"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
