{"description": "Detect changes of syslog daemons configuration files", "enabled": false, "false_positives": ["Legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "c830f15d-6f6e-430f-8074-6f73d6807841", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Logging Configuration Changes on Linux Host", "query": "(type:\"PATH\" AND name:(\"\\/etc\\/syslog.conf\" OR \"\\/etc\\/rsyslog.conf\" OR \"\\/etc\\/syslog\\-ng\\/syslog\\-ng.conf\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["self experience"], "timestamp_override": "event.ingested", "author": ["Mikhail Larin", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
