{"description":"Detects exploitation attempt of vulnerability described in CVE-2021-3156. | Alternative approach might be to look for flooding of auditd logs due to bruteforcing | required to trigger the heap-based buffer overflow. Author: Bhabesh Raj. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"5ee37487-4eb8-4ac2-9be1-d7d14cdc559f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":95,"name":"CVE-2021-3156 Exploitation Attempt","query":"(((type:\"EXECVE\" AND a0:\"\\/usr\\/bin\\/sudoedit\") AND (a1:\"\\-s\" OR a2:\"\\-s\" OR a3:\"\\-s\" OR a4:\"\\-s\")) AND (a1:\"\\\\\" OR a2:\"\\\\\" OR a3:\"\\\\\" OR a4:\"\\\\\"))","meta":{"from":"1m"},"severity":"critical","tags":["Privilege Escalation","T1068"],"to":"now","type":"threshold","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068"}]}],"version":1,"threshold":{"field":"host","value":51},"references":["https://tdm.socprime.com/tdm/info/0"]}
