{"description":"Detects password policy discovery commands Author: Ömer Günal, oscd.community, Pawel Mazur. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administration activities"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"ca94a6db-8106-4737-9ed2-3e3bb826af0a","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Password Policy Discovery","query":"(((type:\"PATH\" AND name:(\"\\/etc\\/pam.d\\/common\\-password\" OR \"\\/etc\\/security\\/pwquality.conf\" OR \"\\/etc\\/pam.d\\/system\\-auth\" OR \"\\/etc\\/login.defs\")) OR (type:\"EXECVE\" AND a0:\"chage\" AND a1:(\"\\-\\-list\" OR \"\\-l\"))) OR (type:\"EXECVE\" AND a0:\"passwd\" AND a1:(\"\\-S\" OR \"\\-\\-status\")))","meta":{"from":"1m"},"severity":"low","tags":["T1201"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007","name":"Discovery"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1201","name":"Password Policy Discovery","reference":"https://attack.mitre.org/techniques/T1201"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
