{"description": "Adversaries may shutdown/reboot systems to interrupt access to, or aid in the destruction of, those systems.", "enabled": false, "false_positives": ["Legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5f65b700-fd8b-9ba4-b0fb-91041cf44fe8", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "System Shutdown/Reboot", "query": "(type:\"EXECVE\" AND ((*shutdown* OR *reboot* OR *halt* OR *poweroff*) OR ((*init* OR *telinit*) AND (*0* OR *6*))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1529"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1529", "name": "System Shutdown/Reboot", "reference": "https://attack.mitre.org/techniques/T1529"}]}], "version": 1, "references": ["hhttps://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1529/T1529.md"], "timestamp_override": "event.ingested", "author": ["Igor Fits", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
