{"description": "Detects command line parameter very often used with coin miners", "enabled": false, "false_positives": ["Other tools that use a --cpu-priority flag"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Possible Coin Miner CPU Priority Param", "query": "(a1:\\-\\-cpu\\-priority* OR a2:\\-\\-cpu\\-priority* OR a3:\\-\\-cpu\\-priority* OR a4:\\-\\-cpu\\-priority* OR a5:\\-\\-cpu\\-priority* OR a6:\\-\\-cpu\\-priority* OR a7:\\-\\-cpu\\-priority*)", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["https://xmrig.com/docs/miner/command-line-options"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
