{"description": "Detects change of user environment. Adversaries can insert code into these files to gain persistence each time a user logs in or opens a new shell.", "enabled": false, "false_positives": ["Admin or User activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e74e15cc-c4b6-4c80-b7eb-dfe49feb7fe9", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Edit of .bash_profile and .bashrc", "query": "(type:\"PATH\" AND name:(\"\\/root\\/.bashrc\" OR \"\\/root\\/.bash_profile\" OR \"\\/root\\/.profile\" OR \\/home\\/*\\/.bashrc OR \\/home\\/*\\/.bash_profile OR \\/home\\/*\\/.profile OR \"\\/etc\\/profile\" OR \"\\/etc\\/shells\" OR \"\\/etc\\/bashrc\" OR \"\\/etc\\/csh.cshrc\" OR \"\\/etc\\/csh.login\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["MITRE Attack technique T1156; .bash_profile and .bashrc. "], "timestamp_override": "event.ingested", "author": ["Peter Matkovski"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
