{"description": "Detects attempts to collect image data stored in the clipboard from users with the usage of xclip tool. Xclip has to be installed. Highly recommended using rule on servers, due to high usage of clipboard utilities on user workstations.", "enabled": false, "false_positives": ["Legitimate usage of xclip tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d793f010-0310-91c9-696c-bae398c54da1", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Clipboard Collection of Image Data with Xclip Tool", "query": "(type:\"EXECVE\" AND a0:\"xclip\" AND a1:(\"\\-selection\" OR \"\\-sel\") AND a2:(\"clipboard\" OR \"clip\") AND a3:\"\\-t\" AND a4:image\\/* AND a5:\"\\-o\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1115"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1115", "name": "Clipboard Data", "reference": "https://attack.mitre.org/techniques/T1115"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1115/", "https://linux.die.net/man/1/xclip"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
