{"description": "Detects exploitation attempt of vulnerability described in CVE-2021-4034.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "40a016ab-4f48-4eee-adde-bbf612695c53", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CVE-2021-4034 Exploitation Attempt", "query": "(type:\"PROCTITLE\" AND proctitle:\"\\(null\\)\" AND type:\"SYSCALL\" AND comm:\"pkexec\" AND exe:\"\\/usr\\/bin\\/pkexec\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "references": ["https://github.com/berdav/CVE-2021-4034", "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4034", "https://access.redhat.com/security/cve/CVE-2021-4034"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
