{"description":"Adversaries may shutdown/reboot systems to interrupt access to, or aid in the destruction of, those systems. Author: Igor Fits, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate administrative activity"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"4cb57c2f-1f29-41f8-893d-8bed8e1c1d2f","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"System Shutdown/Reboot","query":"(type:\"EXECVE\" AND ((*shutdown* OR *reboot* OR *halt* OR *poweroff*) OR ((*init* OR *telinit*) AND (*0* OR *6*))))","meta":{"from":"1m"},"severity":"low","tags":["T1529"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1529","name":"System Shutdown/Reboot","reference":"https://attack.mitre.org/techniques/T1529"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
