{"description": "Detects extraction of files with usage of steghide binary, the adversaries may use this technique to prevent the detection of hidden information.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a5d44965-f0d3-3b95-39ee-cca7d7823fbf", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Steganography Extract Files with Steghide", "query": "(type:\"EXECVE\" AND a0:\"steghide\" AND a1:\"extract\" AND a2:\"\\-sf\" AND a3:(*.jpg OR *.png))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1027"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1027", "name": "Obfuscated Files or Information", "reference": "https://attack.mitre.org/techniques/T1027"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1027/003/", "https://vitux.com/how-to-hide-confidential-files-in-images-on-debian-using-steganography/"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
