{"description":"Detects attempts to discover the files with setuid/setgid capabilitiy on them. That would allow adversary to escalate their privileges. Author: Pawel Mazur. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["None"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"fe10751f-1995-40a5-aaa2-c97ccb4123fe","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Linux Capabilities Discovery","query":"(type:\"EXECVE\" AND a0:\"getcap\" AND a1:\"\\-r\" AND a2:\"\\/\")","meta":{"from":"1m"},"severity":"low","tags":["Privilege Escalation","T1123","T1548"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]},{"tactic":{"id":"TA0009","reference":"https://attack.mitre.org/tactics/TA0009","name":"Collection"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1123","name":"Audio Capture","reference":"https://attack.mitre.org/techniques/T1123"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
