{"description": "Detects adversary creating screen capture of a desktop with Import Tool. Highly recommended using rule on servers, due to high usage of screenshot utilities on user workstations. ImageMagick must be installed.", "enabled": false, "false_positives": ["Legitimate use of screenshot utility"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "dbe4b9c5-c254-4258-9688-d6af0b7967fd", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Screen Capture with Import Tool", "query": "((type:\"EXECVE\" AND a0:\"import\") AND ((a1:\"\\-window\" AND a2:\"root\" AND a3:(*.png OR *.jpg OR *.jpeg)) OR a1:(*.png OR *.jpg OR *.jpeg)))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1113"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1113", "name": "Screen Capture", "reference": "https://attack.mitre.org/techniques/T1113"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1113/T1113.md", "https://attack.mitre.org/techniques/T1113/", "https://linux.die.net/man/1/import", "https://imagemagick.org/"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
