{"description": "Detects adversary creating screen capture of a full with xwd. Highly recommended using rule on servers, due high usage of screenshot utilities on user workstations", "enabled": false, "false_positives": ["Legitimate use of screenshot utility"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e2f17c5d-b02a-442b-9052-6eb89c9fec9c", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Screen Capture with Xwd", "query": "((type:\"EXECVE\" AND a0:\"xwd\") AND ((a1:\"\\-root\" AND a2:\"\\-out\" AND a3:*.xwd) OR (a1:\"\\-out\" AND a2:*.xwd)))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1113"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1113", "name": "Screen Capture", "reference": "https://attack.mitre.org/techniques/T1113"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1113/T1113.md", "https://attack.mitre.org/techniques/T1113/", "https://linux.die.net/man/1/xwd"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
