{"description": "Detect unix shell configuration modification. Adversaries may establish persistence through executing malicious commands triggered when a new shell is opened.", "author": ["Peter Matkovski", "IAI"], "enabled": false, "false_positives": ["Admin or User activity are expected to generate some false positives"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a94cdd87-6c54-4678-a6cc-2814ffe5a13d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Unix Shell Configuration Modification", "query": "(type:\"PATH\" AND name:(\"/etc/shells\" OR \"/etc/profile\" OR /etc/profile.d/* OR \"/etc/bash.bashrc\" OR \"/etc/bashrc\" OR \"/etc/zsh/zprofile\" OR \"/etc/zsh/zshrc\" OR \"/etc/zsh/zlogin\" OR \"/etc/zsh/zlogout\" OR \"/etc/csh.cshrc\" OR \"/etc/csh.login\" OR \"/root/.bashrc\" OR \"/root/.bash_profile\" OR \"/root/.profile\" OR \"/root/.zshrc\" OR \"/root/.zprofile\" OR /home/*/.bashrc OR /home/*/.zshrc OR /home/*/.bash_profile OR /home/*/.zprofile OR /home/*/.profile OR /home/*/.bash_login OR /home/*/.bash_logout OR /home/*/.zlogin OR /home/*/.zlogout))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://objective-see.org/blog/blog_0x68.html", "https://www.glitch-cat.com/p/green-lambert-and-attack", "https://www.anomali.com/blog/pulling-linux-rabbit-rabbot-malware-out-of-a-hat"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
