{"description": "Detects exploitation attempt of vulnerability described in CVE-2021-3156. | Alternative approach might be to look for flooding of auditd logs due to bruteforcing | required to trigger the heap-based buffer overflow.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "45ee2fef-4720-98d6-0cac-238568acd025", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CVE-2021-3156 Exploitation Attempt", "query": "(type:\"SYSCALL\" AND exe:\"\\/usr\\/bin\\/sudoedit\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1068"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}], "version": 1, "threshold": {"field": "host", "value": 51}, "references": ["https://blog.qualys.com/vulnerabilities-research/2021/01/26/cve-2021-3156-heap-based-buffer-overflow-in-sudo-baron-samedit"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
