{"description":"Rule to detect the use of the SCX RunAsProvider Invoke_ExecuteShellCommand to execute any UNIX/Linux command using the /bin/sh shell. SCXcore, started as the Microsoft Operations Manager UNIX/Linux Agent, is now used in a host of products including Microsoft Operations Manager. Microsoft Azure, and Microsoft Operations Management Suite. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of SCX RunAsProvider Invoke_ExecuteShellCommand."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"1883a318-2ada-dcb2-e49b-d280600e83f1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"OMIGOD SCX RunAsProvider ExecuteShellCommand","query":"(type:\"SYSCALL\" AND syscall:\"execve\" AND uid:\"0\" AND cwd:\"\\/var\\/opt\\/microsoft\\/scx\\/tmp\" AND comm:\"sh\")","meta":{"from":"1m"},"severity":"high","tags":["Initial Access","Privilege Escalation","T1068","T1190","T1203"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0001","reference":"https://attack.mitre.org/tactics/TA0001","name":"Initial Access"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190"}]},{"tactic":{"id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002","name":"Execution"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1203","name":"Exploitation for Client Execution","reference":"https://attack.mitre.org/techniques/T1203"}]},{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
