{"description": "Detects attempts to post the file with the usage of wget utility. The adversary can bypass the permission restriction with the misconfigured sudo permission for wget utility which could allow them to read files like /etc/shadow.", "enabled": false, "false_positives": ["Legitimate usage of wget utility to post a file"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "f39521cf-e4ec-99de-42e7-c241fd9f6319", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Data Exfiltration with Wget", "query": "(type:\"EXECVE\" AND a0:\"wget\" AND a1:\\-\\-post\\-file\\=*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1048"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1048", "name": "Exfiltration Over Alternative Protocol", "reference": "https://attack.mitre.org/techniques/T1048"}]}], "version": 1, "references": ["https://attack.mitre.org/tactics/TA0010/", "https://linux.die.net/man/1/wget", "https://gtfobins.github.io/gtfobins/wget/"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
