{"description": "Detects removing immutable file attribute.", "enabled": false, "false_positives": ["Administrator interacting with immutable files (e.g. for instance backups)."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a5b977d6-8a81-4475-91b9-49dbfcd941f7", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Remove Immutable File Attribute", "query": "(type:\"EXECVE\" AND a0:*chattr* AND a1:*\\-i*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1222"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1222", "name": "File and Directory Permissions Modification", "reference": "https://attack.mitre.org/techniques/T1222"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.002/T1222.002.md"], "timestamp_override": "event.ingested", "author": ["Jakob Weinzettl", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
