{"description": "Detects disabling of system firewalls which could be used by adversaries to bypass controls that limit usage of the network.", "enabled": false, "false_positives": ["Admin activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "53059bc0-1472-438b-956a-7508a94a91f0", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Disable System Firewall", "query": "(type:\"SERVICE_STOP\" AND unit:(\"firewalld\" OR \"iptables\" OR \"ufw\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md", "https://attack.mitre.org/techniques/T1562/004/", "https://firewalld.org/documentation/man-pages/firewall-cmd.html"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
