{"description":"Detects a reload or a start of a service. Author: Jakob Weinzettl, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Installation of legitimate service.","Legitimate reconfiguration of service."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"2625cc59-0634-40d0-821e-cb67382a3dd7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"Systemd Service Reload or Start","query":"(type:\"EXECVE\" AND a0:*systemctl* AND a1:(*daemon\\-reload* OR *start*))","meta":{"from":"1m"},"severity":"low","tags":["T1543"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
