{"description": "Detects attempts to discover the files with setuid/setgid capabilitiy on them. That would allow adversary to escalate their privileges.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "2b626610-850f-98b5-33bc-d088e69b9a17", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Linux Capabilities Discovery", "query": "(type:\"EXECVE\" AND a0:\"getcap\" AND a1:\"\\-r\" AND a2:\"\\/\")", "meta": {"from": "1m"}, "severity": "low", "tags": ["Privilege Escalation", "T1123", "T1548"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1123", "name": "Audio Capture", "reference": "https://attack.mitre.org/techniques/T1123"}]}], "version": 1, "references": ["https://man7.org/linux/man-pages/man8/getcap.8.html", "https://www.hackingarticles.in/linux-privilege-escalation-using-capabilities/", "https://mn3m.info/posts/suid-vs-capabilities/", "https://int0x33.medium.com/day-44-linux-capabilities-privilege-escalation-via-openssl-with-selinux-enabled-and-enforced-74d2bec02099"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
