{"description": "Detect attempt to enable auditing of TTY input", "author": ["Pawel Mazur"], "enabled": false, "false_positives": ["Administrative work"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "49aae26c-450e-448b-911d-b3c13d178dfc", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Linux Keylogging with Pam.d", "query": "(((type:\"PATH\" AND name:(\"/etc/pam.d/system-auth\" OR \"/etc/pam.d/password-auth\"))) OR (type:(\"TTY\" OR \"USER_TTY\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "T1003", "T1056"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1003", "name": "OS Credential Dumping", "reference": "https://attack.mitre.org/techniques/T1003"}, {"id": "T1056", "name": "Input Capture", "reference": "https://attack.mitre.org/techniques/T1056"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.001/T1056.001.md", "https://attack.mitre.org/techniques/T1003/", "https://linux.die.net/man/8/pam_tty_audit", "https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/security_guide/sec-configuring_pam_for_auditing", "https://access.redhat.com/articles/4409591#audit-record-types-2"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
