{"description":"Detects removing immutable file attribute. Author: Jakob Weinzettl, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Administrator interacting with immutable files (e.g. for instance backups)."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"a5b977d6-8a81-4475-91b9-49dbfcd941f7","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Remove Immutable File Attribute","query":"(type:\"EXECVE\" AND a0:*chattr* AND a1:*\\-i*)","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1222"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1222","name":"File and Directory Permissions Modification","reference":"https://attack.mitre.org/techniques/T1222"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
