{"description": "Detects adversary creating hidden file or directory, by detecting directories or files with . as the first character", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "d08722cd-3d09-449a-80b4-83ea2d9d4616", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Hidden Files and Directories", "query": "((type:\"EXECVE\" AND a0:(\"mkdir\" OR \"touch\" OR \"vim\" OR \"nano\" OR \"vi\")) AND (a1:*\\/.* OR a1:.* OR a2:*\\/.* OR a2:.*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Defense Evasion", "T1564"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1564", "name": "Hide Artifacts", "reference": "https://attack.mitre.org/techniques/T1564"}]}], "version": 1, "references": ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md", "https://attack.mitre.org/techniques/T1564/001/"], "timestamp_override": "event.ingested", "author": ["Pawel Mazur"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
