{"description": "Detect changes in auditd configuration files", "enabled": false, "false_positives": ["Legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "977ef627-4539-4875-adf4-ed8f780c4922", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Auditing Configuration Changes on Linux Host", "query": "(type:\"PATH\" AND name:(\\/etc\\/audit\\/* OR \"\\/etc\\/libaudit.conf\" OR \\/etc\\/audisp\\/*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://github.com/Neo23x0/auditd/blob/master/audit.rules", "self experience"], "timestamp_override": "event.ingested", "author": ["Mikhail Larin", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
