{"description": "Detects the creation of a new user account. Such accounts may be used for persistence that do not require persistent remote access tools to be deployed on the system.", "enabled": false, "false_positives": ["Admin activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "e64465a1-8fbf-1dfd-a5e5-ee97459e2d1b", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Creation Of An User Account", "query": "(type:\"SYSCALL\" AND exe:*\\/useradd)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1136"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1136", "name": "Create Account", "reference": "https://attack.mitre.org/techniques/T1136"}]}], "version": 1, "references": ["MITRE Attack technique T1136; Create Account "], "timestamp_override": "event.ingested", "author": ["Marie Euler"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
