{"description": "Detects a reload or a start of a service.", "enabled": false, "false_positives": ["Installation of legitimate service.", "Legitimate reconfiguration of service."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "f0e4320f-cc80-aafa-7016-eb1f4ea363df", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Systemd Service Reload or Start", "query": "(type:\"EXECVE\" AND a0:*systemctl* AND a1:(*daemon\\-reload* OR *start*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1543"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1543", "name": "Create or Modify System Process", "reference": "https://attack.mitre.org/techniques/T1543"}]}], "version": 1, "references": ["https://attack.mitre.org/techniques/T1543/002/", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.002/T1543.002.md"], "timestamp_override": "event.ingested", "author": ["Jakob Weinzettl", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
