{"description":"This rule detects a suspicious crash of the Microsoft Malware Protection Engine Author: Florian Roth. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["MsMpEng.exe can crash when C:\\ is full"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2e954b6f-ad17-f23a-aecc-af82d22f622d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Microsoft Malware Protection Engine Crash","query":"(winlog.channel:\"Application\" AND ((Provider_Name:\"Application\\ Error\" AND winlog.event_id:\"1000\") OR (Provider_Name:\"Windows\\ Error\\ Reporting\" AND winlog.event_id:\"1001\")) AND (*MsMpEng.exe* AND *mpengine.dll*))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1211","T1562"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1211","name":"Exploitation for Defense Evasion","reference":"https://attack.mitre.org/techniques/T1211"},{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
