{"description": "An application have been remove check if it is a critical", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "570ae5ec-33dc-427c-b815-db86228ad43e", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "An Application Is Uninstall", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MsiInstaller\" AND winlog.event_id:(\"11724\" OR \"1034\"))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1489"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1489", "name": "Service Stop", "reference": "https://attack.mitre.org/techniques/T1489"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
