{"description": "Detects when the a stored procedure is set or cleared for automatic execution in MSSQL. A stored procedure that is set to automatic execution runs every time an instance of SQL Server is started", "enabled": false, "false_positives": ["Legitimate use of the feature by administrators (rare)"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b3d57a5c-c92e-4b48-9a79-5f124b7cf964", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSSQL SPProcoption Set", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MSSQLSERVER\" AND winlog.event_id:\"33205\" AND Data:*object_name\\:sp_procoption* AND Data:*statement\\:EXEC*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/", "https://docs.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sp-procoption-transact-sql?view=sql-server-ver16"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
