{"description": "Detects restricted access to applications by the Software Restriction Policies (SRP) policy", "author": ["frack113"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b4c8da4a-1c12-46b0-8a2b-0a8521d03442", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Restricted Software Access By SRP", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"Microsoft-Windows-SoftwareRestrictionPolicies\" AND winlog.event_id:(\"865\" OR \"866\" OR \"867\" OR \"868\" OR \"882\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1072"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/windows-server/identity/software-restriction-policies/software-restriction-policies", "https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWEventsList/CSV/Windows11/22H2/W11_22H2_Pro_20220920_22621.382/Providers/Microsoft-Windows-AppXDeployment-Server.csv"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
