{"description": "This detection method points out highly relevant Antivirus events", "author": ["Florian Roth (Nextron Systems)", "Arnim Rupp"], "enabled": false, "false_positives": ["Some software piracy tools (key generators, cracks) are classified as hack tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "8ba9f2a5-a1be-00d1-a879-e89de85029d1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Relevant Anti-Virus Event", "query": "(winlog.channel:\"Application\" AND ((*Adfind*) OR (*ASP/BackDoor*) OR (*ATK/*) OR (*Backdoor.ASP*) OR (*Backdoor.Cobalt*) OR (*Backdoor.JSP*) OR (*Backdoor.PHP*) OR (*Blackworm*) OR (*Brutel*) OR (*BruteR*) OR (*Chopper*) OR (*Cobalt*) OR (*COBEACON*) OR (*Cometer*) OR (*CRYPTES*) OR (*Cryptor*) OR (*Destructor*) OR (*DumpCreds*) OR (*Exploit.Script.CVE*) OR (*Filecoder*) OR (*FastReverseProxy*) OR (*GrandCrab*) OR (*HackTool*) OR (*HKTL.*) OR (*HKTL/*) OR (*HKTL:*) OR (*HTool*) OR (*Impacket*) OR (*IISExchgSpawnCMD*) OR (*JSP/BackDoor*) OR (*Keylogger*) OR (*Koadic*) OR (*Krypt*) OR (*Lazagne*) OR (*Locker*) OR (*Metasploit*) OR (*Meterpreter*) OR (*MeteTool*) OR (*Mimikatz*) OR (*Mpreter*) OR (*Nighthawk*) OR (*Packed.Generic.347*) OR (*PentestPowerShell*) OR (*Phobos*) OR (*PHP/BackDoor*) OR (*Potato*) OR (*PowerSploit*) OR (*PowerSSH*) OR (*PshlSpy*) OR (*PSWTool*) OR (*PWCrack*) OR (*PWDump*) OR (*Ransom*) OR (*Rozena*) OR (*Ryzerlo*) OR (*Sbelt*) OR (*Seatbelt*) OR (*SecurityTool*) OR (*SharpDump*) OR (*Sliver*) OR (*Splinter*) OR (*Swrort*) OR (*Tescrypt*) OR (*TeslaCrypt*) OR (*Valyria*) OR (*Webshell*)) AND (NOT ((((*Keygen*) OR (*Crack*) OR (*anti_ransomware_service.exe*) OR (*cyber-protect-service.exe*))) OR (Level:\"4\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Resource Development", "T1588"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1588", "name": "Obtain Capabilities", "reference": "https://attack.mitre.org/techniques/T1588"}]}], "version": 1, "references": ["https://www.virustotal.com/gui/file/13828b390d5f58b002e808c2c4f02fdd920e236cc8015480fa33b6c1a9300e31", "https://www.virustotal.com/gui/file/15b57c1b68cd6ce3c161042e0f3be9f32d78151fe95461eedc59a79fc222c7ed", "https://www.virustotal.com/gui/file/5092b2672b4cb87a8dd1c2e6047b487b95995ad8ed5e9fc217f46b8bfb1b8c01"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
