{"description": "Detects successful installation of Atera Remote Monitoring & Management (RMM) agent as recently found to be used by Conti operators", "enabled": false, "false_positives": ["Legitimate Atera agent installation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "87261fb2-69d0-42fe-b9de-88c6b5f65a43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Atera Agent Installation", "query": "(winlog.channel:\"Application\" AND winlog.event_id:\"1033\" AND Provider_Name:\"MsiInstaller\" AND Message:*AteraAgent*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1219"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.advintel.io/post/secret-backdoor-behind-conti-ransomware-operation-introducing-atera-agent"], "timestamp_override": "event.ingested", "author": ["Bhabesh Raj"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
