{"description": "Detects when an attacker calls the \"ALTER SERVER AUDIT\" or \"DROP SERVER AUDIT\" transaction in order to delete or disable audit logs on the server", "enabled": false, "false_positives": ["This event should only fire when an administrator is modifying the audit policy. Which should be a rare occurence once it's set up"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "350dfb37-3706-4cdc-9e2e-5e24bc3a46df", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSSQL Disable Audit Settings", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MSSQLSERVER\" AND winlog.event_id:\"33205\" AND Data:(*statement\\:ALTER\\ SERVER\\ AUDIT* OR *statement\\:DROP\\ SERVER\\ AUDIT*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/", "https://docs.microsoft.com/en-us/sql/t-sql/statements/drop-server-audit-transact-sql?view=sql-server-ver16", "https://docs.microsoft.com/en-us/sql/t-sql/statements/alter-server-audit-transact-sql?view=sql-server-ver16"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
