{"description": "Detects when the MSSQL \"xp_cmdshell\" stored procedure setting is changed", "enabled": false, "false_positives": ["Legitimate enable/disable of the setting", "Note that since the event contain the change for both values. This means that this will trigger on both enable and disable"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5f7389cd-d52d-d28a-3ef9-19ae60101b1c", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSSQL XPCmdshell Option Change", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MSSQLSERVER\" AND winlog.event_id:\"15457\" AND Data:*xp_cmdshell*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/", "https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
