{"description": "Detects when an attacker tries to backdoor the MSSQL server by adding a backdoor account to the sysadmin fixed server role", "enabled": false, "false_positives": ["Rare legitimate administrative activity"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "08200f85-2678-463e-9c32-88dce2f073d1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSSQL Add Account To Sysadmin Role", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MSSQLSERVER\" AND winlog.event_id:\"33205\" AND Data:*object_name\\:sysadmin* AND Data:*statement\\:alter\\ server\\ role\\ \\[sysadmin\\]\\ add\\ member\\ *)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
