{"description":"This detection method points out highly relevant Antivirus events Author: Florian Roth, Arnim Rupp. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Some software piracy tools (key generators, cracks) are classified as hack tools"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"8ba9f2a5-a1be-00d1-a879-e89de85029d1","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Relevant Anti-Virus Event","query":"(winlog.channel:\"Application\" AND (*HTool\\-* OR *Hacktool* OR *ASP\\/Backdoor* OR *JSP\\/Backdoor* OR *PHP\\/Backdoor* OR *Backdoor.ASP* OR *Backdoor.JSP* OR *Backdoor.PHP* OR *Webshell* OR *Portscan* OR *Mimikatz* OR *.WinCred.* OR *PlugX* OR *Korplug* OR *Pwdump* OR *Chopper* OR *WmiExec* OR *Xscan* OR *Clearlog* OR *ASPXSpy* OR *Ransom* OR *Filecoder* OR *CobaltStrike*) AND (NOT ((*Keygen* OR *Crack*))))","meta":{"from":"1m"},"severity":"high","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
