{"description": "Detects backup catalog deletions", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "9703792d-fd9a-456d-a672-ff92efe4806a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Backup Catalog Deleted", "query": "(winlog.channel:\"Application\" AND winlog.event_id:\"524\" AND Provider_Name:\"Microsoft\\-Windows\\-Backup\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://technet.microsoft.com/en-us/library/cc742154(v=ws.11).aspx", "https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100"], "timestamp_override": "event.ingested", "author": ["Florian Roth (rule)", "Tom U. @c_APT_ure (collection)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
