{"description": "Detects events generated by Windows to indicate the exploitation of a known vulnerability (e.g. CVE-2020-0601)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "db05d79f-6d5a-411d-1194-cd6515e49995", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Audit CVE Event", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"Microsoft\\-Windows\\-Audit\\-CVE\")", "meta": {"from": "1m"}, "severity": "critical", "tags": ["Credential Access", "Defense Evasion", "Lateral Movement", "Privilege Escalation", "T1068", "T1203", "T1210", "T1211", "T1212", "T1499"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1068", "name": "Exploitation for Privilege Escalation", "reference": "https://attack.mitre.org/techniques/T1068"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1211", "name": "Exploitation for Defense Evasion", "reference": "https://attack.mitre.org/techniques/T1211"}]}, {"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1212", "name": "Exploitation for Credential Access", "reference": "https://attack.mitre.org/techniques/T1212"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1210", "name": "Exploitation of Remote Services", "reference": "https://attack.mitre.org/techniques/T1210"}]}, {"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1499", "name": "Endpoint Denial of Service", "reference": "https://attack.mitre.org/techniques/T1499"}]}], "version": 1, "references": ["https://twitter.com/mattifestation/status/1217179698008068096", "https://twitter.com/VM_vivisector/status/1217190929330655232", "https://twitter.com/davisrichardg/status/1217517547576348673", "https://twitter.com/DidierStevens/status/1217533958096924676", "https://twitter.com/FlemmingRiis/status/1217147415482060800"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
