{"description": "Detects MSI package installation from suspicious locations", "enabled": false, "false_positives": ["Some false positives may occur depending on the environnement"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a0354c27-f294-0ed1-0f5e-172f4db45250", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSI Installation From Suspicious Locations", "query": "(winlog.channel:\"Application\" AND (Provider_Name:\"MsiInstaller\" AND winlog.event_id:(\"1040\" OR \"1042\") AND Data:(*\\\\Users\\\\Public\\\\* OR *\\\\PerfLogs\\\\* OR *\\\\Desktop\\\\* OR *C\\:\\\\Windows\\\\TEMP\\\\* OR *\\\\\\\\\\*)) AND (NOT ((Data:*\\\\AppData\\\\Local\\\\Temp\\\\WinGet\\\\*) OR (Data:*C\\:\\\\Windows\\\\TEMP\\\\UpdHealthTools.msi*))))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
