{"description": "This rule detects a suspicious crash of the Microsoft Malware Protection Engine", "enabled": false, "false_positives": ["MsMpEng.exe can crash when C:\\ is full"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6c82cf5c-090d-4d57-9188-533577631108", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Malware Protection Engine Crash", "query": "(winlog.channel:\"Application\" AND ((Provider_Name:\"Application\\ Error\" AND winlog.event_id:\"1000\") OR (Provider_Name:\"Windows\\ Error\\ Reporting\" AND winlog.event_id:\"1001\")) AND (*MsMpEng.exe* AND *mpengine.dll*))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1211", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1211", "name": "Exploitation for Defense Evasion", "reference": "https://attack.mitre.org/techniques/T1211"}, {"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://bugs.chromium.org/p/project-zero/issues/detail?id=1252&desc=5", "https://technet.microsoft.com/en-us/library/security/4022344"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
