{"description": "Detects when the MSSQL \"xp_cmdshell\" stored procedure is used to execute commands", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "af79e9c4-927d-2830-9b1f-56d89e084203", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "MSSQL XPCmdshell Suspicious Execution", "query": "(winlog.channel:\"Application\" AND Provider_Name:\"MSSQLSERVER\" AND winlog.event_id:\"33205\" AND Data:*object_name\\:xp_cmdshell* AND Data:*statement\\:EXEC*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/", "https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
