{"description": "Detects the exploitation of Microsoft Exchange vulnerability as described in CVE-2020-0688", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d6266bf5-935e-4661-b477-78772735a7cb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "CVE-2020-0688 Exploitation via Eventlog", "query": "(winlog.channel:\"Application\" AND (winlog.event_id:\"4\" AND Provider_Name:\"MSExchange\\ Control\\ Panel\" AND Level:\"Error\") AND \"&__VIEWSTATE\\=\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Initial Access", "T1190"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190"}]}], "version": 1, "references": ["https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/", "https://cyberpolygon.com/materials/okhota-na-ataki-ms-exchange-chast-2-cve-2020-0688-cve-2020-16875-cve-2021-24085/"], "timestamp_override": "event.ingested", "author": ["Florian Roth", "wagga"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
