{"description":"Detects when a memory process image does not match the disk image, indicative of process hollowing. Author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Sittikorn S. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["There are no known false positives at this time"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e9318570-4c8c-5c20-c3b5-87118ba77b8c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Sysmon Process Hollowing Detection","query":"(Type:\"Image\\ is\\ replaced\" AND (NOT (process.executable:(*\\:\\\\Program\\ Files\\\\* OR *\\:\\\\Program\\ Files\\ \\(x86\\)*) AND process.executable:(*\\\\chrome.exe OR *\\\\opera.exe OR *\\\\firefox.exe OR *\\\\MicrosoftEdge.exe))))","meta":{"from":"1m"},"severity":"high","tags":["T1055"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
