{"description": "Triggers on any Sysmon \"FileBlockShredding\" event, which indicates a violation of the configured shredding policy.", "author": ["frack113"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c3e5c1b1-45e9-4632-b242-27939c170239", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Sysmon Blocked File Shredding", "query": "(winlog.channel:\"Microsoft-Windows-Sysmon/Operational\" AND winlog.event_id:\"28\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
