{"description":"Someone try to hide from Sysmon Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["legitimate administrative action"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6f77725e-d1d6-cb47-0f38-e03b48d19341","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Sysmon Configuration Error","query":"(winlog.event_data.Description:(*Failed\\ to\\ open\\ service\\ configuration\\ with\\ error* OR *Failed\\ to\\ connect\\ to\\ the\\ driver\\ to\\ update\\ configuration*) AND (NOT (winlog.event_data.Description:*Failed\\ to\\ open\\ service\\ configuration\\ with\\ error* AND winlog.event_data.Description:*Last\\ error\\:\\ The\\ media\\ is\\ write\\ protected.*)))","meta":{"from":"1m"},"severity":"high","tags":["Defense Evasion","T1564"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1564","name":"Hide Artifacts","reference":"https://attack.mitre.org/techniques/T1564"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
