{"description": "Triggers on any Sysmon file block executable event. Which should indicates a violation of the block policy set", "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "23b71bc5-953e-4971-be4c-c896cda73fc2", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Sysmon Blocked Executable", "query": "process.executable.text:*", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
