{"description":"Detects when an ElastiCache security group has been created. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["A ElastiCache security group may be created by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Security group creations from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"e6f416e5-ec52-0340-1031-f10d3af2533c","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"AWS ElastiCache Security Group Created","query":"(eventSource:\"elasticache.amazonaws.com\" AND eventName:\"CreateCacheSecurityGroup\")","meta":{"from":"1m"},"severity":"low","tags":["T1136","T1136"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"},{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
