{"description": "An attacker with the iam:UpdateLoginProfile permission on other users can change the password used to login to the AWS console on any user that already has a login profile setup.\nWith this alert, it is used to detect anyone is changing password on behalf of other users.\n", "enabled": false, "false_positives": ["Legit User Account Administration"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "055fb148-60f8-462d-ad16-26926ce050f1", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AWS User Login Profile Was Modified", "query": "((eventSource:\"iam.amazonaws.com\" AND eventName:\"UpdateLoginProfile\") AND (NOT (userIdentity.arn:*requestParameters.userName*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1098"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1098", "name": "Account Manipulation", "reference": "https://attack.mitre.org/techniques/T1098"}]}], "version": 1, "references": ["https://github.com/RhinoSecurityLabs/AWS-IAM-Privilege-Escalation"], "timestamp_override": "event.ingested", "author": ["toffeebr33k"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
