{"description": "Detects when a user tampers with S3 data management in Amazon Web Services.", "enabled": false, "false_positives": ["A S3 configuration change may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. S3 configuration change from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "78b3756a-7804-4ef7-8555-7b9024a02e2d", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "AWS S3 Data Management Tampering", "query": "(eventSource:\"s3.amazonaws.com\" AND eventName:(\"PutBucketLogging\" OR \"PutBucketWebsite\" OR \"PutEncryptionConfiguration\" OR \"PutLifecycleConfiguration\" OR \"PutReplicationConfiguration\" OR \"ReplicateObject\" OR \"RestoreObject\"))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1537"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1537", "name": "Transfer Data to Cloud Account", "reference": "https://attack.mitre.org/techniques/T1537"}]}], "version": 1, "references": ["https://github.com/elastic/detection-rules/pull/1145/files", "https://docs.aws.amazon.com/AmazonS3/latest/API/API_Operations.html", "https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketLogging.html", "https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketWebsite.html", "https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutBucketEncryption.html", "https://docs.aws.amazon.com/AmazonS3/latest/userguide/setting-repl-config-perm-overview.html", "https://docs.aws.amazon.com/AmazonS3/latest/API/API_RestoreObject.html"], "timestamp_override": "event.ingested", "author": ["Austin Songer @austinsonger"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
