{"description":"Detects AWS API key creation for a user by another user. Backdoored users can be used to obtain persistence in the AWS environment. Also with this alert, you can detect a flow of AWS keys in your org. Author: faloker. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Adding user keys to their own accounts (the filter cannot cover all possible variants of user naming)","AWS API keys legitimate exchange workflows"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"0a5177f4-6ca9-44c2-aacf-d3f3d8b6e4d2","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"AWS IAM Backdoor Users Keys","query":"((eventSource:\"iam.amazonaws.com\" AND eventName:\"CreateAccessKey\") AND (NOT (userIdentity.arn:*responseElements.accessKey.userName*)))","meta":{"from":"1m"},"severity":"medium","tags":["T1098"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0003","reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
