{"description": "Detects S3 Browser utility creating IAM User or AccessKey.", "author": ["daniel.bohannon@permiso.io (@danielhbohannon)"], "enabled": false, "false_positives": ["Valid usage of S3 Browser for IAM User and/or AccessKey creation"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "db014773-d9d9-4792-91e5-133337c0ffee", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AWS IAM S3Browser User or AccessKey Creation", "query": "(eventSource:\"iam.amazonaws.com\" AND eventName:(\"CreateUser\" OR \"CreateAccessKey\") AND userAgent:*S3\\ Browser*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1059", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
