{"description": "An attempt to export an AWS EC2 instance has been detected. A VM Export might indicate an attempt to extract information from an instance.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "bc194a44-95e7-56f0-4c76-791410248a2f", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "AWS EC2 VM Export Failure", "query": "((eventName:\"CreateInstanceExportTask\" AND eventSource:\"ec2.amazonaws.com\") AND (errorMessage:* OR errorCode:* OR responseElements:*Failure*))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1005", "T1537"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1005", "name": "Data from Local System", "reference": "https://attack.mitre.org/techniques/T1005"}]}, {"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1537", "name": "Transfer Data to Cloud Account", "reference": "https://attack.mitre.org/techniques/T1537"}]}], "version": 1, "references": ["https://docs.aws.amazon.com/vm-import/latest/userguide/vmexport.html#export-instance"], "timestamp_override": "event.ingested", "author": ["Diogo Braz"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
