{"description":"Identifies the suspicious use of GetSessionToken. Tokens could be created and used by attackers to move laterally and escalate privileges. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["GetSessionToken may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. GetSessionToken from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"805e7e21-e026-58c8-f40c-e3d3badeef98","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"AWS STS GetSessionToken Misuse","query":"(eventSource:\"sts.amazonaws.com\" AND eventName:\"GetSessionToken\" AND userIdentity.type:\"IAMUser\")","meta":{"from":"1m"},"severity":"low","tags":["Lateral Movement","Privilege Escalation","T1548","T1550","T1550"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548"}]},{"tactic":{"id":"TA0008","reference":"https://attack.mitre.org/tactics/TA0008","name":"Lateral Movement"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1550","name":"Use Alternate Authentication Material","reference":"https://attack.mitre.org/techniques/T1550"},{"id":"T1550","name":"Use Alternate Authentication Material","reference":"https://attack.mitre.org/techniques/T1550"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
