{"description": "Detects an instance of an SES identity being deleted via the \"DeleteIdentity\" event. This may be an indicator of an adversary removing the account that carried out suspicious or malicious activities", "author": ["Janantha Marasinghe"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "dcaf98fa-668e-be9b-4504-7696c7c76b21", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "SES Identity Has Been Deleted", "query": "(eventSource:\"ses.amazonaws.com\" AND eventName:\"DeleteIdentity\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
