{"description":"Identifies when an EKS cluster is created or deleted. Author: Austin Songer. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["EKS Cluster being created or deleted may be performed by a system administrator.","Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.","EKS Cluster created or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"c09ffcd2-526f-641d-faa6-fbf2847b463e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":5,"name":"AWS EKS Cluster Created or Deleted","query":"(eventSource:\"eks.amazonaws.com\" AND eventName:(\"CreateCluster\" OR \"DeleteCluster\"))","meta":{"from":"1m"},"severity":"low","tags":["T1485"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0034","reference":"https://attack.mitre.org/tactics/TA0034","name":"Impact"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1485","name":"Data Destruction","reference":"https://attack.mitre.org/techniques/T1485"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
