{"description": "Detects when an Elastic Container Service (ECS) Task Definition includes a command to query the credential endpoint.\nThis can indicate a potential adversary adding a backdoor to establish persistence or escalate privileges.\n", "author": ["Darin Smith"], "enabled": false, "false_positives": ["Task Definition being modified to request credentials from the Task Metadata Service for valid reasons"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b94bf91e-c2bf-4047-9c43-c6810f43baad", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AWS ECS Task Definition That Queries The Credential Endpoint", "query": "(eventSource:\"ecs.amazonaws.com\" AND eventName:(\"DescribeTaskDefinition\" OR \"RegisterTaskDefinition\" OR \"RunTask\") AND requestParameters.containerDefinitions.command:*$AWS_CONTAINER_CREDENTIALS_RELATIVE_URI*)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1525"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1525", "name": "Implant Internal Image", "reference": "https://attack.mitre.org/techniques/T1525"}]}], "version": 1, "references": ["https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/ecs__backdoor_task_def/main.py", "https://docs.aws.amazon.com/AmazonECS/latest/APIReference/API_RegisterTaskDefinition.html", "https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task-iam-roles.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
