{"description":"Detects AWS root account usage Author: vitaliy0x1. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["AWS Tasks That Require AWS Account Root User Credentials https://docs.aws.amazon.com/general/latest/gr/aws_tasks-that-require-root.html"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"8ad1600d-e9dc-4251-b0ee-a65268f29add","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"AWS Root Credentials","query":"(userIdentity.type:\"Root\" AND (NOT (eventType:\"AwsServiceEvent\")))","meta":{"from":"1m"},"severity":"medium","tags":["Privilege Escalation","T1078"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0004","reference":"https://attack.mitre.org/tactics/TA0004","name":"Privilege Escalation"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
