{"description": "Detects potential enumeration activity targeting AWS storage", "author": ["Janantha Marasinghe"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5163f2c3-711b-5f90-1eca-191a12bd582a", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Potential Storage Enumeration on AWS", "query": "(eventSource:\"s3.amazonaws.com\" AND eventName:(\"ListBuckets\" OR \"GetBucketCors\" OR \"GetBucketInventoryConfiguration\" OR \"GetBucketPublicAccessBlock\" OR \"GetBucketMetricsConfiguration\" OR \"GetBucketPolicy\" OR \"GetBucketTagging\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1619"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1619", "name": "Cloud Storage Object Discovery", "reference": "https://attack.mitre.org/techniques/T1619"}]}], "version": 1, "threshold": {"field": [], "value": 6}, "references": ["https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
