{"description": "Detects network enumeration performed on AWS.", "author": ["Janantha Marasinghe"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "5c610241-c0ac-e57a-41f9-8a084740ffe8", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Potential Network Enumeration on AWS", "query": "(eventSource:\"ec2.amazonaws.com\" AND eventName:(\"DescribeCarrierGateways\" OR \"DescribeVpcEndpointConnectionNotifications\" OR \"DescribeTransitGatewayMulticastDomains\" OR \"DescribeClientVpnRoutes\" OR \"DescribeDhcpOptions\" OR \"GetTransitGatewayRouteTableAssociations\"))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1016"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1016", "name": "System Network Configuration Discovery", "reference": "https://attack.mitre.org/techniques/T1016"}]}], "version": 1, "threshold": {"field": [], "value": 6}, "references": ["https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
