{"description": "Detects the modification of the findings on SecurityHub.", "enabled": false, "false_positives": ["System or Network administrator behaviors", "DEV, UAT, SAT environment. You should apply this rule with PROD environment only."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "a607e1fe-74bf-4440-a3ec-b059b9103157", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AWS SecurityHub Findings Evasion", "query": "(eventSource:\"securityhub.amazonaws.com\" AND eventName:(\"BatchUpdateFindings\" OR \"DeleteInsight\" OR \"UpdateFindings\" OR \"UpdateInsight\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://docs.aws.amazon.com/cli/latest/reference/securityhub/"], "timestamp_override": "event.ingested", "author": ["Sittikorn S"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
