{"description": "Detects possible suspicious glue development endpoint activity.", "author": ["Austin Songer @austinsonger"], "enabled": false, "false_positives": ["Glue Development Endpoint Activity may be performed by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "4990c2e3-f4b8-45e3-bc3c-30b14ff0ed26", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "AWS Glue Development Endpoint Activity", "query": "(eventSource:\"glue.amazonaws.com\" AND eventName:(\"CreateDevEndpoint\" OR \"DeleteDevEndpoint\" OR \"UpdateDevEndpoint\"))", "meta": {"from": "1m"}, "severity": "low", "tags": ["Privilege Escalation"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation/", "https://docs.aws.amazon.com/glue/latest/webapi/API_CreateDevEndpoint.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
