{"description": "Detects the modification of an EC2 snapshot's permissions to enable access from another account", "enabled": false, "false_positives": ["Valid change to a snapshot's permissions"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "abae8fec-57bd-4f87-aff6-6e3db989843d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AWS Snapshot Backup Exfiltration", "query": "(eventSource:\"ec2.amazonaws.com\" AND eventName:\"ModifySnapshotAttribute\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1537"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1537", "name": "Transfer Data to Cloud Account", "reference": "https://attack.mitre.org/techniques/T1537"}]}], "version": 1, "references": ["https://www.justice.gov/file/1080281/download", "https://attack.mitre.org/techniques/T1537/"], "timestamp_override": "event.ingested", "author": ["Darin Smith"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
