{"description":"Detects bulk downloading of User Data associated with AWS EC2 instances. Instance User Data may include installation scripts and hard-coded secrets for deployment. Author: faloker. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Assets management software like device42"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"60a1578f-d2f0-f1dd-2259-bbc1271a07fe","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"AWS EC2 Download Userdata","query":"(eventSource:\"ec2.amazonaws.com\" AND requestParameters.attribute:\"userData\" AND eventName:\"DescribeInstanceAttribute\")","meta":{"from":"1m"},"severity":"medium","tags":["T1020"],"to":"now","type":"threshold","threat":[{"tactic":{"id":"TA0010","reference":"https://attack.mitre.org/tactics/TA0010","name":"Exfiltration"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1020","name":"Automated Exfiltration","reference":"https://attack.mitre.org/techniques/T1020"}]}],"version":1,"threshold":{"field":[],"value":11},"references":["https://tdm.socprime.com/tdm/info/0"]}
