{"description": "Detects evade to Macie detection.", "enabled": false, "false_positives": ["System or Network administrator behaviors"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "afdde413-cf18-0a3f-3256-04eba06f5133", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AWS Macie Evasion", "query": "eventName:(\"ArchiveFindings\" OR \"CreateFindingsFilter\" OR \"DeleteMember\" OR \"DisassociateFromMasterAccount\" OR \"DisassociateMember\" OR \"DisableMacie\" OR \"DisableOrganizationAdminAccount\" OR \"UpdateFindingsFilter\" OR \"UpdateMacieSession\" OR \"UpdateMemberSession\" OR \"UpdateClassificationJob\")", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "threshold", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "threshold": {"field": "sourceIPAddress", "value": 6}, "references": ["https://docs.aws.amazon.com/cli/latest/reference/macie/"], "timestamp_override": "event.ingested", "author": ["Sittikorn S"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
