{"description": "Detects AWS Config Service disabling", "enabled": false, "false_positives": ["Valid change in AWS Config Service"], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "07330162-dba1-4746-8121-a9647d49d297", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "AWS Config Disabling Channel/Recorder", "query": "(eventSource:\"config.amazonaws.com\" AND eventName:(\"DeleteDeliveryChannel\" OR \"StopConfigurationRecorder\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1562"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1562", "name": "Impair Defenses", "reference": "https://attack.mitre.org/techniques/T1562"}]}], "version": 1, "references": ["https://tdm.socprime.com/tdm/info/0"], "timestamp_override": "event.ingested", "author": ["vitaliy0x1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
