{"description":"Detects when a EFS Fileshare is modified or deleted. You can't delete a file system that is in use. If the file system has any mount targets, the adversary must first delete them, so deletion of a mount will occur before deletion of a fileshare. Author: Austin Songer @austinsonger. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["apm-*-transaction","auditbeat-*","endgame-*","filebeat-*","packetbeat-*","winlogbeat-*","logs-*"],"interval":"5m","rule_id":"8bf98533-bfeb-de5e-e314-cdf8fdcd806d","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"AWS EFS Fileshare Modified or Deleted","query":"(eventSource:\"elasticfilesystem.amazonaws.com\" AND eventName:\"DeleteFileSystem\")","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
