{"description": "Identifies when suspicious SAML activity has occurred in AWS. An adversary could gain backdoor access via SAML.", "enabled": false, "false_positives": ["Automated processes that uses Terraform may lead to false positives.", "SAML Provider could be updated by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.", "SAML Provider being updated from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "f43f5d2f-3f2a-4cc8-b1af-81fde7dbaf0e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "AWS Suspicious SAML Activity", "query": "((eventSource:\"sts.amazonaws.com\" AND eventName:\"AssumeRoleWithSAML\") OR (eventSource:\"iam.amazonaws.com\" AND eventName:\"UpdateSAMLProvider\"))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Initial Access", "Lateral Movement", "Privilege Escalation", "T1078", "T1548", "T1550", "T1550"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}, {"id": "T1548", "name": "Abuse Elevation Control Mechanism", "reference": "https://attack.mitre.org/techniques/T1548"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}, {"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://docs.aws.amazon.com/IAM/latest/APIReference/API_UpdateSAMLProvider.html", "https://docs.aws.amazon.com/STS/latest/APIReference/API_AssumeRoleWithSAML.html"], "timestamp_override": "event.ingested", "author": ["Austin Songer"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
