{"description": "A General detection to trigger for the deletion of files by Sysinternals SDelete. It looks for the common name pattern used to rename files.", "enabled": false, "false_positives": ["Legitime usage of SDelete"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "6ddab845-b1b8-49c2-bbf7-1a11967f64bc", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Sysinternals SDelete File Deletion", "query": "(file.path.text:(*.AAA OR *.ZZZ) AND (NOT ((file.path.text:*\\\\Wireshark\\\\radius\\\\dictionary.alcatel\\-lucent.aaa))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1070"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1070", "name": "Indicator Removal on Host", "reference": "https://attack.mitre.org/techniques/T1070"}]}], "version": 1, "references": ["https://github.com/OTRF/detection-hackathon-apt29/issues/9", "https://threathunterplaybook.com/evals/apt29/detections/4.B.4_83D62033-105A-4A02-8B75-DAB52D8D51EC.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
