{"description":"Detects cases in which a file gets renamed to .dll, which often happens to bypass perimeter protection Author: frack113. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Application installation"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"2bec48b4-8636-eb24-5e75-792c52f84b0e","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Rename Common File to DLL File","query":"(file.path:*.dll AND (NOT (OriginalFilename:(*.dll OR *.tmp) OR OriginalFilename:*.dll.*)))","meta":{"from":"1m"},"severity":"medium","tags":[],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
