{"description": "Detects creation of UserInitMprLogonScript persistence method", "enabled": false, "false_positives": ["Exclude legitimate logon scripts"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5b5713fc-83e4-9dff-cad5-9890f5ca9e23", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Logon Scripts Creation in UserInitMprLogonScript Registry", "query": "(winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:*UserInitMprLogonScript*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://attack.mitre.org/techniques/T1037/", "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1037.001/T1037.001.md"], "timestamp_override": "event.ingested", "author": ["Tom Ueltschi (@c_APT_ure)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
