{"description": "Detects the usage of Sysinternals Tools due to accepteula key being added to Registry", "enabled": false, "false_positives": ["Legitimate use of SysInternals tools", "Programs that use the same Registry Key"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "25ffa65d-76d8-4da5-a832-3f2b0136e133", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "Usage of Sysinternals Tools", "query": "(winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:*\\\\EulaAccepted)", "meta": {"from": "1m"}, "severity": "low", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/Moti_B/status/1008587936735035392"], "timestamp_override": "event.ingested", "author": ["Markus Neis"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
