{"description": "Detects new registry key created by Ursnif malware.", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "40b5ace1-f787-73d7-4cc8-c86614d097fa", "language": "lucene", "max_signals": 100, "risk_score": 95, "name": "Ursnif", "query": "(winlog.event_data.TargetObject:*\\\\Software\\\\AppDataLow\\\\Software\\\\Microsoft\\\\* AND (NOT (winlog.event_data.TargetObject:(*\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\Internet\\ Explorer\\\\* OR *\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\RepService\\\\* OR *\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\IME\\\\* OR *\\\\SOFTWARE\\\\AppDataLow\\\\Software\\\\Microsoft\\\\Edge\\\\*))))", "meta": {"from": "1m"}, "severity": "critical", "tags": ["T1112"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blog.yoroi.company/research/ursnif-long-live-the-steganography/", "https://blog.trendmicro.com/trendlabs-security-intelligence/phishing-campaign-uses-hijacked-emails-to-deliver-ursnif-by-replying-to-ongoing-threads/"], "timestamp_override": "event.ingested", "author": ["megan201296"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
