{"description": "Detects the execution of a Sysinternals Tool via the creation of the \"accepteula\" registry key", "author": ["Markus Neis"], "enabled": false, "false_positives": ["Legitimate use of SysInternals tools", "Programs that use the same Registry Key"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "25ffa65d-76d8-4da5-a832-3f2b0136e133", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PUA - Sysinternal Tool Execution - Registry", "query": "(winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:*\\\\EulaAccepted)", "meta": {"from": "1m"}, "severity": "low", "tags": ["Resource Development", "T1588"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1588", "name": "Obtain Capabilities", "reference": "https://attack.mitre.org/techniques/T1588"}]}], "version": 1, "references": ["https://twitter.com/Moti_B/status/1008587936735035392"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
