{"description": "Detects the usage of Suspicious Sysinternals Tools such as PsExec, Procdump...etc via the \"accepteula\" key being added to Registry", "enabled": false, "false_positives": ["Legitimate use of SysInternals tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c7da8edc-49ae-45a2-9e61-9fd860e4e73d", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Usage of Suspicious Sysinternals Tools", "query": "(winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:(*\\\\PsExec* OR *\\\\ProcDump* OR *\\\\Handle* OR *\\\\LiveKd* OR *\\\\Process\\ Explorer* OR *\\\\PsLoglist* OR *\\\\PsPasswd* OR *\\\\Active\\ Directory\\ Explorer* OR *\\\\Sysinternals*) AND winlog.event_data.TargetObject:*\\\\EulaAccepted)", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Resource Development", "T1588"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0042", "reference": "https://attack.mitre.org/tactics/TA0042", "name": "Resource Development"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1588", "name": "Obtain Capabilities", "reference": "https://attack.mitre.org/techniques/T1588"}]}], "version": 1, "references": ["https://twitter.com/Moti_B/status/1008587936735035392"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
