{"description": "Detects COM object hijacking via TreatAs subkey", "enabled": false, "false_positives": ["Maybe some system utilities in rare cases use linking keys for backward compatibility"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "b8c85b6a-333d-6f1a-c63c-887488d13917", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Windows Registry Persistence COM Key Linking", "query": "((winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:*HKU\\\\* AND winlog.event_data.TargetObject:*Classes\\\\CLSID\\\\* AND winlog.event_data.TargetObject:*\\\\TreatAs*) AND (NOT ((process.executable.text:\"C\\:\\\\WINDOWS\\\\system32\\\\svchost.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1546"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1546", "name": "Event Triggered Execution", "reference": "https://attack.mitre.org/techniques/T1546"}]}], "version": 1, "references": ["https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/"], "timestamp_override": "event.ingested", "author": ["Kutepov Anton", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
