{"description": "Detects when an attacker modifies values of the Disk Cleanup Handler in the registry to achieve persistence.\nThe disk cleanup manager is part of the operating system. It displays the dialog box [\u2026] The user has the option of enabling or disabling individual handlers by selecting or clearing their check box in the disk cleanup manager's UI. Although Windows comes with a number of disk cleanup handlers, they aren't designed to handle files produced by other applications. Instead, the disk cleanup manager is designed to be flexible and extensible by enabling any developer to implement and register their own disk cleanup handler. Any developer can extend the available disk cleanup services by implementing and registering a disk cleanup handler.\n", "enabled": false, "false_positives": ["Legitimate new entry added by windows"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "61ffb86f-9c8b-f560-e743-c151d4ad0a42", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Persistence Via Disk Cleanup Handler - NewEntry", "query": "((winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:*\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\VolumeCaches\\\\*) AND (NOT (winlog.event_data.TargetObject:(*\\\\Active\\ Setup\\ Temp\\ Folders OR *\\\\BranchCache OR *\\\\Content\\ Indexer\\ Cleaner OR *\\\\D3D\\ Shader\\ Cache OR *\\\\Delivery\\ Optimization\\ Files OR *\\\\Device\\ Driver\\ Packages OR *\\\\Diagnostic\\ Data\\ Viewer\\ database\\ files OR *\\\\Downloaded\\ Program\\ Files OR *\\\\DownloadsFolder OR *\\\\Feedback\\ Hub\\ Archive\\ log\\ files OR *\\\\Internet\\ Cache\\ Files OR *\\\\Language\\ Pack OR *\\\\Microsoft\\ Office\\ Temp\\ Files OR *\\\\Offline\\ Pages\\ Files OR *\\\\Old\\ ChkDsk\\ Files OR *\\\\Previous\\ Installations OR *\\\\Recycle\\ Bin OR *\\\\RetailDemo\\ Offline\\ Content OR *\\\\Setup\\ Log\\ Files OR *\\\\System\\ error\\ memory\\ dump\\ files OR *\\\\System\\ error\\ minidump\\ files OR *\\\\Temporary\\ Files OR *\\\\Temporary\\ Setup\\ Files OR *\\\\Temporary\\ Sync\\ Files OR *\\\\Thumbnail\\ Cache OR *\\\\Update\\ Cleanup OR *\\\\Upgrade\\ Discarded\\ Files OR *\\\\User\\ file\\ versions OR *\\\\Windows\\ Defender OR *\\\\Windows\\ Error\\ Reporting\\ Files OR *\\\\Windows\\ ESD\\ installation\\ files OR *\\\\Windows\\ Upgrade\\ Log\\ Files))))", "meta": {"from": "1m"}, "severity": "medium", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://persistence-info.github.io/Data/diskcleanuphandler.html", "https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/"], "timestamp_override": "event.ingested", "author": ["Nasreddine Bencherchali"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
