{"description": "Attempts to detect registry events for common NetWire key HKCU\\Software\\NetWire", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1d218616-71b0-4c40-855b-9dbe75510f7f", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "NetWire RAT Registry Key", "query": "(winlog.event_data.EventType:\"CreateKey\" AND winlog.event_data.TargetObject:*\\\\software\\\\NetWire*)", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.fortinet.com/blog/threat-research/new-netwire-rat-variant-spread-by-phishing", "https://resources.infosecinstitute.com/topic/netwire-malware-what-it-is-how-it-works-and-how-to-prevent-it-malware-spotlight/", "https://unit42.paloaltonetworks.com/guloader-installing-netwire-rat/", "https://blogs.blackberry.com/en/2021/09/threat-thursday-netwire-rat-is-coming-down-the-line", "https://app.any.run/tasks/41ecdbde-4997-4301-a350-0270448b4c8f/"], "timestamp_override": "event.ingested", "author": ["Christopher Peacock"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
