{"description": "Identifies when a privilege role assignment has taken place outside of PIM and may indicate an attack.", "author": ["Mark Morowczynski '@markmorow'", "Gloria Lee", "'@gleeiamglo'"], "enabled": false, "false_positives": ["Investigate where users are being assigned privileged roles outside of Privileged Identity Management and prohibit future assignments from there."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "b1bc08d1-8224-4758-a0e6-fbcfc98c73bb", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Roles Assigned Outside PIM", "query": "riskEventType:rolesAssignedOutsidePrivilegedIdentityManagementAlertConfiguration", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-assigned-outside-of-privileged-identity-management"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
