{"description": "Identifies when the same privilege role has multiple activations by the same user.", "author": ["Mark Morowczynski '@markmorow'", "Gloria Lee", "'@gleeiamglo'"], "enabled": false, "false_positives": ["Investigate where if active time period for a role is set too short."], "filters": [], "from": "now-360s", "immutable": false, "index": ["apm-*-transaction", "auditbeat-*", "endgame-*", "filebeat-*", "packetbeat-*", "winlogbeat-*", "logs-*"], "interval": "5m", "rule_id": "645fd80d-6c07-435b-9e06-7bc1b5656cba", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Roles Activated Too Frequently", "query": "riskEventType:sequentialActivationRenewalsAlertIncident", "meta": {"from": "1m"}, "severity": "high", "tags": ["Privilege Escalation", "T1078"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0003", "reference": "https://attack.mitre.org/tactics/TA0003", "name": "Persistence"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}, {"tactic": {"id": "TA0004", "reference": "https://attack.mitre.org/tactics/TA0004", "name": "Privilege Escalation"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "name": "Valid Accounts", "reference": "https://attack.mitre.org/techniques/T1078"}]}], "version": 1, "references": ["https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-activated-too-frequently"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
