{"description": "Detects an executable in the Windows folder accessing suspicious domains", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4efe8f2f-7b38-7ffd-df2a-58d47a888fd4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Binary Suspicious Communication Endpoint", "query": "(winlog.event_data.Initiated:\"true\" AND destination.domain:(*dl.dropboxusercontent.com OR *.pastebin.com OR *.githubusercontent.com) AND process.executable:C\\:\\\\Windows\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/M_haggis/status/900741347035889665", "https://twitter.com/M_haggis/status/1032799638213066752"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
