{"description": "Detects an executable in the Windows folder accessing github.com", "enabled": false, "false_positives": ["Unknown", "@subTee in your network"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "635dbb88-67b3-4b41-9ea5-a3af2dd88153", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Binary Github Communication", "query": "(winlog.event_data.Initiated:\"true\" AND destination.domain:(*.github.com OR *.githubusercontent.com) AND process.executable:C\\:\\\\Windows\\\\*)", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1105", "T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://twitter.com/M_haggis/status/900741347035889665", "https://twitter.com/M_haggis/status/1032799638213066752", "https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/exfil/Invoke-ExfilDataToGitHub.ps1"], "timestamp_override": "event.ingested", "author": ["Michael Haag (idea)", "Florian Roth (rule)"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
