{"description": "Detects a Powershell process that opens network connections - check for suspicious target ports and target systems - adjust to your environment (e.g. extend filters with company's ip range')", "author": ["Florian Roth"], "enabled": false, "false_positives": ["Administrative scripts", "Microsoft IP range"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "1f21ec3f-810d-4b0e-8045-322202e22b4b", "language": "lucene", "max_signals": 100, "risk_score": 5, "name": "PowerShell Network Connections", "query": "((process.executable.text:(*\\\\powershell.exe OR *\\\\pwsh.exe) AND winlog.event_data.Initiated:\"true\" AND DestinationIsIpv6:\"false\") AND (NOT (((destination.ip:(10.* OR 192.168.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.* OR 127.0.0.1*) AND user.name:(*AUTHORI* OR *AUTORI*))) OR (destination.ip:(\\:\\:1* OR 0\\:0\\:0\\:0\\:0\\:0\\:0\\:1* OR fe80\\:* OR fc* OR fd*)) OR (destination.ip:(20.184.* OR 20.185.* OR 20.186.* OR 20.187.* OR 20.188.* OR 20.189.* OR 20.190.* OR 20.191.* OR 23.79.* OR 51.10.* OR 51.103.* OR 51.104.* OR 51.105.* OR 52.239.*)))))", "meta": {"from": "1m"}, "severity": "low", "tags": ["T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}], "version": 1, "references": ["https://www.youtube.com/watch?v=DLtJTxMWZ2o"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
