{"description": "Detects an executable, which is not an internet browser, making DNS request to legit popular websites, which were seen to be used as dead drop resolvers in previous attacks.", "author": ["Sorina Ionescu", "X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["One might need to exclude other internet browsers found in it's network or other applications like ones mentioned above from Microsoft Defender."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "297ae038-edc2-4b2e-bb3e-7c5fc94dd5c7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Dead Drop Resolvers", "query": "(((winlog.event_data.Initiated:\"true\" AND destination.domain:(*.cloudflare.com OR *.githubusercontent.com OR *4shared.com OR *anonfiles.com OR *cdn.discordapp.com OR *ddns.net OR *discord.com\\/api\\/webhooks\\/ OR *docs.google.com OR *drive.google.com OR *dropbox.com OR *dropmefiles.com OR *facebook.com OR *feeds.rapidfeeds.com OR *fotolog.com OR *ghostbin.co\\/ OR *gist.githubusercontent.com OR *hastebin.com OR *imgur.com OR *livejournal.com OR *mediafire.com OR *mega.nz OR *onedrive.com OR *paste.ee OR *pastebin.com OR *pastebin.pl OR *pastetext.net OR *privatlab.com OR *privatlab.net OR *raw.githubusercontent.com OR *reddit.com OR *send.exploit.in OR *sendspace.com OR *steamcommunity.com OR *storage.googleapis.com OR *t.me OR *technet.microsoft.com OR *temp.sh OR *transfer.sh OR *twitter.com OR *ufile.io OR *vimeo.com OR *wetransfer.com OR *youtube.com)) AND (NOT ((process.executable.text:(\"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\")) OR (process.executable.text:(\"C:\\Program Files\\Mozilla Firefox\\firefox.exe\" OR \"C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe\")) OR (process.executable.text:(\"C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe\" OR \"C:\\Program Files\\Internet Explorer\\iexplore.exe\")) OR (((process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\") OR (process.executable.text:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\") OR (process.executable.text:(\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" OR \"C:\\Program Files\\Microsoft\\Edge\\Application\\msedge.exe\")))) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeCore\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\\\EdgeCore\\\\*\") AND process.executable.text:(\"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\"))) OR (process.executable.text:\"*\\\\safari.exe\") OR ((process.executable.text:\"*\\\\brave.exe\" AND process.executable.text:\"C\\:\\\\Program\\ Files\\\\BraveSoftware\\\\*\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Maxthon\\\\*\" AND process.executable.text:\"*\\\\maxthon.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Programs\\\\Opera\\\\*\" AND process.executable.text:\"*\\\\opera.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\SeaMonkey\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\SeaMonkey\\\\*\") AND process.executable.text:\"*\\\\seamonkey.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Vivaldi\\\\*\" AND process.executable.text:\"*\\\\vivaldi.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Naver\\\\Naver\\ Whale\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Naver\\\\Naver\\ Whale\\\\*\") AND process.executable.text:\"*\\\\whale.exe\")) OR (process.executable.text:\"*\\\\Tor\\ Browser\\\\*\") OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Waterfox\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Waterfox\\\\*\") AND process.executable.text:\"*\\\\Waterfox.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Programs\\\\midori\\-ng\\\\*\" AND process.executable.text:\"*\\\\Midori\\ Next\\ Generation.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\SlimBrowser\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\SlimBrowser\\\\*\") AND process.executable.text:\"*\\\\slimbrowser.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Flock\\\\*\" AND process.executable.text:\"*\\\\Flock.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Phoebe\\\\*\" AND process.executable.text:\"*\\\\Phoebe.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Falkon\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Falkon\\\\*\") AND process.executable.text:\"*\\\\falkon.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\QtWeb\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\QtWeb\\\\*\") AND process.executable.text:\"*\\\\QtWeb.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Avant\\ Browser\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Avant\\ Browser\\\\*\") AND process.executable.text:\"*\\\\avant.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\WindowsApps\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\WindowsApps\\\\*\") AND process.executable.text:\"*WhatsApp.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Roaming\\\\Telegram\\ Desktop\\\\*\" AND process.executable.text:\"*\\\\Telegram.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\*\" AND process.executable.text:\"*\\\\OneDrive.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Dropbox\\\\Client\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Dropbox\\\\Client\\\\*\") AND process.executable.text:\"*\\\\Dropbox.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\MEGAsync\\\\*\" AND process.executable.text:\"*MEGAsync.exe\")) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Google\\\\Drive\\ File\\ Stream\\\\*\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Google\\\\Drive\\ File\\ Stream\\\\*\") AND process.executable.text:\"*GoogleDriveFS.exe\")) OR ((process.executable.text:\"*\\\\AppData\\\\Local\\\\Discord\\\\*\" AND process.executable.text:\"*\\\\Discord.exe\"))))) AND (NOT ((process.executable.text:(\"*\\\\MsMpEng.exe\" OR \"*\\\\MsSense.exe\")) OR (process.executable.text:\"*\\\\PRTG\\ Probe.exe\") OR (process.executable.text:\"*\\\\Engine.exe\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1102", "T1102"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://content.fireeye.com/apt-41/rpt-apt41", "https://securelist.com/the-tetrade-brazilian-banking-malware/97779/", "https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
