{"description": "Detects suspicious network connections made by a well-known Windows binary run with no command line parameters", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "20384606-a124-4fec-acbb-8bd373728613", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Network Connection Binary No CommandLine", "query": "((winlog.event_data.Initiated:\"true\" AND process.executable:(*\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\dllhost.exe) AND process.command_line:(*\\\\regsvr32.exe OR *\\\\rundll32.exe OR *\\\\dllhost.exe)) AND (NOT ((process.command_line:\"\") OR (NOT _exists_:process.command_line))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://redcanary.com/blog/raspberry-robin/"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
