{"description": "Detects an a non-browser process interacting with the Telegram API which could indicate use of a covert C2", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate applications communicating with the Telegram API e.g. web browsers not in the exclusion list, app with an RSS  etc."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c3dbbc9f-ef1d-470a-a90a-d343448d5875", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Non-Browser Network Communication With Telegram API", "query": "(destination.domain:*api.telegram.org* AND (NOT ((process.executable.text:\"*\\\\brave.exe\") OR (process.executable.text:(\"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\")) OR (process.executable.text:(\"C:\\Program Files\\Mozilla Firefox\\firefox.exe\" OR \"C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe\")) OR (process.executable.text:(\"C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe\" OR \"C:\\Program Files\\Internet Explorer\\iexplore.exe\")) OR (process.executable.text:\"*\\\\maxthon.exe\") OR (((process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\") OR (process.executable.text:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\") OR (process.executable.text:(\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" OR \"C:\\Program Files\\Microsoft\\Edge\\Application\\msedge.exe\")))) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeCore\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\\\EdgeCore\\\\*\") AND process.executable.text:(\"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\"))) OR (process.executable.text:\"*\\\\opera.exe\") OR (process.executable.text:\"*\\\\safari.exe\") OR (process.executable.text:\"*\\\\seamonkey.exe\") OR (process.executable.text:\"*\\\\vivaldi.exe\") OR (process.executable.text:\"*\\\\whale.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1102"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/small-sieve/NCSC-MAR-Small-Sieve.pdf"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
