{"description": "Detects Dllhost that communicates with public IP addresses", "author": ["bartblaze"], "enabled": false, "false_positives": ["Communication to other corporate systems that use IP addresses from public address spaces"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c27de3b9-f924-135b-0395-055d19e86049", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Dllhost Internet Connection", "query": "((process.executable.text:*\\\\dllhost.exe AND winlog.event_data.Initiated:\"true\") AND (NOT ((destination.ip:(10.* OR 192.168.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.* OR 169.254.* OR 127.*)) OR (destination.ip:(\\:\\:1* OR 0\\:0\\:0\\:0\\:0\\:0\\:0\\:1* OR fe80\\:* OR fc* OR fd*)) OR (destination.ip:(20.184.* OR 20.185.* OR 20.186.* OR 20.187.* OR 20.188.* OR 20.189.* OR 20.190.* OR 20.191.* OR 23.79.* OR 51.10.* OR 51.103.* OR 51.104.* OR 51.105.* OR 52.239.*)))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218", "T1559"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1559", "name": "Inter-Process Communication", "reference": "https://attack.mitre.org/techniques/T1559"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://redcanary.com/blog/child-processes/", "https://nasbench.medium.com/what-is-the-dllhost-exe-process-actually-running-ef9fe4c19c08"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
