{"description": "Detects an executable that isn't dropbox but communicates with the Dropbox API", "enabled": false, "false_positives": ["Legitimate use of the API with a tool that the author wasn't aware of"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d9ea52b1-12c8-01f8-722b-c3641a27d747", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Dropbox API Usage", "query": "((winlog.event_data.Initiated:\"true\" AND destination.domain:(*api.dropboxapi.com OR *content.dropboxapi.com)) AND (NOT (process.executable:*\\\\Dropbox*)))", "meta": {"from": "1m"}, "severity": "high", "tags": [], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://app.any.run/tasks/7e906adc-9d11-447f-8641-5f40375ecebb", "https://www.zscaler.com/blogs/security-research/new-espionage-attack-molerats-apt-targeting-users-middle-east"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
