{"description": "Detects suspicious network connection by Notepad", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e81528db-fc02-45e8-8e98-4e84aba1f10b", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Notepad Making Network Connection", "query": "(process.executable:*\\\\notepad.exe AND (NOT (destination.port:\"9100\")))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Defense Evasion", "T1055"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1055", "name": "Process Injection", "reference": "https://attack.mitre.org/techniques/T1055"}]}], "version": 1, "references": ["https://www.sans.org/cyber-security-summit/archives/file/summit-archive-1492186586.pdf", "https://blog.cobaltstrike.com/2013/08/08/why-is-notepad-exe-connecting-to-the-internet/"], "timestamp_override": "event.ingested", "author": ["EagleEye Team"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
