{"description": "Detects suspicious \"epmap\" connection to a remote computer via remote procedure call (RPC)", "author": ["frack113", "Tim Shelton (fps)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "628d7a0b-7b84-4466-8552-e6138bc03b43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Epmap Connection", "query": "(event.category:network AND (Protocol:tcp AND winlog.event_data.Initiated:true AND destination.port:135) AND (NOT ((process.executable:(/[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/ OR /[Cc]\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Dd][Aa][Tt][Aa]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\\\[Ss][Ss][Mm]\\\\[Uu][Pp][Dd][Aa][Tt][Ee]\\\\[Aa][Mm][Aa][Zz][Oo][Nn]\\-[Ss][Ss][Mm]\\-[Aa][Gg][Ee][Nn][Tt]\\-[Uu][Pp][Dd][Aa][Tt][Ee][Rr].*/)) OR (NOT _exists_:process.executable.text) OR (process.executable.text:) OR (process.executable:/\\<[Uu][Nn][Kk][Nn][Oo][Ww][Nn]\\ [Pp][Rr][Oo][Cc][Ee][Ss][Ss]\\>/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/RiccardoAncarani/TaskShell/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
