{"description": "Detects remote PowerShell connections by monitoring network outbound connections to ports 5985 or 5986 from a non-network service account.", "enabled": false, "false_positives": ["Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.", "Network Service user name of a not-covered localization"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c539afac-c12a-46ed-b1bd-5a5567c9f045", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Remote PowerShell Session (Network)", "query": "((destination.port:(\"5985\" OR \"5986\") AND winlog.event_data.Initiated:\"true\") AND (NOT ((user.name:(*NETWORK\\ SERVICE* OR *NETZWERKDIENST* OR *SERVIZIO\\ DI\\ RETE* OR *SERVICIO\\ DE\\ RED*) OR user.name:*SERVICE\\ R* AND user.name:*SEAU* OR source.ip:0\\:0\\:* OR process.executable.text:(\"C\\:\\\\Program\\ Files\\\\Avast\\ Software\\\\Avast\\\\AvastSvc.exe\" OR \"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Avast\\ Software\\\\Avast\\\\AvastSvc.exe\")) OR (source.ip:\"\\:\\:1\" AND destination.ip:\"\\:\\:1\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1059"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1059", "name": "Command and Scripting Interpreter", "reference": "https://attack.mitre.org/techniques/T1059"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html"], "timestamp_override": "event.ingested", "author": ["Roberto Rodriguez @Cyb3rWard0g"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
