{"description": "Detects network connections from Equation Editor", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "a66bc059-c370-472c-a0d7-f8fd1bf9d583", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Equation Editor Network Connection", "query": "process.executable:*\\\\eqnedt32.exe", "meta": {"from": "1m"}, "severity": "high", "tags": ["attack.execution", "attack.t1203"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}], "version": 1, "references": ["https://twitter.com/forensicitguy/status/1513538712986079238", "https://news.sophos.com/en-us/2019/07/18/a-new-equation-editor-exploit-goes-commercial-as-maldoc-attacks-using-it-spike/"], "timestamp_override": "event.ingested", "author": ["Max Altgelt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
