{"description": "Detects suspicious \"epmap\" connection to a remote computer via remote procedure call (RPC)", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "628d7a0b-7b84-4466-8552-e6138bc03b43", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Epmap Connection", "query": "((Protocol:\"tcp\" AND winlog.event_data.Initiated:\"true\" AND destination.port:\"135\") AND (NOT (process.executable:C\\:\\\\Windows\\\\*)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/RiccardoAncarani/TaskShell/"], "timestamp_override": "event.ingested", "author": ["frack113"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
