{"description": "Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.", "enabled": false, "false_positives": ["Other browsers"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e54979bd-c5f9-4d6c-967b-a04b19ac4c74", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Suspicious Outbound Kerberos Connection", "query": "((destination.port:\"88\" AND winlog.event_data.Initiated:\"true\") AND (NOT (process.executable:(*\\\\lsass.exe OR *\\\\opera.exe OR *\\\\chrome.exe OR *\\\\firefox.exe OR *\\\\tomcat\\\\bin\\\\tomcat8.exe))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Credential Access", "Lateral Movement", "T1550", "T1558"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential Access"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1558", "name": "Steal or Forge Kerberos Tickets", "reference": "https://attack.mitre.org/techniques/T1558"}]}, {"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1550", "name": "Use Alternate Authentication Material", "reference": "https://attack.mitre.org/techniques/T1550"}]}], "version": 1, "references": ["https://github.com/GhostPack/Rubeus"], "timestamp_override": "event.ingested", "author": ["Ilyas Ochkov", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
