{"description": "Detects an executable, which is not an internet browser, making DNS request to legit popular websites, which were seen to be used as dead drop resolvers in previous attacks.", "author": ["Sorina Ionescu"], "enabled": false, "false_positives": ["One might need to exclude other internet browsers found in it's network or other applications like ones mentioned above from Microsoft Defender."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "297ae038-edc2-4b2e-bb3e-7c5fc94dd5c7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Dead Drop Resolvers", "query": "((winlog.event_data.Initiated:\"true\" AND destination.domain:(*cdn.discordapp.com OR *pastebin.com OR *youtube.com OR *technet.microsoft.com OR *facebook.com OR *.cloudflare.com OR *docs.google.com OR *steamcommunity.com OR *reddit.com OR *fotolog.com OR *twitter.com OR *imgur.com OR *feeds.rapidfeeds.com OR *livejournal.com OR *.githubusercontent.com OR *pastetext.net OR *pastebin.pl OR *paste.ee)) AND (NOT ((process.executable.text:(*\\\\iexplore.exe OR *\\\\msedge.exe OR *\\\\edge.exe OR *\\\\opera.exe OR *\\\\brave.exe OR *\\\\vivaldi.exe OR *\\\\whale.exe OR *\\\\chrome.exe OR *\\\\firefox.exe)) OR (process.executable.text:(*\\\\MsMpEng.exe OR *\\\\MsSense.exe OR *\\\\PRTG\\ Probe.exe OR *\\\\Engine.exe OR *\\\\msedgewebview2.exe)))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1102", "T1102"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://content.fireeye.com/apt-41/rpt-apt41", "https://securelist.com/the-tetrade-brazilian-banking-malware/97779/", "https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
