{"description": "Detects initiated network connections to crypto mining pools", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unlikely"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "fa5b1358-b040-4403-9868-15f7d9ab6329", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Network Communication With Crypto Mining Pool", "query": "destination.domain:(\"alimabi.cn\" OR \"ap.luckpool.net\" OR \"bcn.pool.minergate.com\" OR \"bcn.vip.pool.minergate.com\" OR \"bohemianpool.com\" OR \"ca.minexmr.com\" OR \"ca.monero.herominers.com\" OR \"cbd.monerpool.org\" OR \"cbdv2.monerpool.org\" OR \"cryptmonero.com\" OR \"crypto-pool.fr\" OR \"crypto-pool.info\" OR \"cryptonight-hub.miningpoolhub.com\" OR \"d1pool.ddns.net\" OR \"d5pool.us\" OR \"daili01.monerpool.org\" OR \"de.minexmr.com\" OR \"dl.nbminer.com\" OR \"donate.graef.in\" OR \"donate.ssl.xmrig.com\" OR \"donate.v2.xmrig.com\" OR \"donate.xmrig.com\" OR \"donate2.graef.in\" OR \"drill.moneroworld.com\" OR \"dwarfpool.com\" OR \"emercoin.com\" OR \"emercoin.net\" OR \"emergate.net\" OR \"ethereumpool.co\" OR \"eu.luckpool.net\" OR \"eu.minerpool.pw\" OR \"fcn-xmr.pool.minergate.com\" OR \"fee.xmrig.com\" OR \"fr.minexmr.com\" OR \"hellominer.com\" OR \"herominers.com\" OR \"huadong1-aeon.ppxxmr.com\" OR \"iwanttoearn.money\" OR \"jw-js1.ppxxmr.com\" OR \"koto-pool.work\" OR \"lhr.nbminer.com\" OR \"lhr3.nbminer.com\" OR \"linux.monerpool.org\" OR \"lokiturtle.herominers.com\" OR \"luckpool.net\" OR \"masari.miner.rocks\" OR \"mine.c3pool.com\" OR \"mine.moneropool.com\" OR \"mine.ppxxmr.com\" OR \"mine.zpool.ca\" OR \"mine1.ppxxmr.com\" OR \"minemonero.gq\" OR \"miner.ppxxmr.com\" OR \"miner.rocks\" OR \"minercircle.com\" OR \"minergate.com\" OR \"minerpool.pw\" OR \"minerrocks.com\" OR \"miners.pro\" OR \"minerxmr.ru\" OR \"minexmr.cn\" OR \"minexmr.com\" OR \"mining-help.ru\" OR \"miningpoolhub.com\" OR \"mixpools.org\" OR \"moner.monerpool.org\" OR \"moner1min.monerpool.org\" OR \"monero-master.crypto-pool.fr\" OR \"monero.crypto-pool.fr\" OR \"monero.hashvault.pro\" OR \"monero.herominers.com\" OR \"monero.lindon-pool.win\" OR \"monero.miners.pro\" OR \"monero.riefly.id\" OR \"monero.us.to\" OR \"monerocean.stream\" OR \"monerogb.com\" OR \"monerohash.com\" OR \"moneroocean.stream\" OR \"moneropool.com\" OR \"moneropool.nl\" OR \"monerorx.com\" OR \"monerpool.org\" OR \"moriaxmr.com\" OR \"mro.pool.minergate.com\" OR \"multipool.us\" OR \"myxmr.pw\" OR \"na.luckpool.net\" OR \"nanopool.org\" OR \"nbminer.com\" OR \"node3.luckpool.net\" OR \"noobxmr.com\" OR \"pangolinminer.comgandalph3000.com\" OR \"pool.4i7i.com\" OR \"pool.armornetwork.org\" OR \"pool.cortins.tk\" OR \"pool.gntl.co.uk\" OR \"pool.hashvault.pro\" OR \"pool.minergate.com\" OR \"pool.minexmr.com\" OR \"pool.monero.hashvault.pro\" OR \"pool.ppxxmr.com\" OR \"pool.somec.cc\" OR \"pool.support\" OR \"pool.supportxmr.com\" OR \"pool.usa-138.com\" OR \"pool.xmr.pt\" OR \"pool.xmrfast.com\" OR \"pool2.armornetwork.org\" OR \"poolchange.ppxxmr.com\" OR \"pooldd.com\" OR \"poolmining.org\" OR \"poolto.be\" OR \"ppxvip1.ppxxmr.com\" OR \"ppxxmr.com\" OR \"prohash.net\" OR \"r.twotouchauthentication.online\" OR \"randomx.xmrig.com\" OR \"ratchetmining.com\" OR \"seed.emercoin.com\" OR \"seed.emercoin.net\" OR \"seed.emergate.net\" OR \"seed1.joulecoin.org\" OR \"seed2.joulecoin.org\" OR \"seed3.joulecoin.org\" OR \"seed4.joulecoin.org\" OR \"seed5.joulecoin.org\" OR \"seed6.joulecoin.org\" OR \"seed7.joulecoin.org\" OR \"seed8.joulecoin.org\" OR \"sg.minexmr.com\" OR \"sheepman.mine.bz\" OR \"siamining.com\" OR \"sumokoin.minerrocks.com\" OR \"supportxmr.com\" OR \"suprnova.cc\" OR \"teracycle.net\" OR \"trtl.cnpool.cc\" OR \"trtl.pool.mine2gether.com\" OR \"turtle.miner.rocks\" OR \"us-west.minexmr.com\" OR \"usxmrpool.com\" OR \"viaxmr.com\" OR \"webservicepag.webhop.net\" OR \"xiazai.monerpool.org\" OR \"xiazai1.monerpool.org\" OR \"xmc.pool.minergate.com\" OR \"xmo.pool.minergate.com\" OR \"xmr-asia1.nanopool.org\" OR \"xmr-au1.nanopool.org\" OR \"xmr-eu1.nanopool.org\" OR \"xmr-eu2.nanopool.org\" OR \"xmr-jp1.nanopool.org\" OR \"xmr-us-east1.nanopool.org\" OR \"xmr-us-west1.nanopool.org\" OR \"xmr-us.suprnova.cc\" OR \"xmr-usa.dwarfpool.com\" OR \"xmr.2miners.com\" OR \"xmr.5b6b7b.ru\" OR \"xmr.alimabi.cn\" OR \"xmr.bohemianpool.com\" OR \"xmr.crypto-pool.fr\" OR \"xmr.crypto-pool.info\" OR \"xmr.f2pool.com\" OR \"xmr.hashcity.org\" OR \"xmr.hex7e4.ru\" OR \"xmr.ip28.net\" OR \"xmr.monerpool.org\" OR \"xmr.mypool.online\" OR \"xmr.nanopool.org\" OR \"xmr.pool.gntl.co.uk\" OR \"xmr.pool.minergate.com\" OR \"xmr.poolto.be\" OR \"xmr.ppxxmr.com\" OR \"xmr.prohash.net\" OR \"xmr.simka.pw\" OR \"xmr.somec.cc\" OR \"xmr.suprnova.cc\" OR \"xmr.usa-138.com\" OR \"xmr.vip.pool.minergate.com\" OR \"xmr1min.monerpool.org\" OR \"xmrf.520fjh.org\" OR \"xmrf.fjhan.club\" OR \"xmrfast.com\" OR \"xmrigcc.graef.in\" OR \"xmrminer.cc\" OR \"xmrpool.de\" OR \"xmrpool.eu\" OR \"xmrpool.me\" OR \"xmrpool.net\" OR \"xmrpool.xyz\" OR \"xx11m.monerpool.org\" OR \"xx11mv2.monerpool.org\" OR \"xxx.hex7e4.ru\" OR \"zarabotaibitok.ru\" OR \"zer0day.ru\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1496"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0034", "reference": "https://attack.mitre.org/tactics/TA0034", "name": "Impact"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1496", "name": "Resource Hijacking", "reference": "https://attack.mitre.org/techniques/T1496"}]}], "version": 1, "references": ["https://www.poolwatch.io/coin/monero", "https://github.com/stamparm/maltrail/blob/3ea70459b9559134449423c0a7d8b965ac5c40ea/trails/static/suspicious/crypto_mining.txt"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
