{"description": "Detects Dllhost that communicates with public IP addresses", "enabled": false, "false_positives": ["Communication to other corporate systems that use IP addresses from public address spaces"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "cfed2f44-16df-4bf3-833a-79405198b277", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Dllhost Internet Connection", "query": "((process.executable:*\\\\dllhost.exe AND winlog.event_data.Initiated:\"true\") AND (NOT ((destination.ip:(10.* OR 192.168.* OR 172.16.* OR 172.17.* OR 172.18.* OR 172.19.* OR 172.20.* OR 172.21.* OR 172.22.* OR 172.23.* OR 172.24.* OR 172.25.* OR 172.26.* OR 172.27.* OR 172.28.* OR 172.29.* OR 172.30.* OR 172.31.*)) OR (destination.ip:\"0\\:0\\:0\\:0\\:0\\:0\\:0\\:1\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218", "T1559"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1559", "name": "Inter-Process Communication", "reference": "https://attack.mitre.org/techniques/T1559"}]}, {"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1218", "name": "Signed Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://github.com/Neo23x0/sigma/blob/master/rules/windows/network_connection/sysmon_rundll32_net_connections.yml"], "timestamp_override": "event.ingested", "author": ["bartblaze"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
