{"description": "Detects a possible remote connections to Silenttrinity c2", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e8eac746-b28f-cb29-b795-1d0b930e74b8", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Silenttrinity Stager Msbuild Activity", "query": "(process.executable:*\\\\msbuild.exe AND destination.port:(\"80\" OR \"443\") AND winlog.event_data.Initiated:\"true\")", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1127"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/"], "timestamp_override": "event.ingested", "author": ["Kiran kumar s", "oscd.community"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
