{"description": "Detects Non-Standard Tools Connecting to TCP port 3389 indicating possible lateral movement", "author": ["Markus Neis"], "enabled": false, "false_positives": ["Third party RDP tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "ed74fe75-7594-4b4b-ae38-e38e3fd2eb23", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Outbound RDP Connections Over Non-Standard Tools", "query": "(((destination.port:\"3389\" AND winlog.event_data.Initiated:\"true\") AND (NOT process.executable.text:(\"C:\\Windows\\System32\\mstsc.exe\" OR \"C:\\Windows\\SysWOW64\\mstsc.exe\"))) AND (NOT (((process.executable.text:\"C:\\Windows\\System32\\dns.exe\" AND source.port:\"53\" AND Protocol:\"udp\")) OR (process.executable.text:(\"*\\\\Avast\\ Software\\\\Avast\\\\AvastSvc.exe\" OR \"*\\\\Avast\\\\AvastSvc.exe\")) OR (process.executable.text:\"*\\\\RDCMan.exe\") OR (process.executable.text:\"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\") OR (((*\\FSAssessment.exe*) OR (*\\FSDiscovery.exe*) OR (*\\MobaRTE.exe*) OR (*\\mRemote.exe*) OR (*\\mRemoteNG.exe*) OR (*\\Passwordstate.exe*) OR (*\\RemoteDesktopManager.exe*) OR (*\\RemoteDesktopManager64.exe*) OR (*\\RemoteDesktopManagerFree.exe*) OR (*\\RSSensor.exe*) OR (*\\RTS2App.exe*) OR (*\\RTSApp.exe*) OR (*\\spiceworks-finder.exe*) OR (*\\Terminals.exe*) OR (*\\ws_TunnelService.exe*))) OR (process.executable.text:(\"*\\\\thor.exe\" OR \"*\\\\thor64.exe\")) OR (process.executable.text:\"C\\:\\\\Program\\ Files\\\\SplunkUniversalForwarder\\\\bin\\\\*\") OR (process.executable.text:\"*\\\\Ranger\\\\SentinelRanger.exe\") OR (process.executable.text:\"C:\\Program Files\\Mozilla Firefox\\firefox.exe\") OR (NOT _exists_:process.executable.text) OR (process.executable.text:\"\") OR (process.executable.text:\"<unknown process>\"))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
