{"description": "Detects external IP address lookups by non-browser processes via services such as \"api.ipify.org\". This could be indicative of potential post compromise internet test activity.", "author": ["Janantha Marasinghe", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Legitimate use of the external websites for troubleshooting or network monitoring"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "edf3485d-dac4-4d50-90e4-b0e5813f7e60", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Network Connection to IP Lookup Service APIs", "query": "(destination.domain:(*api.2ip.ua* OR *api.ipify.org* OR *bot.whatismyipaddress.com* OR *canireachthe.net* OR *checkip.amazonaws.com* OR *checkip.dyndns.org* OR *curlmyip.com* OR *edns.ip\\-api.com* OR *eth0.me* OR *freegeoip.app* OR *geoipy.com* OR *getip.pro* OR *icanhazip.com* OR *ident.me* OR *ifconfig.io* OR *ifconfig.me* OR *ip\\-api.com* OR *ip.anysrc.net* OR *ip.tyk.nu* OR *ipaddressworld.com* OR *ipecho.net* OR *ipinfo.io* OR *ipof.in* OR *ipv4.icanhazip.com* OR *ipv4bot.whatismyipaddress.com* OR *ipwho.is* OR *l2.io* OR *myexternalip.com* OR *wgetip.com* OR *whatismyip.akamai.com* OR *wtfismyip.com*) AND (NOT ((process.executable.text:\"*\\\\brave.exe\") OR (process.executable.text:(\"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\")) OR (process.executable.text:(\"C:\\Program Files\\Mozilla Firefox\\firefox.exe\" OR \"C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe\")) OR (process.executable.text:(\"C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe\" OR \"C:\\Program Files\\Internet Explorer\\iexplore.exe\")) OR (process.executable.text:\"*\\\\maxthon.exe\") OR (((process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\") OR (process.executable.text:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\") OR (process.executable.text:(\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" OR \"C:\\Program Files\\Microsoft\\Edge\\Application\\msedge.exe\")))) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeCore\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\\\EdgeCore\\\\*\") AND process.executable.text:(\"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\"))) OR (process.executable.text:\"*\\\\opera.exe\") OR (process.executable.text:\"*\\\\safari.exe\") OR (process.executable.text:\"*\\\\seamonkey.exe\") OR (process.executable.text:\"*\\\\vivaldi.exe\") OR (process.executable.text:\"*\\\\whale.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1016"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0007", "reference": "https://attack.mitre.org/tactics/TA0007", "name": "Discovery"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1016", "name": "System Network Configuration Discovery", "reference": "https://attack.mitre.org/techniques/T1016"}]}], "version": 1, "references": ["https://github.com/rsp/scripts/blob/c8bb272d68164a9836e4f273d8f924927f39b8c6/externalip-benchmark.md", "https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-302a", "https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/", "https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
