{"description": "Detects office suit applications communicating to target systems on uncommon ports", "author": ["X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["Other ports can be used, apply additional filters accordingly"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "3b5ba899-9842-4bc2-acc2-12308498bf42", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Office Outbound Connections", "query": "(process.executable:(/.*\\\\\\\\[Ee][Xx][Cc][Ee][Ll]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Pp][Oo][Ww][Ee][Rr][Pp][Nn][Tt]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Ii][Nn][Ww][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Oo][Rr][Dd][Pp][Aa][Dd]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Ww][Oo][Rr][Dd][Vv][Ii][Ee][Ww]\\.[Ee][Xx][Ee]/) AND (NOT destination.port:(139 OR 443 OR 445 OR 80)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
