{"description": "Detects an executable in the Windows folder accessing suspicious domains", "author": ["Florian Roth (Nextron Systems)", "Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown", "@subTee in your network"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Microsoft Binary Suspicious Communication Endpoint", "query": "(event.category:network AND ((process.executable:(/[Cc]\\:\\\\[Pp][Ee][Rr][Ff][Ll][Oo][Gg][Ss].*/ OR /[Cc]\\:\\\\[Tt][Ee][Mm][Pp]\\\\.*/ OR /[Cc]\\:\\\\[Uu][Ss][Ee][Rr][Ss]\\\\[Pp][Uu][Bb][Ll][Ii][Cc]\\\\.*/ OR /[Cc]\\:\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss]\\\\.*/)) OR (process.executable:/.*\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\[Tt][Ee][Mm][Pp]\\\\.*/)) AND (winlog.event_data.Initiated:true AND destination.domain:(/.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]\\/[Aa][Tt][Tt][Aa][Cc][Hh][Mm][Ee][Nn][Tt][Ss]\\// OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/ OR /.*[Dd][Ll]\\.[Dd][Rr][Oo][Pp][Bb][Oo][Xx][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo]/ OR /.*[Gg][Oo][Ff][Ii][Ll][Ee]\\.[Ii][Oo]/ OR /.*[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm]/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz]/ OR /.*[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Pp][Ll]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Tt][Ee][Xx][Tt]\\.[Nn][Ee][Tt]/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Cc][Oo][Mm]/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Nn][Ee][Tt]/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn]/ OR /.*[Ss][Ee][Nn][Dd][Ss][Pp][Aa][Cc][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Tt][Oo][Rr][Jj][Ss][Hh][Aa][Rr][Ee]\\.[Ii][Oo]/ OR /.*[Tt][Ee][Mm][Pp]\\.[Ss][Hh]/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh]/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo]/)))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1105"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://twitter.com/M_haggis/status/900741347035889665", "https://twitter.com/M_haggis/status/1032799638213066752", "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker", "https://www.cisa.gov/uscert/ncas/alerts/aa22-321a", "https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/exfil/Invoke-ExfilDataToGitHub.ps1"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
