{"description": "Detects a non-browser process interacting with the Google API which could indicate the use of a covert C2 such as Google Sheet C2 (GC2-sheet)", "author": ["Gavin Knapp"], "enabled": false, "false_positives": ["Legitimate applications communicating with the \"googleapis.com\" endpoints that are not already in the exclusion list. This is environmental dependent and requires further testing and tuning."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7e9cf7b6-e827-11ed-a05b-0242ac120003", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Non-Browser Network Communication With Google API", "query": "(event.category:network AND ((destination.domain:(/.*[Oo][Aa][Uu][Tt][Hh]2\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Hh][Ee][Ee][Tt][Ss]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Dd][Rr][Ii][Vv][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ww][Ww][Ww]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/)) OR (dns.question.name:(/.*[Oo][Aa][Uu][Tt][Hh]2\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Hh][Ee][Ee][Tt][Ss]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Dd][Rr][Ii][Vv][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ww][Ww][Ww]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/)) OR (dns.question.subdomain:(/.*[Oo][Aa][Uu][Tt][Hh]2\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ss][Hh][Ee][Ee][Tt][Ss]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Dd][Rr][Ii][Vv][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/ OR /.*[Ww][Ww][Ww]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm].*/))) AND (NOT ((process.executable:/.*\\\\[Bb][Rr][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\[Dd][Rr][Ii][Vv][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Tt][Rr][Ee][Aa][Mm]\\\\.*/ AND process.executable:/.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ff][Ss]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\[Mm][Aa][Xx][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/) OR (((process.executable:/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\.*/) OR (process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee]\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:(/.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\.*/ OR /.*\\:\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\.*/) AND process.executable:(/.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/))) OR (process.executable:/.*\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Ss][Aa][Ff][Aa][Rr][Ii]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Ss][Ee][Aa][Mm][Oo][Nn][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Ww][Hh][Aa][Ll][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Gg][Oo][Oo][Gg][Ll][Ee][Uu][Pp][Dd][Aa][Tt][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Oo][Uu][Tt][Ll][Oo][Oo][Kk]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\[Tt][Ee][Aa][Mm][Ss]\\.[Ee][Xx][Ee]/))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1102"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/looCiprian/GC2-sheet", "https://youtu.be/n2dFlSaBBKo", "https://services.google.com/fh/files/blogs/gcat_threathorizons_full_apr2023.pdf", "https://www.tanium.com/blog/apt41-deploys-google-gc2-for-attacks-cyber-threat-intelligence-roundup/", "https://www.bleepingcomputer.com/news/security/hackers-abuse-google-command-and-control-red-team-tool-in-attacks/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
