{"description": "Detects an a non-browser process interacting with the Reddit API which could indicate use of a covert C2 such as RedditC2", "author": ["Gavin Knapp"], "enabled": false, "false_positives": ["Legitimate applications communicating with the Reddit API e.g. web browsers not in the exclusion list, app with an RSS  etc."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "d7b09985-95a3-44be-8450-b6eadf49833e", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Suspicious Non-Browser Network Communication With Reddit API", "query": "(destination.domain:*reddit.com* AND (NOT ((process.executable.text:\"*\\\\brave.exe\") OR (process.executable.text:(\"C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe\" OR \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\")) OR (process.executable.text:(\"C:\\Program Files\\Mozilla Firefox\\firefox.exe\" OR \"C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe\")) OR (process.executable.text:(\"C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe\" OR \"C:\\Program Files\\Internet Explorer\\iexplore.exe\")) OR (process.executable.text:\"*\\\\maxthon.exe\") OR (((process.executable.text:\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeWebView\\\\Application\\\\*\") OR (process.executable.text:\"*\\\\WindowsApps\\\\MicrosoftEdge.exe\") OR (process.executable.text:(\"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" OR \"C:\\Program Files\\Microsoft\\Edge\\Application\\msedge.exe\")))) OR ((process.executable.text:(\"C\\:\\\\Program\\ Files\\ \\(x86\\)\\\\Microsoft\\\\EdgeCore\\\\*\" OR \"C\\:\\\\Program\\ Files\\\\Microsoft\\\\EdgeCore\\\\*\") AND process.executable.text:(\"*\\\\msedge.exe\" OR \"*\\\\msedgewebview2.exe\"))) OR (process.executable.text:\"*\\\\opera.exe\") OR (process.executable.text:\"*\\\\safari.exe\") OR (process.executable.text:\"*\\\\seamonkey.exe\") OR (process.executable.text:\"*\\\\vivaldi.exe\") OR (process.executable.text:\"*\\\\whale.exe\"))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1102"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://github.com/kleiton0x00/RedditC2", "https://twitter.com/kleiton0x7e/status/1600567316810551296", "https://www.linkedin.com/posts/kleiton-kurti_github-kleiton0x00redditc2-abusing-reddit-activity-7009939662462984192-5DbI/?originalSubdomain=al"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
