{"description": "Detects an executable, which is not an internet browser, making DNS request to legit popular websites, which were seen to be used as dead drop resolvers in previous attacks.", "author": ["Sorina Ionescu", "X__Junior (Nextron Systems)"], "enabled": false, "false_positives": ["One might need to exclude other internet browsers found in it's network or other applications like ones mentioned above from Microsoft Defender."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "297ae038-edc2-4b2e-bb3e-7c5fc94dd5c7", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Potential Dead Drop Resolvers", "query": "(((winlog.event_data.Initiated:true AND destination.domain:(/.*\\.[Cc][Ll][Oo][Uu][Dd][Ff][Ll][Aa][Rr][Ee]\\.[Cc][Oo][Mm]/ OR /.*\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/ OR /.*4[Ss][Hh][Aa][Rr][Ee][Dd]\\.[Cc][Oo][Mm]/ OR /.*[Aa][Nn][Oo][Nn][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Cc][Dd][Nn]\\.[Dd][Ii][Ss][Cc][Oo][Rr][Dd][Aa][Pp][Pp]\\.[Cc][Oo][Mm]/ OR /.*[Dd][Dd][Nn][Ss]\\.[Nn][Ee][Tt]/ OR /.*[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\.[Cc][Oo][Mm]\\/[Aa][Pp][Ii]\\/[Ww][Ee][Bb][Hh][Oo][Oo][Kk][Ss]\\// OR /.*[Dd][Oo][Cc][Ss]\\.[Gg][Oo][Oo][Gg][Ll][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Dd][Rr][Ii][Vv][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Cc][Oo][Mm]/ OR /.*[Dd][Rr][Oo][Pp][Mm][Ee][Ff][Ii][Ll][Ee][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Ff][Aa][Cc][Ee][Bb][Oo][Oo][Kk]\\.[Cc][Oo][Mm]/ OR /.*[Ff][Ee][Ee][Dd][Ss]\\.[Rr][Aa][Pp][Ii][Dd][Ff][Ee][Ee][Dd][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Ff][Oo][Tt][Oo][Ll][Oo][Gg]\\.[Cc][Oo][Mm]/ OR /.*[Gg][Hh][Oo][Ss][Tt][Bb][Ii][Nn]\\.[Cc][Oo]\\// OR /.*[Gg][Ii][Ss][Tt]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Hh][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm]/ OR /.*[Ii][Mm][Gg][Uu][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Ll][Ii][Vv][Ee][Jj][Oo][Uu][Rr][Nn][Aa][Ll]\\.[Cc][Oo][Mm]/ OR /.*[Mm][Ee][Dd][Ii][Aa][Ff][Ii][Rr][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Mm][Ee][Gg][Aa]\\.[Nn][Zz]/ OR /.*[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Pp][Aa][Ss][Tt][Ee]\\.[Ee][Ee]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Cc][Oo][Mm]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Bb][Ii][Nn]\\.[Pp][Ll]/ OR /.*[Pp][Aa][Ss][Tt][Ee][Tt][Ee][Xx][Tt]\\.[Nn][Ee][Tt]/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Cc][Oo][Mm]/ OR /.*[Pp][Rr][Ii][Vv][Aa][Tt][Ll][Aa][Bb]\\.[Nn][Ee][Tt]/ OR /.*[Rr][Aa][Ww]\\.[Gg][Ii][Tt][Hh][Uu][Bb][Uu][Ss][Ee][Rr][Cc][Oo][Nn][Tt][Ee][Nn][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Rr][Ee][Dd][Dd][Ii][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Ee][Nn][Dd]\\.[Ee][Xx][Pp][Ll][Oo][Ii][Tt]\\.[Ii][Nn]/ OR /.*[Ss][Ee][Nn][Dd][Ss][Pp][Aa][Cc][Ee]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Tt][Ee][Aa][Mm][Cc][Oo][Mm][Mm][Uu][Nn][Ii][Tt][Yy]\\.[Cc][Oo][Mm]/ OR /.*[Ss][Tt][Oo][Rr][Aa][Gg][Ee]\\.[Gg][Oo][Oo][Gg][Ll][Ee][Aa][Pp][Ii][Ss]\\.[Cc][Oo][Mm]/ OR /.*[Tt]\\.[Mm][Ee]/ OR /.*[Tt][Ee][Cc][Hh][Nn][Ee][Tt]\\.[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\.[Cc][Oo][Mm]/ OR /.*[Tt][Ee][Mm][Pp]\\.[Ss][Hh]/ OR /.*[Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Ss][Hh]/ OR /.*[Tt][Ww][Ii][Tt][Tt][Ee][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Uu][Ff][Ii][Ll][Ee]\\.[Ii][Oo]/ OR /.*[Vv][Ii][Mm][Ee][Oo]\\.[Cc][Oo][Mm]/ OR /.*[Ww][Ee][Tt][Rr][Aa][Nn][Ss][Ff][Ee][Rr]\\.[Cc][Oo][Mm]/ OR /.*[Yy][Oo][Uu][Tt][Uu][Bb][Ee]\\.[Cc][Oo][Mm]/)) AND (NOT ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Cc][Hh][Rr][Oo][Mm][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Oo][Zz][Ii][Ll][Ll][Aa]\\ [Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\\\\\\\[Ff][Ii][Rr][Ee][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ii][Nn][Tt][Ee][Rr][Nn][Ee][Tt]\\ [Ee][Xx][Pp][Ll][Oo][Rr][Ee][Rr]\\\\\\\\[Ii][Ee][Xx][Pp][Ll][Oo][Rr][Ee]\\.[Ee][Xx][Ee]/)) OR (((process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\.*/) OR (process.executable:/.*\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee]\\\\\\\\[Aa][Pp][Pp][Ll][Ii][Cc][Aa][Tt][Ii][Oo][Nn]\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/)))) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Ee][Dd][Gg][Ee][Cc][Oo][Rr][Ee]\\\\\\\\.*/) AND process.executable:(/.*\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Ee][Dd][Gg][Ee][Ww][Ee][Bb][Vv][Ii][Ee][Ww]2\\.[Ee][Xx][Ee]/))) OR (process.executable:/.*\\\\\\\\[Ss][Aa][Ff][Aa][Rr][Ii]\\.[Ee][Xx][Ee]/) OR ((process.executable:/.*\\\\\\\\[Bb][Rr][Aa][Vv][Ee]\\.[Ee][Xx][Ee]/ AND process.executable:/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Bb][Rr][Aa][Vv][Ee][Ss][Oo][Ff][Tt][Ww][Aa][Rr][Ee]\\\\\\\\.*/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Mm][Aa][Xx][Tt][Hh][Oo][Nn]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Mm][Aa][Xx][Tt][Hh][Oo][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\\\\\[Oo][Pp][Ee][Rr][Aa]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Oo][Pp][Ee][Rr][Aa]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ss][Ee][Aa][Mm][Oo][Nn][Kk][Ee][Yy]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ss][Ee][Aa][Mm][Oo][Nn][Kk][Ee][Yy]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Ss][Ee][Aa][Mm][Oo][Nn][Kk][Ee][Yy]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Vv][Ii][Vv][Aa][Ll][Dd][Ii]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Nn][Aa][Vv][Ee][Rr]\\\\\\\\[Nn][Aa][Vv][Ee][Rr]\\ [Ww][Hh][Aa][Ll][Ee]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Nn][Aa][Vv][Ee][Rr]\\\\\\\\[Nn][Aa][Vv][Ee][Rr]\\ [Ww][Hh][Aa][Ll][Ee]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Ww][Hh][Aa][Ll][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\\\\\[Tt][Oo][Rr]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\\\\\.*/) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ww][Aa][Tt][Ee][Rr][Ff][Oo][Xx]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ww][Aa][Tt][Ee][Rr][Ff][Oo][Xx]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Ww][Aa][Tt][Ee][Rr][Ff][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm][Ss]\\\\\\\\[Mm][Ii][Dd][Oo][Rr][Ii]\\-[Nn][Gg]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Mm][Ii][Dd][Oo][Rr][Ii]\\ [Nn][Ee][Xx][Tt]\\ [Gg][Ee][Nn][Ee][Rr][Aa][Tt][Ii][Oo][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ss][Ll][Ii][Mm][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ss][Ll][Ii][Mm][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Ss][Ll][Ii][Mm][Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Ff][Ll][Oo][Cc][Kk]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Ff][Ll][Oo][Cc][Kk]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Pp][Hh][Oo][Ee][Bb][Ee]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Pp][Hh][Oo][Ee][Bb][Ee]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ff][Aa][Ll][Kk][Oo][Nn]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ff][Aa][Ll][Kk][Oo][Nn]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Ff][Aa][Ll][Kk][Oo][Nn]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Qq][Tt][Ww][Ee][Bb]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Qq][Tt][Ww][Ee][Bb]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Qq][Tt][Ww][Ee][Bb]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Aa][Vv][Aa][Nn][Tt]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Aa][Vv][Aa][Nn][Tt]\\ [Bb][Rr][Oo][Ww][Ss][Ee][Rr]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Aa][Vv][Aa][Nn][Tt]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Ww][Ii][Nn][Dd][Oo][Ww][Ss][Aa][Pp][Pp][Ss]\\\\\\\\.*/) AND process.executable:/.*[Ww][Hh][Aa][Tt][Ss][Aa][Pp][Pp]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Rr][Oo][Aa][Mm][Ii][Nn][Gg]\\\\\\\\[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]\\ [Dd][Ee][Ss][Kk][Tt][Oo][Pp]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Mm][Ii][Cc][Rr][Oo][Ss][Oo][Ff][Tt]\\\\\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Oo][Nn][Ee][Dd][Rr][Ii][Vv][Ee]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\\\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\\\\\\\[Cc][Ll][Ii][Ee][Nn][Tt]\\\\\\\\.*/) AND process.executable:/.*\\\\\\\\[Dd][Rr][Oo][Pp][Bb][Oo][Xx]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Mm][Ee][Gg][Aa][Ss][Yy][Nn][Cc]\\\\\\\\.*/ AND process.executable:/.*[Mm][Ee][Gg][Aa][Ss][Yy][Nn][Cc]\\.[Ee][Xx][Ee]/)) OR ((process.executable:(/[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Dd][Rr][Ii][Vv][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Tt][Rr][Ee][Aa][Mm]\\\\\\\\.*/ OR /[Cc]\\:\\\\\\\\[Pp][Rr][Oo][Gg][Rr][Aa][Mm]\\ [Ff][Ii][Ll][Ee][Ss]\\ \\([Xx]86\\)\\\\\\\\[Gg][Oo][Oo][Gg][Ll][Ee]\\\\\\\\[Dd][Rr][Ii][Vv][Ee]\\ [Ff][Ii][Ll][Ee]\\ [Ss][Tt][Rr][Ee][Aa][Mm]\\\\\\\\.*/) AND process.executable:/.*[Gg][Oo][Oo][Gg][Ll][Ee][Dd][Rr][Ii][Vv][Ee][Ff][Ss]\\.[Ee][Xx][Ee]/)) OR ((process.executable:/.*\\\\\\\\[Aa][Pp][Pp][Dd][Aa][Tt][Aa]\\\\\\\\[Ll][Oo][Cc][Aa][Ll]\\\\\\\\[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\\\\\\\.*/ AND process.executable:/.*\\\\\\\\[Dd][Ii][Ss][Cc][Oo][Rr][Dd]\\.[Ee][Xx][Ee]/))))) AND (NOT ((process.executable:(/.*\\\\\\\\[Mm][Ss][Mm][Pp][Ee][Nn][Gg]\\.[Ee][Xx][Ee]/ OR /.*\\\\\\\\[Mm][Ss][Ss][Ee][Nn][Ss][Ee]\\.[Ee][Xx][Ee]/)) OR (process.executable:/.*\\\\\\\\[Pp][Rr][Tt][Gg]\\ [Pp][Rr][Oo][Bb][Ee]\\.[Ee][Xx][Ee]/) OR (process.executable:/.*\\\\\\\\[Ee][Nn][Gg][Ii][Nn][Ee]\\.[Ee][Xx][Ee]/))))", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1102", "T1102"], "to": "now", "type": "query", "threat": [], "version": 1, "references": ["https://content.fireeye.com/apt-41/rpt-apt41", "https://securelist.com/the-tetrade-brazilian-banking-malware/97779/", "https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
