{"description": "Detects svchost hosting RDP termsvcs communicating with the loopback address and on TCP port 3389", "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "RDP Over Reverse SSH Tunnel", "query": "((process.executable:*\\\\svchost.exe AND winlog.event_data.Initiated:\"true\" AND source.port:\"3389\") AND (destination.ip:127.* OR destination.ip:\"\\:\\:1\"))", "meta": {"from": "1m"}, "severity": "high", "tags": ["Lateral Movement", "T1021", "T1572"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0008", "reference": "https://attack.mitre.org/tactics/TA0008", "name": "Lateral Movement"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1021", "name": "Remote Services", "reference": "https://attack.mitre.org/techniques/T1021"}]}], "version": 1, "references": ["https://twitter.com/SBousseaden/status/1096148422984384514"], "timestamp_override": "event.ingested", "author": ["Samir Bousseaden"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
