{"description": "Detects an executable accessing mega.co.nz, which could be a sign of forbidden file sharing use of data exfiltration by malicious actors", "enabled": false, "false_positives": ["Legitimate use of mega.nz uploaders and tools"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "7cf83c66-91d8-1b22-6726-61d2db6d0f1a", "language": "lucene", "max_signals": 100, "risk_score": 65, "name": "Communication To Mega.nz", "query": "(winlog.event_data.Initiated:\"true\" AND destination.domain:*api.mega.co.nz)", "meta": {"from": "1m"}, "severity": "high", "tags": ["T1567"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0010", "reference": "https://attack.mitre.org/tactics/TA0010", "name": "Exfiltration"}, "framework": "MITRE ATT&CK\u00ae", "technique": [{"id": "T1567", "name": "Exfiltration Over Web Service", "reference": "https://attack.mitre.org/techniques/T1567"}]}], "version": 1, "references": ["https://megatools.megous.com/", "https://www.mandiant.com/resources/russian-targeting-gov-business"], "timestamp_override": "event.ingested", "author": ["Florian Roth"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"}
