{"description": "Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code and making a network connections.\nOne could easily make the DLL spawn a new process and inject to it to proxy the network connection and bypass this rule.\n", "author": ["Roberto Rodriguez (Cyb3rWard0g)", "OTR (Open Threat Research)"], "enabled": false, "false_positives": ["Legitimate use of wuauclt.exe over the network."], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "c649a6c7-cd8c-4a78-9c04-000fc76df954", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Wuauclt Network Connection", "query": "(process.executable.text:*wuauclt* AND (NOT ((destination.ip:(20.184.* OR 20.185.* OR 20.186.* OR 20.187.* OR 20.188.* OR 20.189.* OR 20.190.* OR 20.191.* OR 23.79.* OR 51.10.* OR 51.103.* OR 51.104.* OR 51.105.* OR 52.239.*)) OR (process.command_line.text:*\\\\UpdateDeploy.dll\\ \\/ClassId\\ *))))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["Defense Evasion", "T1218"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0005", "reference": "https://attack.mitre.org/tactics/TA0005", "name": "Defense Evasion"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1218", "name": "System Binary Proxy Execution", "reference": "https://attack.mitre.org/techniques/T1218"}]}], "version": 1, "references": ["https://dtm.uk/wuauclt/"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
