{"description": "Detects network connections from \"dfsvc.exe\" used to handled ClickOnce applications to uncommon ports", "author": ["Nasreddine Bencherchali (Nextron Systems)"], "enabled": false, "false_positives": ["Unknown"], "filters": [], "from": "now-360s", "immutable": false, "index": ["winlogbeat-*"], "interval": "5m", "rule_id": "4c5fba4a-9ef6-4f16-823d-606246054741", "language": "lucene", "max_signals": 100, "risk_score": 35, "name": "Dfsvc.EXE Network Connection To Uncommon Ports", "query": "((process.executable:/.*\\\\\\\\[Dd][Ff][Ss][Vv][Cc]\\.[Ee][Xx][Ee]/ AND winlog.event_data.Initiated:true) AND (NOT destination.port:(80 OR 443 OR 445)))", "meta": {"from": "1m"}, "severity": "medium", "tags": ["T1203"], "to": "now", "type": "query", "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1203", "name": "Exploitation for Client Execution", "reference": "https://attack.mitre.org/techniques/T1203"}]}], "version": 1, "references": ["https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5"], "license": "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md", "timestamp_override": "event.ingested"}
