{"description":"Detects a possible remote connections to Silenttrinity c2 Author: Kiran kumar s, oscd.community. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["unknown"],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"50e54b8d-ad73-43f8-96a1-5191685b17a4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":65,"name":"Silenttrinity Stager Msbuild Activity","query":"(process.executable:*\\\\msbuild.exe AND destination.port:(\"80\" OR \"443\") AND winlog.event_data.Initiated:\"true\")","meta":{"from":"1m"},"severity":"high","tags":["T1127"],"to":"now","type":"query","threat":[],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
