{"description":"Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code and making a network connections. One could easily make the DLL spawn a new process and inject to it to proxy the network connection and bypass this rule. Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research). License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md","enabled":false,"false_positives":["Legitimate use of wuauclt.exe over the network."],"filters":[],"from":"now-360s","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"e08bb5c3-3742-dbce-70c2-6f70be4da5b4","language":"lucene","output_index":".siem-signals-default","max_signals":100,"risk_score":35,"name":"Wuauclt Network Connection","query":"process.executable:*wuauclt*","meta":{"from":"1m"},"severity":"medium","tags":["Defense Evasion","T1218"],"to":"now","type":"query","threat":[{"tactic":{"id":"TA0005","reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion"},"framework":"MITRE ATT&CK®","technique":[{"id":"T1218","name":"Signed Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218"}]}],"version":1,"references":["https://tdm.socprime.com/tdm/info/0"]}
